[
  {
    "ayat": 51,
    "arabic": "وَنُفِخَ فِى الصُّوْرِ فَاِذَا هُمْ مِّنَ الْاَجْدَاثِ اِلٰى رَبِّهِمْ يَنْسِلُوْنَ",
    "transliteration_en": "Wa nufikha fis-soori faizaa hum minal ajdaasi ilaa Rabbihim yansiloon",
    "transliteration_id": "Wa nufikha fiṣ-ṣūri fa'iżā hum minal-ajdāṡi ilā rabbihim yansilūn(a).",
    "translation_en": "And the Horn will be blown; and at once from the graves to their Lord they will hasten.",
    "translation_id": "Sangkakala pun ditiup dan seketika itu mereka bergerak cepat dari kuburnya menuju kepada Tuhannya."
  },
  {
    "ayat": 52,
    "arabic": "قَالُوْا يٰوَيْلَنَا مَنْۢ بَعَثَنَا مِنْ مَّرْقَدِنَا ۜهٰذَا مَا وَعَدَ الرَّحْمٰنُ وَصَدَقَ الْمُرْسَلُوْنَ",
    "transliteration_en": "Qaaloo yaa wailanaa mam ba'asanaa mim marqadinaa; haaza maa wa'adar Rahmanu wa sadaqal mursaloon",
    "transliteration_id": "Qālū yā wailanā mam ba‘aṡanā mim marqadinā…hāżā mā wa‘adar-raḥmānu wa ṣadaqal-mursalūn(a).",
    "translation_en": "They will say, \"O woe to us! Who has raised us up from our sleeping place?\" [The reply will be], \"This is what the Most Merciful had promised, and the messengers told the truth.\"",
    "translation_id": "Mereka berkata, “Celakalah kami! Siapakah yang membangkitkan kami dari tempat tidur kami (kubur)?” (Lalu, dikatakan kepada mereka,) “Inilah yang dijanjikan (Allah) Yang Maha Pengasih dan benarlah para rasul(-Nya).”"
  },
  {
    "ayat": 53,
    "arabic": "اِنْ كَانَتْ اِلَّا صَيْحَةً وَّاحِدَةً فَاِذَا هُمْ جَمِيْعٌ لَّدَيْنَا مُحْضَرُوْنَ",
    "transliteration_en": "In kaanat illaa saihatanw waahidatan fa-izaa hum jamee'ul ladainaa muhdaroon",
    "transliteration_id": "In kānat illā ṣaiḥataw wāḥidatan fa'iżā hum jamī‘ul ladainā muḥḍarūn(a).",
    "translation_en": "It will not be but one blast, and at once they are all brought present before Us.",
    "translation_id": "Teriakan itu hanya sekali saja, maka seketika itu mereka semua dihadapkan kepada Kami (untuk dihisab)."
  },
  {
    "ayat": 54,
    "arabic": "فَالْيَوْمَ لَا تُظْلَمُ نَفْسٌ شَيْـًٔا وَّلَا تُجْزَوْنَ اِلَّا مَا كُنْتُمْ تَعْمَلُوْنَ",
    "transliteration_en": "Fal-Yawma laa tuzlamu nafsun shai'anw-wa laa tujzawna illaa maa kuntum ta'maloon",
    "transliteration_id": "Fal-yauma lā tuẓlamu nafsun syai'aw wa lā tujzauna illā mā kuntum ta‘malūn(a).",
    "translation_en": "So today no soul will be wronged at all, and you will not be recompensed except for what you used to do.",
    "translation_id": "Pada hari itu tidak ada sama sekali orang yang dirugikan sedikit pun. Kamu tidak akan diberi balasan, kecuali atas apa yang telah kamu kerjakan."
  },
  {
    "ayat": 55,
    "arabic": "اِنَّ اَصْحٰبَ الْجَنَّةِ الْيَوْمَ فِيْ شُغُلٍ فٰكِهُوْنَ ۚ",
    "transliteration_en": "Inna Ashaabal jannatil Yawma fee shughulin faakihoon",
    "transliteration_id": "Inna aṣḥābal-jannatil-yauma fī syugulin fākihūn(a).",
    "translation_en": "Indeed the companions of Paradise, that Day, will be amused in [joyful] occupation -",
    "translation_id": "Sesungguhnya penghuni surga pada hari itu berada dalam kesibukan (sehingga tidak sempat berpikir tentang penghuni neraka) lagi bersenang-senang."
  },
  {
    "ayat": 56,
    "arabic": "هُمْ وَاَزْوَاجُهُمْ فِيْ ظِلٰلٍ عَلَى الْاَرَاۤىِٕكِ مُتَّكِـُٔوْنَ ۚ",
    "transliteration_en": "Hum wa azwaajuhum fee zilaalin 'alal araaa'iki muttaki'oon",
    "transliteration_id": "Hum wa azwājuhum fī ẓilālin ‘alal-arā'iki muttaki'ūn(a).",
    "translation_en": "They and their spouses - in shade, reclining on adorned couches.",
    "translation_id": "Mereka dan pasangan-pasangannya berada dalam tempat yang teduh sambil berbaring di atas ranjang berkelambu."
  },
  {
    "ayat": 57,
    "arabic": "لَهُمْ فِيْهَا فَاكِهَةٌ وَّلَهُمْ مَّا يَدَّعُوْنَ ۚ",
    "transliteration_en": "Lahum feehaa faakiha tunw-wa lahum maa yadda'oon",
    "transliteration_id": "Lahum fīhā fākihatuw wa lahum mā yadda‘ūn(a).",
    "translation_en": "For them therein is fruit, and for them is whatever they request [or wish]",
    "translation_id": "Di (surga) itu mereka memperoleh buah-buahan dan apa saja yang mereka inginkan."
  },
  {
    "ayat": 58,
    "arabic": "سَلٰمٌۗ قَوْلًا مِّنْ رَّبٍّ رَّحِيْمٍ",
    "transliteration_en": "Salaamun qawlam mir Rabbir Raheem",
    "transliteration_id": "Salāmun qaulam mir rabbir raḥīm(in).",
    "translation_en": "[And] \"Peace,\" a word from a Merciful Lord.",
    "translation_id": "(Kepada mereka dikatakan,) “Salam sejahtera” sebagai ucapan dari Tuhan Yang Maha Penyayang."
  },
  {
    "ayat": 59,
    "arabic": "وَامْتَازُوا الْيَوْمَ اَيُّهَا الْمُجْرِمُوْنَ",
    "transliteration_en": "Wamtaazul Yawma ayyuhal mujrimoon",
    "transliteration_id": "Wamtāzul-yauma  ayyuhal-mujrimūn(a).",
    "translation_en": "[Then He will say], \"But stand apart today, you criminals.",
    "translation_id": "(Dikatakan kepada orang-orang kafir,) “Berpisahlah kamu (dari orang-orang mukmin) pada hari ini, wahai para pendurhaka!"
  },
  {
    "ayat": 60,
    "arabic": "۞ اَلَمْ اَعْهَدْ اِلَيْكُمْ يٰبَنِيْٓ اٰدَمَ اَنْ لَّا تَعْبُدُوا الشَّيْطٰنَۚ اِنَّهٗ لَكُمْ عَدُوٌّ مُّبِيْنٌ",
    "transliteration_en": "Alam a'had ilaikum yaa Baneee Aadama al-laa ta'budush Shaitaana innahoo lakum 'aduwwum mubeen",
    "transliteration_id": "Alam a‘had ilaikum yā banī ādama allā ta‘budusy-syaiṭān(a), innahū lakum ‘aduwwum mubīn(un).",
    "translation_en": "Did I not enjoin upon you, O children of Adam, that you not worship Satan - [for] indeed, he is to you a clear enemy -",
    "translation_id": "Bukankah Aku telah berpesan kepadamu dengan sungguh-sungguh, wahai anak cucu Adam, bahwa janganlah kamu menyembah setan? Sesungguhnya setan itu musuh yang nyata bagi kamu."
  },
  {
    "ayat": 61,
    "arabic": "وَاَنِ اعْبُدُوْنِيْ ۗهٰذَا صِرَاطٌ مُّسْتَقِيْمٌ",
    "transliteration_en": "Wa ani'budoonee; haazaa Siraatum Mustaqeem",
    "transliteration_id": "Wa ani‘budūnī, hāżā ṣirāṭum mustaqīm(un).",
    "translation_en": "And that you worship [only] Me? This is a straight path.",
    "translation_id": "(Begitu juga bahwa) sembahlah Aku. Inilah jalan yang lurus.”"
  },
  {
    "ayat": 62,
    "arabic": "وَلَقَدْ اَضَلَّ مِنْكُمْ جِبِلًّا كَثِيْرًا ۗاَفَلَمْ تَكُوْنُوْا تَعْقِلُوْنَ",
    "transliteration_en": "Wa laqad adalla minkum jibillan kaseeraa; afalam takoonoo ta'qiloon",
    "transliteration_id": "Wa laqad aḍalla minkum jibillan kaṡīrā(n), afalam takūnū ta‘qilūn(a).",
    "translation_en": "And he had already led astray from among you much of creation, so did you not use reason?",
    "translation_id": "Sungguh, ia (setan itu) benar-benar telah menyesatkan sangat banyak orang dari kamu. Maka, apakah kamu tidak mengerti?"
  },
  {
    "ayat": 63,
    "arabic": "هٰذِهٖ جَهَنَّمُ الَّتِيْ كُنْتُمْ تُوْعَدُوْنَ",
    "transliteration_en": "Haazihee Jahannamul latee kuntum too'adoon",
    "transliteration_id": "Hāżihī jahannamul-latī kuntum tū‘adūn(a).",
    "translation_en": "This is the Hellfire which you were promised.",
    "translation_id": "Inilah (neraka) Jahanam yang dahulu telah diperingatkan kepadamu."
  },
  {
    "ayat": 64,
    "arabic": "اِصْلَوْهَا الْيَوْمَ بِمَا كُنْتُمْ تَكْفُرُوْنَ",
    "transliteration_en": "Islawhal Yawma bimaa kuntum takfuroon",
    "transliteration_id": "Iṣlauhal-yauma bimā kuntum takfurūn(a).",
    "translation_en": "[Enter to] burn therein today for what you used to deny.\"",
    "translation_id": "Masuklah ke dalamnya pada hari ini karena dahulu kamu mengingkarinya."
  },
  {
    "ayat": 65,
    "arabic": "اَلْيَوْمَ نَخْتِمُ عَلٰٓى اَفْوَاهِهِمْ وَتُكَلِّمُنَآ اَيْدِيْهِمْ وَتَشْهَدُ اَرْجُلُهُمْ بِمَا كَانُوْا يَكْسِبُوْنَ",
    "transliteration_en": "Al-Yawma nakhtimu 'alaaa afwaahihim wa tukallimunaaa aideehim wa tashhadu arjuluhum bimaa kaanoo yaksiboon",
    "transliteration_id": "Al-yauma nakhtimu ‘alā afwāhihim wa tukallimunā aidīhim wa tasyhadu arjuluhum bimā kānū yaksibūn(a).",
    "translation_en": "That Day, We will seal over their mouths, and their hands will speak to Us, and their feet will testify about what they used to earn.",
    "translation_id": "Pada hari ini Kami membungkam mulut mereka. Tangan merekalah yang berkata kepada Kami dan kaki merekalah yang akan bersaksi terhadap apa yang dahulu mereka kerjakan."
  },
  {
    "ayat": 66,
    "arabic": "وَلَوْ نَشَاۤءُ لَطَمَسْنَا عَلٰٓى اَعْيُنِهِمْ فَاسْتَبَقُوا الصِّرَاطَ فَاَنّٰى يُبْصِرُوْنَ",
    "transliteration_en": "Wa law nashaaa'u lata masna 'alaaa aiyunihim fasta baqus-siraata fa-annaa yubsiroon",
    "transliteration_id": "Wa lau nasyā'u laṭamasnā ‘alā a‘yunihim fastabaquṣ-ṣirāṭa fa annā yubṣirūn(a).",
    "translation_en": "And if We willed, We could have obliterated their eyes, and they would race to [find] the path, and how could they see?",
    "translation_id": "Seandainya Kami menghendaki, pastilah Kami akan menghapus penglihatan (membutakan) mereka sehingga mereka berlomba-lomba (mencari) jalan (selamat). Maka, bagaimana mungkin mereka dapat melihat?"
  },
  {
    "ayat": 67,
    "arabic": "وَلَوْ نَشَاۤءُ لَمَسَخْنٰهُمْ عَلٰى مَكَانَتِهِمْ فَمَا اسْتَطَاعُوْا مُضِيًّا وَّلَا يَرْجِعُوْنَ ࣖ",
    "transliteration_en": "Wa law nashaaa'u lamasakhnaahum 'alaa makaanatihim famas-tataa'oo mudiyyanw-wa laa yarji'oon",
    "transliteration_id": "Wa lau nasyā'u lamasakhnāhum ‘alā makānatihim famastaṭā‘ū muḍiyyaw wa lā yarji‘ūn(a).",
    "translation_en": "And if We willed, We could have deformed them, [paralyzing them] in their places so they would not be able to proceed, nor could they return.",
    "translation_id": "Seandainya Kami menghendaki, pastilah Kami akan mengubah bentuk mereka di tempat mereka berada, sehingga mereka tidak sanggup meneruskan perjalanan dan juga tidak sanggup pulang kembali."
  },
  {
    "ayat": 68,
    "arabic": "وَمَنْ نُّعَمِّرْهُ نُنَكِّسْهُ فِى الْخَلْقِۗ اَفَلَا يَعْقِلُوْنَ",
    "transliteration_en": "Wa man nu 'ammirhu nunakkishu fil-khalq; afalaa ya'qiloon",
    "transliteration_id": "Wa man nu‘ammirhu nunakkishu fil-khalq(i), afalā ya‘qilūn(a).",
    "translation_en": "And he to whom We grant long life We reverse in creation; so will they not understand?",
    "translation_id": "Siapa yang Kami panjangkan umurnya niscaya Kami balik proses penciptaannya (dari kuat menuju lemah). Maka, apakah mereka tidak mengerti?"
  },
  {
    "ayat": 69,
    "arabic": "وَمَا عَلَّمْنٰهُ الشِّعْرَ وَمَا يَنْۢبَغِيْ لَهٗ ۗاِنْ هُوَ اِلَّا ذِكْرٌ وَّقُرْاٰنٌ مُّبِيْنٌ ۙ",
    "transliteration_en": "Wa maa 'allamnaahush shi'ra wa maa yambaghee lah; in huwa illaa zikrunw-wa Qur-aanum mubeen",
    "transliteration_id": "Wa mā ‘allamnāhusy-syi‘ra wa mā yambagī lah(ū), in huwa illā żikruw wa qur'ānum mubīn(un).",
    "translation_en": "And We did not give Prophet Muhammad, knowledge of poetry, nor is it befitting for him. It is not but a message and a clear Qur'an",
    "translation_id": "Kami tidak mengajarkan syair kepadanya (Nabi Muhammad) dan (bersyair) itu tidaklah pantas baginya. (Wahyu yang Kami turunkan kepadanya) itu tidak lain hanyalah pelajaran dan Al-Qur’an yang jelas"
  },
  {
    "ayat": 70,
    "arabic": "لِّيُنْذِرَ مَنْ كَانَ حَيًّا وَّيَحِقَّ الْقَوْلُ عَلَى الْكٰفِرِيْنَ",
    "transliteration_en": "Liyunzira man kaana haiyanw-wa yahiqqal qawlu 'alal-kaafireen",
    "transliteration_id": "Liyunżira man kāna ḥayyaw wa yaḥiqqal-qaulu ‘alal-kāfirīn(a).",
    "translation_en": "To warn whoever is alive and justify the word against the disbelievers.",
    "translation_id": "agar dia (Nabi Muhammad) memberi peringatan kepada orang-orang yang hidup (hatinya) dan agar ketetapan (azab) terhadap orang-orang kafir itu menjadi pasti."
  },
  {
    "ayat": 71,
    "arabic": "اَوَلَمْ يَرَوْا اَنَّا خَلَقْنَا لَهُمْ مِّمَّا عَمِلَتْ اَيْدِيْنَآ اَنْعَامًا فَهُمْ لَهَا مٰلِكُوْنَ",
    "transliteration_en": "Awalam yaraw annaa khalaqnaa lahum mimmaa 'amilat aideenaaa an'aaman fahum lahaa maalikoon",
    "transliteration_id": "Awalam yarau annā khalaqnā lahum mimmā ‘amilat aidīnā an‘āman fahum lahā mālikūn(a).",
    "translation_en": "Do they not see that We have created for them from what Our hands have made, grazing livestock, and [then] they are their owners?",
    "translation_id": "Tidakkah mereka mengetahui bahwa Kami telah menciptakan untuk mereka hewan-hewan ternak dari ciptaan tangan Kami (sendiri), lalu mereka menjadi pemiliknya?"
  },
  {
    "ayat": 72,
    "arabic": "وَذَلَّلْنٰهَا لَهُمْ فَمِنْهَا رَكُوْبُهُمْ وَمِنْهَا يَأْكُلُوْنَ",
    "transliteration_en": "Wa zallalnaahaa lahum faminhaa rakoobuhum wa minhaa yaakuloon",
    "transliteration_id": "Wa żallalnāhā lahum fa minhā rakūbuhum wa minhā ya'kulūn(a).",
    "translation_en": "And We have tamed them for them, so some of them they ride, and some of them they eat.",
    "translation_id": "Kami menjadikannya (hewan-hewan itu) tunduk kepada mereka. Sebagian di antaranya menjadi tunggangan mereka dan sebagian (lagi) mereka makan."
  },
  {
    "ayat": 73,
    "arabic": "وَلَهُمْ فِيْهَا مَنَافِعُ وَمَشَارِبُۗ اَفَلَا يَشْكُرُوْنَ",
    "transliteration_en": "Wa lahum feehaa manaa fi'u wa mashaarib; afalaa yashkuroon",
    "transliteration_id": "Wa lahum fīhā manāfi‘u wa masyārib(u), afalā yasykurūn(a).",
    "translation_en": "And for them therein are [other] benefits and drinks, so will they not be grateful?",
    "translation_id": "Pada dirinya (hewan-hewan ternak itu) terdapat berbagai manfaat dan minuman untuk mereka. Apakah mereka tidak bersyukur?"
  },
  {
    "ayat": 74,
    "arabic": "وَاتَّخَذُوْا مِنْ دُوْنِ اللّٰهِ اٰلِهَةً لَّعَلَّهُمْ يُنْصَرُوْنَ ۗ",
    "transliteration_en": "Wattakhazoo min doonil laahi aalihatal la'allahum yunsaroon",
    "transliteration_id": "Wattakhażū min dūnillāhi ālihatal la‘allahum yunṣarūn(a).",
    "translation_en": "But they have taken besides Allah [false] deities that perhaps they would be helped.",
    "translation_id": "Mereka menjadikan sesembahan selain Allah agar mereka mendapat pertolongan."
  },
  {
    "ayat": 75,
    "arabic": "لَا يَسْتَطِيْعُوْنَ نَصْرَهُمْۙ وَهُمْ لَهُمْ جُنْدٌ مُّحْضَرُوْنَ",
    "transliteration_en": "Laa yastatee'oona nasrahum wa hum lahum jundum muhdaroon",
    "transliteration_id": "Lā yastaṭī‘ūna naṣrahum, wa hum lahum jundum muḥḍarūn(a).",
    "translation_en": "They are not able to help them, and they [themselves] are for them soldiers in attendance.",
    "translation_id": "(Sesembahan) itu tidak mampu menolong mereka, padahal (sesembahan) itu adalah tentara yang dihadirkan untuk menjaganya."
  },
  {
    "ayat": 76,
    "arabic": "فَلَا يَحْزُنْكَ قَوْلُهُمْ ۘاِنَّا نَعْلَمُ مَا يُسِرُّوْنَ وَمَا يُعْلِنُوْنَ",
    "transliteration_en": "Falaa yahzunka qawluhum; innaa na'lamu maa yusirroona wa maa yu'linoon",
    "transliteration_id": "Falā yaḥzunka qauluhum, innā na‘lamu mā yusirrūna wa mā yu‘linūn(a).",
    "translation_en": "So let not their speech grieve you. Indeed, We know what they conceal and what they declare.",
    "translation_id": "Maka, jangan sampai ucapan mereka membuat engkau (Nabi Muhammad) bersedih hati. Sesungguhnya Kami mengetahui apa yang mereka rahasiakan dan apa yang mereka nyatakan."
  },
  {
    "ayat": 77,
    "arabic": "اَوَلَمْ يَرَ الْاِنْسَانُ اَنَّا خَلَقْنٰهُ مِنْ نُّطْفَةٍ فَاِذَا هُوَ خَصِيْمٌ مُّبِيْنٌ",
    "transliteration_en": "Awalam yaral insaanu annaa khalaqnaahu min nutfatin fa-izaa huwa khaseemum mubeen",
    "transliteration_id": "Awalam yaral-insānu annā khalaqnāhu min nuṭfatin fa'iżā huwa khaṣīmum mubīn(un).",
    "translation_en": "Does man not consider that We created him from a [mere] sperm-drop - then at once he is a clear adversary?",
    "translation_id": "Tidakkah manusia mengetahui bahwa Kami menciptakannya dari setetes mani? Kemudian tiba-tiba saja dia menjadi musuh yang nyata."
  },
  {
    "ayat": 78,
    "arabic": "وَضَرَبَ لَنَا مَثَلًا وَّنَسِيَ خَلْقَهٗۗ قَالَ مَنْ يُّحْيِ الْعِظَامَ وَهِيَ رَمِيْمٌ",
    "transliteration_en": "Wa daraba lanaa maslanw-wa nasiya khalqahoo qaala mai-yuhyil'izaama wa hiya rameem",
    "transliteration_id": "Wa ḍaraba lanā maṡalaw wa nasiya khalqah(ū), qāla may yuḥyil-‘iẓāma wa hiya ramīm(un).",
    "translation_en": "And he presents for Us an example and forgets his [own] creation. He says, \"Who will give life to bones while they are disintegrated?\"",
    "translation_id": "Dia membuat perumpamaan bagi Kami dan melupakan asal penciptaannya. Dia berkata, “Siapakah yang bisa menghidupkan tulang-belulang yang telah hancur luluh?”"
  },
  {
    "ayat": 79,
    "arabic": "قُلْ يُحْيِيْهَا الَّذِيْٓ اَنْشَاَهَآ اَوَّلَ مَرَّةٍ ۗوَهُوَ بِكُلِّ خَلْقٍ عَلِيْمٌ ۙ",
    "transliteration_en": "Qul yuh yeehal lazeee ansha ahaaa awwala marrah; wa Huwa bikulli khalqin 'Aleem",
    "transliteration_id": "Qul yuḥyīhal-lażī ansya'ahā awwala marrah(tin), wa huwa bikulli khalqin ‘alīm(un).",
    "translation_en": "Say, \"He will give them life who produced them the first time; and He is, of all creation, Knowing.\"",
    "translation_id": "Katakanlah (Nabi Muhammad), “Yang akan menghidupkannya adalah Zat yang menciptakannya pertama kali. Dia Maha Mengetahui setiap makhluk."
  },
  {
    "ayat": 80,
    "arabic": "ۨالَّذِيْ جَعَلَ لَكُمْ مِّنَ الشَّجَرِ الْاَخْضَرِ نَارًاۙ فَاِذَآ اَنْتُمْ مِّنْهُ تُوْقِدُوْنَ",
    "transliteration_en": "Allazee ja'ala lakum minash shajaril akhdari naaran fa-izaaa antum minhu tooqidoon",
    "transliteration_id": "Allażī ja‘ala lakum minasy-syajaril-akhḍari nārā(n), fa'iżā antum minhu tūqidūn(a).",
    "translation_en": "[It is] He who made for you from the green tree, fire, and then from it you ignite.",
    "translation_id": "(Dialah) yang menjadikan api untukmu dari kayu yang hijau. Kemudian, seketika itu kamu menyalakan (api) darinya.”"
  },
  {
    "ayat": 81,
    "arabic": "اَوَلَيْسَ الَّذِيْ خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ بِقٰدِرٍ عَلٰٓى اَنْ يَّخْلُقَ مِثْلَهُمْ ۗبَلٰى وَهُوَ الْخَلّٰقُ الْعَلِيْمُ",
    "transliteration_en": "Awa laisal lazee khalaqas samaawaati wal arda biqaadirin 'alaaa ai-yakhluqa mislahum; balaa wa Huwal Khallaaqul 'Aleem",
    "transliteration_id": "Awa laisal-lażī khalaqas-samāwāti wal-arḍa biqādirin ‘alā ay yakhluqa miṡlahum, balā wa huwal-khallāqul-‘alīm(u).",
    "translation_en": "Is not He who created the heavens and the earth Able to create the likes of them? Yes, [it is so]; and He is the Knowing Creator.",
    "translation_id": "Bukankah Zat yang menciptakan langit dan bumi mampu menciptakan manusia yang serupa mereka itu (di akhirat kelak)? Benar. Dialah yang Maha Banyak Mencipta lagi Maha Mengetahui."
  },
  {
    "ayat": 82,
    "arabic": "اِنَّمَآ اَمْرُهٗٓ اِذَآ اَرَادَ شَيْـًٔاۖ اَنْ يَّقُوْلَ لَهٗ كُنْ فَيَكُوْنُ",
    "transliteration_en": "Innamaa amruhooo izaaa araada shai'an ai-yaqoola lahoo kun fa-yakoon",
    "transliteration_id": "Innamā amruhū iżā arāda syai'an ay yaqūla lahū kun fa yakūn(u).",
    "translation_en": "His command is only when He intends a thing that He says to it, \"Be,\" and it is.",
    "translation_id": "Sesungguhnya ketetapan-Nya, jika Dia menghendaki sesuatu, Dia hanya berkata kepadanya, “Jadilah!” Maka, jadilah (sesuatu) itu."
  },
  {
    "ayat": 83,
    "arabic": "فَسُبْحٰنَ الَّذِيْ بِيَدِهٖ مَلَكُوْتُ كُلِّ شَيْءٍ وَّاِلَيْهِ تُرْجَعُوْنَ ࣖ",
    "transliteration_en": "Fa Subhaanal lazee biyadihee malakootu kulli shai-inw-wa ilaihi turja'oon",
    "transliteration_id": "Fa subḥānal-lażī biyadihī malakūtu kulli syai'iw wa ilaihi turja‘ūn(a).",
    "translation_en": "So exalted is He in whose hand is the realm of all things, and to Him you will be returned.",
    "translation_id": "Maka, Maha Suci (Allah) yang di tangan-Nya kekuasaan atas segala sesuatu dan kepada-Nya kamu dikembalikan."
  }
]