[
  {
    "ayat": 51,
    "arabic": "وَلَا تَجْعَلُوْا مَعَ اللّٰهِ اِلٰهًا اٰخَرَۗ اِنِّيْ لَكُمْ مِّنْهُ نَذِيْرٌ مُّبِيْنٌ",
    "transliteration_en": "Wa laa taj'aloo ma'al laahi ilaahan aakhara innee lakum minhu nazeerum mubeen",
    "transliteration_id": "Wa lā taj‘alū ma‘allāhi ilāhan ākhar(a), innī lakum minhu nażīrum mubīn(un).",
    "translation_en": "And do not make [as equal] with Allah another deity. Indeed, I am to you from Him a clear warner.",
    "translation_id": "Janganlah kamu mengadakan tuhan lain bersama Allah. Sesungguhnya aku adalah seorang pemberi peringatan yang jelas dari Allah untukmu.”"
  },
  {
    "ayat": 52,
    "arabic": "كَذٰلِكَ مَآ اَتَى الَّذِيْنَ مِنْ قَبْلِهِمْ مِّنْ رَّسُوْلٍ اِلَّا قَالُوْا سَاحِرٌ اَوْ مَجْنُوْنٌ",
    "transliteration_en": "Kazaalika maaa atal lazeena min qablihim mir Rasoolin illaa qaaloo saahirun aw majnoon",
    "transliteration_id": "Każālika mā atal-lażīna min qablihim mir rasūlin illā qālū sāḥirun au majnūn(un).",
    "translation_en": "Similarly, there came not to those before them any messenger except that they said, \"A magician or a madman.\"",
    "translation_id": "Demikianlah setiap kali seorang rasul datang kepada orang-orang sebelumnya, mereka pasti mengatakan, “(Dia itu adalah) penyihir atau orang gila.”"
  },
  {
    "ayat": 53,
    "arabic": "اَتَوَاصَوْا بِهٖۚ بَلْ هُمْ قَوْمٌ طَاغُوْنَۚ",
    "transliteration_en": "Atawaasaw bih; bal hum qawmun taaghoon",
    "transliteration_id": "Atawāṣau bih(ī), bal hum qaumun ṭāgūn(a).",
    "translation_en": "Did they suggest it to them? Rather, they [themselves] are a transgressing people.",
    "translation_id": "Apakah mereka saling menasihati tentang (apa yang dikatakan) itu? (Tidak!) Sebaliknya, mereka adalah kaum yang melampaui batas."
  },
  {
    "ayat": 54,
    "arabic": "فَتَوَلَّ عَنْهُمْ فَمَآ اَنْتَ بِمَلُوْمٍ",
    "transliteration_en": "Fatawalla 'anhum famaaa anta bimaloom",
    "transliteration_id": "Fa tawalla ‘anhum famā anta bimalūm(in).",
    "translation_en": "So leave them, [O Muhammad], for you are not to be blamed.",
    "translation_id": "Berpalinglah dari mereka, maka engkau sama sekali bukan orang yang tercela."
  },
  {
    "ayat": 55,
    "arabic": "وَذَكِّرْ فَاِنَّ الذِّكْرٰى تَنْفَعُ الْمُؤْمِنِيْنَ",
    "transliteration_en": "Wa zakkir fa innaz zikraa tanfa'ul mu'mineen",
    "transliteration_id": "Wa żakkir fa innaż-żikra  tanfa‘ul-mu'minīn(a).",
    "translation_en": "And remind, for indeed, the reminder benefits the believers.",
    "translation_id": "Teruslah memberi peringatan karena sesungguhnya peringatan itu bermanfaat bagi orang-orang mukmin."
  },
  {
    "ayat": 56,
    "arabic": "وَمَا خَلَقْتُ الْجِنَّ وَالْاِنْسَ اِلَّا لِيَعْبُدُوْنِ",
    "transliteration_en": "Wa maa khalaqtul jinna wal insa illaa liya'budoon",
    "transliteration_id": "Wa mā khalaqtul-jinna wal-insa illā liya‘budūn(i).",
    "translation_en": "And I did not create the jinn and mankind except to worship Me.",
    "translation_id": "Tidaklah Aku menciptakan jin dan manusia kecuali untuk beribadah kepada-Ku."
  },
  {
    "ayat": 57,
    "arabic": "مَآ اُرِيْدُ مِنْهُمْ مِّنْ رِّزْقٍ وَّمَآ اُرِيْدُ اَنْ يُّطْعِمُوْنِ",
    "transliteration_en": "Maaa ureedu minhum mir rizqinw wa maaa ureedu anyyut'imoon",
    "transliteration_id": "Mā urīdu minhum mir rizqiw wa mā urīdu ay yuṭ‘imūn(i).",
    "translation_en": "I do not want from them any provision, nor do I want them to feed Me.",
    "translation_id": "Aku tidak menghendaki rezeki sedikit pun dari mereka dan tidak menghendaki agar mereka memberi makan kepada-Ku."
  },
  {
    "ayat": 58,
    "arabic": "اِنَّ اللّٰهَ هُوَ الرَّزَّاقُ ذُو الْقُوَّةِ الْمَتِيْنُ",
    "transliteration_en": "Innal laaha Huwar Razzaaqu Zul Quwwatil Mateen",
    "transliteration_id": "Innallāha huwar-razzāqu żul-quwwatil-matīn(u).",
    "translation_en": "Indeed, it is Allah who is the [continual] Provider, the firm possessor of strength.",
    "translation_id": "Sesungguhnya Allahlah Maha Pemberi Rezeki yang mempunyai kekuatan lagi sangat kukuh."
  },
  {
    "ayat": 59,
    "arabic": "فَاِنَّ لِلَّذِيْنَ ظَلَمُوْا ذَنُوْبًا مِّثْلَ ذَنُوْبِ اَصْحٰبِهِمْ فَلَا يَسْتَعْجِلُوْنِ",
    "transliteration_en": "Fa inna lillazeena zalamoo zanoobam misla zanoobi ashaabihim falaa yasta'jiloon",
    "transliteration_id": "Fa inna lil-lażīna ẓalamū żanūbam miṡla żanūbi aṣḥābihim falā yasta‘jilūn(i).",
    "translation_en": "And indeed, for those who have wronged is a portion [of punishment] like the portion of their predecessors, so let them not impatiently urge Me.",
    "translation_id": "Sesungguhnya orang-orang yang zalim mendapatkan bagian (azab) seperti bagian teman-teman mereka (dahulu). Maka, janganlah mereka meminta kepada-Ku untuk menyegerakan(-nya)."
  },
  {
    "ayat": 60,
    "arabic": "فَوَيْلٌ لِّلَّذِيْنَ كَفَرُوْا مِنْ يَّوْمِهِمُ الَّذِيْ يُوْعَدُوْنَ ࣖ",
    "transliteration_en": "Fawailul lillazeena kafaroo miny yawmihimul lazee yoo'adoon",
    "transliteration_id": "Fa wailul lil-lażīna kafarū miy yaumihimul-lażī yū‘adūn(a).",
    "translation_en": "And woe to those who have disbelieved from their Day which they are promised.",
    "translation_id": "Celakalah orang-orang yang kufur pada hari yang telah dijanjikan kepada mereka (hari Kiamat)."
  }
]