[
  {
    "ayat": 1,
    "arabic": "الۤمّۤ ۚ",
    "transliteration_en": "Alif-Laaam-Meeem",
    "transliteration_id": "Alif lām mīm.",
    "translation_en": "Alif, Lam, Meem.",
    "translation_id": "Alif Lām Mīm."
  },
  {
    "ayat": 2,
    "arabic": "ذٰلِكَ الْكِتٰبُ لَا رَيْبَ ۛ فِيْهِ ۛ هُدًى لِّلْمُتَّقِيْنَۙ",
    "transliteration_en": "Zaalikal Kitaabu laa raiba feeh; udal lilmuttaqeen",
    "transliteration_id": "Żālikal-kitābu lā raiba fīh(i), hudal lil-muttaqīn(a).",
    "translation_en": "This is the Book about which there is no doubt, a guidance for those conscious of Allah -",
    "translation_id": "Kitab (Al-Qur’an) ini tidak ada keraguan di dalamnya; (ia merupakan) petunjuk bagi orang-orang yang bertakwa,"
  },
  {
    "ayat": 3,
    "arabic": "الَّذِيْنَ يُؤْمِنُوْنَ بِالْغَيْبِ وَيُقِيْمُوْنَ الصَّلٰوةَ وَمِمَّا رَزَقْنٰهُمْ يُنْفِقُوْنَ ۙ",
    "transliteration_en": "Allazeena yu'minoona bilghaibi wa yuqeemoonas salaata wa mimmaa razaqnaahum yunfiqoon",
    "transliteration_id": "Al-lażīna yu'minūna bil-gaibi wa yuqīmūnaṣ-ṣalāta wa mimmā razaqnāhum yunfiqūn(a).",
    "translation_en": "Who believe in the unseen, establish prayer, and spend out of what We have provided for them,",
    "translation_id": "(yaitu) orang-orang yang beriman pada yang gaib, menegakkan salat, dan menginfakkan sebagian rezeki yang Kami anugerahkan kepada mereka,"
  },
  {
    "ayat": 4,
    "arabic": "وَالَّذِيْنَ يُؤْمِنُوْنَ بِمَآ اُنْزِلَ اِلَيْكَ وَمَآ اُنْزِلَ مِنْ قَبْلِكَ ۚ وَبِالْاٰخِرَةِ هُمْ يُوْقِنُوْنَۗ",
    "transliteration_en": "Wallazeena yu'minoona bimaa unzila ilaika wa maaa unzila min qablika wa bil Aakhirati hum yooqinoon",
    "transliteration_id": "Wal-lażīna yu'minūna bimā unzila ilaika wa mā unzila min qablik(a), wabil-ākhirati hum yūqinūn(a).",
    "translation_en": "And who believe in what has been revealed to you, [O Muhammad], and what was revealed before you, and of the Hereafter they are certain [in faith].",
    "translation_id": "dan mereka yang beriman pada (Al-Qur’an) yang diturunkan kepadamu (Nabi Muhammad) dan (kitab-kitab suci) yang telah diturunkan sebelum engkau dan mereka yakin akan adanya akhirat."
  },
  {
    "ayat": 5,
    "arabic": "اُولٰۤىِٕكَ عَلٰى هُدًى مِّنْ رَّبِّهِمْ ۙ وَاُولٰۤىِٕكَ هُمُ الْمُفْلِحُوْنَ",
    "transliteration_en": "Ulaaa'ika 'alaa hudam mir rabbihim wa ulaaa'ika humul muflihoon",
    "transliteration_id": "Ulā'ika ‘alā hudam mir rabbihim wa ulā'ika humul-mufliḥūn(a).",
    "translation_en": "Those are upon [right] guidance from their Lord, and it is those who are the successful.",
    "translation_id": "Merekalah yang mendapat petunjuk dari Tuhannya dan mereka itulah orang-orang yang beruntung."
  },
  {
    "ayat": 6,
    "arabic": "اِنَّ الَّذِيْنَ كَفَرُوْا سَوَاۤءٌ عَلَيْهِمْ ءَاَنْذَرْتَهُمْ اَمْ لَمْ تُنْذِرْهُمْ لَا يُؤْمِنُوْنَ",
    "transliteration_en": "Innal lazeena kafaroo sawaaa'un 'alaihim 'a-anzar tahum am lam tunzirhum laa yu'minoon",
    "transliteration_id": "Innal-lażīna kafarū sawā'un ‘alaihim a'anżartahum am lam tunżirhum lā yu'minūn(a).",
    "translation_en": "Indeed, those who disbelieve - it is all the same for them whether you warn them or do not warn them - they will not believe.",
    "translation_id": "Sesungguhnya orang-orang yang kufur itu sama saja bagi mereka, apakah engkau (Nabi Muhammad) beri peringatan atau tidak engkau beri peringatan, mereka tidak akan beriman."
  },
  {
    "ayat": 7,
    "arabic": "خَتَمَ اللّٰهُ عَلٰى قُلُوْبِهِمْ وَعَلٰى سَمْعِهِمْ ۗ وَعَلٰٓى اَبْصَارِهِمْ غِشَاوَةٌ وَّلَهُمْ عَذَابٌ عَظِيْمٌ ࣖ",
    "transliteration_en": "Khatamal laahu 'alaa quloobihim wa 'alaa sam'i-him wa 'alaaa absaarihim ghishaa watunw wa lahum 'azaabun 'azeem",
    "transliteration_id": "Khatamallāhu ‘alā qulūbihim wa ‘alā sam‘ihim wa ‘alā abṣārihim gisyāwatuw wa lahum ‘ażābun ‘aẓīm(un).",
    "translation_en": "Allah has set a seal upon their hearts and upon their hearing, and over their vision is a veil. And for them is a great punishment.",
    "translation_id": "Allah telah mengunci hati dan pendengaran mereka. Pada penglihatan mereka ada penutup, dan bagi mereka azab yang sangat berat."
  },
  {
    "ayat": 8,
    "arabic": "وَمِنَ النَّاسِ مَنْ يَّقُوْلُ اٰمَنَّا بِاللّٰهِ وَبِالْيَوْمِ الْاٰخِرِ وَمَا هُمْ بِمُؤْمِنِيْنَۘ",
    "transliteration_en": "Wa minan naasi mai yaqoolu aamannaa billaahi wa bil yawmil aakhiri wa maa hum bimu'mineen",
    "transliteration_id": "Wa minan-nāsi may yaqūlu āmannā billāhi wa bil-yaumil-ākhiri wa mā hum bimu'minīn(a).",
    "translation_en": "And of the people are some who say, \"We believe in Allah and the Last Day,\" but they are not believers.",
    "translation_id": "Di antara manusia ada yang berkata, “Kami beriman kepada Allah dan hari Akhir,” padahal sesungguhnya mereka itu bukanlah orang-orang mukmin."
  },
  {
    "ayat": 9,
    "arabic": "يُخٰدِعُوْنَ اللّٰهَ وَالَّذِيْنَ اٰمَنُوْا ۚ وَمَا يَخْدَعُوْنَ اِلَّآ اَنْفُسَهُمْ وَمَا يَشْعُرُوْنَۗ",
    "transliteration_en": "Yukhaadi'oonal laaha wallazeena aamanoo wa maa yakhda'oona illaaa anfusahum wa maa yash'uroon",
    "transliteration_id": "Yukhādi‘ūnallāha wal-lażīna āmanū wa mā yakhda‘ūna illā anfusahum wa mā yasy‘urūn(a).",
    "translation_en": "They [think to] deceive Allah and those who believe, but they deceive not except themselves and perceive [it] not.",
    "translation_id": "Mereka menipu Allah dan orang-orang yang beriman, padahal mereka hanyalah menipu diri sendiri tanpa mereka sadari."
  },
  {
    "ayat": 10,
    "arabic": "فِيْ قُلُوْبِهِمْ مَّرَضٌۙ فَزَادَهُمُ اللّٰهُ مَرَضًاۚ وَلَهُمْ عَذَابٌ اَلِيْمٌ ۢ ەۙ بِمَا كَانُوْا يَكْذِبُوْنَ",
    "transliteration_en": "Fee quloobihim mara dun fazzdahumul laahu maradan wa lahum 'azaabun aleemum bimaa kaanoo yakziboon",
    "transliteration_id": "Fī qulūbihim maraḍun fa zādahumullāhu maraḍā(n), wa lahum ‘ażābun alīmum bimā kānū yakżibūn(a).",
    "translation_en": "In their hearts is disease, so Allah has increased their disease; and for them is a painful punishment because they [habitually] used to lie.",
    "translation_id": "Dalam hati mereka ada penyakit, lalu Allah menambah penyakitnya dan mereka mendapat azab yang sangat pedih karena mereka selalu berdusta."
  },
  {
    "ayat": 11,
    "arabic": "وَاِذَا قِيْلَ لَهُمْ لَا تُفْسِدُوْا فِى الْاَرْضِۙ قَالُوْٓا اِنَّمَا نَحْنُ مُصْلِحُوْنَ",
    "transliteration_en": "Wa izaa qeela lahum laa tufsidoo fil ardi qaalo innamaa nahnu muslihoon",
    "transliteration_id": "Wa iżā qīla lahum lā tufsidū fil-arḍ(i), qālū innamā naḥnu muṣliḥūn(a).",
    "translation_en": "And when it is said to them, \"Do not cause corruption on the earth,\" they say, \"We are but reformers.\"",
    "translation_id": "Apabila dikatakan kepada mereka, “Janganlah berbuat kerusakan di bumi,” mereka menjawab, “Sesungguhnya kami hanyalah orang-orang yang melakukan perbaikan.”"
  },
  {
    "ayat": 12,
    "arabic": "اَلَآ اِنَّهُمْ هُمُ الْمُفْسِدُوْنَ وَلٰكِنْ لَّا يَشْعُرُوْنَ",
    "transliteration_en": "Alaaa innahum humul mufsidoona wa laakil laa yash'uroon",
    "transliteration_id": "Alā innahum humul-mufsidūna wa lākil lā yasy‘urūn(a).",
    "translation_en": "Unquestionably, it is they who are the corrupters, but they perceive [it] not.",
    "translation_id": "Ingatlah, sesungguhnya merekalah yang berbuat kerusakan, tetapi mereka tidak menyadari."
  },
  {
    "ayat": 13,
    "arabic": "وَاِذَا قِيْلَ لَهُمْ اٰمِنُوْا كَمَآ اٰمَنَ النَّاسُ قَالُوْٓا اَنُؤْمِنُ كَمَآ اٰمَنَ السُّفَهَاۤءُ ۗ اَلَآ اِنَّهُمْ هُمُ السُّفَهَاۤءُ وَلٰكِنْ لَّا يَعْلَمُوْنَ",
    "transliteration_en": "Wa izaa qeela lahum aaminoo kamaaa aamanan naasu qaalooo anu'minu kamaaa aamanas sufahaaa'; alaaa innahum humus sufahaaa'u wa laakil laa ya'lamoon",
    "transliteration_id": "Wa iżā qīla lahum āminū kamā āmanan nāsu qālū anu'minu kamā āmanas-sufahā'(u), alā innahum humus-sufahā'u wa lākil lā ya‘lamūn(a).",
    "translation_en": "And when it is said to them, \"Believe as the people have believed,\" they say, \"Should we believe as the foolish have believed?\" Unquestionably, it is they who are the foolish, but they know [it] not.",
    "translation_id": "Apabila dikatakan kepada mereka, “Berimanlah kamu sebagaimana orang lain telah beriman,” mereka menjawab, “Apakah kami akan beriman seperti orang-orang yang picik akalnya itu beriman?” Ingatlah, sesungguhnya mereka itulah orang-orang yang picik akalnya, tetapi mereka tidak tahu."
  },
  {
    "ayat": 14,
    "arabic": "وَاِذَا لَقُوا الَّذِيْنَ اٰمَنُوْا قَالُوْٓا اٰمَنَّا ۚ وَاِذَا خَلَوْا اِلٰى شَيٰطِيْنِهِمْ ۙ قَالُوْٓا اِنَّا مَعَكُمْ  ۙاِنَّمَا نَحْنُ مُسْتَهْزِءُوْنَ",
    "transliteration_en": "Wa izaa laqul lazeena aamanoo qaalooo aamannaa wa izaa khalw ilaa shayaateenihim qaalooo innaa ma'akum innamaa nahnu mustahzi'oon",
    "transliteration_id": "Wa iżā laqul-lażīna āmanū qālū āmannā, wa iżā khalau ilā syayāṭīnihim qālū innā ma‘akum, innamā naḥnu mustahzi'ūn(a).",
    "translation_en": "And when they meet those who believe, they say, \"We believe\"; but when they are alone with their evil ones, they say, \"Indeed, we are with you; we were only mockers.\"",
    "translation_id": "Apabila mereka berjumpa dengan orang yang beriman, mereka berkata, “Kami telah beriman.” Akan tetapi apabila mereka menyendiri dengan setan-setan (para pemimpin) mereka, mereka berkata, “Sesungguhnya kami bersama kamu, kami hanya pengolok-olok.”"
  },
  {
    "ayat": 15,
    "arabic": "اَللّٰهُ يَسْتَهْزِئُ بِهِمْ وَيَمُدُّهُمْ فِيْ طُغْيَانِهِمْ يَعْمَهُوْنَ",
    "transliteration_en": "Allahu yastahzi'u bihim wa yamudduhum fee tughyaanihim ya'mahoon",
    "transliteration_id": "Allāhu yastahzi'u bihim wa yamudduhum fī ṭugyānihim ya‘mahūn(a).",
    "translation_en": "[But] Allah mocks them and prolongs them in their transgression [while] they wander blindly.",
    "translation_id": "Allah akan memperolok-olokkan dan membiarkan mereka terombang-ambing dalam kesesatan."
  },
  {
    "ayat": 16,
    "arabic": "اُولٰۤىِٕكَ الَّذِيْنَ اشْتَرَوُا الضَّلٰلَةَ بِالْهُدٰىۖ فَمَا رَبِحَتْ تِّجَارَتُهُمْ وَمَا كَانُوْا مُهْتَدِيْنَ",
    "transliteration_en": "Ulaaa'ikal lazeenash tara wud dalaalata bilhudaa famaa rabihat tijaaratuhum wa maa kaanoo muhtadeen",
    "transliteration_id": "Ulā'ikal-lażīnasytarawuḍ-ḍalālata bil-hudā, famā rabiḥat tijāratuhum wa mā kānū muhtadīn(a).",
    "translation_en": "Those are the ones who have purchased error [in exchange] for guidance, so their transaction has brought no profit, nor were they guided.",
    "translation_id": "Mereka itulah orang-orang yang membeli kesesatan dengan petunjuk. Maka, tidaklah beruntung perniagaannya dan mereka bukanlah orang-orang yang mendapatkan petunjuk."
  },
  {
    "ayat": 17,
    "arabic": "مَثَلُهُمْ كَمَثَلِ الَّذِى اسْتَوْقَدَ نَارًا ۚ فَلَمَّآ اَضَاۤءَتْ مَا حَوْلَهٗ ذَهَبَ اللّٰهُ بِنُوْرِهِمْ وَتَرَكَهُمْ فِيْ ظُلُمٰتٍ لَّا يُبْصِرُوْنَ",
    "transliteration_en": "Masaluhum kamasalillazis tawqada naaran falammaaa adaaa'at maa hawlahoo zahabal laahu binoorihim wa tarakahum fee zulumaatil laa yubsiroon",
    "transliteration_id": "Maṡaluhum kamaṡalil-lażistauqada nārā(n), falammā aḍā'at mā ḥaulahūū  żahaballāhu binūrihim wa tarakahum fī ẓulumātil lā yubṣirūn(a).",
    "translation_en": "Their example is that of one who kindled a fire, but when it illuminated what was around him, Allah took away their light and left them in darkness [so] they could not see.",
    "translation_id": "Perumpamaan mereka seperti orang yang menyalakan api. Setelah (api itu) menerangi sekelilingnya, Allah melenyapkan cahaya (yang menyinari) mereka dan membiarkan mereka dalam kegelapan, tidak dapat melihat."
  },
  {
    "ayat": 18,
    "arabic": "صُمٌّ ۢ بُكْمٌ عُمْيٌ فَهُمْ لَا يَرْجِعُوْنَۙ",
    "transliteration_en": "Summum bukmun 'umyun fahum laa yarji'oon",
    "transliteration_id": "Ṣummum bukmun ‘umyun fahum lā yarji‘ūn(a).",
    "translation_en": "Deaf, dumb and blind - so they will not return [to the right path].",
    "translation_id": "(Mereka) tuli, bisu, lagi buta, sehingga mereka tidak dapat kembali."
  },
  {
    "ayat": 19,
    "arabic": "اَوْ كَصَيِّبٍ مِّنَ السَّمَاۤءِ فِيْهِ ظُلُمٰتٌ وَّرَعْدٌ وَّبَرْقٌۚ يَجْعَلُوْنَ اَصَابِعَهُمْ فِيْٓ اٰذَانِهِمْ مِّنَ الصَّوَاعِقِ حَذَرَ الْمَوْتِۗ وَاللّٰهُ مُحِيْطٌۢ بِالْكٰفِرِيْنَ",
    "transliteration_en": "Aw kasaiyibim minas samaaa'i feehi zulumaatunw wa ra'dunw wa barq, yaj'aloona asaabi'ahum feee aazaanihim minas sawaa'iqi hazaral mawt' wallaahu muheetum bilkaafireen",
    "transliteration_id": "Au kaṣayyibim minas-samā'i fīhi ẓulumātuw wa ra‘duw wa barq(un), yaj‘alūna aṣābi‘ahum fī āżānihim minaṣ-ṣawā‘iqi ḥażaral-maut(i), wallāhu muḥīṭum bil- kāfirīn(a).",
    "translation_en": "Or [it is] like a rainstorm from the sky within which is darkness, thunder and lightning. They put their fingers in their ears against the thunderclaps in dread of death. But Allah is encompassing of the disbelievers.",
    "translation_id": "Atau, seperti (orang yang ditimpa) hujan lebat dari langit yang disertai berbagai kegelapan, petir, dan kilat. Mereka menyumbat telinga dengan jari-jarinya (untuk menghindari) suara petir itu karena takut mati. Allah meliputi orang-orang yang kafir."
  },
  {
    "ayat": 20,
    "arabic": "يَكَادُ الْبَرْقُ يَخْطَفُ اَبْصَارَهُمْ ۗ كُلَّمَآ اَضَاۤءَ لَهُمْ مَّشَوْا فِيْهِ ۙ وَاِذَآ اَظْلَمَ عَلَيْهِمْ قَامُوْا ۗوَلَوْ شَاۤءَ اللّٰهُ لَذَهَبَ بِسَمْعِهِمْ وَاَبْصَارِهِمْ ۗ اِنَّ اللّٰهَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ ࣖ",
    "transliteration_en": "Yakaadul barqu yakhtafu absaarahum kullamaaa adaaa'a lahum mashaw feehi wa izaaa azlama 'alaihim qaamoo; wa law shaaa'al laahu lazahaba bisam'ihim wa absaarihim; innal laaha 'alaa kulli shai'in Qadeer",
    "transliteration_id": "Yakādul-barqu yakhṭafu abṣārahum, kullamā aḍā'a lahum masyau fīh(i), wa iżā aẓlama ‘alaihim qāmū, wa lau syā'allāhu lażahaba bisam‘ihim wa abṣārihim, innallāha ‘alā kulli syai'in qadīr(un).",
    "translation_en": "The lightning almost snatches away their sight. Every time it lights [the way] for them, they walk therein; but when darkness comes over them, they stand [still]. And if Allah had willed, He could have taken away their hearing and their sight. Indeed, Allah is over all things competent.",
    "translation_id": "Hampir saja kilat itu menyambar penglihatan mereka. Setiap kali (kilat itu) menyinari, mereka berjalan di bawah (sinar) itu. Apabila gelap menerpa mereka, mereka berdiri (tidak bergerak). Sekiranya Allah menghendaki, niscaya Dia menghilangkan pendengaran dan penglihatan mereka. Sesungguhnya Allah Maha Kuasa atas segala sesuatu."
  },
  {
    "ayat": 21,
    "arabic": "يٰٓاَيُّهَا النَّاسُ اعْبُدُوْا رَبَّكُمُ الَّذِيْ خَلَقَكُمْ وَالَّذِيْنَ مِنْ قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُوْنَۙ",
    "transliteration_en": "Yaaa aiyuhan naasu'budoo Rabbakumul lazee khalaqakum wallazeena min qablikum la'allakum tattaqoon",
    "transliteration_id": "Yā ayyuhan-nāsu‘budū rabbakumul-lażī khalaqakum wal-lażīna min qablikum la‘allakum tattaqūn(a).",
    "translation_en": "O mankind, worship your Lord, who created you and those before you, that you may become righteous -",
    "translation_id": "Wahai manusia, sembahlah Tuhanmu yang telah menciptakan kamu dan orang-orang yang sebelum kamu agar kamu bertakwa."
  },
  {
    "ayat": 22,
    "arabic": "الَّذِيْ جَعَلَ لَكُمُ الْاَرْضَ فِرَاشًا وَّالسَّمَاۤءَ بِنَاۤءً  ۖوَّاَنْزَلَ مِنَ السَّمَاۤءِ مَاۤءً فَاَخْرَجَ بِهٖ مِنَ الثَّمَرٰتِ رِزْقًا لَّكُمْ ۚ فَلَا تَجْعَلُوْا لِلّٰهِ اَنْدَادًا وَّاَنْتُمْ تَعْلَمُوْنَ",
    "transliteration_en": "Allazee ja'ala lakumul arda firaashanw wassamaaa'a binaaa 'anw wa anzala minassamaaa'i maaa'an fa akhraja bihee minas samaraati rizqal lakum falaa taj'aloo lillaahi andaadanw wa antum ta'lamoon",
    "transliteration_id": "Allażī ja‘ala lakumul-arḍa firāsyaw was-samā'a binā'ā(n), wa anzala minas-samā'i mā'an fa akhraja bihī minaṡ-ṡamarāti rizqal lakum, falā taj‘alū lillāhi andādaw wa antum ta‘lamūn(a).",
    "translation_en": "[He] who made for you the earth a bed [spread out] and the sky a ceiling and sent down from the sky, rain and brought forth thereby fruits as provision for you. So do not attribute to Allah equals while you know [that there is nothing similar to Him].",
    "translation_id": "(Dialah) yang menjadikan bagimu bumi (sebagai) hamparan dan langit sebagai atap, dan Dialah yang menurunkan air (hujan) dari langit, lalu Dia menghasilkan dengan (hujan) itu buah-buahan sebagai rezeki untuk kamu. Oleh karena itu, janganlah kamu mengadakan tandingan-tandingan bagi Allah, padahal kamu mengetahui."
  },
  {
    "ayat": 23,
    "arabic": "وَاِنْ كُنْتُمْ فِيْ رَيْبٍ مِّمَّا نَزَّلْنَا عَلٰى عَبْدِنَا فَأْتُوْا بِسُوْرَةٍ مِّنْ مِّثْلِهٖ ۖ وَادْعُوْا شُهَدَاۤءَكُمْ مِّنْ دُوْنِ اللّٰهِ اِنْ كُنْتُمْ صٰدِقِيْنَ",
    "transliteration_en": "Wa in kuntum fee raibim mimmaa nazzalnaa 'alaa 'abdinaa fatoo bi Sooratim mim mislihee wad'oo shuhadaaa'akum min doonil laahi in kuntum saadiqeen",
    "transliteration_id": "Wa in kuntum fī raibim mimmā nazzalnā ‘alā ‘abdinā fa'tū bisūratim mim miṡlih(ī), wad‘ū syuhadā'akum min dūnillāhi in kuntum ṣādiqīn(a).",
    "translation_en": "And if you are in doubt about what We have sent down upon Our Servant [Muhammad], then produce a surah the like thereof and call upon your witnesses other than Allah, if you should be truthful.",
    "translation_id": "Jika kamu (tetap) dalam keraguan tentang apa (Al-Qur’an) yang Kami turunkan kepada hamba Kami (Nabi Muhammad), buatlah satu surah yang semisal dengannya dan ajaklah penolong-penolongmu selain Allah, jika kamu orang-orang yang benar."
  },
  {
    "ayat": 24,
    "arabic": "فَاِنْ لَّمْ تَفْعَلُوْا وَلَنْ تَفْعَلُوْا فَاتَّقُوا النَّارَ الَّتِيْ وَقُوْدُهَا النَّاسُ وَالْحِجَارَةُ ۖ اُعِدَّتْ لِلْكٰفِرِيْنَ",
    "transliteration_en": "Fail lam taf'aloo wa lan taf'aloo fattaqun Naaral latee waqooduhan naasu walhijaaratu u'iddat lilkaafireen",
    "transliteration_id": "Fa'illam taf‘alū wa lan taf‘alū fattaqun-nāral-latī waqūduhan-nāsu wal-ḥijārah(tu), u‘iddat lil-kāfirīn(a).",
    "translation_en": "But if you do not - and you will never be able to - then fear the Fire, whose fuel is men and stones, prepared for the disbelievers.",
    "translation_id": "Jika kamu tidak (mampu) membuat(-nya) dan (pasti) kamu tidak akan (mampu) membuat(-nya), takutlah pada api neraka yang bahan bakarnya adalah manusia dan batu yang disediakan bagi orang-orang kafir."
  },
  {
    "ayat": 25,
    "arabic": "وَبَشِّرِ الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ اَنَّ لَهُمْ جَنّٰتٍ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُ ۗ كُلَّمَا رُزِقُوْا مِنْهَا مِنْ ثَمَرَةٍ رِّزْقًا ۙ قَالُوْا هٰذَا الَّذِيْ رُزِقْنَا مِنْ قَبْلُ  وَاُتُوْا بِهٖ مُتَشَابِهًا ۗوَلَهُمْ فِيْهَآ اَزْوَاجٌ مُّطَهَّرَةٌ  وَّهُمْ فِيْهَا خٰلِدُوْنَ",
    "transliteration_en": "Wa bashshiril lazeena aamanoo wa 'amilus saalihaati anna lahum jannaatin tajree min tahtihal anhaaru kullamaa riziqoo minhaa min samaratir rizqan qaaloo haazal lazee ruziqnaa min qablu wa utoo bihee mutashaabihaa, wa lahum feehaaa azwaajum mutahhara tunw wa hum feehaa khaalidoon",
    "transliteration_id": "Wa basysyiril-lażīna āmanū wa ‘amiluṣ-ṣāliḥāti anna lahum jannātin tajrī min taḥtihal- anhār(u), kullamā ruziqū minhā min ṡamaratir rizqā(n), qālū hāżal-lażī ruziqnā min qablu wa utū bihī mutasyābihā(n), wa lahum fīhā azwājum muṭahharatuw wa hum fīhā khālidūn(a).",
    "translation_en": "And give good tidings to those who believe and do righteous deeds that they will have gardens [in Paradise] beneath which rivers flow. Whenever they are provided with a provision of fruit therefrom, they will say, \"This is what we were provided with before.\" And it is given to them in likeness. And they will have therein purified spouses, and they will abide therein eternally.",
    "translation_id": "Sampaikanlah kabar gembira kepada orang-orang yang beriman dan beramal saleh bahwa untuk mereka (disediakan) surga-surga yang di bawahnya mengalir sungai-sungai. Setiap kali diberi rezeki buah-buahan darinya, mereka berkata, “Inilah rezeki yang diberikan kepada kami sebelumnya.” Mereka telah diberi (buah-buahan) yang serupa dan di sana mereka (memperoleh) pasangan-pasangan yang disucikan. Mereka kekal di dalamnya."
  },
  {
    "ayat": 26,
    "arabic": "۞ اِنَّ اللّٰهَ لَا يَسْتَحْيٖٓ اَنْ يَّضْرِبَ مَثَلًا مَّا بَعُوْضَةً فَمَا فَوْقَهَا ۗ فَاَمَّا الَّذِيْنَ اٰمَنُوْا فَيَعْلَمُوْنَ اَنَّهُ الْحَقُّ مِنْ رَّبِّهِمْ ۚ وَاَمَّا الَّذِيْنَ كَفَرُوْا فَيَقُوْلُوْنَ مَاذَآ اَرَادَ اللّٰهُ بِهٰذَا مَثَلًا ۘ يُضِلُّ بِهٖ كَثِيْرًا وَّيَهْدِيْ بِهٖ كَثِيْرًا ۗ وَمَا يُضِلُّ بِهٖٓ اِلَّا الْفٰسِقِيْنَۙ",
    "transliteration_en": "Innal laaha laa yastahyeee ai yadriba masalam maa ba'oodatan famaa fawqahaa; faammal lazeena aamanoo faya'lamoona annahul haqqu mir rabbihim wa ammal lazeena kafaroo fayaqooloona maazaaa araadal laahu bihaazaa masalaa; yudillu bihee kaseeranw wa yahdee bihee kaseeraa; wa maa yudillu biheee illal faasiqeen",
    "transliteration_id": "Innallāha lā yastaḥyī ay yaḍriba maṡalam mā ba‘ūḍatan famā fauqahā, fa'ammal- lażīna āmanū faya‘lamūna annahul-ḥaqqu mir rabbihim, wa ammal-lażīna kafarū fayaqūlūna māżā arādallāhu bihāżā maṡalā(n), yuḍillu bihī kaṡīraw wa yahdī bihī kaṡīrā(n), wa mā yuḍillu bihī illal-fāsiqīn(a).",
    "translation_en": "Indeed, Allah is not timid to present an example - that of a mosquito or what is smaller than it. And those who have believed know that it is the truth from their Lord. But as for those who disbelieve, they say, \"What did Allah intend by this as an example?\" He misleads many thereby and guides many thereby. And He misleads not except the defiantly disobedient,",
    "translation_id": "Sesungguhnya Allah tidak segan membuat perumpamaan seekor nyamuk atau yang lebih kecil daripada itu. Adapun orang-orang yang beriman mengetahui bahwa itu kebenaran dari Tuhannya. Akan tetapi, orang-orang kafir berkata, “Apa maksud Allah dengan perumpamaan ini?” Dengan (perumpamaan) itu banyak orang yang disesatkan-Nya. Dengan itu pula banyak orang yang diberi-Nya petunjuk. Namun, tidak ada yang Dia sesatkan dengan (perumpamaan) itu, selain orang-orang fasik,"
  },
  {
    "ayat": 27,
    "arabic": "الَّذِيْنَ يَنْقُضُوْنَ عَهْدَ اللّٰهِ مِنْۢ بَعْدِ مِيْثَاقِهٖۖ وَيَقْطَعُوْنَ مَآ اَمَرَ اللّٰهُ بِهٖٓ اَنْ يُّوْصَلَ وَيُفْسِدُوْنَ فِى الْاَرْضِۗ  اُولٰۤىِٕكَ هُمُ الْخٰسِرُوْنَ",
    "transliteration_en": "Allazeena yanqudoona 'ahdal laahi mim ba'di meesaaqihee wa yaqt'oona maaa amaral laahu biheee ai yoosala wa yufsidoona fil ard; ulaaa'ika hum khaasirron",
    "transliteration_id": "Allażīna yanquḍūna ‘ahdallāhi mim ba‘di mīṡāqih(ī), wa yaqṭa‘ūna mā amarallāhu bihī ay yūṣala wa yufsidūna fil-arḍ(i), ulā'ika humul-khāsirūn(a).",
    "translation_en": "Who break the covenant of Allah after contracting it and sever that which Allah has ordered to be joined and cause corruption on earth. It is those who are the losers.",
    "translation_id": "(yaitu) orang-orang yang melanggar perjanjian Allah setelah (perjanjian) itu diteguhkan, memutuskan apa yang diperintahkan Allah untuk disambungkan (silaturahmi), dan berbuat kerusakan di bumi. Mereka itulah orang-orang yang rugi."
  },
  {
    "ayat": 28,
    "arabic": "كَيْفَ تَكْفُرُوْنَ بِاللّٰهِ وَكُنْتُمْ اَمْوَاتًا فَاَحْيَاكُمْۚ  ثُمَّ يُمِيْتُكُمْ ثُمَّ يُحْيِيْكُمْ ثُمَّ اِلَيْهِ تُرْجَعُوْنَ",
    "transliteration_en": "Kaifa takfuroona billaahi wa kuntum amwaatan fa ahyaakum summa yumeetukum summa yuhyeekum summaa ilaihi turja'oon",
    "transliteration_id": "Kaifa takfurūna billāhi wa kuntum amwātan fa'aḥyākum, ṡumma yumītukum ṡumma yuḥyīkum ṡumma ilaihi turja‘ūn(a).",
    "translation_en": "How can you disbelieve in Allah when you were lifeless and He brought you to life; then He will cause you to die, then He will bring you [back] to life, and then to Him you will be returned.",
    "translation_id": "Bagaimana kamu ingkar kepada Allah, padahal kamu (tadinya) mati, lalu Dia menghidupkan kamu, kemudian Dia akan mematikan kamu, Dia akan menghidupkan kamu kembali, dan kepada-Nyalah kamu dikembalikan?"
  },
  {
    "ayat": 29,
    "arabic": "هُوَ الَّذِيْ خَلَقَ لَكُمْ مَّا فِى الْاَرْضِ جَمِيْعًا ثُمَّ اسْتَوٰٓى اِلَى السَّمَاۤءِ فَسَوّٰىهُنَّ سَبْعَ سَمٰوٰتٍ ۗ وَهُوَ بِكُلِّ شَيْءٍ عَلِيْمٌ ࣖ",
    "transliteration_en": "Huwal lazee khalaqa lakum maa fil ardi jamee'an summas tawaaa ilas samaaa'i fasaw waahunna sab'a samaa waat; wa Huwa bikulli shai'in Aleem",
    "transliteration_id": "Huwal-lażī khalaqa lakum mā fil-arḍi jamī‘ā(n), ṡummastawā ilas-samā'i fasawwāhunna sab‘a samāwāt(in), wa huwa bikulli syai'in ‘alīm(un).",
    "translation_en": "It is He who created for you all of that which is on the earth. Then He directed Himself to the heaven, [His being above all creation], and made them seven heavens, and He is Knowing of all things.",
    "translation_id": "Dialah (Allah) yang menciptakan segala yang ada di bumi untukmu, kemudian Dia menuju ke langit, lalu Dia menyempurnakannya menjadi tujuh langit. Dia Maha Mengetahui segala sesuatu."
  },
  {
    "ayat": 30,
    "arabic": "وَاِذْ قَالَ رَبُّكَ لِلْمَلٰۤىِٕكَةِ اِنِّيْ جَاعِلٌ فِى الْاَرْضِ خَلِيْفَةً ۗ قَالُوْٓا اَتَجْعَلُ فِيْهَا مَنْ يُّفْسِدُ فِيْهَا وَيَسْفِكُ الدِّمَاۤءَۚ وَنَحْنُ نُسَبِّحُ بِحَمْدِكَ وَنُقَدِّسُ لَكَ ۗ قَالَ اِنِّيْٓ اَعْلَمُ مَا لَا تَعْلَمُوْنَ",
    "transliteration_en": "Wa iz qaala rabbuka lil malaaa'ikati innee jaa'ilun fil ardi khaleefatan qaalooo ataj'alu feehaa mai yufsidu feehaa wa yasfikud dimaaa'a wa nahnu nusabbihu bihamdika wa nuqaddisu laka qaala inneee a'lamu maa laa ta'lamoon",
    "transliteration_id": "Wa iż qāla rabbuka lil-malā'ikati innī jā‘ilun fil-arḍi khalīfah(tan), qālū ataj‘alu fīhā may yufsidu fīhā wa yasfikud-dimā'(a), wa naḥnu nusabbiḥu biḥamdika wa nuqaddisu lak(a), qāla innī a‘lamu mā lā ta‘lamūn(a).",
    "translation_en": "And [mention, O Muhammad], when your Lord said to the angels, \"Indeed, I will make upon the earth a successive authority.\" They said, \"Will You place upon it one who causes corruption therein and sheds blood, while we declare Your praise and sanctify You?\" Allah said, \"Indeed, I know that which you do not know.\"",
    "translation_id": "(Ingatlah) ketika Tuhanmu berfirman kepada para malaikat, “Aku hendak menjadikan khalifah di bumi.” Mereka berkata, “Apakah Engkau hendak menjadikan orang yang merusak dan menumpahkan darah di sana, sedangkan kami bertasbih memuji-Mu dan menyucikan nama-Mu?” Dia berfirman, “Sesungguhnya Aku mengetahui apa yang tidak kamu ketahui.”"
  },
  {
    "ayat": 31,
    "arabic": "وَعَلَّمَ اٰدَمَ الْاَسْمَاۤءَ كُلَّهَا ثُمَّ عَرَضَهُمْ عَلَى الْمَلٰۤىِٕكَةِ فَقَالَ اَنْۢبِـُٔوْنِيْ بِاَسْمَاۤءِ هٰٓؤُلَاۤءِ اِنْ كُنْتُمْ صٰدِقِيْنَ",
    "transliteration_en": "Wa 'allama Aadamal asmaaa'a kullahaa summa 'aradahum 'alal malaaa'ikati faqaala ambi'oonee bias maaa'i haaa'ulaaa'i in kuntum saadiqeen",
    "transliteration_id": "Wa ‘allama ādamal-asmā'a kullahā ṡumma ‘araḍahum ‘alal-malā'ikati faqāla ambi'ūnī bi'asmā'i hā'ulā'i in kuntum ṣādiqīn(a).",
    "translation_en": "And He taught Adam the names - all of them. Then He showed them to the angels and said, \"Inform Me of the names of these, if you are truthful.\"",
    "translation_id": "Dia mengajarkan kepada Adam nama-nama (benda) seluruhnya, kemudian Dia memperlihatkannya kepada para malaikat, seraya berfirman, “Sebutkan kepada-Ku nama-nama (benda) ini jika kamu benar!”"
  },
  {
    "ayat": 32,
    "arabic": "قَالُوْا سُبْحٰنَكَ لَا عِلْمَ لَنَآ اِلَّا مَا عَلَّمْتَنَا ۗاِنَّكَ اَنْتَ الْعَلِيْمُ الْحَكِيْمُ",
    "transliteration_en": "Qaaloo subhaanaka laa 'ilma lanaaa illaa maa 'allamtanaaa innaka antal'aleemul hakeem",
    "transliteration_id": "Qālū subḥānaka lā ‘ilma lanā illā mā ‘allamtanā, innaka antal-‘alīmul-ḥakīm(u).",
    "translation_en": "They said, \"Exalted are You; we have no knowledge except what You have taught us. Indeed, it is You who is the Knowing, the Wise.\"",
    "translation_id": "Mereka menjawab, “Maha Suci Engkau. Tidak ada pengetahuan bagi kami, selain yang telah Engkau ajarkan kepada kami. Sesungguhnya Engkaulah Yang Maha Mengetahui lagi Maha Bijaksana.”"
  },
  {
    "ayat": 33,
    "arabic": "قَالَ يٰٓاٰدَمُ اَنْۢبِئْهُمْ بِاَسْمَاۤىِٕهِمْ ۚ فَلَمَّآ اَنْۢبَاَهُمْ بِاَسْمَاۤىِٕهِمْۙ قَالَ اَلَمْ اَقُلْ لَّكُمْ اِنِّيْٓ اَعْلَمُ غَيْبَ السَّمٰوٰتِ وَالْاَرْضِۙ وَاَعْلَمُ مَا تُبْدُوْنَ وَمَا كُنْتُمْ تَكْتُمُوْنَ",
    "transliteration_en": "Qaala yaaa Aadamu ambi' hum biasmaaa'ihimfalammaaa amba ahum bi asmaaa'ihim qaala alam aqul lakum inneee a'lamu ghaibas samaawaati wal ardi wa a'lamu maa tubdoona wa maa kuntum taktumoon",
    "transliteration_id": "Qāla yā ādamu ambi'hum bi'asmā'ihim, falammā amba'ahum bi'asmā'ihim, qāla alam aqul lakum innī a‘lamu gaibas-samāwāti wal-arḍ(i), wa a‘lamu mā tubdūna wa mā kuntum taktumūn(a).",
    "translation_en": "He said, \"O Adam, inform them of their names.\" And when he had informed them of their names, He said, \"Did I not tell you that I know the unseen [aspects] of the heavens and the earth? And I know what you reveal and what you have concealed.\"",
    "translation_id": "Dia (Allah) berfirman, “Wahai Adam, beri tahukanlah kepada mereka nama-nama benda itu!” Setelah dia (Adam) menyebutkan nama-nama itu, Dia berfirman, “Bukankah telah Kukatakan kepadamu bahwa Aku mengetahui rahasia langit dan bumi, dan Aku mengetahui apa yang kamu nyatakan dan apa yang selalu kamu sembunyikan?”"
  },
  {
    "ayat": 34,
    "arabic": "وَاِذْ قُلْنَا لِلْمَلٰۤىِٕكَةِ اسْجُدُوْا لِاٰدَمَ فَسَجَدُوْٓا اِلَّآ اِبْلِيْسَۗ  اَبٰى وَاسْتَكْبَرَۖ وَكَانَ مِنَ الْكٰفِرِيْنَ",
    "transliteration_en": "Wa iz qulnaa lilmalaaa'i katis judoo liAadama fasajadooo illaaa Ibleesa abaa wastakbara wa kaana minal kaafireen",
    "transliteration_id": "Wa iż qulnā lil-malā'ikatisjudū li ādama fasajadū illā iblīs(a), abā wastakbara wa kāna minal-kāfirīn(a).",
    "translation_en": "And [mention] when We said to the angels, \"Prostrate before Adam\"; so they prostrated, except for Iblees. He refused and was arrogant and became of the disbelievers.",
    "translation_id": "(Ingatlah) ketika Kami berfirman kepada para malaikat, “Sujudlah kamu kepada Adam!” Maka, mereka pun sujud, kecuali Iblis. Ia menolaknya dan menyombongkan diri, dan ia termasuk golongan kafir."
  },
  {
    "ayat": 35,
    "arabic": "وَقُلْنَا يٰٓاٰدَمُ اسْكُنْ اَنْتَ وَزَوْجُكَ الْجَنَّةَ وَكُلَا مِنْهَا رَغَدًا حَيْثُ شِئْتُمَاۖ وَلَا تَقْرَبَا هٰذِهِ الشَّجَرَةَ فَتَكُوْنَا مِنَ الظّٰلِمِيْنَ",
    "transliteration_en": "Wa qulnaa yaaa Aadamus kun anta wa zawjukal jannata wa kulaa minhaa raghadan haisu shi'tumaa wa laa taqabaa haazihish shajarata fatakoonaa minaz zaalimeen",
    "transliteration_id": "Wa qulnā yā ādamuskun anta wa zaujukal-jannata wa kulā minhā ragadan ḥaiṡu syi'tumā,  wa lā taqrabā hāżihisy-syajarata fa takūnā minaẓ-ẓālimīn(a).",
    "translation_en": "And We said, \"O Adam, dwell, you and your wife, in Paradise and eat therefrom in [ease and] abundance from wherever you will. But do not approach this tree, lest you be among the wrongdoers.\"",
    "translation_id": "Kami berfirman, “Wahai Adam, tinggallah engkau dan istrimu di dalam surga, makanlah dengan nikmat (berbagai makanan) yang ada di sana sesukamu, dan janganlah kamu dekati pohon ini, sehingga kamu termasuk orang-orang zalim!”"
  },
  {
    "ayat": 36,
    "arabic": "فَاَزَلَّهُمَا الشَّيْطٰنُ عَنْهَا فَاَخْرَجَهُمَا مِمَّا كَانَا فِيْهِ ۖ وَقُلْنَا اهْبِطُوْا بَعْضُكُمْ لِبَعْضٍ عَدُوٌّ ۚ وَلَكُمْ فِى الْاَرْضِ مُسْتَقَرٌّ وَّمَتَاعٌ اِلٰى حِيْنٍ",
    "transliteration_en": "Fa azallahumash Shaitaanu 'anhaa fa akhrajahumaa mimmaa kaanaa fee wa qulnah bitoo ba'dukum liba'din 'aduwwunw wa lakum fil ardi mustaqarrunw wa mataa'un ilaa heen",
    "transliteration_id": "Fa'azallahumasy-syaiṭānu ‘anhā fa akhrajahumā mimmā kānā fīh(i), wa qulnahbiṭū ba‘ḍukum liba‘ḍin ‘aduww(un), wa lakum fil-arḍi mustaqarruw wa matā‘un ilā ḥīn(in).",
    "translation_en": "But Satan caused them to slip out of it and removed them from that [condition] in which they had been. And We said, \"Go down, [all of you], as enemies to one another, and you will have upon the earth a place of settlement and provision for a time.\"",
    "translation_id": "Lalu, setan menggelincirkan keduanya darinya sehingga keduanya dikeluarkan dari segala kenikmatan ketika keduanya ada di sana (surga). Kami berfirman, “Turunlah kamu! Sebagian kamu menjadi musuh bagi yang lain serta bagi kamu ada tempat tinggal dan kesenangan di bumi sampai waktu yang ditentukan.”"
  },
  {
    "ayat": 37,
    "arabic": "فَتَلَقّٰٓى اٰدَمُ مِنْ رَّبِّهٖ كَلِمٰتٍ فَتَابَ عَلَيْهِ ۗ اِنَّهٗ هُوَ التَّوَّابُ الرَّحِيْمُ",
    "transliteration_en": "Fatalaqqaaa Aadamu mir Rabbihee Kalimaatin fataaba 'alayh; innahoo Huwat Tawwaabur Raheem",
    "transliteration_id": "Fatalaqqā ādamu mir rabbihī kalimātin fatāba ‘alaih(i), innahū huwat-tawwābur- raḥīm(u).",
    "translation_en": "Then Adam received from his Lord [some] words, and He accepted his repentance. Indeed, it is He who is the Accepting of repentance, the Merciful.",
    "translation_id": "Kemudian, Adam menerima beberapa kalimat dari Tuhannya, lalu Dia pun menerima tobatnya. Sesungguhnya Dialah Yang Maha Penerima tobat lagi Maha Penyayang."
  },
  {
    "ayat": 38,
    "arabic": "قُلْنَا اهْبِطُوْا مِنْهَا جَمِيْعًا ۚ فَاِمَّا يَأْتِيَنَّكُمْ مِّنِّيْ هُدًى فَمَنْ تَبِعَ هُدَايَ فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُوْنَ",
    "transliteration_en": "Qulnah bitoo minhaa jamee 'an fa immaa yaatiyannakum minnee hudan faman tabi'a hudaaya falaa khawfun 'alaihim wa laa hum yahza noon",
    "transliteration_id": "Qulnahbiṭū minhā jamī‘ā(n), fa'immā ya'tiyannakum minnī hudan faman tabi‘a hudāya falā khaufun ‘alaihim wa lā hum yaḥzanūn(a).",
    "translation_en": "We said, \"Go down from it, all of you. And when guidance comes to you from Me, whoever follows My guidance - there will be no fear concerning them, nor will they grieve.",
    "translation_id": "Kami berfirman, “Turunlah kamu semua dari surga! Lalu, jika benar-benar datang petunjuk-Ku kepadamu, siapa saja yang mengikuti petunjuk-Ku tidak ada rasa takut yang menimpa mereka dan mereka pun tidak bersedih hati.”"
  },
  {
    "ayat": 39,
    "arabic": "وَالَّذِيْنَ كَفَرُوْا وَكَذَّبُوْا بِاٰيٰتِنَآ اُولٰۤىِٕكَ اَصْحٰبُ النَّارِ ۚ هُمْ فِيْهَا خٰلِدُوْنَ ࣖ",
    "transliteration_en": "Wallazeena kafaroo wa kaz zabooo bi aayaatinaa ulaaa'ika Ashaabun Naari hum feehaa khaalidoon",
    "transliteration_id": "Wal-lażīna kafarū wa każżabū bi'āyātinā ulā'ika aṣḥābun-nār(i), hum fīhā khālidūn(a).",
    "translation_en": "And those who disbelieve and deny Our signs - those will be companions of the Fire; they will abide therein eternally.\"",
    "translation_id": "(Sementara itu,) orang-orang yang mengingkari dan mendustakan ayat-ayat Kami, mereka itulah penghuni neraka. Mereka kekal di dalamnya."
  },
  {
    "ayat": 40,
    "arabic": "يٰبَنِيْٓ اِسْرَاۤءِيْلَ اذْكُرُوْا نِعْمَتِيَ الَّتِيْٓ اَنْعَمْتُ عَلَيْكُمْ وَاَوْفُوْا بِعَهْدِيْٓ اُوْفِ بِعَهْدِكُمْۚ وَاِيَّايَ فَارْهَبُوْنِ",
    "transliteration_en": "Yaa Baneee Israaa'eelaz kuroo ni'matiyal lateee an'amtu 'alaikum wa awfoo bi'Ahdeee oofi bi ahdikum wa iyyaaya farhaboon",
    "transliteration_id": "Yā banī isrā'īlażkurū ni‘matiyal-latī an‘amtu ‘alaikum wa aufū bi‘ahdī ūfi bi‘ahdikum, wa iyyāya farhabūn(i).",
    "translation_en": "O Children of Israel, remember My favor which I have bestowed upon you and fulfill My covenant [upon you] that I will fulfill your covenant [from Me], and be afraid of [only] Me.",
    "translation_id": "Wahai Bani Israil, ingatlah nikmat-Ku yang telah Aku berikan kepadamu dan penuhilah janjimu kepada-Ku, niscaya Aku penuhi janji-Ku kepadamu. Hanya kepada-Ku hendaknya kamu takut."
  },
  {
    "ayat": 41,
    "arabic": "وَاٰمِنُوْا بِمَآ اَنْزَلْتُ مُصَدِّقًا لِّمَا مَعَكُمْ وَلَا تَكُوْنُوْٓا اَوَّلَ كَافِرٍۢ بِهٖ ۖ وَلَا تَشْتَرُوْا بِاٰيٰتِيْ ثَمَنًا قَلِيْلًا  ۖوَّاِيَّايَ فَاتَّقُوْنِ",
    "transliteration_en": "Wa aaminoo bimaaa anzaltu musaddiqal limaa ma'akum wa laa takoonooo awwala kaafirim bihee wa laa tashtaroo bi Aayaatee samanan qaleelanw wa iyyaaya fattaqoon",
    "transliteration_id": "Wa āminū bimā anzaltu muṣaddiqal limā ma‘akum wa lā takūnū awwala kāfirim bih(ī), wa lā tasytarū bi'āyātī ṡamanan qalīlā(n), wa iyyāya fattaqūn(i).",
    "translation_en": "And believe in what I have sent down confirming that which is [already] with you, and be not the first to disbelieve in it. And do not exchange My signs for a small price, and fear [only] Me.",
    "translation_id": "Berimanlah kamu kepada apa (Al-Qur’an) yang telah Aku turunkan sebagai pembenar bagi apa yang ada pada kamu (Taurat) dan janganlah kamu menjadi orang yang pertama kafir kepadanya. Janganlah kamu menukarkan ayat-ayat-Ku dengan harga murah dan bertakwalah hanya kepada-Ku."
  },
  {
    "ayat": 42,
    "arabic": "وَلَا تَلْبِسُوا الْحَقَّ بِالْبَاطِلِ وَتَكْتُمُوا الْحَقَّ وَاَنْتُمْ تَعْلَمُوْنَ",
    "transliteration_en": "Wa laa talbisul haqqa bilbaatili wa taktumul haqqa wa antum ta'lamoon",
    "transliteration_id": "Wa lā talbisul-ḥaqqa bil-bāṭili wa taktumul-ḥaqqa wa antum ta‘lamūn(a).",
    "translation_en": "And do not mix the truth with falsehood or conceal the truth while you know [it].",
    "translation_id": "Janganlah kamu campuradukkan kebenaran dengan kebatilan dan (jangan pula) kamu sembunyikan kebenaran, sedangkan kamu mengetahui(-nya)."
  },
  {
    "ayat": 43,
    "arabic": "وَاَقِيْمُوا الصَّلٰوةَ وَاٰتُوا الزَّكٰوةَ وَارْكَعُوْا مَعَ الرّٰكِعِيْنَ",
    "transliteration_en": "Wa aqeemus salaata wa aatuz zakaata warka'oo ma'ar raaki'een",
    "transliteration_id": "Wa aqīmuṣ-ṣalāta wa ātuz-zakāta warka‘ū ma‘ar-rāki‘īn(a).",
    "translation_en": "And establish prayer and give zakah and bow with those who bow [in worship and obedience].",
    "translation_id": "Tegakkanlah salat, tunaikanlah zakat, dan rukuklah beserta orang-orang yang rukuk."
  },
  {
    "ayat": 44,
    "arabic": "۞ اَتَأْمُرُوْنَ النَّاسَ بِالْبِرِّ وَتَنْسَوْنَ اَنْفُسَكُمْ وَاَنْتُمْ تَتْلُوْنَ الْكِتٰبَ ۗ اَفَلَا تَعْقِلُوْنَ",
    "transliteration_en": "Ataamuroonan naasa bilbirri wa tansawna anfusakum wa antum tatloonal Kitaab; afalaa ta'qiloon",
    "transliteration_id": "Ata'murūnan-nāsa bil-birri wa tansauna anfusakum wa antum tatlūnal-kitāb(a), afalā ta‘qilūn(a).",
    "translation_en": "Do you order righteousness of the people and forget yourselves while you recite the Scripture? Then will you not reason?",
    "translation_id": "Mengapa kamu menyuruh orang lain untuk (mengerjakan) kebajikan, sedangkan kamu melupakan dirimu sendiri, padahal kamu membaca kitab suci (Taurat)? Tidakkah kamu mengerti?"
  },
  {
    "ayat": 45,
    "arabic": "وَاسْتَعِيْنُوْا بِالصَّبْرِ وَالصَّلٰوةِ ۗ وَاِنَّهَا لَكَبِيْرَةٌ اِلَّا عَلَى الْخٰشِعِيْنَۙ",
    "transliteration_en": "Wasta'eenoo bissabri was Salaah; wa innahaa lakabee ratun illaa alal khaashi'een",
    "transliteration_id": "Wasta‘īnū biṣ-ṣabri waṣ-ṣalāh(ti), wa innahā lakabīratun illā ‘alal-khāsyi‘īn(a).",
    "translation_en": "And seek help through patience and prayer, and indeed, it is difficult except for the humbly submissive [to Allah]",
    "translation_id": "Mohonlah pertolongan (kepada Allah) dengan sabar dan salat. Sesungguhnya (salat) itu benar-benar berat, kecuali bagi orang-orang yang khusyuk,"
  },
  {
    "ayat": 46,
    "arabic": "الَّذِيْنَ يَظُنُّوْنَ اَنَّهُمْ مُّلٰقُوْا رَبِّهِمْ وَاَنَّهُمْ اِلَيْهِ رٰجِعُوْنَ ࣖ",
    "transliteration_en": "Allazeena yazunnoona annahum mulaaqoo Rabbihim wa annahum ilaihi raaji'oon",
    "transliteration_id": "Allażīna yaẓunnūna annahum mulāqū rabbihim wa annahum ilaihi rāji‘ūn(a).",
    "translation_en": "Who are certain that they will meet their Lord and that they will return to Him.",
    "translation_id": "(yaitu) orang-orang yang meyakini bahwa mereka akan menemui Tuhannya dan hanya kepada-Nya mereka kembali."
  },
  {
    "ayat": 47,
    "arabic": "يٰبَنِيْٓ اِسْرَاۤءِيْلَ اذْكُرُوْا نِعْمَتِيَ الَّتِيْٓ اَنْعَمْتُ عَلَيْكُمْ وَاَنِّيْ فَضَّلْتُكُمْ عَلَى الْعٰلَمِيْنَ",
    "transliteration_en": "Yaa Baneee Israaa'eelaz kuroo ni'matiyal lateee an'amtu 'alaikum wa annee faddaltukum 'alal 'aalameen",
    "transliteration_id": "Yā banī isrā'īlażkurū ni‘matiyal-latī an‘amtu ‘alaikum wa annī faḍḍaltukum ‘alal- ‘ālamīn(a).",
    "translation_en": "O Children of Israel, remember My favor that I have bestowed upon you and that I preferred you over the worlds.",
    "translation_id": "Wahai Bani Israil, ingatlah nikmat-Ku yang telah Aku anugerahkan kepadamu dan sesungguhnya Aku telah melebihkan kamu daripada semua umat di alam ini (pada masa itu)."
  },
  {
    "ayat": 48,
    "arabic": "وَاتَّقُوْا يَوْمًا لَّا تَجْزِيْ نَفْسٌ عَنْ نَّفْسٍ شَيْـًٔا وَّلَا يُقْبَلُ مِنْهَا شَفَاعَةٌ وَّلَا يُؤْخَذُ مِنْهَا عَدْلٌ وَّلَا هُمْ يُنْصَرُوْنَ",
    "transliteration_en": "Wattaqoo Yawmal laa tajzee nafsun 'an nafsin shai'anw wa laa yuqbalu minhaa shafaa'atunw wa laa yu'khazu minhaa 'adlunw wa laa hum yunsaroon",
    "transliteration_id": "Wattaqū yaumal lā tajzī nafsun ‘an nafsin syai'aw wa lā yuqbalu minhā syafā‘atuw wa lā yu'khażu minhā ‘adluw wa lā hum yunṣarūn(a).",
    "translation_en": "And fear a Day when no soul will suffice for another soul at all, nor will intercession be accepted from it, nor will compensation be taken from it, nor will they be aided.",
    "translation_id": "Takutlah kamu pada suatu hari (kiamat) yang seseorang tidak dapat membela orang lain sedikit pun, syafaat dan tebusan apa pun darinya tidak diterima, dan mereka tidak akan ditolong."
  },
  {
    "ayat": 49,
    "arabic": "وَاِذْ نَجَّيْنٰكُمْ مِّنْ اٰلِ فِرْعَوْنَ يَسُوْمُوْنَكُمْ سُوْۤءَ الْعَذَابِ يُذَبِّحُوْنَ اَبْنَاۤءَكُمْ وَيَسْتَحْيُوْنَ نِسَاۤءَكُمْ ۗ وَفِيْ ذٰلِكُمْ بَلَاۤءٌ مِّنْ رَّبِّكُمْ عَظِيْمٌ",
    "transliteration_en": "Wa iz najjainaakum min Aali Fir'awna yasoomoonakum sooo'al azaabi yuzabbihoona abuaaa'akum wa yastahyoona nisaaa'akum; wa fee zaalikum balaaa'um mir Rabbikum 'azeem",
    "transliteration_id": "Wa iż najjainākum min āli fir‘auna yasūmūnakum sū'al-‘ażābi yużabbiḥūna abnā'akum wa yastaḥyūna nisā'akum, wa fī żālikum balā'um mir rabbikum ‘aẓīm(un).",
    "translation_en": "And [recall] when We saved your forefathers from the people of Pharaoh, who afflicted you with the worst torment, slaughtering your [newborn] sons and keeping your females alive. And in that was a great trial from your Lord.",
    "translation_id": "(Ingatlah) ketika Kami menyelamatkan kamu dari (Fir‘aun dan) pengikut-pengikut Fir‘aun. Mereka menimpakan siksaan yang sangat berat kepadamu. Mereka menyembelih anak-anak laki-lakimu dan membiarkan hidup anak-anak perempuanmu. Pada yang demikian terdapat cobaan yang sangat besar dari Tuhanmu."
  },
  {
    "ayat": 50,
    "arabic": "وَاِذْ فَرَقْنَا بِكُمُ الْبَحْرَ فَاَنْجَيْنٰكُمْ وَاَغْرَقْنَآ اٰلَ فِرْعَوْنَ وَاَنْتُمْ تَنْظُرُوْنَ",
    "transliteration_en": "Wa iz faraqnaa bikumul bahra fa anjainaakum wa agh-raqnaaa Aala Fir'awna wa antum tanzuroon",
    "transliteration_id": "Wa iż faraqnā bikumul-baḥra fa'anjainākum wa agraqnā āla fir‘auna wa antum tanẓurūn(a).",
    "translation_en": "And [recall] when We parted the sea for you and saved you and drowned the people of Pharaoh while you were looking on.",
    "translation_id": "(Ingatlah) ketika Kami membelah laut untukmu, lalu Kami menyelamatkanmu dan menenggelamkan (Fir‘aun dan) pengikut-pengikut Fir‘aun, sedangkan kamu menyaksikan(-nya)."
  }
]