[
  {
    "ayat": 51,
    "arabic": "وَاِذْ وٰعَدْنَا مُوْسٰىٓ اَرْبَعِيْنَ لَيْلَةً ثُمَّ اتَّخَذْتُمُ الْعِجْلَ مِنْۢ بَعْدِهٖ وَاَنْتُمْ ظٰلِمُوْنَ",
    "transliteration_en": "Wa iz waa'adnaa Moosaaa arba'eena lailatan summattakhaztumul 'ijla mim ba'dihee wa antum zaalimoon",
    "transliteration_id": "Wa iż wā‘adnā mūsā arba‘īna lailatan ṡummattakhażtumul-‘ijla mim ba‘dihī wa antum ẓālimūn(a).",
    "translation_en": "And [recall] when We made an appointment with Moses for forty nights. Then you took [for worship] the calf after him, while you were wrongdoers.",
    "translation_id": "(Ingatlah) ketika Kami menjanjikan (petunjuk Taurat) kepada Musa (melalui munajat selama) empat puluh malam. Kemudian, kamu (Bani Israil) menjadikan (patung) anak sapi (sebagai sembahan) setelah (kepergian)-nya, dan kamu (menjadi) orang-orang zalim."
  },
  {
    "ayat": 52,
    "arabic": "ثُمَّ عَفَوْنَا عَنْكُمْ مِّنْۢ بَعْدِ ذٰلِكَ لَعَلَّكُمْ تَشْكُرُوْنَ",
    "transliteration_en": "Summa 'afawnaa 'ankum mim ba'di zaalika la'allakum tashkuroon",
    "transliteration_id": "Ṡumma ‘afaunā ‘ankum mim ba‘di żālika la‘allakum tasykurūn(a).",
    "translation_en": "Then We forgave you after that so perhaps you would be grateful.",
    "translation_id": "Setelah itu, Kami memaafkan kamu agar kamu bersyukur."
  },
  {
    "ayat": 53,
    "arabic": "وَاِذْ اٰتَيْنَا مُوْسَى الْكِتٰبَ وَالْفُرْقَانَ لَعَلَّكُمْ تَهْتَدُوْنَ",
    "transliteration_en": "Wa iz aatainaa Moosal kitaaba wal Furqaana la'allakum tahtadoon",
    "transliteration_id": "Wa iż ātainā mūsal-kitāba wal-furqāna la‘allakum tahtadūn(a).",
    "translation_en": "And [recall] when We gave Moses the Scripture and criterion that perhaps you would be guided.",
    "translation_id": "(Ingatlah) ketika Kami memberikan kitab (Taurat) dan furqān kepada Musa agar kamu memperoleh petunjuk."
  },
  {
    "ayat": 54,
    "arabic": "وَاِذْ قَالَ مُوْسٰى لِقَوْمِهٖ يٰقَوْمِ اِنَّكُمْ ظَلَمْتُمْ اَنْفُسَكُمْ بِاتِّخَاذِكُمُ الْعِجْلَ فَتُوْبُوْٓا اِلٰى بَارِىِٕكُمْ فَاقْتُلُوْٓا اَنْفُسَكُمْۗ ذٰلِكُمْ خَيْرٌ لَّكُمْ عِنْدَ بَارِىِٕكُمْۗ فَتَابَ عَلَيْكُمْ ۗ اِنَّهٗ هُوَ التَّوَّابُ الرَّحِيْمُ",
    "transliteration_en": "Wa iz qaala Moosaa liqawmihee yaa qawmi innakum zalamtum anfusakum bittikhaa zikumul 'ijla fatoobooo ilaa Baari'ikum faqtulooo anfusakum zaalikum khairul lakum 'inda Baari'ikum fataaba 'alaikum; innahoo Huwat Tawwaabur Raheem",
    "transliteration_id": "Wa iż qāla mūsā liqaumihī yā qaumi innakum ẓalamtum anfusakum bittikhāżikumul- ‘ijla fatūbū ilā bāri'ikum faqtulū anfusakum, żālikum khairul lakum ‘inda bāri'ikum, fatāba ‘alaikum, innahū huwat-tawwābur-raḥīm(u).",
    "translation_en": "And [recall] when Moses said to his people, \"O my people, indeed you have wronged yourselves by your taking of the calf [for worship]. So repent to your Creator and kill yourselves. That is best for [all of] you in the sight of your Creator.\" Then He accepted your repentance; indeed, He is the Accepting of repentance, the Merciful.",
    "translation_id": "(Ingatlah) ketika Musa berkata kepada kaumnya, “Wahai kaumku, sesungguhnya kamu telah menzalimi dirimu sendiri dengan menjadikan (patung) anak sapi (sebagai sembahan). Oleh karena itu, bertobatlah kepada Penciptamu dan bunuhlah dirimu. Itu lebih baik bagimu dalam pandangan Penciptamu. Dia akan menerima tobatmu. Sesungguhnya Dialah Yang Maha Penerima Tobat lagi Maha Penyayang."
  },
  {
    "ayat": 55,
    "arabic": "وَاِذْ قُلْتُمْ يٰمُوْسٰى لَنْ نُّؤْمِنَ لَكَ حَتّٰى نَرَى اللّٰهَ جَهْرَةً فَاَخَذَتْكُمُ الصّٰعِقَةُ وَاَنْتُمْ تَنْظُرُوْنَ",
    "transliteration_en": "Wa iz qultum yaa Moosaa lan nu'mina laka hattaa naral laaha jahratan fa akhazat kumus saa'iqatu wa antum tanzuroon",
    "transliteration_id": "Wa iż qultum yā mūsā lan nu'mina laka ḥattā narallāha jahratan fa'akhażatkumuṣ-ṣā‘iqatu wa antum tanẓurūn(a).",
    "translation_en": "And [recall] when you said, \"O Moses, we will never believe you until we see Allah outright\"; so the thunderbolt took you while you were looking on.",
    "translation_id": "(Ingatlah) ketika kamu berkata, “Wahai Musa, kami tidak akan beriman kepadamu sebelum melihat Allah dengan jelas.” Maka, halilintar menyambarmu dan kamu menyaksikan(-nya)."
  },
  {
    "ayat": 56,
    "arabic": "ثُمَّ بَعَثْنٰكُمْ مِّنْۢ بَعْدِ مَوْتِكُمْ لَعَلَّكُمْ تَشْكُرُوْنَ",
    "transliteration_en": "Summa ba'asnaakum mim ba'di mawtikum la'allakum tashkuroon",
    "transliteration_id": "Ṡumma ba‘aṡnākum mim ba‘di mautikum la‘allakum tasykurūn(a).",
    "translation_en": "Then We revived you after your death that perhaps you would be grateful.",
    "translation_id": "Kemudian, Kami membangkitkan kamu setelah kematianmu agar kamu bersyukur."
  },
  {
    "ayat": 57,
    "arabic": "وَظَلَّلْنَا عَلَيْكُمُ الْغَمَامَ وَاَنْزَلْنَا عَلَيْكُمُ الْمَنَّ وَالسَّلْوٰى ۗ كُلُوْا مِنْ طَيِّبٰتِ مَا رَزَقْنٰكُمْ ۗ وَمَا ظَلَمُوْنَا وَلٰكِنْ كَانُوْٓا اَنْفُسَهُمْ يَظْلِمُوْنَ",
    "transliteration_en": "Wa zallalnaa 'alaikumul ghamaama wa anzalnaa 'alaikumul Manna was Salwaa kuloo min taiyibaati maa razaqnaakum wa maa zalamoonaa wa laakin kaanooo anfusahum yazlimoon",
    "transliteration_id": "Wa ẓallalnā ‘alaikumul-gamāma wa anzalnā ‘alaikumul-manna was-salwā, kulū min ṭayyibāti mā razaqnākum, wa mā ẓalamūnā wa lākin kānū anfusahum yaẓlimūn(a).",
    "translation_en": "And We shaded you with clouds and sent down to you manna and quails, [saying], \"Eat from the good things with which We have provided you.\" And they wronged Us not - but they were [only] wronging themselves.",
    "translation_id": "Kami menaungi kamu dengan awan dan Kami menurunkan kepadamu manna dan salwa. Makanlah (makanan) yang baik-baik dari rezeki yang telah Kami berikan kepadamu. Mereka tidak menzalimi Kami, tetapi justru merekalah yang menzalimi diri sendiri."
  },
  {
    "ayat": 58,
    "arabic": "وَاِذْ قُلْنَا ادْخُلُوْا هٰذِهِ الْقَرْيَةَ فَكُلُوْا مِنْهَا حَيْثُ شِئْتُمْ رَغَدًا وَّادْخُلُوا الْبَابَ سُجَّدًا وَّقُوْلُوْا حِطَّةٌ نَّغْفِرْ لَكُمْ خَطٰيٰكُمْ ۗ وَسَنَزِيْدُ الْمُحْسِنِيْنَ",
    "transliteration_en": "Wa iz qulnad khuloo haazihil qaryata fakuloo minhaa haisu shi'tum raghadanw wadkhulul baaba sujjadanw wa qooloo hittatun naghfir lakum khataayaakum; wa sanazeedul muhsineen",
    "transliteration_id": "Wa iż qulnadkhulū hāżihil-qaryata fakulū minhā ḥaiṡu syi'tum ragadaw wadkhulul- bāba sujjadaw wa qūlū ḥiṭṭatun nagfir lakum khaṭāyākum, wa sanazīdul-muḥsinīn(a).",
    "translation_en": "And [recall] when We said, \"Enter this city and eat from it wherever you will in [ease and] abundance, and enter the gate bowing humbly and say, 'Relieve us of our burdens.' We will [then] forgive your sins for you, and We will increase the doers of good [in goodness and reward].\"",
    "translation_id": "(Ingatlah) ketika Kami berfirman, “Masuklah ke negeri ini (Baitulmaqdis). Lalu, makanlah dengan nikmat (berbagai makanan) yang ada di sana sesukamu. Masukilah pintu gerbangnya sambil membungkuk dan katakanlah, ‘Bebaskanlah kami (dari dosa-dosa kami),’ niscaya Kami mengampuni kesalahan-kesalahanmu. Kami akan menambah (karunia) kepada orang-orang yang berbuat kebaikan.”"
  },
  {
    "ayat": 59,
    "arabic": "فَبَدَّلَ الَّذِيْنَ ظَلَمُوْا قَوْلًا غَيْرَ الَّذِيْ قِيْلَ لَهُمْ فَاَنْزَلْنَا عَلَى الَّذِيْنَ ظَلَمُوْا رِجْزًا مِّنَ السَّمَاۤءِ بِمَا كَانُوْا يَفْسُقُوْنَ ࣖ",
    "transliteration_en": "Fabaddalal lazeena zalamoo qawlan ghairal lazee qeela lahum fa anzalnaa 'alal lazeena zalamoo rijzam minas samaaa'i bimaa kaanoo yafsuqoon",
    "transliteration_id": "Fabaddalal-lażīna ẓalamū qaulan gairal-lażī qīla lahum fa anzalnā ‘alal-lażīna ẓalamū rijzam minas-samā'i bimā kānū yafsuqūn(a).",
    "translation_en": "But those who wronged changed [those words] to a statement other than that which had been said to them, so We sent down upon those who wronged a punishment from the sky because they were defiantly disobeying.",
    "translation_id": "Lalu, orang-orang yang zalim mengganti perintah dengan (perintah lain) yang tidak diperintahkan kepada mereka. Maka, Kami menurunkan malapetaka dari langit kepada orang-orang yang zalim itu karena mereka selalu berbuat fasik."
  },
  {
    "ayat": 60,
    "arabic": "۞ وَاِذِ اسْتَسْقٰى مُوْسٰى لِقَوْمِهٖ فَقُلْنَا اضْرِبْ بِّعَصَاكَ الْحَجَرَۗ  فَانْفَجَرَتْ مِنْهُ اثْنَتَا عَشْرَةَ عَيْنًا ۗ قَدْ عَلِمَ كُلُّ اُنَاسٍ مَّشْرَبَهُمْ ۗ كُلُوْا وَاشْرَبُوْا مِنْ رِّزْقِ اللّٰهِ وَلَا تَعْثَوْا فِى الْاَرْضِ مُفْسِدِيْنَ",
    "transliteration_en": "Wa izis tasqaa Moosaa liqawmihee faqulnad rib bi'asaakal hajara fanfajarat minhusnataaa 'ashrata 'aynan qad 'alima kullu unaasim mash rabahum kuloo washraboo mir rizqil laahi wa laa ta'saw fil ardi mufsideen",
    "transliteration_id": "Wa iżistasqā mūsā liqaumihī faqulnaḍrib bi‘aṣākal-ḥajar(a), fanfajarat minhuṡnatā ‘asyrata ‘ainā(n), qad ‘alima kullu unāsim masyrabahum, kulū wasyrabū mir rizqillāhi wa lā ta‘ṡau fil-arḍi mufsidīn(a).",
    "translation_en": "And [recall] when Moses prayed for water for his people, so We said, \"Strike with your staff the stone.\" And there gushed forth from it twelve springs, and every people knew its watering place. \"Eat and drink from the provision of Allah, and do not commit abuse on the earth, spreading corruption.\"",
    "translation_id": "(Ingatlah) ketika Musa memohon (curahan) air untuk kaumnya. Lalu, Kami berfirman, “Pukullah batu itu dengan tongkatmu!” Maka, memancarlah darinya (batu itu) dua belas mata air. Setiap suku telah mengetahui tempat minumnya (masing-masing). Makan dan minumlah rezeki (yang diberikan) Allah dan janganlah melakukan kejahatan di bumi dengan berbuat kerusakan."
  },
  {
    "ayat": 61,
    "arabic": "وَاِذْ قُلْتُمْ يٰمُوْسٰى لَنْ نَّصْبِرَ عَلٰى طَعَامٍ وَّاحِدٍ فَادْعُ لَنَا رَبَّكَ يُخْرِجْ لَنَا مِمَّا تُنْۢبِتُ الْاَرْضُ مِنْۢ بَقْلِهَا وَقِثَّاۤىِٕهَا وَفُوْمِهَا وَعَدَسِهَا وَبَصَلِهَا ۗ قَالَ اَتَسْتَبْدِلُوْنَ الَّذِيْ هُوَ اَدْنٰى بِالَّذِيْ هُوَ خَيْرٌ ۗ اِهْبِطُوْا مِصْرًا فَاِنَّ لَكُمْ مَّا سَاَلْتُمْ ۗ وَضُرِبَتْ عَلَيْهِمُ الذِّلَّةُ وَالْمَسْكَنَةُ وَبَاۤءُوْ بِغَضَبٍ مِّنَ اللّٰهِ ۗ ذٰلِكَ بِاَنَّهُمْ كَانُوْا يَكْفُرُوْنَ بِاٰيٰتِ اللّٰهِ وَيَقْتُلُوْنَ النَّبِيّٖنَ بِغَيْرِ الْحَقِّ ۗ ذٰلِكَ بِمَا عَصَوْا وَّكَانُوْا يَعْتَدُوْنَ ࣖ",
    "transliteration_en": "Wa iz qultum yaa Moosaa lan nasbira 'alaa ta'aaminw waahidin fad'u lanaa rabbaka yukhrij lanaa mimmaa tumbitul ardu mimbaqlihaa wa qis saaa'ihaa wa foomihaa wa 'adasihaa wa basalihaa qaala atastabdiloonal lazee huwa adnaa billazee huwa khayr; ihbitoo misran fa inna lakum maa sa altum; wa duribat 'alaihimuz zillatu walmaskanatu wa baaa'oo bighadabim minal laah; zaalika bi annahum kaano yakfuroona bi aayaatil laahi wa yaqtuloonan Nabiyyeena bighairil haqq; zaalika bimaa 'asaw wa kaanoo ya'tadoon",
    "transliteration_id": "Wa iż qultum yā mūsā lan naṣbira ‘alā ṭa‘āmiw wāḥidin fad‘u lanā rabbaka yukhrij lanā mimmā tumbitul-arḍu mim baqlihā wa qiṡṡā'ihā wa fūmihā wa ‘adasihā wa baṣalihā, qāla atastabdilūnal-lażī huwa adnā bil-lażī huwa khair(un), ihbiṭū miṣran fa inna lakum mā sa'altum, wa ḍuribat ‘alaihimuż-żillatu wal-maskanatu wa bā'ū bigaḍabim minallāh(i), żālika bi'annahum kānū yakfurūna bi'āyātillāhi wa yaqtulūnan- nabiyyīna bi gairil-ḥaqq(i), żālika bimā ‘aṣaw wa kānū ya‘tadūn(a).",
    "translation_en": "And [recall] when you said, \"O Moses, we can never endure one [kind of] food. So call upon your Lord to bring forth for us from the earth its green herbs and its cucumbers and its garlic and its lentils and its onions.\" [Moses] said, \"Would you exchange what is better for what is less? Go into [any] settlement and indeed, you will have what you have asked.\" And they were covered with humiliation and poverty and returned with anger from Allah [upon them]. That was because they [repeatedly] disbelieved in the signs of Allah and killed the prophets without right. That was because they disobeyed and were [habitually] transgressing.",
    "translation_id": "(Ingatlah) ketika kamu berkata, “Wahai Musa, kami tidak tahan hanya (makan) dengan satu macam makanan. Maka, mohonkanlah kepada Tuhanmu untuk kami agar Dia memberi kami apa yang ditumbuhkan bumi, seperti sayur-mayur, mentimun, bawang putih, kacang adas, dan bawang merah.” Dia (Musa) menjawab, “Apakah kamu meminta sesuatu yang buruk sebagai ganti dari sesuatu yang baik? Pergilah ke suatu kota. Pasti kamu akan memperoleh apa yang kamu minta.” Kemudian, mereka ditimpa kenistaan dan kemiskinan, dan mereka (kembali) mendapat kemurkaan dari Allah. Hal itu (terjadi) karena sesungguhnya mereka selalu mengingkari ayat-ayat Allah dan membunuh para nabi tanpa hak (alasan yang benar). Yang demikian itu ditimpakan karena mereka durhaka dan selalu melampaui batas."
  },
  {
    "ayat": 62,
    "arabic": "اِنَّ الَّذِيْنَ اٰمَنُوْا وَالَّذِيْنَ هَادُوْا وَالنَّصٰرٰى وَالصَّابِــِٕيْنَ مَنْ اٰمَنَ بِاللّٰهِ وَالْيَوْمِ الْاٰخِرِ وَعَمِلَ صَالِحًا فَلَهُمْ اَجْرُهُمْ عِنْدَ رَبِّهِمْۚ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُوْنَ",
    "transliteration_en": "Innal lazeena aamanoo wallazeena haadoo wan nasaaraa was Saabi'eena man aamana billaahi wal yawmil aakhiri wa 'amila saalihan falahum ajruhum 'inda Rabbihim wa laa khawfun 'alaihim wa laa hum yahzanoon",
    "transliteration_id": "Innal-lażīna āmanū wal-lażīna hādū wan-naṣārā waṣ-ṣābi'īna man āmana billāhi wal- yaumil-ākhiri wa ‘amila ṣāliḥan fa lahum ajruhum ‘inda rabbihim, wa lā khaufun ‘alaihim wa lā hum yaḥzanūn(a).",
    "translation_en": "Indeed, those who believed and those who were Jews or Christians or Sabeans [before Prophet Muhammad] - those [among them] who believed in Allah and the Last Day and did righteousness - will have their reward with their Lord, and no fear will there be concerning them, nor will they grieve.",
    "translation_id": "Sesungguhnya orang-orang yang beriman, orang-orang Yahudi, orang-orang Nasrani, dan orang-orang Sabiin, siapa saja (di antara mereka) yang beriman kepada Allah dan hari Akhir serta melakukan kebajikan (pasti) mendapat pahala dari Tuhannya, tidak ada rasa takut yang menimpa mereka dan mereka pun tidak bersedih hati."
  },
  {
    "ayat": 63,
    "arabic": "وَاِذْ اَخَذْنَا مِيْثَاقَكُمْ وَرَفَعْنَا فَوْقَكُمُ الطُّوْرَۗ خُذُوْا مَآ اٰتَيْنٰكُمْ بِقُوَّةٍ وَّاذْكُرُوْا مَا فِيْهِ لَعَلَّكُمْ تَتَّقُوْنَ",
    "transliteration_en": "Wa iz akhaznaa meesaaqakum wa rafa'naa fawqakumut Toora khuzoo maaa aatainaakum biquwwatinw wazkuroo maa feehi la'allakum tattaqoon",
    "transliteration_id": "Wa iż akhażnā mīṡāqakum wa rafa‘nā fauqakumuṭ-ṭūr(a), khużū mā ātainākum biquwwatiw ważkurū mā fīhi la‘allakum tattaqūn(a).",
    "translation_en": "And [recall] when We took your covenant, [O Children of Israel, to abide by the Torah] and We raised over you the mount, [saying], \"Take what We have given you with determination and remember what is in it that perhaps you may become righteous.\"",
    "translation_id": "(Ingatlah) ketika Kami mengambil janjimu dan Kami angkat gunung (Sinai) di atasmu (seraya berfirman), “Pegang teguhlah apa yang telah Kami berikan kepadamu dan ingatlah apa yang ada di dalamnya agar kamu bertakwa.”"
  },
  {
    "ayat": 64,
    "arabic": "ثُمَّ تَوَلَّيْتُمْ مِّنْۢ بَعْدِ ذٰلِكَ  فَلَوْلَا فَضْلُ اللّٰهِ عَلَيْكُمْ وَرَحْمَتُهٗ لَكُنْتُمْ مِّنَ الْخٰسِرِيْنَ",
    "transliteration_en": "Summa tawallaitum mim ba'di zaalika falawlaa fadlul laahi 'alaikum wa rahmatuhoo lakuntum minal khaasireen",
    "transliteration_id": "Ṡumma tawallaitum mim ba‘di żālika falau lā faḍlullāhi ‘alaikum wa raḥmatuhū lakuntum minal-khāsirīn(a).",
    "translation_en": "Then you turned away after that. And if not for the favor of Allah upon you and His mercy, you would have been among the losers.",
    "translation_id": "Setelah itu, kamu berpaling. Maka, seandainya bukan karena karunia Allah dan rahmat-Nya kepadamu, pasti kamu termasuk orang yang rugi."
  },
  {
    "ayat": 65,
    "arabic": "وَلَقَدْ عَلِمْتُمُ الَّذِيْنَ اعْتَدَوْا مِنْكُمْ فِى السَّبْتِ فَقُلْنَا لَهُمْ كُوْنُوْا قِرَدَةً خٰسِـِٕيْنَ",
    "transliteration_en": "Wa laqad 'alimtumul lazeena'-tadaw minkum fis Sabti faqulnaa lahum koonoo qiradatan khaasi'een",
    "transliteration_id": "Wa laqad ‘alimtumul-lażīna‘tadau minkum fis-sabti faqulnā lahum kūnū qiradatan khāsi'īn(a).",
    "translation_en": "And you had already known about those who transgressed among you concerning the sabbath, and We said to them, \"Be apes, despised.\"",
    "translation_id": "Sungguh, kamu benar-benar telah mengetahui orang-orang yang melakukan pelanggaran di antara kamu pada hari Sabat, lalu Kami katakan kepada mereka, “Jadilah kamu kera yang hina!”"
  },
  {
    "ayat": 66,
    "arabic": "فَجَعَلْنٰهَا نَكَالًا لِّمَا بَيْنَ يَدَيْهَا وَمَا خَلْفَهَا وَمَوْعِظَةً لِّلْمُتَّقِيْنَ",
    "transliteration_en": "Faja'alnaahaa nakaalal limaa baina yadihaa wa maa khalfahaa wa maw'izatal lilmuttaqeen",
    "transliteration_id": "Faja‘alnāhā nakālal limā baina yadaihā wa mā khalfahā wa mau‘iẓatal lil-muttaqīn(a).",
    "translation_en": "And We made it a deterrent punishment for those who were present and those who succeeded [them] and a lesson for those who fear Allah.",
    "translation_id": "Maka, Kami jadikan (yang demikian) itu sebagai peringatan bagi orang-orang pada masa itu dan bagi mereka yang datang kemudian, serta menjadi pelajaran bagi orang-orang yang bertakwa."
  },
  {
    "ayat": 67,
    "arabic": "وَاِذْ قَالَ مُوْسٰى لِقَوْمِهٖٓ اِنَّ اللّٰهَ يَأْمُرُكُمْ اَنْ تَذْبَحُوْا بَقَرَةً ۗ قَالُوْٓا اَتَتَّخِذُنَا هُزُوًا ۗ قَالَ اَعُوْذُ بِاللّٰهِ اَنْ اَكُوْنَ مِنَ الْجٰهِلِيْنَ",
    "transliteration_en": "Wa iz qaala Moosaa liqawmiheee innal laaha yaamurukum an tazbahoo baqaratan qaalooo atattakhizunna huzuwan qaala a'oozu billaahi an akoona minal jaahileen",
    "transliteration_id": "Wa iż qāla mūsā liqaumihī innallāha ya'murukum an tażbaḥū baqarah(tan), qālū atattakhiżunā huzuwā(n), qāla a‘ūżu billāhi an akūna minal-jāhilīn(a).",
    "translation_en": "And [recall] when Moses said to his people, \"Indeed, Allah commands you to slaughter a cow.\" They said, \"Do you take us in ridicule?\" He said, \"I seek refuge in Allah from being among the ignorant.\"",
    "translation_id": "(Ingatlah) ketika Musa berkata kepada kaumnya, “Allah memerintahkan kamu agar menyembelih seekor sapi.” Mereka bertanya, “Apakah engkau akan menjadikan kami sebagai ejekan?” Dia menjawab, “Aku berlindung kepada Allah agar tidak termasuk orang-orang yang jahil.”"
  },
  {
    "ayat": 68,
    "arabic": "قَالُوا ادْعُ لَنَا رَبَّكَ يُبَيِّنْ لَّنَا مَا هِيَ ۗ قَالَ اِنَّهٗ يَقُوْلُ اِنَّهَا بَقَرَةٌ لَّا فَارِضٌ وَّلَا بِكْرٌۗ عَوَانٌۢ بَيْنَ ذٰلِكَ ۗ فَافْعَلُوْا مَا تُؤْمَرُوْنَ",
    "transliteration_en": "Qaalud-'u lanaa rabbaka yubaiyil lanaa maa hee; qaala innahoo yaqoolu innahaa baqaratul laa faaridunw wa laa bikrun 'awaanum baina zaalika faf'aloo maa tu'maroon",
    "transliteration_id": "Qālud‘u lanā rabbaka yubayyil lanā mā hiy(a), qāla innahū yaqūlu innahā baqaratul lā fāriḍuw wa lā bikr(un), ‘awānum baina żālik(a), faf‘alū mā tu'marūn(a).",
    "translation_en": "They said, \"Call upon your Lord to make clear to us what it is.\" [Moses] said, \"[Allah] says, 'It is a cow which is neither old nor virgin, but median between that,' so do what you are commanded.\"",
    "translation_id": "Mereka berkata, “Mohonkanlah kepada Tuhanmu untuk kami agar Dia menjelaskan kepada kami tentang (sapi) itu.” Dia (Musa) menjawab, “Dia (Allah) berfirman bahwa sapi itu tidak tua dan tidak muda, (tetapi) pertengahan antara itu. Maka, kerjakanlah apa yang diperintahkan kepadamu.”"
  },
  {
    "ayat": 69,
    "arabic": "قَالُوا ادْعُ لَنَا رَبَّكَ يُبَيِّنْ لَّنَا مَا لَوْنُهَا ۗ قَالَ اِنَّهٗ يَقُوْلُ اِنَّهَا بَقَرَةٌ صَفْرَاۤءُ فَاقِعٌ لَّوْنُهَا تَسُرُّ النّٰظِرِيْنَ",
    "transliteration_en": "Qaalud-'u lanaa rabaaka yubaiyil lanaa maa lawnuhaa; qaala innahoo yaqoolu innahaa baqaratun safraaa'u faqi'ul lawnuhaa tasurrunnaazireen",
    "transliteration_id": "Qālud‘u lanā rabbaka yubayyil lanā mā launuhā, qāla innahū yaqūlu innahā baqaratun ṣafrā'u fāqi‘ul launuhā tasurrun-nāẓirīn(a).",
    "translation_en": "They said, \"Call upon your Lord to show us what is her color.\" He said, \"He says, 'It is a yellow cow, bright in color - pleasing to the observers.' \"",
    "translation_id": "Mereka berkata, “Mohonkanlah kepada Tuhanmu untuk kami agar Dia menjelaskan kepada kami apa warnanya.” Dia (Musa) menjawab, “Dia (Allah) berfirman bahwa (sapi) itu adalah sapi yang warnanya kuning tua, yang menyenangkan orang-orang yang memandang(-nya).”"
  },
  {
    "ayat": 70,
    "arabic": "قَالُوا ادْعُ لَنَا رَبَّكَ يُبَيِّنْ لَّنَا مَا هِيَۙ اِنَّ الْبَقَرَ تَشٰبَهَ عَلَيْنَاۗ وَاِنَّآ اِنْ شَاۤءَ اللّٰهُ لَمُهْتَدُوْنَ",
    "transliteration_en": "Qaalud-'u lanaa rabbaka yubaiyil lanaa maa hiya innal baqara tashaabaha 'alainaa wa innaaa in shaaa'al laahu lamuhtadoon",
    "transliteration_id": "Qālud‘u lanā rabbaka yubayyil lanā mā hiy(a), innal-baqara tasyābaha ‘alainā, wa innā in syā'allāhu lamuhtadūn(a).",
    "translation_en": "They said, \"Call upon your Lord to make clear to us what it is. Indeed, [all] cows look alike to us. And indeed we, if Allah wills, will be guided.\"",
    "translation_id": "Mereka berkata, “Mohonkanlah kepada Tuhanmu untuk kami agar Dia menjelaskan kepada kami tentang (sapi) itu. (Karena) sesungguhnya sapi itu belum jelas bagi kami, dan jika Allah menghendakinya, niscaya kami mendapat petunjuk.”"
  },
  {
    "ayat": 71,
    "arabic": "قَالَ اِنَّهٗ يَقُوْلُ اِنَّهَا بَقَرَةٌ لَّا ذَلُوْلٌ تُثِيْرُ الْاَرْضَ وَلَا تَسْقِى الْحَرْثَۚ مُسَلَّمَةٌ لَّاشِيَةَ فِيْهَا ۗ قَالُوا الْـٰٔنَ جِئْتَ بِالْحَقِّ  فَذَبَحُوْهَا وَمَا كَادُوْا يَفْعَلُوْنَ ࣖ",
    "transliteration_en": "Qaala innahoo yaqoolu innahaa baqaratul laa zaloolun tuseerul arda wa laa tasqil harsa musallamatullaa shiyata feehaa; qaalul 'aana jita bilhaqq; fazabahoohaa wa maa kaado yaf'aloon",
    "transliteration_id": "Qāla innahū yaqūlu innahā baqaratul lā żalūlun tuṡīrul-arḍa wa lā tasqil-ḥarṡ(a), musallamatul lā syiyata fīhā, qālul-'āna ji'ta bil-ḥaqqi fażabaḥūhā wa mā kādū yaf‘alūn(a).",
    "translation_en": "He said, \"He says, 'It is a cow neither trained to plow the earth nor to irrigate the field, one free from fault with no spot upon her.' \" They said, \"Now you have come with the truth.\" So they slaughtered her, but they could hardly do it.",
    "translation_id": "Dia (Musa) menjawab, “Dia (Allah) berfirman bahwa (sapi) itu adalah sapi yang belum pernah dipakai untuk membajak tanah dan tidak (pula) untuk mengairi tanaman, sehat, dan tanpa belang.” Mereka berkata, “Sekarang barulah engkau menerangkan (hal) yang sebenarnya.” Lalu, mereka menyembelihnya, dan hampir saja mereka tidak melaksanakan (perintah) itu."
  },
  {
    "ayat": 72,
    "arabic": "وَاِذْ قَتَلْتُمْ نَفْسًا فَادّٰرَءْتُمْ فِيْهَا ۗ وَاللّٰهُ مُخْرِجٌ مَّا كُنْتُمْ تَكْتُمُوْنَ ۚ",
    "transliteration_en": "Wa iz qataltum nafsan faddaara'tum feehaa wallaahu mukrijum maa kuntum taktumoon",
    "transliteration_id": "Wa iż qultum nafsan faddāra'tum fīhā, wallāhu mukhrijum mā kuntum taktumūn(a).",
    "translation_en": "And [recall] when you slew a man and disputed over it, but Allah was to bring out that which you were concealing.",
    "translation_id": "(Ingatlah) ketika kamu membunuh seseorang lalu kamu saling tuduh tentang itu. Akan tetapi, Allah menyingkapkan apa yang selalu kamu sembunyikan."
  },
  {
    "ayat": 73,
    "arabic": "فَقُلْنَا اضْرِبُوْهُ بِبَعْضِهَاۗ  كَذٰلِكَ يُحْيِ اللّٰهُ الْمَوْتٰى وَيُرِيْكُمْ اٰيٰتِهٖ لَعَلَّكُمْ تَعْقِلُوْنَ",
    "transliteration_en": "Faqulnad riboohu biba'dihaa; kazaalika yuhyil laa hul mawtaa wa yureekum aayaatihee la'allakum ta'qiloon",
    "transliteration_id": "Faqulnaḍribūhu biba‘ḍihā, każālika yuḥyillāhul-mautā wa yurīkum āyātihī la‘allakum ta‘qilūn(a).",
    "translation_en": "So, We said, \"Strike the slain man with part of it.\" Thus does Allah bring the dead to life, and He shows you His signs that you might reason.",
    "translation_id": "Lalu, Kami berfirman, “Pukullah (mayat) itu dengan bagian dari (sapi) itu!” Demikianlah Allah menghidupkan (orang) yang telah mati, dan Dia memperlihatkan kepadamu tanda-tanda (kekuasaan-Nya) agar kamu mengerti."
  },
  {
    "ayat": 74,
    "arabic": "ثُمَّ قَسَتْ قُلُوْبُكُمْ مِّنْۢ بَعْدِ ذٰلِكَ فَهِيَ كَالْحِجَارَةِ اَوْ اَشَدُّ قَسْوَةً ۗ وَاِنَّ مِنَ الْحِجَارَةِ لَمَا يَتَفَجَّرُ مِنْهُ الْاَنْهٰرُ ۗ وَاِنَّ مِنْهَا لَمَا يَشَّقَّقُ فَيَخْرُجُ مِنْهُ الْمَاۤءُ  ۗوَاِنَّ مِنْهَا لَمَا يَهْبِطُ مِنْ خَشْيَةِ اللّٰهِ ۗوَمَا اللّٰهُ بِغَافِلٍ عَمَّا تَعْمَلُوْنَ",
    "transliteration_en": "Summa qasat quloobukum mim ba'di zaalika fahiya kalhijaarati aw-ashaadu qaswah; wa inna minal hijaarati lamaa yatafajjaru minhul anhaar; wa inna minhaa lamaa yash shaqqaqu fayakhruju minhul maaa'; wa inna minhaa lamaa yahbitu min khashyatil laa; wa mal laahu bighaafilin 'ammaa ta'maloon",
    "transliteration_id": "Ṡumma qasat qulūbukum mim ba‘di żālika fahiya kal-ḥijārati au asyaddu qaswah(tan), wa inna minal-ḥijārati lamā yatafajjaru minhul-anhār(u), wa inna minhā lamā yasysyaqqaqu fayakhruju minhul-mā'(u), wa inna minhā lamā yahbiṭu min khasy-yatillāh(i), wa mallāhu bigāfilin ‘ammā ta‘malūn(a).",
    "translation_en": "Then your hearts became hardened after that, being like stones or even harder. For indeed, there are stones from which rivers burst forth, and there are some of them that split open and water comes out, and there are some of them that fall down for fear of Allah. And Allah is not unaware of what you do.",
    "translation_id": "Setelah itu, hatimu menjadi keras sehingga ia (hatimu) seperti batu, bahkan lebih keras. Padahal, dari batu-batu itu pasti ada sungai-sungai yang (airnya) memancar. Ada pula yang terbelah, lalu keluarlah mata air darinya, dan ada lagi yang meluncur jatuh karena takut kepada Allah. Allah tidaklah lengah terhadap apa yang kamu kerjakan."
  },
  {
    "ayat": 75,
    "arabic": "۞ اَفَتَطْمَعُوْنَ اَنْ يُّؤْمِنُوْا لَكُمْ وَقَدْ كَانَ فَرِيْقٌ مِّنْهُمْ يَسْمَعُوْنَ كَلَامَ اللّٰهِ ثُمَّ يُحَرِّفُوْنَهٗ مِنْۢ بَعْدِ مَا عَقَلُوْهُ وَهُمْ يَعْلَمُوْنَ",
    "transliteration_en": "Afatatma'oona ai yu'minoo lakum wa qad kaana fareequm minhum yasma'oona Kalaamal laahi summa yuharri foonahoo mim ba'di maa'aqaloohu wa hum ya'lamoon",
    "transliteration_id": "Afa taṭma‘ūna ay yu'minū lakum wa qad kāna farīqum minhum yasma‘ūna kalāmallāhi ṡumma yuḥarrifūnahū mim ba‘di mā ‘aqalūhu wa hum ya‘lamūn(a).",
    "translation_en": "Do you covet [the hope, O believers], that they would believe for you while a party of them used to hear the words of Allah and then distort the Torah after they had understood it while they were knowing?",
    "translation_id": "Maka, apakah kamu (muslimin) sangat mengharapkan mereka agar percaya kepadamu, sedangkan segolongan mereka mendengar firman Allah lalu mereka mengubahnya setelah memahaminya, padahal mereka mengetahui(-nya)?"
  },
  {
    "ayat": 76,
    "arabic": "وَاِذَا لَقُوا الَّذِيْنَ اٰمَنُوْا قَالُوْٓا اٰمَنَّاۚ وَاِذَا خَلَا بَعْضُهُمْ اِلٰى بَعْضٍ قَالُوْٓا اَتُحَدِّثُوْنَهُمْ بِمَا فَتَحَ اللّٰهُ عَلَيْكُمْ لِيُحَاۤجُّوْكُمْ بِهٖ عِنْدَ رَبِّكُمْ ۗ اَفَلَا تَعْقِلُوْنَ",
    "transliteration_en": "Wa izaa laqul lazeena aamanoo qaalooo aamannaa wa izaakhalaa ba'duhum ilaa ba'din qaalooo atuhaddisoonahum bimaa fatahal laahu 'alaikum liyuhaajjookum bihee 'inda rabbikum; afalaa ta'qiloon",
    "transliteration_id": "Wa iżā laqul-lażīna āmanū qālū āmannā, wa iżā khalā ba‘ḍuhum ilā ba‘ḍin qālū atuḥaddiṡūnahum bimā fataḥallāhu ‘alaikum liyuḥājjūkum bihī ‘inda rabbikum, afalā ta‘qilūn(a).",
    "translation_en": "And when they meet those who believe, they say, \"We have believed\"; but when they are alone with one another, they say, \"Do you talk to them about what Allah has revealed to you so they can argue with you about it before your Lord?\" Then will you not reason?",
    "translation_id": "Apabila berjumpa dengan orang-orang yang beriman, mereka berkata, “Kami telah beriman.” Akan tetapi, apabila kembali kepada sesamanya, mereka bertanya, “Apakah akan kamu ceritakan kepada mereka apa yang telah diterangkan Allah kepadamu sehingga mereka dapat menyanggah kamu di hadapan Tuhanmu? Apakah kamu tidak mengerti?”"
  },
  {
    "ayat": 77,
    "arabic": "اَوَلَا يَعْلَمُوْنَ اَنَّ اللّٰهَ يَعْلَمُ مَا يُسِرُّوْنَ وَمَا يُعْلِنُوْنَ",
    "transliteration_en": "Awalaa ya'lamoona annal laaha ya'lamu maa yusirroona wa maa yu'linoon",
    "transliteration_id": "Awalā ya‘lamūna annallāha ya‘lamu mā yusirrūna wa mā yu‘linūn(a).",
    "translation_en": "But do they not know that Allah knows what they conceal and what they declare?",
    "translation_id": "Tidakkah mereka tahu bahwa Allah mengetahui apa yang mereka sembunyikan dan apa yang mereka nyatakan?"
  },
  {
    "ayat": 78,
    "arabic": "وَمِنْهُمْ اُمِّيُّوْنَ لَا يَعْلَمُوْنَ الْكِتٰبَ اِلَّآ اَمَانِيَّ وَاِنْ هُمْ اِلَّا يَظُنُّوْنَ",
    "transliteration_en": "Wa minhum ummiyyoona laa ya'lamoonal kitaaba illaaa amaaniyya wa in hum illaa yazunnoon",
    "transliteration_id": "Wa minhum umiyyūna lā ya‘lamūnal-kitāba illā amāniyya wa in hum illā yaẓunnūn(a).",
    "translation_en": "And among them are unlettered ones who do not know the Scripture except in wishful thinking, but they are only assuming.",
    "translation_id": "Di antara mereka ada yang umi (buta huruf), tidak memahami Kitab (Taurat), kecuali hanya berangan-angan dan mereka hanya menduga-duga."
  },
  {
    "ayat": 79,
    "arabic": "فَوَيْلٌ لِّلَّذِيْنَ يَكْتُبُوْنَ الْكِتٰبَ بِاَيْدِيْهِمْ ثُمَّ يَقُوْلُوْنَ هٰذَا مِنْ عِنْدِ اللّٰهِ لِيَشْتَرُوْا بِهٖ ثَمَنًا قَلِيْلًا ۗفَوَيْلٌ لَّهُمْ مِّمَّا كَتَبَتْ اَيْدِيْهِمْ وَوَيْلٌ لَّهُمْ مِّمَّا يَكْسِبُوْنَ",
    "transliteration_en": "Fawailul lillazeena yaktuboonal kitaaba bi aydddhim summa yaqooloona haazaa min 'indil laahi liyashtaroo bihee samanan qaleelan fawilul lahum mimaa katabat aydeehim wa wailul lahum mimmaa yaksiboon",
    "transliteration_id": "Fawailul lil-lażīna yaktubūnal-kitāba bi'aidīhim ṡumma yaqūlūna hāżā min ‘indillāhi liyasytarū bihī ṡamanan qalīlā(n), fawailul lahum mimmā katabat aidīhim wa wailul lahum mimmā yaksibūn(a).",
    "translation_en": "So woe to those who write the \"scripture\" with their own hands, then say, \"This is from Allah,\" in order to exchange it for a small price. Woe to them for what their hands have written and woe to them for what they earn.",
    "translation_id": "Celakalah orang-orang yang menulis kitab dengan tangan mereka (sendiri), kemudian berkata, “Ini dari Allah,” (dengan maksud) untuk menjualnya dengan harga murah. Maka, celakalah mereka karena tulisan tangan mereka dan celakalah mereka karena apa yang mereka perbuat."
  },
  {
    "ayat": 80,
    "arabic": "وَقَالُوْا لَنْ تَمَسَّنَا النَّارُ اِلَّآ اَيَّامًا مَّعْدُوْدَةً ۗ قُلْ اَتَّخَذْتُمْ عِنْدَ اللّٰهِ عَهْدًا فَلَنْ يُّخْلِفَ اللّٰهُ عَهْدَهٗٓ اَمْ تَقُوْلُوْنَ عَلَى اللّٰهِ مَا لَا تَعْلَمُوْنَ",
    "transliteration_en": "Wa qaaloo lan tamassanan Naaru illaaa ayyaamam ma'doo dah; qul attakhaztum 'indal laahi 'ahdan falai yukhlifal laahu 'ahdahooo am taqooloona 'alal laahi maa laa ta'lamoon",
    "transliteration_id": "Wa qālū lan tamassanan-nāru illā ayyāmam ma‘dūdah (tan), qul attakhażtum ‘indallāhi ‘ahdan falay yukhlifallāhu ‘ahdahū am taqūlūna ‘alallāhi mā lā ta‘lamūn(a).",
    "translation_en": "And they say, \"Never will the Fire touch us, except for a few days.\" Say, \"Have you taken a covenant with Allah? For Allah will never break His covenant. Or do you say about Allah that which you do not know?\"",
    "translation_id": "Mereka berkata, “Neraka tidak akan menyentuh kami, kecuali beberapa hari saja.” Katakanlah, “Sudahkah kamu menerima janji dari Allah sehingga Allah tidak akan mengingkari janji-Nya ataukah kamu berkata tentang Allah sesuatu yang tidak kamu ketahui?”"
  },
  {
    "ayat": 81,
    "arabic": "بَلٰى مَنْ كَسَبَ سَيِّئَةً وَّاَحَاطَتْ بِهٖ خَطِيْۤـَٔتُهٗ فَاُولٰۤىِٕكَ اَصْحٰبُ النَّارِ ۚ هُمْ فِيْهَا خٰلِدُوْنَ",
    "transliteration_en": "Balaa man kasaba sayyi'atanw wa ahaatat bihee khateee'atuhoo fa-ulaaa'ika Ashaabun Naari hum feehaa khaalidoon",
    "transliteration_id": "Balā man kasaba sayyi'ataw wa aḥāṭat bihī khaṭī'atuhū fa ulā'ika aṣḥābun-nār(i), hum fīhā khālidūn(a).",
    "translation_en": "Yes, whoever earns evil and his sin has encompassed him - those are the companions of the Fire; they will abide therein eternally.",
    "translation_id": "Bukan demikian! Siapa yang berbuat keburukan dan dosanya telah menenggelamkannya, mereka itulah penghuni neraka. Mereka kekal di dalamnya."
  },
  {
    "ayat": 82,
    "arabic": "وَالَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ اُولٰۤىِٕكَ اَصْحٰبُ الْجَنَّةِ ۚ هُمْ فِيْهَا خٰلِدُوْنَ ࣖ",
    "transliteration_en": "Wallazeena aamanoo wa 'amilus saalihaati ulaaa'ika Ashaabul Jannati hum feeha khaalidoon",
    "transliteration_id": "Wal-lażīna āmanū wa ‘amiluṣ-ṣāliḥāti ulā'ika aṣḥābul-jannah(ti), hum fīhā khālidūn(a).",
    "translation_en": "But they who believe and do righteous deeds - those are the companions of Paradise; they will abide therein eternally.",
    "translation_id": "Adapun orang-orang yang beriman dan beramal saleh, mereka itulah penghuni surga. Mereka kekal di dalamnya."
  },
  {
    "ayat": 83,
    "arabic": "وَاِذْ اَخَذْنَا مِيْثَاقَ بَنِيْٓ اِسْرَاۤءِيْلَ لَا تَعْبُدُوْنَ اِلَّا اللّٰهَ وَبِالْوَالِدَيْنِ اِحْسَانًا وَّذِى الْقُرْبٰى وَالْيَتٰمٰى وَالْمَسٰكِيْنِ وَقُوْلُوْا لِلنَّاسِ حُسْنًا وَّاَقِيْمُوا الصَّلٰوةَ وَاٰتُوا الزَّكٰوةَۗ  ثُمَّ تَوَلَّيْتُمْ اِلَّا قَلِيْلًا مِّنْكُمْ وَاَنْتُمْ مُّعْرِضُوْنَ",
    "transliteration_en": "Wa iz akhaznaa meesaaqa Baneee Israaa'eela laa ta'budoona illal laaha wa bil waalidaini ihsaananw wa zil qurbaa walyataamaa walmasaakeeni wa qooloo linnaasi husnanw wa aqeemus salaata wa aatuzZakaata summa tawallitum illaa qaleelam minkum wa antum mu'ridoon",
    "transliteration_id": "Wa iż akhażnā mīṡāqa banī isrā'īla lā ta‘budūna illallāha wa bil-wālidaini iḥsānaw wa żil-qurbā wal-yatāmā wal-masākīni wa qūlū lin-nāsi ḥusnaw wa aqīmuṣ-ṣalāta wa ātuz-zakāh(ta), ṡumma tawallaitum illā qalīlam minkum wa antum mu‘riḍūn(a).",
    "translation_en": "And [recall] when We took the covenant from the Children of Israel, [enjoining upon them], \"Do not worship except Allah; and to parents do good and to relatives, orphans, and the needy. And speak to people good [words] and establish prayer and give zakah.\" Then you turned away, except a few of you, and you were refusing.",
    "translation_id": "(Ingatlah) ketika Kami mengambil perjanjian dari Bani Israil, “Janganlah kamu menyembah selain Allah, dan berbuatbaiklah kepada kedua orang tua, kerabat, anak-anak yatim, dan orang-orang miskin. Selain itu, bertutur katalah yang baik kepada manusia, laksanakanlah salat, dan tunaikanlah zakat.” Akan tetapi, kamu berpaling (mengingkarinya), kecuali sebagian kecil darimu, dan kamu (masih menjadi) pembangkang."
  },
  {
    "ayat": 84,
    "arabic": "وَاِذْ اَخَذْنَا مِيْثَاقَكُمْ لَا تَسْفِكُوْنَ دِمَاۤءَكُمْ وَلَا تُخْرِجُوْنَ اَنْفُسَكُمْ مِّنْ دِيَارِكُمْ ۖ ثُمَّ اَقْرَرْتُمْ وَاَنْتُمْ تَشْهَدُوْنَ",
    "transliteration_en": "Wa iz akhaznaa meesaa qakum laa tasfikoona dimaaa'akum wa laa tukrijoona anfusakum min diyaarikum summa aqrartum wa antum tashhadoon",
    "transliteration_id": "Wa iż akhażnā mīṡāqakum lā tasfikūna dimā'akum wa lā tukhrijūna anfusakum min diyārikum ṡumma aqrartum wa antum tasyhadūn(a).",
    "translation_en": "And [recall] when We took your covenant, [saying], \"Do not shed each other's blood or evict one another from your homes.\" Then you acknowledged [this] while you were witnessing.",
    "translation_id": "(Ingatlah) ketika Kami mengambil perjanjianmu (agar) kamu tidak menumpahkan darahmu (membunuh orang) dan mengusir dirimu (saudara sebangsamu) dari kampung halamanmu. Kemudian, kamu berikrar dan bersaksi."
  },
  {
    "ayat": 85,
    "arabic": "ثُمَّ اَنْتُمْ هٰٓؤُلَاۤءِ تَقْتُلُوْنَ اَنْفُسَكُمْ وَتُخْرِجُوْنَ فَرِيْقًا مِّنْكُمْ مِّنْ دِيَارِهِمْۖ تَظٰهَرُوْنَ عَلَيْهِمْ بِالْاِثْمِ وَالْعُدْوَانِۗ وَاِنْ يَّأْتُوْكُمْ اُسٰرٰى تُفٰدُوْهُمْ وَهُوَ مُحَرَّمٌ عَلَيْكُمْ اِخْرَاجُهُمْ ۗ اَفَتُؤْمِنُوْنَ بِبَعْضِ الْكِتٰبِ وَتَكْفُرُوْنَ بِبَعْضٍۚ  فَمَا جَزَاۤءُ مَنْ يَّفْعَلُ ذٰلِكَ مِنْكُمْ اِلَّا خِزْيٌ فِى الْحَيٰوةِ الدُّنْيَا ۚوَيَوْمَ الْقِيٰمَةِ يُرَدُّوْنَ اِلٰٓى  اَشَدِّ الْعَذَابِۗ وَمَا اللّٰهُ بِغَافِلٍ عَمَّا تَعْمَلُوْنَ",
    "transliteration_en": "Summa antum haaa'ulaaa'i taqtuloona anfusakum wa tukhrijoona fareeqam minkum min diyaarihim tazaaharoona 'alaihim bil ismi wal'udwaani wa iny yaatookum usaaraa tufaadoohum wahuwa muharramun 'alaikum ikhraajuhum; afatu' mi-noona biba'dil Kitaabi wa takfuroona biba'd; famaa jazaaa'u mai yaf'alu zaalika minkum illaa khizyun fil hayaatid-dunyaa wa yawmal qiyaamati yuraddoona ilaaa ashaddil 'azaab; wa mal laahu bighaafilin 'ammaa ta'maloon",
    "transliteration_id": "Ṡumma antum hā'ulā'i taqtulūna anfusakum wa tukhrijūna farīqam minkum min diyārihim taẓāharūna ‘alaihim bil-iṡmi wal-‘udwān(i), wa iy ya'tūkum usārā tufādūhum wa huwa muḥarramun ‘alaikum ikhrājuhum, afa tu'minūna biba‘ḍil-kitābi wa takfurūna bi ba‘ḍ(in), famā jazā'u may yaf‘alu żālika minkum illā khizyun fil-ḥayātid-dun-yā, wa yaumal-qiyāmati yuraddūna ilā asyaddil-‘ażāb(i), wa mallāhu bigāfilin ‘ammā ta‘malūn(a).",
    "translation_en": "Then, you are those [same ones who are] killing one another and evicting a party of your people from their homes, cooperating against them in sin and aggression. And if they come to you as captives, you ransom them, although their eviction was forbidden to you. So do you believe in part of the Scripture and disbelieve in part? Then what is the recompense for those who do that among you except disgrace in worldly life; and on the Day of Resurrection they will be sent back to the severest of punishment. And Allah is not unaware of what you do.",
    "translation_id": "Kemudian, kamu (Bani Israil) membunuh dirimu (sesamamu) dan mengusir segolongan darimu dari kampung halamannya. Kamu saling membantu (menghadapi) mereka dalam kejahatan dan permusuhan. Jika mereka datang kepadamu sebagai tawanan, kamu tebus mereka, padahal kamu dilarang mengusir mereka. Apakah kamu beriman pada sebagian Kitab (Taurat) dan ingkar pada sebagian (yang lain)? Maka, tidak ada balasan (yang pantas) bagi orang yang berbuat demikian di antaramu, selain kenistaan dalam kehidupan dunia dan pada hari Kiamat mereka dikembalikan pada azab yang paling berat. Allah tidak lengah terhadap apa yang kamu kerjakan."
  },
  {
    "ayat": 86,
    "arabic": "اُولٰۤىِٕكَ الَّذِيْنَ اشْتَرَوُا الْحَيٰوةَ الدُّنْيَا بِالْاٰخِرَةِ ۖ فَلَا يُخَفَّفُ عَنْهُمُ الْعَذَابُ وَلَا هُمْ يُنْصَرُوْنَ ࣖ",
    "transliteration_en": "Ulaaa'ikal lazeenash tarawul hayaatad dunyaa bil aakhirati falaa yukhaffafu 'anhumul 'azaabu wa laa hum yunsaroon",
    "transliteration_id": "Ulā'ikal-lażīnasytarawul-ḥayātad-dun-yā bil-ākhirah(ti), falā yukhaffafu ‘anhumul-‘ażābu wa lā hum yunṣarūn(a).",
    "translation_en": "Those are the ones who have bought the life of this world [in exchange] for the Hereafter, so the punishment will not be lightened for them, nor will they be aided.",
    "translation_id": "Mereka itulah orang-orang yang membeli kehidupan dunia dengan (kehidupan) akhirat. Maka, azabnya tidak akan diringankan dan mereka tidak akan ditolong."
  },
  {
    "ayat": 87,
    "arabic": "وَلَقَدْ اٰتَيْنَا مُوْسَى الْكِتٰبَ وَقَفَّيْنَا مِنْۢ بَعْدِهٖ بِالرُّسُلِ ۖ وَاٰتَيْنَا عِيْسَى ابْنَ مَرْيَمَ الْبَيِّنٰتِ وَاَيَّدْنٰهُ بِرُوْحِ الْقُدُسِۗ  اَفَكُلَّمَا جَاۤءَكُمْ رَسُوْلٌۢ بِمَا لَا تَهْوٰىٓ اَنْفُسُكُمُ اسْتَكْبَرْتُمْ ۚ فَفَرِيْقًا كَذَّبْتُمْ وَفَرِيْقًا تَقْتُلُوْنَ",
    "transliteration_en": "Wa laqad aatainaa Moosal Kitaaba wa qaffainaa mim ba'dihee bir Rusuli wa aatainaa 'Eesab-na-Maryamal baiyinaati wa ayyadnaahu bi Roohil Qudus; afakullamaa jaaa'akum Rasoolum bimaa laa tahwaaa anfusukumus takbartum fafareeqan kazzabtum wa fareeqan taqtuloon",
    "transliteration_id": "Wa laqad ātainā mūsal-kitāba wa qaffainā mim ba‘dihī bir-rusul(i), wa ātainā ‘īsabna maryamal-bayyināti wa ayyadnāhu birūḥil-qudus(i), afakullamā jā'akum rasūlum bimā lā tahwā anfusukumustakbartum, fafarīqan każżabtum wa farīqan taqtulūn(a).",
    "translation_en": "And We did certainly give Moses the Torah and followed up after him with messengers. And We gave Jesus, the son of Mary, clear proofs and supported him with the Pure Spirit. But is it [not] that every time a messenger came to you, [O Children of Israel], with what your souls did not desire, you were arrogant? And a party [of messengers] you denied and another party you killed.",
    "translation_id": "Sungguh, Kami benar-benar telah menganugerahkan Kitab (Taurat) kepada Musa dan Kami menyusulkan setelahnya rasul-rasul. Kami juga telah menganugerahkan kepada Isa, putra Maryam, bukti-bukti kebenaran, serta Kami perkuat dia dengan Ruhulkudus (Jibril). Mengapa setiap kali rasul datang kepadamu (membawa) sesuatu (pelajaran) yang tidak kamu inginkan, kamu menyombongkan diri? Lalu, sebagian(-nya) kamu dustakan dan sebagian (yang lain) kamu bunuh?"
  },
  {
    "ayat": 88,
    "arabic": "وَقَالُوْا قُلُوْبُنَا غُلْفٌ ۗ بَلْ لَّعَنَهُمُ اللّٰهُ بِكُفْرِهِمْ فَقَلِيْلًا مَّا يُؤْمِنُوْنَ",
    "transliteration_en": "Wa qaaloo quloobunaa ghulf; bal la'anahumul laahu bikufrihim faqaleelam maa yu'minoon",
    "transliteration_id": "Wa qālū qulūbunā gulf(un), bal la‘anahumullāhu bikufrihim faqalīlam mā yu'minūn(a).",
    "translation_en": "And they said, \"Our hearts are wrapped.\" But, [in fact], Allah has cursed them for their disbelief, so little is it that they believe.",
    "translation_id": "Mereka berkata, “Hati kami tertutup.” Tidak! Allah telah melaknat mereka itu karena keingkaran mereka, tetapi sedikit sekali mereka yang beriman."
  },
  {
    "ayat": 89,
    "arabic": "وَلَمَّا جَاۤءَهُمْ كِتٰبٌ مِّنْ عِنْدِ اللّٰهِ مُصَدِّقٌ لِّمَا مَعَهُمْۙ وَكَانُوْا مِنْ قَبْلُ يَسْتَفْتِحُوْنَ عَلَى الَّذِيْنَ كَفَرُوْاۚ فَلَمَّا جَاۤءَهُمْ مَّا عَرَفُوْا كَفَرُوْا بِهٖ ۖ فَلَعْنَةُ اللّٰهِ عَلَى الْكٰفِرِيْنَ",
    "transliteration_en": "Wa lammaa jaaa'ahum Kitaabum min 'indil laahi musaddiqul limaa ma'ahum wa kaanoo min qablu yastaftihoona 'alal lazeena kafaroo falammaa jaaa'ahum maa 'arafoo kafaroo bih; fala 'natul laahi 'alal kaafireen",
    "transliteration_id": "Wa lammā jā'akum kitābum min ‘indillāhi muṣaddiqul limā ma‘ahum, wa kānū min qablu yastaftiḥūna ‘alal-lażīna kafarū, falammā jā'ahum mā ‘arafū kafarū bih(ī), fala‘natullāhi ‘alal-kāfirīn(a).",
    "translation_en": "And when there came to them a Book from Allah confirming that which was with them - although before they used to pray for victory against those who disbelieved - but [then] when there came to them that which they recognized, they disbelieved in it; so the curse of Allah will be upon the disbelievers.",
    "translation_id": "Setelah sampai kepada mereka Kitab (Al-Qur’an) dari Allah yang membenarkan apa yang ada pada mereka, sedangkan sebelumnya mereka memohon kemenangan atas orang-orang kafir, ternyata setelah sampai kepada mereka apa yang telah mereka ketahui itu, mereka mengingkarinya. Maka, laknat Allahlah terhadap orang-orang yang ingkar."
  },
  {
    "ayat": 90,
    "arabic": "بِئْسَمَا اشْتَرَوْا بِهٖٓ اَنْفُسَهُمْ اَنْ يَّكْفُرُوْا بِمَآ اَنْزَلَ اللّٰهُ بَغْيًا اَنْ يُّنَزِّلَ اللّٰهُ مِنْ فَضْلِهٖ عَلٰى مَنْ يَّشَاۤءُ مِنْ عِبَادِهٖ ۚ فَبَاۤءُوْ بِغَضَبٍ عَلٰى غَضَبٍۗ وَلِلْكٰفِرِيْنَ عَذَابٌ مُّهِيْنٌ",
    "transliteration_en": "Bi'samash taraw biheee anfusahum ai yakfuroo bimaaa anzalal laahu baghyan ai yunazzilal laahu min fadlilhee 'alaa mai yashaaa'u min ibaadihee fabaaa'oo bighadabin 'alaa ghadab; wa lilkaafireena 'azaabum muheen",
    "transliteration_id": "Bi'samasytarau bihī anfusahum ay yakfurū bimā anzalallāhu bagyan ay yunazzilallāhu min faḍlihī ‘alā may yasyā'u min ‘ibādih(ī), fabā'ū bigaḍabin ‘alā gaḍab(in), wa lil-kāfirīna ‘ażābum muhīn(un).",
    "translation_en": "How wretched is that for which they sold themselves - that they would disbelieve in what Allah has revealed through [their] outrage that Allah would send down His favor upon whom He wills from among His servants. So they returned having [earned] wrath upon wrath. And for the disbelievers is a humiliating punishment.",
    "translation_id": "Buruk sekali (perbuatan) mereka menjual dirinya dengan mengingkari apa yang diturunkan Allah karena dengki bahwa Allah menurunkan karunia-Nya kepada siapa yang Dia kehendaki di antara hamba-hamba-Nya. Oleh karena itu, mereka menanggung kemurkaan demi kemurkaan. Kepada orang-orang kafir (ditimpakan) azab yang menghinakan."
  },
  {
    "ayat": 91,
    "arabic": "وَاِذَا قِيْلَ لَهُمْ اٰمِنُوْا بِمَآ اَنْزَلَ اللّٰهُ قَالُوْا نُؤْمِنُ بِمَآ اُنْزِلَ عَلَيْنَا وَيَكْفُرُوْنَ بِمَا وَرَاۤءَهٗ وَهُوَ الْحَقُّ مُصَدِّقًا لِّمَا مَعَهُمْ ۗ قُلْ فَلِمَ تَقْتُلُوْنَ اَنْۢبِيَاۤءَ اللّٰهِ مِنْ قَبْلُ اِنْ كُنْتُمْ مُّؤْمِنِيْنَ",
    "transliteration_en": "Wa izaa qeela lahum aaminoo bimaaa anzalal laahu qaaloo nu'minu bimaaa unzila 'alainaa wa yakfuroona bimaa waraaa'ahoo wa huwal haqqu musaddiqal limaa ma'ahum; qul falima taqtuloona Ambiyaaa'al laahi min qablu in kuntum mu'mineen",
    "transliteration_id": "Wa iżā qīla lahum āminū bimā anzalallāhu qālū nu'minu bimā unzila ‘alainā wa yakfurūna bimā warā'ah(ū), wa huwal-ḥaqqu muṣaddiqal limā ma‘ahum, qul falima taqtulūna ambiyā'allāhi min qablu in kuntum mu'minīn(a).",
    "translation_en": "And when it is said to them, \"Believe in what Allah has revealed,\" they say, \"We believe [only] in what was revealed to us.\" And they disbelieve in what came after it, while it is the truth confirming that which is with them. Say, \"Then why did you kill the prophets of Allah before, if you are [indeed] believers?\"",
    "translation_id": "Apabila dikatakan kepada mereka, “Berimanlah pada apa yang diturunkan Allah (Al-Qur’an),” mereka menjawab, “Kami beriman pada apa yang diturunkan kepada kami.” Mereka ingkar pada apa yang setelahnya, padahal (Al-Qur’an) itu adalah kebenaran yang membenarkan apa yang ada pada mereka. Katakanlah (Nabi Muhammad), “Mengapa kamu dahulu membunuh nabi-nabi Allah jika kamu orang-orang mukmin?”"
  },
  {
    "ayat": 92,
    "arabic": "۞ وَلَقَدْ جَاۤءَكُمْ مُّوْسٰى بِالْبَيِّنٰتِ ثُمَّ اتَّخَذْتُمُ الْعِجْلَ مِنْۢ بَعْدِهٖ وَاَنْتُمْ ظٰلِمُوْنَ",
    "transliteration_en": "Wa laqad jaaa'akum Moosa bilbaiyinaati summat takhaztunmul 'ijla mim ba'dihee wa antum zaalimoon",
    "transliteration_id": "Wa laqad jā'akum mūsā bil-bayyināti ṡummattakhażtumul-‘ijla mim ba‘dihī wa antum ẓālimūn(a).",
    "translation_en": "And Moses had certainly brought you clear proofs. Then you took the calf [in worship] after that, while you were wrongdoers.",
    "translation_id": "Sungguh, Musa benar-benar telah datang kepadamu dengan bukti-bukti kebenaran. Kemudian, kamu mengambil (patung) anak sapi (sebagai sembahan) setelah (kepergian)-nya dan kamu (menjadi) orang-orang zalim."
  },
  {
    "ayat": 93,
    "arabic": "وَاِذْ اَخَذْنَا مِيْثَاقَكُمْ وَرَفَعْنَا فَوْقَكُمُ الطُّوْرَۗ خُذُوْا مَآ اٰتَيْنٰكُمْ بِقُوَّةٍ وَّاسْمَعُوْا ۗ قَالُوْا سَمِعْنَا وَعَصَيْنَا وَاُشْرِبُوْا فِيْ قُلُوْبِهِمُ الْعِجْلَ بِكُفْرِهِمْ ۗ قُلْ بِئْسَمَا يَأْمُرُكُمْ بِهٖٓ اِيْمَانُكُمْ اِنْ كُنْتُمْ مُّؤْمِنِيْنَ",
    "transliteration_en": "Wa iz akhaznaa meesaaqakum wa rafa'naa fawqa kumut Toora khuzoo maaa aatainaakum biquwwatinw wasma'oo qaaloo sami'naa wa 'asainaa wa ushriboo fee quloobihimul 'ijla bikufrihim; qul bi'samaa yaamurukum biheee eemaanukum in kuntum m'mineen",
    "transliteration_id": "Wa iż akhażnā mīṡāqakum wa rafa‘nā fauqakumuṭ-ṭūr(a), khużū mā ātainākum biquwwatiw wasma‘ū, qālū sami‘nā wa ‘aṣainā, wa usyribū fī qulūbihimul-‘ijla bikufrihim, qul bi'samā ya'murukum bihī īmānukum in kuntum mu'minīn(a).",
    "translation_en": "And [recall] when We took your covenant and raised over you the mount, [saying], \"Take what We have given you with determination and listen.\" They said [instead], \"We hear and disobey.\" And their hearts absorbed [the worship of] the calf because of their disbelief. Say, \"How wretched is that which your faith enjoins upon you, if you should be believers.\"",
    "translation_id": "(Ingatlah) ketika Kami mengambil janjimu dan Kami angkat gunung (Sinai) di atasmu (seraya berfirman), “Pegang teguhlah apa yang Kami berikan kepadamu dan dengarkanlah!” Mereka menjawab, “Kami mendengarkannya, tetapi kami tidak menaatinya.” Diresapkanlah ke dalam hati mereka itu (kecintaan menyembah patung) anak sapi karena kekufuran mereka. Katakanlah, “Sangat buruk apa yang diperintahkan oleh keimananmu kepadamu jika kamu orang-orang mukmin!”"
  },
  {
    "ayat": 94,
    "arabic": "قُلْ اِنْ كَانَتْ لَكُمُ الدَّارُ الْاٰخِرَةُ عِنْدَ اللّٰهِ خَالِصَةً مِّنْ دُوْنِ النَّاسِ فَتَمَنَّوُا الْمَوْتَ اِنْ كُنْتُمْ صٰدِقِيْنَ",
    "transliteration_en": "Qul in kaanat lakumud Daarul Aakhiratu 'indal laahi khaalisatam min doonin naasi fatamannawul mawta in kuntum saadiqeen",
    "transliteration_id": "Qul in kānat lakumud-dārul-ākhiratu ‘indallāhi khāliṣatam min dūnin-nāsi fatamannawul-mauta in kuntum ṣādiqīn(a).",
    "translation_en": "Say, [O Muhammad], \"If the home of the Hereafter with Allah is for you alone and not the [other] people, then wish for death, if you should be truthful.",
    "translation_id": "Katakanlah (Nabi Muhammad), “Jika negeri akhirat di sisi Allah khusus untukmu, bukan untuk orang lain, mintalah kematian jika kamu orang-orang benar.”"
  },
  {
    "ayat": 95,
    "arabic": "وَلَنْ يَّتَمَنَّوْهُ اَبَدًاۢ بِمَا قَدَّمَتْ اَيْدِيْهِمْ ۗ وَاللّٰهُ عَلِيْمٌ ۢ بِالظّٰلِمِيْنَ",
    "transliteration_en": "Wa lai yatamannawhu abadam bimaa qaddamat aydeehim; wallaahu 'aleemum bizzaalimeen",
    "transliteration_id": "Wa lay yatamannauhu abadam bima qaddamat aidīhim, wallāhu ‘alīmum biẓ-ẓālimīn(a).",
    "translation_en": "But they will never wish for it, ever, because of what their hands have put forth. And Allah is Knowing of the wrongdoers.",
    "translation_id": "Akan tetapi, mereka tidak akan menginginkan kematian itu sama sekali karena (dosa-dosa) yang telah dilakukan oleh tangan-tangan mereka. Allah Maha Mengetahui orang-orang zalim."
  },
  {
    "ayat": 96,
    "arabic": "وَلَتَجِدَنَّهُمْ اَحْرَصَ النَّاسِ عَلٰى حَيٰوةٍ ۛوَمِنَ الَّذِيْنَ اَشْرَكُوْا ۛيَوَدُّ اَحَدُهُمْ لَوْ يُعَمَّرُ اَلْفَ سَنَةٍۚ وَمَا هُوَ بِمُزَحْزِحِهٖ مِنَ الْعَذَابِ اَنْ يُّعَمَّرَۗ وَاللّٰهُ بَصِيْرٌۢ بِمَا يَعْمَلُوْنَ ࣖ",
    "transliteration_en": "Wa latajidannahum ahrasannaasi 'alaa hayaatinw wa minal lazeena ashrakoo; yawaddu ahaduhum law yu'ammaru alfa sanatinw wa maa huwa bi muzahzihihee minal 'azaabi ai yu'ammar; wallaahu baseerum bimaa ya'maloon",
    "transliteration_id": "Wa latajidannahum aḥraṣan-nāsi ‘alā ḥayāh(tin), wa minal-lażīna asyrakū, yawaddu aḥaduhum lau yu‘ammaru alfa sanah(tin), wa mā huwa bi muzaḥziḥihī minal-‘ażābi ay yu‘ammar(a), wallāhu baṣīrum bimā ya‘malūn(a).",
    "translation_en": "And you will surely find them the most greedy of people for life - [even] more than those who associate others with Allah. One of them wishes that he could be granted life a thousand years, but it would not remove him in the least from the [coming] punishment that he should be granted life. And Allah is Seeing of what they do.",
    "translation_id": "Engkau (Nabi Muhammad) sungguh-sungguh akan mendapati mereka (orang-orang Yahudi) sebagai manusia yang paling tamak akan kehidupan (dunia), bahkan (lebih tamak) daripada orang-orang musyrik. Tiap-tiap orang (dari) mereka ingin diberi umur seribu tahun, padahal umur panjang itu tidak akan menjauhkan mereka dari azab. Allah Maha Melihat apa yang mereka kerjakan."
  },
  {
    "ayat": 97,
    "arabic": "قُلْ مَنْ كَانَ عَدُوًّا لِّجِبْرِيْلَ فَاِنَّهٗ نَزَّلَهٗ عَلٰى قَلْبِكَ بِاِذْنِ اللّٰهِ مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ وَهُدًى وَّبُشْرٰى لِلْمُؤْمِنِيْنَ",
    "transliteration_en": "Qul man kaana 'aduwwal li Jibreela fainnahoo nazzalahoo 'alaa qalbika bi iznil laahi musaddiqal limaa baina yadihi wa hudanw wa bushraa lilmu'mineen",
    "transliteration_id": "Qul man kāna ‘aduwwal lijibrīla fa'innahū nazzalahū ‘alā qalbika bi iżnillāhi muṣaddiqal limā baina yadaihi wa hudaw wa busyrā lil-mu'minīn(a).",
    "translation_en": "Say, \"Whoever is an enemy to Gabriel - it is [none but] he who has brought the Qur'an down upon your heart, [O Muhammad], by permission of Allah, confirming that which was before it and as guidance and good tidings for the believers.\"",
    "translation_id": "Katakanlah (Nabi Muhammad), “Siapa yang menjadi musuh Jibril?” Padahal, dialah yang telah menurunkan (Al-Qur’an) ke dalam hatimu dengan izin Allah sebagai pembenaran terhadap apa (kitab-kitab) yang terdahulu, dan petunjuk serta berita gembira bagi orang-orang beriman.”"
  },
  {
    "ayat": 98,
    "arabic": "مَنْ كَانَ عَدُوًّا لِّلّٰهِ وَمَلٰۤىِٕكَتِهٖ وَرُسُلِهٖ وَجِبْرِيْلَ وَمِيْكٰىلَ فَاِنَّ اللّٰهَ عَدُوٌّ لِّلْكٰفِرِيْنَ",
    "transliteration_en": "Man kaana 'aduwwal lillaahi wa malaaa'ikatihee wa Rusulihee wa Jibreela wa Meekaala fa innal laaha 'aduwwul lilkaafireen",
    "transliteration_id": "Man kāna ‘aduwwal lillāhi wa malā'ikatihī wa rusulihī wa jibrīla wa mīkāla fa innallāha ‘aduwwul lil-kāfirīn(a).",
    "translation_en": "Whoever is an enemy to Allah and His angels and His messengers and Gabriel and Michael - then indeed, Allah is an enemy to the disbelievers.",
    "translation_id": "Siapa yang menjadi musuh Allah, malaikat-malaikat-Nya, rasul-rasul-Nya, Jibril, dan Mikail, sesungguhnya Allah adalah musuh orang-orang kafir."
  },
  {
    "ayat": 99,
    "arabic": "وَلَقَدْ اَنْزَلْنَآ اِلَيْكَ اٰيٰتٍۢ بَيِّنٰتٍۚ وَمَا يَكْفُرُ بِهَآ اِلَّا الْفٰسِقُوْنَ",
    "transliteration_en": "Wa laqad anzalnaaa ilaika Aayaatim baiyinaatinw wa maa yakfuru bihaaa illal faasiqoon",
    "transliteration_id": "Wa laqad anzalnā ilaika āyātim bayyināt(in), wa mā yakfuru bihā illal-fāsiqūn(a).",
    "translation_en": "And We have certainly revealed to you verses [which are] clear proofs, and no one would deny them except the defiantly disobedient.",
    "translation_id": "Sungguh, Kami benar-benar telah menurunkan ayat-ayat yang jelas kepadamu (Nabi Muhammad), dan tidaklah ada yang mengingkarinya selain orang-orang fasik."
  },
  {
    "ayat": 100,
    "arabic": "اَوَكُلَّمَا عٰهَدُوْا عَهْدًا نَّبَذَهٗ فَرِيْقٌ مِّنْهُمْ ۗ بَلْ اَكْثَرُهُمْ لَا يُؤْمِنُوْنَ",
    "transliteration_en": "Awa kullamaa 'aahadoo ahdan nabazahoo fareequm minhum; bal aksaruhum laa u'minoon",
    "transliteration_id": "Awa kullamā ‘āhadū ‘ahdan nabażahū farīqum minhum, bal akṡaruhum lā yu'minūn(a).",
    "translation_en": "Is it not [true] that every time they took a covenant a party of them threw it away? But, [in fact], most of them do not believe.",
    "translation_id": "Mengapa setiap kali mereka mengikat janji, sekelompok mereka melanggarnya? Bahkan, sebagian besar mereka tidak beriman."
  }
]