[
  {
    "ayat": 251,
    "arabic": "فَهَزَمُوْهُمْ بِاِذْنِ اللّٰهِ  ۗوَقَتَلَ دَاوٗدُ جَالُوْتَ وَاٰتٰىهُ اللّٰهُ الْمُلْكَ وَالْحِكْمَةَ وَعَلَّمَهٗ مِمَّا يَشَاۤءُ ۗ وَلَوْلَا دَفْعُ اللّٰهِ النَّاسَ بَعْضَهُمْ بِبَعْضٍ لَّفَسَدَتِ الْاَرْضُ وَلٰكِنَّ اللّٰهَ ذُوْ فَضْلٍ عَلَى الْعٰلَمِيْنَ",
    "transliteration_en": "Fahazamoohum bi iznillaahi wa qatala Daawoodu jaaloota wa aataahul laahulmulka Wal Hikmata wa 'allamahoo mimmaa yashaaa'; wa law laa daf'ullaahin naasa ba'dahum biba'dil lafasadatil ardu wa laakinnal laaha zoo fadlin 'alal'aalameen",
    "transliteration_id": "Fahazamūhum bi'iżnillāh(i), wa qatala dāwūdu jālūta wa ātāhullāhul-mulka wal-ḥikmata wa ‘allamahū mimmā yasyā'(u), wa lau lā daf‘ullāhin-nāsa ba‘ḍahum biba‘ḍil lafasadatil-arḍu wa lākinnallāha żū faḍlin ‘alal-‘ālamīn(a).",
    "translation_en": "So they defeated them by permission of Allah, and David killed Goliath, and Allah gave him the kingship and prophethood and taught him from that which He willed. And if it were not for Allah checking [some] people by means of others, the earth would have been corrupted, but Allah is full of bounty to the worlds.",
    "translation_id": "Mereka (tentara Talut) mengalahkan tentara Jalut dengan izin Allah dan Daud membunuh Jalut. Kemudian, Allah menganugerahinya (Daud) kerajaan dan hikmah (kenabian); Dia (juga) mengajarinya apa yang Dia kehendaki. Seandainya Allah tidak menolak (keganasan) sebagian manusia dengan sebagian yang lain, niscaya rusaklah bumi ini. Akan tetapi, Allah mempunyai karunia (yang dilimpahkan-Nya) atas seluruh alam."
  },
  {
    "ayat": 252,
    "arabic": "تِلْكَ اٰيٰتُ اللّٰهِ نَتْلُوْهَا عَلَيْكَ بِالْحَقِّ ۗ وَاِنَّكَ لَمِنَ الْمُرْسَلِيْنَ  ۔",
    "transliteration_en": "Tilka Aayaatul laahi natloohaa 'alaika bilhaqq; wa innaka laminal mursaleen",
    "transliteration_id": "Tilka āyātullāhi natlūhā ‘alaika bil-ḥaqq(i), wa innaka laminal-mursalīn(a).",
    "translation_en": "These are the verses of Allah which We recite to you, [O Muhammad], in truth. And indeed, you are from among the messengers.",
    "translation_id": "Itulah ayat-ayat Allah. Kami membacakannya kepadamu (Nabi Muhammad) dengan benar. Sesungguhnya engkau benar-benar termasuk di antara para rasul."
  },
  {
    "ayat": 253,
    "arabic": "۞ تِلْكَ الرُّسُلُ فَضَّلْنَا بَعْضَهُمْ عَلٰى بَعْضٍۘ مِنْهُمْ مَّنْ كَلَّمَ اللّٰهُ وَرَفَعَ بَعْضَهُمْ دَرَجٰتٍۗ وَاٰتَيْنَا عِيْسَى ابْنَ مَرْيَمَ الْبَيِّنٰتِ وَاَيَّدْنٰهُ بِرُوْحِ الْقُدُسِۗ وَلَوْ شَاۤءَ اللّٰهُ مَا اقْتَتَلَ الَّذِيْنَ مِنْۢ بَعْدِهِمْ مِّنْۢ بَعْدِ مَا جَاۤءَتْهُمُ الْبَيِّنٰتُ وَلٰكِنِ اخْتَلَفُوْا فَمِنْهُمْ مَّنْ اٰمَنَ وَمِنْهُمْ مَّنْ كَفَرَ ۗوَلَوْ شَاۤءَ اللّٰهُ مَا اقْتَتَلُوْاۗ وَلٰكِنَّ اللّٰهَ يَفْعَلُ مَا يُرِيْدُ ࣖ",
    "transliteration_en": "Tilkar Rusulu faddalnaa ba'dahum 'alaa ba'd; minhum man kallamal laahu wa rafa'a ba'dahum darajaat; wa aatainaa 'Eesab na Maryamal baiyinaati wa ayyadnaahu bi Roohil Qudus; wa law shaaa'al laahu maqtatalal lazeena mimba'dihim mim ba'di maa jaaa'athumul baiyinaatu wa laakinikh talafoo faminhum man aamana wa minhum man kafar; wa law shaaa'al laahu maq tataloo wa laakinnallaaha yaf'alu maa yureed (",
    "transliteration_id": "Tilkar-rusulu faḍḍalnā ba‘ḍahum ‘alā ba‘ḍ(in), minhum man kallamallāhu wa rafa‘a ba‘ḍahum darajāt(in), wa ātainā ‘īsabna maryamal-bayyināti wa ayyadnāhu birūḥil-qudus(i), wa lau syā'allāhu maqtatalal-lażīna mim ba‘dihim mim ba‘di mā jā'athumul-bayyinātu wa lākinikhtalafū fa minhum man āmana wa minhum man kafar(a),  wa lau syā'allāhu maqtatalū, wa lākinnallāha yaf‘alu mā yurīd(u).",
    "translation_en": "Those messengers - some of them We caused to exceed others. Among them were those to whom Allah spoke, and He raised some of them in degree. And We gave Jesus, the Son of Mary, clear proofs, and We supported him with the Pure Spirit. If Allah had willed, those [generations] succeeding them would not have fought each other after the clear proofs had come to them. But they differed, and some of them believed and some of them disbelieved. And if Allah had willed, they would not have fought each other, but Allah does what He intends.",
    "translation_id": "Para rasul itu Kami lebihkan sebagian mereka atas sebagian (yang lain). Di antara mereka ada yang Allah berbicara (langsung) dengannya dan sebagian lagi Dia tinggikan beberapa derajat. Kami telah menganugerahkan kepada Isa putra Maryam bukti-bukti yang sangat jelas (mukjizat) dan Kami memperkuat dia dengan Ruhulkudus (Jibril). Seandainya Allah menghendaki, niscaya orang-orang setelah mereka tidak akan saling membunuh setelah bukti-bukti sampai kepada mereka. Akan tetapi, mereka berselisih sehingga ada di antara mereka yang beriman dan ada (pula) yang kufur. Andaikata Allah menghendaki, tidaklah mereka saling membunuh. Namun, Allah melakukan apa yang Dia kehendaki."
  },
  {
    "ayat": 254,
    "arabic": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْٓا اَنْفِقُوْا مِمَّا رَزَقْنٰكُمْ مِّنْ قَبْلِ اَنْ يَّأْتِيَ يَوْمٌ لَّا بَيْعٌ فِيْهِ وَلَا خُلَّةٌ وَّلَا شَفَاعَةٌ  ۗوَالْكٰفِرُوْنَ هُمُ الظّٰلِمُوْنَ",
    "transliteration_en": "Yaa ayyuhal lazeena aamanoo anfiqoo mimmaa razaqnaakum min qabli ai yaatiya yawmul laa bai'un fee wa la khullatunw wa laa shafaa'ah; walkaa firoona humuz zaalimoon",
    "transliteration_id": "Yā ayyuhal-lażīna āmanū anfiqū mimmā razaqnākum min qabli ay ya'tiya yaumul lā bai‘un fīhi wa lā khullatuw wa lā syafā‘ah(tun), wal-kāfirūna humuẓ-ẓālimūn(a).",
    "translation_en": "O you who have believed, spend from that which We have provided for you before there comes a Day in which there is no exchange and no friendship and no intercession. And the disbelievers - they are the wrongdoers.",
    "translation_id": "Wahai orang-orang yang beriman, infakkanlah sebagian dari rezeki yang telah Kami anugerahkan kepadamu sebelum datang hari (Kiamat) yang tidak ada (lagi) jual beli padanya (hari itu), tidak ada juga persahabatan yang akrab, dan tidak ada pula syafaat. Orang-orang kafir itulah orang-orang zalim."
  },
  {
    "ayat": 255,
    "arabic": "اَللّٰهُ لَآ اِلٰهَ اِلَّا هُوَۚ اَلْحَيُّ الْقَيُّوْمُ ەۚ لَا تَأْخُذُهٗ سِنَةٌ وَّلَا نَوْمٌۗ  لَهٗ مَا فِى السَّمٰوٰتِ وَمَا فِى الْاَرْضِۗ مَنْ ذَا الَّذِيْ يَشْفَعُ عِنْدَهٗٓ اِلَّا بِاِذْنِهٖۗ يَعْلَمُ مَا بَيْنَ اَيْدِيْهِمْ وَمَا خَلْفَهُمْۚ وَلَا يُحِيْطُوْنَ بِشَيْءٍ مِّنْ عِلْمِهٖٓ اِلَّا بِمَا شَاۤءَۚ وَسِعَ كُرْسِيُّهُ السَّمٰوٰتِ وَالْاَرْضَۚ وَلَا يَـُٔوْدُهٗ حِفْظُهُمَاۚ وَهُوَ الْعَلِيُّ الْعَظِيْمُ",
    "transliteration_en": "Allahu laaa ilaaha illaa Huwal Haiyul Qaiyoom; laa taakhuzuhoo sinatunw wa laa nawm; lahoo maa fissamaawaati wa maa fil ard; man zal lazee yashfa'u indahooo illaa bi-iznih; ya'lamu maa baina aydeehim wa mww khalfahum wa laa yuheetoona bishai'im min 'ilmihee illaa bimaa shaaa'; wasi'a Kursiyyuhus samaawaati wal arda wa laa ya'ooduho hifzuhumaa; wa Huwal Aliyyul 'Azeem",
    "transliteration_id": "Allāhu lā ilāha illā huw(a), al-ḥayyul-qayyūm(u), lā ta'khużuhū sinatuw wa lā naum(un), lahū mā fis-samāwāti wa mā fil-arḍ(i), man żal-lażī yasyfa‘u ‘indahū illā bi'iżnih(ī), ya‘lamu mā baina aidīhim wa mā khalfahum, wa lā yuḥīṭūna bisyai'im min ‘ilmihī illā bimā syā'(a), wasi‘a kursiyyuhus-samāwāti wal-arḍ(a), wa lā ya'ūduhū ḥifẓuhumā, wa huwal-‘aliyyul-‘aẓīm(u).",
    "translation_en": "Allah - there is no deity except Him, the Ever-Living, the Sustainer of [all] existence. Neither drowsiness overtakes Him nor sleep. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except by His permission? He knows what is [presently] before them and what will be after them, and they encompass not a thing of His knowledge except for what He wills. His Kursi extends over the heavens and the earth, and their preservation tires Him not. And He is the Most High, the Most Great.",
    "translation_id": "Allah, tidak ada tuhan selain Dia, Yang Maha Hidup lagi terus-menerus mengurus (makhluk-Nya). Dia tidak dilanda oleh kantuk dan tidak (pula) oleh tidur. Milik-Nyalah apa yang ada di langit dan apa yang ada di bumi. Tidak ada yang dapat memberi syafaat di sisi-Nya tanpa izin-Nya. Dia mengetahui apa yang ada di hadapan mereka dan apa yang ada di belakang mereka. Mereka tidak mengetahui sesuatu apa pun dari ilmu-Nya, kecuali apa yang Dia kehendaki. Kursi-Nya (ilmu dan kekuasaan-Nya) meliputi langit dan bumi. Dia tidak merasa berat memelihara keduanya. Dialah yang Maha Tinggi lagi Maha Agung."
  },
  {
    "ayat": 256,
    "arabic": "لَآ اِكْرَاهَ فِى الدِّيْنِۗ  قَدْ تَّبَيَّنَ الرُّشْدُ مِنَ الْغَيِّ ۚ فَمَنْ يَّكْفُرْ بِالطَّاغُوْتِ وَيُؤْمِنْۢ بِاللّٰهِ فَقَدِ اسْتَمْسَكَ بِالْعُرْوَةِ الْوُثْقٰى لَا انْفِصَامَ لَهَا ۗوَاللّٰهُ سَمِيْعٌ عَلِيْمٌ",
    "transliteration_en": "Laaa ikraaha fid deeni qat tabiyanar rushdu minal ghayy; famai yakfur bit Taaghooti wa yu'mim billaahi faqadis tamsaka bil'urwatil wusqaa lan fisaama lahaa; wallaahu Samee'un 'Aleem",
    "transliteration_id": "Lā ikrāha fid-dīn(i), qat tabayyanar-rusydu minal-gayy(i), famay yakfur biṭ-ṭāgūti wa yu'mim billāhi fa qadistamsaka bil-‘urwatil-wuṡqā, lanfiṣāma lahā, wallāhu samī‘un ‘alīm(un).",
    "translation_en": "There shall be no compulsion in [acceptance of] the religion. The right course has become clear from the wrong. So whoever disbelieves in Taghut and believes in Allah has grasped the most trustworthy handhold with no break in it. And Allah is Hearing and Knowing.",
    "translation_id": "Tidak ada paksaan dalam (menganut) agama (Islam). Sungguh, telah jelas jalan yang benar dari jalan yang sesat. Siapa yang ingkar kepada tagut dan beriman kepada Allah sungguh telah berpegang teguh pada tali yang sangat kuat yang tidak akan putus. Allah Maha Mendengar lagi Maha Mengetahui."
  },
  {
    "ayat": 257,
    "arabic": "اَللّٰهُ وَلِيُّ الَّذِيْنَ اٰمَنُوْا يُخْرِجُهُمْ مِّنَ الظُّلُمٰتِ اِلَى النُّوْرِۗ وَالَّذِيْنَ كَفَرُوْٓا اَوْلِيَاۤؤُهُمُ الطَّاغُوْتُ يُخْرِجُوْنَهُمْ مِّنَ النُّوْرِ اِلَى الظُّلُمٰتِۗ  اُولٰۤىِٕكَ اَصْحٰبُ النَّارِۚ هُمْ فِيْهَا خٰلِدُوْنَ ࣖ",
    "transliteration_en": "Allaahu waliyyul lazeena aamanoo yukhrijuhum minaz zulumaati ilan noori wallazeena kafarooo awliyaaa'uhumut Taaghootu yukhrijoonahum minan noori ilaz zulumaat; ulaaa'ika Ashaabun Naari hum feehaa khaalidoon",
    "transliteration_id": "Allāhu waliyyul-lażīna āmanū yukhrijuhum minaẓ-ẓulumāti ilan-nūr(i), wal-lażīna kafarū auliyā'uhumuṭ-ṭāgūtu yukhrijuhum minan-nūri ilaẓ-ẓulumāt(i), ulā'ika aṣḥābun-nār(i), hum fīhā khālidūn(a).",
    "translation_en": "Allah is the ally of those who believe. He brings them out from darknesses into the light. And those who disbelieve - their allies are Taghut. They take them out of the light into darknesses. Those are the companions of the Fire; they will abide eternally therein.",
    "translation_id": "Allah adalah pelindung orang-orang yang beriman. Dia mengeluarkan mereka dari aneka kegelapan menuju cahaya (iman). Sedangkan orang-orang yang kufur, pelindung-pelindung mereka adalah tagut. Mereka (tagut) mengeluarkan mereka (orang-orang kafir itu) dari cahaya menuju aneka kegelapan. Mereka itulah para penghuni neraka. Mereka kekal di dalamnya."
  },
  {
    "ayat": 258,
    "arabic": "اَلَمْ تَرَ اِلَى الَّذِيْ حَاۤجَّ اِبْرٰهٖمَ فِيْ رَبِّهٖٓ اَنْ اٰتٰىهُ اللّٰهُ الْمُلْكَ ۘ اِذْ قَالَ اِبْرٰهٖمُ رَبِّيَ الَّذِيْ يُحْيٖ وَيُمِيْتُۙ قَالَ اَنَا۠ اُحْيٖ وَاُمِيْتُ ۗ قَالَ اِبْرٰهٖمُ فَاِنَّ اللّٰهَ يَأْتِيْ بِالشَّمْسِ مِنَ الْمَشْرِقِ فَأْتِ بِهَا مِنَ الْمَغْرِبِ فَبُهِتَ الَّذِيْ كَفَرَ ۗوَاللّٰهُ لَا يَهْدِى الْقَوْمَ الظّٰلِمِيْنَۚ",
    "transliteration_en": "Alam tara ilal lazee Haaajja Ibraaheema fee Rabbiheee an aataahullaahul mulka iz qaala Ibraaheemu Rabbiyal lazee yuhyee wa yumeetu qaala ana uhyee wa yumeetu qaala ana uhyee wa umeetu qaala Ibraaheemu fa innal laaha yaatee bishshamsi minal mashriqi faati bihaa minal maghribi fabuhital lazee kafar; wallaahu laa yahdil qawmaz zaalimeen",
    "transliteration_id": "Alam tara ilal-lażī ḥājja ibrāhīma fī rabbihī an ātāhullāhul-mulk(a), iż qāla ibrāhīmu rabbiyal-lażī yuḥyī wa yumīt(u), qāla ana uḥyī wa umīt(u), qāla ibrāhīmu fa innallāha ya'tī bisy-syamsi minal-masyriqi fa'ti bihā minal-magribi fabuhital-lażī kafar(a), wallāhu lā yahdil-qaumaẓ-ẓālimīn(a).",
    "translation_en": "Have you not considered the one who argued with Abraham about his Lord [merely] because Allah had given him kingship? When Abraham said, \"My Lord is the one who gives life and causes death,\" he said, \"I give life and cause death.\" Abraham said, \"Indeed, Allah brings up the sun from the east, so bring it up from the west.\" So the disbeliever was overwhelmed [by astonishment], and Allah does not guide the wrongdoing people.",
    "translation_id": "Tidakkah kamu memperhatikan orang yang mendebat Ibrahim mengenai Tuhannya karena Allah telah menganugerahkan kepadanya (orang itu) kerajaan (kekuasaan), (yakni) ketika Ibrahim berkata, “Tuhankulah yang menghidupkan dan mematikan.” (Orang itu) berkata, “Aku (pun) dapat menghidupkan dan mematikan.” Ibrahim berkata, “Kalau begitu, sesungguhnya Allah menerbitkan matahari dari timur. Maka, terbitkanlah ia dari barat.” Akhirnya, bingunglah orang yang kufur itu. Allah tidak memberi petunjuk kepada kaum yang zalim."
  },
  {
    "ayat": 259,
    "arabic": "اَوْ كَالَّذِيْ مَرَّ عَلٰى قَرْيَةٍ وَّهِيَ خَاوِيَةٌ عَلٰى عُرُوْشِهَاۚ قَالَ اَنّٰى يُحْيٖ هٰذِهِ اللّٰهُ بَعْدَ مَوْتِهَا ۚ فَاَمَاتَهُ اللّٰهُ مِائَةَ عَامٍ ثُمَّ بَعَثَهٗ ۗ قَالَ كَمْ لَبِثْتَ ۗ قَالَ لَبِثْتُ يَوْمًا اَوْ بَعْضَ يَوْمٍۗ قَالَ بَلْ لَّبِثْتَ مِائَةَ عَامٍ فَانْظُرْ اِلٰى طَعَامِكَ وَشَرَابِكَ لَمْ يَتَسَنَّهْ ۚ وَانْظُرْ اِلٰى حِمَارِكَۗ وَلِنَجْعَلَكَ اٰيَةً لِّلنَّاسِ وَانْظُرْ اِلَى الْعِظَامِ كَيْفَ نُنْشِزُهَا ثُمَّ نَكْسُوْهَا لَحْمًا ۗ فَلَمَّا تَبَيَّنَ لَهٗ ۙ قَالَ اَعْلَمُ اَنَّ اللّٰهَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ",
    "transliteration_en": "Aw kallazee marra 'alaa qaryatinw wa hiya khaawiyatun 'alaa 'urooshihaa qaala annaa yuhyee haazihil laahu ba'da mawtihaa fa amaatahul laahu mi'ata 'aamin suumma ba'asahoo qaala kam labista qaala labistu yawman aw ba'da yawmin qaala bal labista mi'ata 'aamin fanzur ilaa ta'aamika wa sharaabika lam yatasannah wanzur ilaa himaarika wa linaj'alaka Aayatal linnaasi wanzur ilal'izaami kaifa nunshizuhaa summa naksoohaa lahmaa; falammaa tabiyana lahoo qaala a'lamu annal laaha 'alaakulli shai'in Qadeer",
    "transliteration_id": "Au kal-lażī marra ‘alā qaryatiw wa hiya khāwiyatun ‘alā ‘urūsyihā, qāla annā yuḥyī hāżihillāhu ba‘da mautihā, fa'amātahullāhu mi'ata ‘āmin ṡumma ba‘aṡah(ū), qāla kam labiṡt(a), qāla labiṡtu yauman au ba‘ḍa yaum(in), qāla bal labiṡta mi'ata ‘āmin fanẓur ilā ṭa‘āmika wa syarābika lam yatasannah, wanẓur ilā ḥimārik(a), wa linaj‘alaka āyatal lin-nāsi wanẓur ilal-‘iẓāmi kaifa nunsyizuhā ṡumma naksūhā laḥmā(n), falammā tabayyana lah(ū), qāla a‘lamu annallāha ‘alā kulli syai'in qadīr(un).",
    "translation_en": "Or [consider such an example] as the one who passed by a township which had fallen into ruin. He said, \"How will Allah bring this to life after its death?\" So Allah caused him to die for a hundred years; then He revived him. He said, \"How long have you remained?\" The man said, \"I have remained a day or part of a day.\" He said, \"Rather, you have remained one hundred years. Look at your food and your drink; it has not changed with time. And look at your donkey; and We will make you a sign for the people. And look at the bones [of this donkey] - how We raise them and then We cover them with flesh.\" And when it became clear to him, he said, \"I know that Allah is over all things competent.\"",
    "translation_id": "Atau, seperti orang yang melewati suatu negeri yang (bangunan-bangunannya) telah roboh menutupi (reruntuhan) atap-atapnya. Dia berkata, “Bagaimana Allah menghidupkan kembali (negeri) ini setelah kehancurannya?” Lalu, Allah mematikannya selama seratus tahun, kemudian membangkitkannya (kembali). Dia (Allah) bertanya, “Berapa lama engkau tinggal (di sini)?” Dia menjawab, “Aku tinggal (di sini) sehari atau setengah hari.” Allah berfirman, “Sebenarnya engkau telah tinggal selama seratus tahun. Lihatlah makanan dan minumanmu yang belum berubah, (tetapi) lihatlah keledaimu (yang telah menjadi tulang-belulang) dan Kami akan menjadikanmu sebagai tanda (kekuasaan Kami) bagi manusia. Lihatlah tulang-belulang (keledai itu), bagaimana Kami menyusunnya kembali, kemudian Kami membalutnya dengan daging (sehingga hidup kembali).” Maka, ketika telah nyata baginya, dia pun berkata, “Aku mengetahui bahwa Allah Maha Kuasa atas segala sesuatu.”"
  },
  {
    "ayat": 260,
    "arabic": "وَاِذْ قَالَ اِبْرٰهٖمُ رَبِّ اَرِنِيْ كَيْفَ تُحْيِ الْمَوْتٰىۗ قَالَ اَوَلَمْ تُؤْمِنْ ۗقَالَ بَلٰى وَلٰكِنْ لِّيَطْمَىِٕنَّ قَلْبِيْ ۗقَالَ فَخُذْ اَرْبَعَةً مِّنَ الطَّيْرِ فَصُرْهُنَّ اِلَيْكَ ثُمَّ اجْعَلْ عَلٰى كُلِّ جَبَلٍ مِّنْهُنَّ جُزْءًا ثُمَّ ادْعُهُنَّ يَأْتِيْنَكَ سَعْيًا ۗوَاعْلَمْ اَنَّ اللّٰهَ عَزِيْزٌ حَكِيْمٌ ࣖ",
    "transliteration_en": "Wa iz qaala Ibraaheemu Rabbi arinee kaifa tuhyil mawtaa qaala awa lam tu'min qaala balaa wa laakil liyatma'inna qalbee qaala fakhuz arab'atam minal tairi fasurhunna ilaika summaj 'al a'alaa kulli jabalim minhunna juz'an sumaad 'uhunna yaateenaka sa'yaa; wa'lam annal laaha 'Azeezun Hakeem",
    "transliteration_id": "Wa iż qāla ibrāhīmu rabbi arinī kaifa tuḥyil-mautā, qāla awalam tu'min, qāla balā wa lākil liyaṭma'inna qalbī, qāla fakhuż arba‘atam minaṭ-ṭairi faṣurhunna ilaika ṡummaj‘al ‘alā kulli jabalim minhunna  juz'an ṡummad‘uhunna ya'tīnaka sa‘yā(n), wa‘lam annallāha ‘azīzun ḥakīm(un).",
    "translation_en": "And [mention] when Abraham said, \"My Lord, show me how You give life to the dead.\" [Allah] said, \"Have you not believed?\" He said, \"Yes, but [I ask] only that my heart may be satisfied.\" [Allah] said, \"Take four birds and commit them to yourself. Then [after slaughtering them] put on each hill a portion of them; then call them - they will come [flying] to you in haste. And know that Allah is Exalted in Might and Wise.\"",
    "translation_id": "(Ingatlah) ketika Ibrahim berkata, “Ya Tuhanku, perlihatkanlah kepadaku bagaimana Engkau menghidupkan orang-orang mati.” Dia (Allah) berfirman, “Belum percayakah engkau?” Dia (Ibrahim) menjawab, “Aku percaya, tetapi agar hatiku tenang.” Dia (Allah) berfirman, “Kalau begitu, ambillah empat ekor burung, lalu dekatkanlah kepadamu (potong-potonglah). Kemudian, letakkanlah di atas setiap bukit satu bagian dari tiap-tiap burung. Selanjutnya, panggillah mereka, niscaya mereka datang kepadamu dengan segera.” Ketahuilah bahwa Allah Maha Perkasa lagi Maha Bijaksana."
  },
  {
    "ayat": 261,
    "arabic": "مَثَلُ الَّذِيْنَ يُنْفِقُوْنَ اَمْوَالَهُمْ فِيْ سَبِيْلِ اللّٰهِ كَمَثَلِ حَبَّةٍ اَنْۢبَتَتْ سَبْعَ سَنَابِلَ فِيْ كُلِّ سُنْۢبُلَةٍ مِّائَةُ حَبَّةٍ ۗ وَاللّٰهُ يُضٰعِفُ لِمَنْ يَّشَاۤءُ ۗوَاللّٰهُ وَاسِعٌ عَلِيْمٌ",
    "transliteration_en": "Masalul lazeena yunfiqoona amwaalahum fee sabeelil laahi kamasali habbatin ambatat sab'a sanaabila fee kulli sumbulatim mi'atu habbah; wallaahu yudaa'ifu limai yashaaa; wallaahu Waasi'un 'Aleem",
    "transliteration_id": "Maṡalul-lażīna yunfiqūna amwālahum fī sabīlillāhi kamaṡali ḥabbatin ambatat sab‘a sanābila fī kulli sumbulatim mi'atu ḥabbah(tin), wallāhu yuḍā‘ifu limay yasyā'(u), wallāhu wāsi‘un ‘alīm(un).",
    "translation_en": "The example of those who spend their wealth in the way of Allah is like a seed [of grain] which grows seven spikes; in each spike is a hundred grains. And Allah multiplies [His reward] for whom He wills. And Allah is all-Encompassing and Knowing.",
    "translation_id": "Perumpamaan orang-orang yang menginfakkan hartanya di jalan Allah adalah seperti (orang-orang yang menabur) sebutir biji (benih) yang menumbuhkan tujuh tangkai, pada setiap tangkai ada seratus biji. Allah melipatgandakan (pahala) bagi siapa yang Dia kehendaki. Allah Maha Luas lagi Maha Mengetahui."
  },
  {
    "ayat": 262,
    "arabic": "اَلَّذِيْنَ يُنْفِقُوْنَ اَمْوَالَهُمْ فِيْ سَبِيْلِ اللّٰهِ ثُمَّ لَا يُتْبِعُوْنَ مَآ اَنْفَقُوْا مَنًّا وَّلَآ اَذًىۙ  لَّهُمْ اَجْرُهُمْ عِنْدَ رَبِّهِمْۚ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُوْنَ",
    "transliteration_en": "Allazeena yunfiqoona amwaalahum fee sabeelillaahi summa laa yutbi'oona maaa anfaqoo mannanw wa laaa azal lahum ajruhum 'inda Rabbihim; wa laa khawfun 'alaihim wa laa hum yahzanoon",
    "transliteration_id": "Allażīna yunfiqūna amwālahum fī sabīlillāhi ṡumma lā yutbi‘ūna mā anfaqū mannaw wa lā ażā(n), lahum ajruhum ‘inda rabbihim, wa lā khaufun ‘alaihim wa lā hum yaḥzanūn(a).",
    "translation_en": "Those who spend their wealth in the way of Allah and then do not follow up what they have spent with reminders [of it] or [other] injury will have their reward with their Lord, and there will be no fear concerning them, nor will they grieve.",
    "translation_id": "Orang-orang yang menginfakkan harta mereka di jalan Allah, kemudian tidak mengiringi apa yang mereka infakkan itu dengan menyebut-nyebutnya dan menyakiti (perasaan penerima), bagi mereka pahala di sisi Tuhan mereka. Tidak ada rasa takut pada mereka dan mereka tidak bersedih."
  },
  {
    "ayat": 263,
    "arabic": "۞ قَوْلٌ مَّعْرُوْفٌ وَّمَغْفِرَةٌ خَيْرٌ مِّنْ صَدَقَةٍ يَّتْبَعُهَآ اَذًى ۗ وَاللّٰهُ غَنِيٌّ حَلِيْمٌ",
    "transliteration_en": "Qawlum ma'roofunw wa maghfiratun khairum min sadaqatiny yatba'uhaaa azaa; wallaahu Ghaniyyun Haleem",
    "transliteration_id": "Qaulum ma‘rūfuw wa magfiratun khairum min ṣadaqatiy yatba‘uhā ażā(n), wallāhu ganiyyun ḥalīm(un).",
    "translation_en": "Kind speech and forgiveness are better than charity followed by injury. And Allah is Free of need and Forbearing.",
    "translation_id": "Perkataan yang baik dan pemberian maaf itu lebih baik daripada sedekah yang diiringi tindakan yang menyakiti. Allah Maha Kaya lagi Maha Penyantun."
  },
  {
    "ayat": 264,
    "arabic": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا تُبْطِلُوْا صَدَقٰتِكُمْ بِالْمَنِّ وَالْاَذٰىۙ  كَالَّذِيْ يُنْفِقُ مَالَهٗ رِئَاۤءَ النَّاسِ وَلَا يُؤْمِنُ بِاللّٰهِ وَالْيَوْمِ الْاٰخِرِۗ  فَمَثَلُهٗ كَمَثَلِ صَفْوَانٍ عَلَيْهِ تُرَابٌ فَاَصَابَهٗ وَابِلٌ فَتَرَكَهٗ صَلْدًا ۗ  لَا يَقْدِرُوْنَ عَلٰى شَيْءٍ مِّمَّا كَسَبُوْا ۗ وَاللّٰهُ لَا يَهْدِى الْقَوْمَ الْكٰفِرِيْنَ",
    "transliteration_en": "Yaaa ayyuhal lazeena aamanoo laa tubtiloo sadaqaatikum bilmanni wal azaa kallazee yunfiqu maalahoo ri'aaa'an naasi wa laa yu'minu billaahi wal yawmil aakhiri famasaluhoo kamasali safwaanin 'alaihi turaabun fa asaabahoo waabilun fatara kahoo saldaa; laa yaqdiroona 'alaa shai'im mimmaa kasaboo; wallaahu laa yahdil qawmal kaafireen",
    "transliteration_id": "Yā ayyuhal-lażīna āmanū lā tubṭilū ṣadaqātikum bil-manni wal-ażā, kal-lażī yunfiqu mālahū ri'ā'an-nāsi wa lā yu'minu billāhi wal-yaumil-ākhir(i), fa maṡaluhū kamaṡali ṣafwānin ‘alaihi turābun fa'aṣābahū wābilun fatarakahū ṣaldā(n), lā yaqdirūna ‘alā syai'im mimmā kasabū, wallāhu lā yahdil-qaumal-kāfirīn(a).",
    "translation_en": "O you who have believed, do not invalidate your charities with reminders or injury as does one who spends his wealth [only] to be seen by the people and does not believe in Allah and the Last Day. His example is like that of a [large] smooth stone upon which is dust and is hit by a downpour that leaves it bare. They are unable [to keep] anything of what they have earned. And Allah does not guide the disbelieving people.",
    "translation_id": "Wahai orang-orang yang beriman, jangan membatalkan (pahala) sedekahmu dengan menyebut-nyebutnya dan menyakiti (perasaan penerima), seperti orang yang menginfakkan hartanya karena riya (pamer) kepada manusia, sedangkan dia tidak beriman kepada Allah dan hari Akhir. Perumpamaannya (orang itu) seperti batu licin yang di atasnya ada debu, lalu batu itu diguyur hujan lebat sehingga tinggallah (batu) itu licin kembali. Mereka tidak menguasai sesuatu pun dari apa yang mereka usahakan. Allah tidak memberi petunjuk kepada kaum kafir."
  },
  {
    "ayat": 265,
    "arabic": "وَمَثَلُ الَّذِيْنَ يُنْفِقُوْنَ اَمْوَالَهُمُ ابْتِغَاۤءَ مَرْضَاتِ اللّٰهِ وَتَثْبِيْتًا مِّنْ اَنْفُسِهِمْ كَمَثَلِ جَنَّةٍۢ بِرَبْوَةٍ اَصَابَهَا وَابِلٌ فَاٰتَتْ اُكُلَهَا ضِعْفَيْنِۚ فَاِنْ لَّمْ يُصِبْهَا وَابِلٌ فَطَلٌّ  ۗوَاللّٰهُ بِمَا تَعْمَلُوْنَ بَصِيْرٌ",
    "transliteration_en": "Wa masalul lazeena yunfiqoona amwaalahumub ti ghaaaa'a mardaatil laahi wa tasbeetam min anfusihim kamasali jannatim birabwatin asaabahaa waabilun fa aatat ukulahaa di'faini fa il lam yusibhaa waabilun fatall; wallaahu bimaa ta'maloona Baseer",
    "transliteration_id": "Wa maṡalul-lażīna yunfiqūna amwālahumubtigā'a marḍātillāhi wa taṡbītam min anfusihim kamaṡali jannatim birabwatin aṣābahā wābilun fa'ātat ukulahā ḍi‘fain(i), fa'illam yuṣibhā wābilun faṭall(un), wallāhu bimā ta‘malūna baṣīr(un).",
    "translation_en": "And the example of those who spend their wealth seeking means to the approval of Allah and assuring [reward for] themselves is like a garden on high ground which is hit by a downpour - so it yields its fruits in double. And [even] if it is not hit by a downpour, then a drizzle [is sufficient]. And Allah, of what you do, is Seeing.",
    "translation_id": "Perumpamaan orang-orang yang menginfakkan harta mereka untuk mencari rida Allah dan memperteguh jiwa mereka adalah seperti sebuah kebun di dataran tinggi yang disiram oleh hujan lebat, lalu ia (kebun itu) menghasilkan buah-buahan dua kali lipat. Jika hujan lebat tidak menyiraminya, hujan gerimis (pun memadai). Allah Maha Melihat apa yang kamu kerjakan."
  },
  {
    "ayat": 266,
    "arabic": "اَيَوَدُّ اَحَدُكُمْ اَنْ تَكُوْنَ لَهٗ جَنَّةٌ مِّنْ نَّخِيْلٍ وَّاَعْنَابٍ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُۙ  لَهٗ فِيْهَا مِنْ كُلِّ الثَّمَرٰتِۙ وَاَصَابَهُ الْكِبَرُ وَلَهٗ ذُرِّيَّةٌ ضُعَفَاۤءُۚ فَاَصَابَهَآ اِعْصَارٌ فِيْهِ نَارٌ فَاحْتَرَقَتْ ۗ  كَذٰلِكَ يُبَيِّنُ اللّٰهُ لَكُمُ الْاٰيٰتِ لَعَلَّكُمْ تَتَفَكَّرُوْنَ ࣖ",
    "transliteration_en": "Ayawaddu ahadukum an takoona lahoo jannatum min nakheelinw wa a'naabin tajree min tahtihal anhaaru lahoo feehaa min kullis samaraati wa asaabahul kibaru wa lahoo zurriyyatun du'afaaa'u fa asaabahaaa i'saarun feehi naarun fahtaraqat; kazaalika yubaiyinul laahu lakumul aayaati la'allakum tatafakkaroon",
    "transliteration_id": "Ayawaddu aḥadukum an takūna lahū jannatum min nakhīliw wa a‘nābin tajrī min taḥtihal-anhār(u), lahū fīhā min kulliṡ-ṡamarāt(i), wa aṣābahul-kibaru wa lahū żurriyyatun ḍu‘afā'(u), fa'aṣābahā i‘ṣārun fīhi nārun faḥtaraqat, każālika yubayyinullāhu lakumul-āyāti la‘allakum tatafakkarūn(a).",
    "translation_en": "Would one of you like to have a garden of palm trees and grapevines underneath which rivers flow in which he has from every fruit? But he is afflicted with old age and has weak offspring, and it is hit by a whirlwind containing fire and is burned. Thus does Allah make clear to you [His] verses that you might give thought.",
    "translation_id": "Apakah salah seorang di antara kamu ingin memiliki kebun kurma dan anggur yang mengalir di bawahnya sungai-sungai, di sana dia memiliki segala macam buah-buahan. Kemudian, datanglah masa tua, sedangkan dia memiliki keturunan yang masih kecil-kecil. Lalu, kebun itu ditiup angin kencang yang mengandung api sehingga terbakar. Demikianlah Allah menerangkan ayat-ayat-Nya kepadamu agar kamu memikirkan(-nya)."
  },
  {
    "ayat": 267,
    "arabic": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْٓا اَنْفِقُوْا مِنْ طَيِّبٰتِ مَا كَسَبْتُمْ وَمِمَّآ اَخْرَجْنَا لَكُمْ مِّنَ الْاَرْضِ ۗ وَلَا تَيَمَّمُوا الْخَبِيْثَ مِنْهُ تُنْفِقُوْنَ وَلَسْتُمْ بِاٰخِذِيْهِ اِلَّآ اَنْ تُغْمِضُوْا فِيْهِ ۗ وَاعْلَمُوْٓا اَنَّ اللّٰهَ غَنِيٌّ حَمِيْدٌ",
    "transliteration_en": "Yaaa 'ayyuhal lazeena aamanooo anfiqoo min taiyibaati maa kasabtum wa mimmaaa akhrajuaa lakum minal ardi wa laa tayammamul khabeesa minhu tunfiqoona wa lastum bi aakhizeehi illaaa an tughmidoo feeh; wa'lamooo annal laaha Ghaniyyun Hameed",
    "transliteration_id": "Yā ayyuhal-lażīna āmanū anfiqū min ṭayyibāti mā kasabtum wa mimmā akhrajnā lakum minal-arḍ(i), wa lā tayammamul-khabīṡa minhu tunfiqūna wa lastum bi'ākhiżīhi illā an tugmiḍū fīh(i), wa‘lamū annallāha ganiyyun ḥamīd(un).",
    "translation_en": "O you who have believed, spend from the good things which you have earned and from that which We have produced for you from the earth. And do not aim toward the defective therefrom, spending [from that] while you would not take it [yourself] except with closed eyes. And know that Allah is Free of need and Praiseworthy.",
    "translation_id": "Wahai orang-orang yang beriman, infakkanlah sebagian dari hasil usahamu yang baik-baik dan sebagian dari apa yang Kami keluarkan dari bumi untukmu. Janganlah kamu memilih yang buruk untuk kamu infakkan, padahal kamu tidak mau mengambilnya, kecuali dengan memicingkan mata (enggan) terhadapnya. Ketahuilah bahwa Allah Maha Kaya lagi Maha Terpuji."
  },
  {
    "ayat": 268,
    "arabic": "اَلشَّيْطٰنُ يَعِدُكُمُ الْفَقْرَ وَيَأْمُرُكُمْ بِالْفَحْشَاۤءِ ۚ وَاللّٰهُ يَعِدُكُمْ مَّغْفِرَةً مِّنْهُ وَفَضْلًا ۗ وَاللّٰهُ وَاسِعٌ عَلِيْمٌ ۖ",
    "transliteration_en": "Ash Shaitaanu ya'idukumul faqra wa yaamurukum bilfahshaaa'i wallaahu ya'idukum maghfiratam minhu wa fadlaa; wallaahu Waasi'un 'Aleem",
    "transliteration_id": "Asy-syaiṭānu ya‘idukumul-faqra wa ya'murukum bil-faḥsyā'(i), wallāhu ya‘idukum magfiratam minhu wa faḍlā(n), wallāhu wāsi'un ‘alīm(un).",
    "translation_en": "Satan threatens you with poverty and orders you to immorality, while Allah promises you forgiveness from Him and bounty. And Allah is all-Encompassing and Knowing.",
    "translation_id": "Setan menjanjikan (menakut-nakuti) kamu kemiskinan dan menyuruh kamu berbuat keji (kikir), sedangkan Allah menjanjikan kamu ampunan dan karunia-Nya. Allah Maha Luas lagi Maha Mengetahui."
  },
  {
    "ayat": 269,
    "arabic": "يُّؤْتِى الْحِكْمَةَ مَنْ يَّشَاۤءُ ۚ وَمَنْ يُّؤْتَ الْحِكْمَةَ فَقَدْ اُوْتِيَ خَيْرًا كَثِيْرًا ۗ وَمَا يَذَّكَّرُ اِلَّآ اُولُوا الْاَلْبَابِ",
    "transliteration_en": "Yu'til Hikmata mai yashaaa'; wa mai yutal Hikmata faqad ootiya khairan kaseeraa; wa maa yazzakkaru illaaa ulul albaab",
    "transliteration_id": "Yu'til-ḥikmata may yasyā'(u), wa may yu'tal-ḥikmata faqad ūtiya khairan kaṡīrā(n), wa mā yażżakkaru ilā ulul-albāb(i).",
    "translation_en": "He gives wisdom to whom He wills, and whoever has been given wisdom has certainly been given much good. And none will remember except those of understanding.",
    "translation_id": "Dia (Allah) menganugerahkan hikmah kepada siapa yang Dia kehendaki. Siapa yang dianugerahi hikmah, sungguh dia telah dianugerahi kebaikan yang banyak. Tidak ada yang dapat mengambil pelajaran (darinya), kecuali ululalbab."
  },
  {
    "ayat": 270,
    "arabic": "وَمَآ اَنْفَقْتُمْ مِّنْ نَّفَقَةٍ اَوْ نَذَرْتُمْ مِّنْ نَّذْرٍ فَاِنَّ اللّٰهَ يَعْلَمُهٗ ۗ وَمَا لِلظّٰلِمِيْنَ مِنْ اَنْصَارٍ",
    "transliteration_en": "Wa maaa anfaqtum min nafaqatin aw nazartum min nazrin fa innal laaha ya'lamuh; wa maa lizzaalimeena min ansaar",
    "transliteration_id": "Wa mā anfaqtum min nafaqatin au nażartum min nażrin fa innallāha ya‘lamuh(ū), wa mā liẓ-ẓālimīna min anṣār(in).",
    "translation_en": "And whatever you spend of expenditures or make of vows - indeed, Allah knows of it. And for the wrongdoers there are no helpers.",
    "translation_id": "Infak apa pun yang kamu berikan atau nazar apa pun yang kamu janjikan sesungguhnya Allah mengetahuinya. Bagi orang-orang zalim tidak ada satu pun penolong (dari azab Allah)."
  },
  {
    "ayat": 271,
    "arabic": "اِنْ تُبْدُوا الصَّدَقٰتِ فَنِعِمَّا هِيَۚ وَاِنْ تُخْفُوْهَا وَتُؤْتُوْهَا الْفُقَرَاۤءَ فَهُوَ خَيْرٌ لَّكُمْ ۗ وَيُكَفِّرُ عَنْكُمْ مِّنْ سَيِّاٰتِكُمْ ۗ وَاللّٰهُ بِمَا تَعْمَلُوْنَ خَبِيْرٌ",
    "transliteration_en": "In tubdus sadaqaati fani'immaa hiya wa in tukhfoohaa wa tu'toohal fuqaraaa'a fahuwa khayrul lakum; wa yukaffiru 'ankum min saiyi aatikum; wallaahu bimaa ta'maloona Khabeer",
    "transliteration_id": "In tubduṣ-ṣadaqāti fani‘immā hiy(a), wa in tukhfūhā wa tu'tūhal-fuqarā'a fahuwa khairul lakum, wa yukaffiru ‘ankum min sayyi'ātikum, wallāhu bimā ta‘malūna khabīr(un).",
    "translation_en": "If you disclose your charitable expenditures, they are good; but if you conceal them and give them to the poor, it is better for you, and He will remove from you some of your misdeeds [thereby]. And Allah, with what you do, is [fully] Acquainted.",
    "translation_id": "Jika kamu menampakkan sedekahmu, itu baik. (Akan tetapi,) jika kamu menyembunyikannya dan memberikannya kepada orang-orang fakir, itu lebih baik bagimu. Allah akan menghapus sebagian kesalahanmu. Allah Maha Teliti terhadap apa yang kamu kerjakan."
  },
  {
    "ayat": 272,
    "arabic": "۞ لَيْسَ عَلَيْكَ هُدٰىهُمْ وَلٰكِنَّ اللّٰهَ يَهْدِيْ مَنْ يَّشَاۤءُ ۗوَمَا تُنْفِقُوْا مِنْ خَيْرٍ فَلِاَنْفُسِكُمْ ۗوَمَا تُنْفِقُوْنَ اِلَّا ابْتِغَاۤءَ وَجْهِ اللّٰهِ ۗوَمَا تُنْفِقُوْا مِنْ خَيْرٍ يُّوَفَّ اِلَيْكُمْ وَاَنْتُمْ لَا تُظْلَمُوْنَ",
    "transliteration_en": "Laisa 'alaika hudaahum wa laakinnal laaha yahdee mai yashaaa'; wa maa tunfiqoo min khairin fali anfusikum; wa maa tunfiqoona illab tighaaa'a wajhil laah; wa maa tunfiqoo min khairiny yuwaffa ilaikum wa antum laa tuzlamoon",
    "transliteration_id": "Laisa ‘alaika hudāhum wa lākinnallāha yahdī may yasyā'(u), wa mā tunfiqū min khairin fa li'anfusikum, wa mā tunfiqūna illabtigā'a wajhillāh(i), wa mā tunfiqū min khairiy yuwaffa ilaikum wa antum lā tuẓlamūn(a).",
    "translation_en": "Not upon you, [O Muhammad], is [responsibility for] their guidance, but Allah guides whom He wills. And whatever good you [believers] spend is for yourselves, and you do not spend except seeking the countenance of Allah. And whatever you spend of good - it will be fully repaid to you, and you will not be wronged.",
    "translation_id": "Bukanlah kewajibanmu (Nabi Muhammad) menjadikan mereka mendapat petunjuk, tetapi Allahlah yang memberi petunjuk kepada siapa yang Dia kehendaki (berdasarkan kesiapannya untuk menerima petunjuk). Kebaikan apa pun yang kamu infakkan, (manfaatnya) untuk dirimu (sendiri). Kamu (orang-orang mukmin) tidak berinfak, kecuali karena mencari rida Allah. Kebaikan apa pun yang kamu infakkan, niscaya kamu akan diberi (pahala) secara penuh dan kamu tidak akan dizalimi."
  },
  {
    "ayat": 273,
    "arabic": "لِلْفُقَرَاۤءِ الَّذِيْنَ اُحْصِرُوْا فِيْ سَبِيْلِ اللّٰهِ لَا يَسْتَطِيْعُوْنَ ضَرْبًا فِى الْاَرْضِۖ يَحْسَبُهُمُ الْجَاهِلُ اَغْنِيَاۤءَ مِنَ التَّعَفُّفِۚ  تَعْرِفُهُمْ بِسِيْمٰهُمْۚ  لَا يَسْـَٔلُوْنَ النَّاسَ اِلْحَافًا ۗوَمَا تُنْفِقُوْا مِنْ خَيْرٍ فَاِنَّ اللّٰهَ بِهٖ عَلِيْمٌ ࣖ",
    "transliteration_en": "Lilfuqaraaa'il lazeena uhsiroo fee sabeelil laahi laa yastatee'oona darban fil ardi yah sabuhumul jaahilu aghniyaaa'a minat ta'affufi ta'rifuhum biseemaahum laa yas'aloonan naasa ilhaafaa; wa maa tunfiqoo min khairin fa innal laaha bihee 'Aleem",
    "transliteration_id": "Lil-fuqarā'il-lażīna uḥṣirū fī sabīlillāhi lā yastaṭī‘ūna ḍarban fil-arḍi yaḥsabuhumul-jāhilu  agniyā'a minat-ta‘affuf(i), ta‘rifuhum bisīmāhum, lā yas'alūnan-nāsa ilḥāfā(n), wa mā tunfiqū min khairin fa innallāha bihī ‘alīm(un).",
    "translation_en": "[Charity is] for the poor who have been restricted for the cause of Allah, unable to move about in the land. An ignorant [person] would think them self-sufficient because of their restraint, but you will know them by their [characteristic] sign. They do not ask people persistently [or at all]. And whatever you spend of good - indeed, Allah is Knowing of it.",
    "translation_id": "(Apa pun yang kamu infakkan) diperuntukkan bagi orang-orang fakir yang terhalang (usahanya karena jihad) di jalan Allah dan mereka tidak dapat berusaha di bumi. Orang yang tidak mengetahuinya mengira bahwa mereka adalah orang-orang kaya karena mereka memelihara diri dari mengemis. Engkau (Nabi Muhammad) mengenal mereka dari ciri-cirinya (karena) mereka tidak meminta secara paksa kepada orang lain. Kebaikan apa pun yang kamu infakkan, sesungguhnya Allah Maha Tahu tentang itu."
  },
  {
    "ayat": 274,
    "arabic": "اَلَّذِيْنَ يُنْفِقُوْنَ اَمْوَالَهُمْ بِالَّيْلِ وَالنَّهَارِ سِرًّا وَّعَلَانِيَةً فَلَهُمْ اَجْرُهُمْ عِنْدَ رَبِّهِمْۚ  وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُوْنَ",
    "transliteration_en": "Allazeena yunfiqoona amwaalahum billaili wan nahaari sirranw wa 'alaaniyatan falahum ajruhum 'inda Rabbihim wa laa khawfun 'alaihim wa laa hum yahzanoon",
    "transliteration_id": "Allażīna yunfiqūna amwālahum bil-laili wan-nahāri sirraw wa ‘alāniyatan falahum ajruhum ‘inda rabbihim, wa lā khaufun ‘alaihim wa lā hum yaḥzanūn(a).",
    "translation_en": "Those who spend their wealth [in Allah 's way] by night and by day, secretly and publicly - they will have their reward with their Lord. And no fear will there be concerning them, nor will they grieve.",
    "translation_id": "Orang-orang yang menginfakkan hartanya pada malam dan siang hari, baik secara rahasia maupun terang-terangan, mereka mendapat pahala di sisi Tuhannya. Tidak ada rasa takut pada mereka dan tidak (pula) mereka bersedih."
  },
  {
    "ayat": 275,
    "arabic": "اَلَّذِيْنَ يَأْكُلُوْنَ الرِّبٰوا لَا يَقُوْمُوْنَ اِلَّا كَمَا يَقُوْمُ الَّذِيْ يَتَخَبَّطُهُ الشَّيْطٰنُ مِنَ الْمَسِّۗ ذٰلِكَ بِاَنَّهُمْ قَالُوْٓا اِنَّمَا الْبَيْعُ مِثْلُ الرِّبٰواۘ وَاَحَلَّ اللّٰهُ الْبَيْعَ وَحَرَّمَ الرِّبٰواۗ  فَمَنْ جَاۤءَهٗ مَوْعِظَةٌ مِّنْ رَّبِّهٖ فَانْتَهٰى فَلَهٗ مَا سَلَفَۗ وَاَمْرُهٗٓ اِلَى اللّٰهِ ۗ وَمَنْ عَادَ فَاُولٰۤىِٕكَ اَصْحٰبُ النَّارِ ۚ هُمْ فِيْهَا خٰلِدُوْنَ",
    "transliteration_en": "Allazeena yaakuloonar ribaa laa yaqoomoona illaa kamaa yaqoomul lazee yatakhabbatuhush shaitaanu minal mass; zaalika bi annahum qaalooo innamal bai'u mishur ribaa; wa ahallal laahul bai'a wa harramar ribba; faman jaaa'ahoo maw'izatum mir rabbihee fantahaa falahoo maa salafa wa amruhooo ilal laahi wa man 'aada fa ulaaa 'ika Ashaabun naari hum feehaa khaalidoon",
    "transliteration_id": "Allażīna ya'kulūnar-ribā lā yaqūmūna illā kamā yaqūmul-lażī yatakhabbaṭuhusy-syaiṭānu minal-mass(i), żālika bi'annahum qālū innamal-bai‘u miṡlur-ribā, wa aḥallallāhul-bai‘a wa ḥarramar-ribā, faman jā'ahū mau‘iẓatum mir rabbihī fantahā falahū mā salaf(a), wa amruhū ilallāh(i), wa man ‘āda fa ulā'ika aṣḥābun-nār(i), hum fīhā khālidūn(a).",
    "translation_en": "Those who consume interest cannot stand [on the Day of Resurrection] except as one stands who is being beaten by Satan into insanity. That is because they say, \"Trade is [just] like interest.\" But Allah has permitted trade and has forbidden interest. So whoever has received an admonition from his Lord and desists may have what is past, and his affair rests with Allah. But whoever returns to [dealing in interest or usury] - those are the companions of the Fire; they will abide eternally therein.",
    "translation_id": "Orang-orang yang memakan (bertransaksi dengan) riba tidak dapat berdiri, kecuali seperti orang yang berdiri sempoyongan karena kesurupan setan. Demikian itu terjadi karena mereka berkata bahwa jual beli itu sama dengan riba. Padahal, Allah telah menghalalkan jual beli dan mengharamkan riba. Siapa pun yang telah sampai kepadanya peringatan dari Tuhannya (menyangkut riba), lalu dia berhenti sehingga apa yang telah diperolehnya dahulu menjadi miliknya dan urusannya (terserah) kepada Allah. Siapa yang mengulangi (transaksi riba), mereka itulah penghuni neraka. Mereka kekal di dalamnya."
  },
  {
    "ayat": 276,
    "arabic": "يَمْحَقُ اللّٰهُ الرِّبٰوا وَيُرْبِى الصَّدَقٰتِ ۗ وَاللّٰهُ لَا يُحِبُّ كُلَّ كَفَّارٍ اَثِيْمٍ",
    "transliteration_en": "Yamhaqul laahur ribaa wa yurbis sadaqaat; wallaahu laa yuhibbu kulla kaffaarin aseem",
    "transliteration_id": "Yamḥaqullāhur-ribā wa yurbiṣ-ṣadaqāt(i), wallāhu lā yuḥibbu kulla kaffārin aṡīm(in).",
    "translation_en": "Allah destroys interest and gives increase for charities. And Allah does not like every sinning disbeliever.",
    "translation_id": "Allah menghilangkan (keberkahan dari) riba dan menyuburkan sedekah. Allah tidak menyukai setiap orang yang sangat kufur lagi bergelimang dosa."
  },
  {
    "ayat": 277,
    "arabic": "اِنَّ الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ وَاَقَامُوا الصَّلٰوةَ وَاٰتَوُا الزَّكٰوةَ لَهُمْ اَجْرُهُمْ عِنْدَ رَبِّهِمْۚ وَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُوْنَ",
    "transliteration_en": "Innal lazeena aamanoo wa amilus saalihaati wa aqaamus salaata wa aatawuz zakaata lahum ajruhum 'inda rabbihim wa laa khawfun 'alaihim wa laa hum yahzanoon",
    "transliteration_id": "Innal-lażīna āmanū wa ‘amiluṣ-ṣāliḥāti wa aqāmuṣ-ṣalāta wa ātuz-zakāta lahum ajruhum ‘inda rabbihim, wa lā khaufun ‘alaihim wa lā hum yaḥzanūn(a).",
    "translation_en": "Indeed, those who believe and do righteous deeds and establish prayer and give zakah will have their reward with their Lord, and there will be no fear concerning them, nor will they grieve.",
    "translation_id": "Sesungguhnya orang-orang yang beriman, beramal saleh, menegakkan salat, dan menunaikan zakat, mereka mendapat pahala di sisi Tuhannya. Tidak ada rasa takut pada mereka dan tidak (pula) mereka bersedih."
  },
  {
    "ayat": 278,
    "arabic": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوا اتَّقُوا اللّٰهَ وَذَرُوْا مَا بَقِيَ مِنَ الرِّبٰوٓا اِنْ كُنْتُمْ مُّؤْمِنِيْنَ",
    "transliteration_en": "Yaaa ayyuhal lazeena aamanut taqul laaha wa zaroo maa baqiya minar ribaaa in kuntum mu'mineen",
    "transliteration_id": "Yā ayyuhal-lażīna āmanuttaqullāha wa żarū mā baqiya minar-ribā in kuntum mu'minīn(a).",
    "translation_en": "O you who have believed, fear Allah and give up what remains [due to you] of interest, if you should be believers.",
    "translation_id": "Wahai orang-orang yang beriman, bertakwalah kepada Allah dan tinggalkan sisa riba (yang belum dipungut) jika kamu orang-orang mukmin."
  },
  {
    "ayat": 279,
    "arabic": "فَاِنْ لَّمْ تَفْعَلُوْا فَأْذَنُوْا بِحَرْبٍ مِّنَ اللّٰهِ وَرَسُوْلِهٖۚ وَاِنْ تُبْتُمْ فَلَكُمْ رُءُوْسُ اَمْوَالِكُمْۚ  لَا تَظْلِمُوْنَ وَلَا تُظْلَمُوْنَ",
    "transliteration_en": "Fail lam taf'aloo faazanoo biharbim minal laahi wa Rasoolihee wa in tubtum falakum ru'oosu amwaalikum laa tazlimoona wa laa tuzlamoon",
    "transliteration_id": "Fa'illam taf‘alū fa'żanū biḥarbim minallāhi wa rasūlih(ī), wa in tubtum falakum ru'ūsu amwālikum, lā taẓlimūna wa lā tuẓlamūn(a).",
    "translation_en": "And if you do not, then be informed of a war [against you] from Allah and His Messenger. But if you repent, you may have your principal - [thus] you do no wrong, nor are you wronged.",
    "translation_id": "Jika kamu tidak melaksanakannya, ketahuilah akan terjadi perang (dahsyat) dari Allah dan Rasul-Nya. Akan tetapi, jika kamu bertobat, kamu berhak atas pokok hartamu. Kamu tidak berbuat zalim (merugikan) dan tidak dizalimi (dirugikan)."
  },
  {
    "ayat": 280,
    "arabic": "وَاِنْ كَانَ ذُوْ عُسْرَةٍ فَنَظِرَةٌ اِلٰى مَيْسَرَةٍ ۗ وَاَنْ تَصَدَّقُوْا خَيْرٌ لَّكُمْ اِنْ كُنْتُمْ تَعْلَمُوْنَ",
    "transliteration_en": "Wa in kaana zoo 'usratin fanaziratun ilaa maisarah; wa an tasaddaqoo khairul lakum in kuntum ta'lamoon",
    "transliteration_id": "Wa in kāna żū ‘usratin fanaẓiratun ilā maisarah(tin), wa an taṣaddaqū khairul lakum in kuntum ta‘lamūn(a).",
    "translation_en": "And if someone is in hardship, then [let there be] postponement until [a time of] ease. But if you give [from your right as] charity, then it is better for you, if you only knew.",
    "translation_id": "Jika dia (orang yang berutang itu) dalam kesulitan, berilah tenggang waktu sampai dia memperoleh kelapangan. Kamu bersedekah (membebaskan utang) itu lebih baik bagimu apabila kamu mengetahui(-nya)."
  },
  {
    "ayat": 281,
    "arabic": "وَاتَّقُوْا يَوْمًا تُرْجَعُوْنَ فِيْهِ اِلَى اللّٰهِ ۗثُمَّ تُوَفّٰى كُلُّ نَفْسٍ مَّا كَسَبَتْ وَهُمْ لَا يُظْلَمُوْنَ ࣖ",
    "transliteration_en": "Wattaqoo yawman turja'oona feehi ilal laahi summa tuwaffaa kullu nafsim maa kasabat wa hum laa yuzlamoon",
    "transliteration_id": "Wattaqū yauman turja‘ūna fīhi ilallāh(i), ṡumma tuwaffā kullu nafsim mā kasabat wa hum lā yuẓlamūn(a).",
    "translation_en": "And fear a Day when you will be returned to Allah. Then every soul will be compensated for what it earned, and they will not be treated unjustly.",
    "translation_id": "Waspadalah terhadap suatu hari (kiamat) yang padanya kamu semua dikembalikan kepada Allah. Kemudian, setiap orang diberi balasan yang sempurna sesuai dengan apa yang telah dilakukannya dan mereka tidak dizalimi."
  },
  {
    "ayat": 282,
    "arabic": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْٓا اِذَا تَدَايَنْتُمْ بِدَيْنٍ اِلٰٓى اَجَلٍ مُّسَمًّى فَاكْتُبُوْهُۗ وَلْيَكْتُبْ بَّيْنَكُمْ كَاتِبٌۢ بِالْعَدْلِۖ وَلَا يَأْبَ كَاتِبٌ اَنْ يَّكْتُبَ كَمَا عَلَّمَهُ اللّٰهُ فَلْيَكْتُبْۚ وَلْيُمْلِلِ الَّذِيْ عَلَيْهِ الْحَقُّ وَلْيَتَّقِ اللّٰهَ رَبَّهٗ وَلَا يَبْخَسْ مِنْهُ شَيْـًٔاۗ  فَاِنْ كَانَ الَّذِيْ عَلَيْهِ الْحَقُّ سَفِيْهًا اَوْ ضَعِيْفًا اَوْ لَا يَسْتَطِيْعُ اَنْ يُّمِلَّ هُوَ فَلْيُمْلِلْ وَلِيُّهٗ بِالْعَدْلِۗ وَاسْتَشْهِدُوْا شَهِيْدَيْنِ مِنْ رِّجَالِكُمْۚ فَاِنْ لَّمْ يَكُوْنَا رَجُلَيْنِ فَرَجُلٌ وَّامْرَاَتٰنِ مِمَّنْ تَرْضَوْنَ مِنَ الشُّهَدَۤاءِ اَنْ تَضِلَّ اِحْدٰىهُمَا فَتُذَكِّرَ اِحْدٰىهُمَا الْاُخْرٰىۗ وَلَا يَأْبَ الشُّهَدَۤاءُ اِذَا مَا دُعُوْا ۗ وَلَا تَسْـَٔمُوْٓا اَنْ تَكْتُبُوْهُ صَغِيْرًا اَوْ كَبِيْرًا اِلٰٓى اَجَلِهٖۗ ذٰلِكُمْ اَقْسَطُ عِنْدَ اللّٰهِ وَاَقْوَمُ لِلشَّهَادَةِ وَاَدْنٰىٓ اَلَّا تَرْتَابُوْٓا اِلَّآ اَنْ تَكُوْنَ تِجَارَةً حَاضِرَةً تُدِيْرُوْنَهَا بَيْنَكُمْ فَلَيْسَ عَلَيْكُمْ جُنَاحٌ اَلَّا تَكْتُبُوْهَاۗ وَاَشْهِدُوْٓا اِذَا تَبَايَعْتُمْ ۖ وَلَا يُضَاۤرَّ كَاتِبٌ وَّلَا شَهِيْدٌ ەۗ وَاِنْ تَفْعَلُوْا فَاِنَّهٗ فُسُوْقٌۢ بِكُمْ ۗ وَاتَّقُوا اللّٰهَ ۗ وَيُعَلِّمُكُمُ اللّٰهُ ۗ وَاللّٰهُ بِكُلِّ شَيْءٍ عَلِيْمٌ",
    "transliteration_en": "Yaa ayyuhal lazeena aamanoo izaa tadaayantum bidinin ilaa ajalimmusamman faktubooh; walyaktub bainakum kaatibum bil'adl; wa laa yaaba kaatibun ai yaktuba kamaa 'allamahul laah; falyaktub walyumlilil lazee 'alaihil haqqu walyattaqil laaha rabbahoo wa laa yabkhas minhu shai'aa; fa in kaanal lazee 'alaihil lhaqqu safeehan aw da'eefan aw laa yastatee'u ai yumilla huwa falyumlil waliyyuhoo bil'adl; wastash hidoo shaheedaini mir rijaalikum fa il lam yakoonaa rajulaini farajulunw wamra ataani mimman tardawna minash shuhadaaa'i an tadilla ihdaahumaa fatuzakkira ihdaahumal ukhraa; wa laa yaabash shuhadaaa'u izaa maadu'oo; wa laa tas'amooo an taktuboohu sagheeran awkabeeran ilaaa ajalih; zaalikum aqsatu 'indal laahi wa aqwamu lishshahaadati wa adnaaa allaa tartaabooo illaaa an takoona tijaaratan haadiratan tudeeroonahaa bainakum falaisa 'alaikum junaahun allaa taktuboohan; wa ashidooo izaa tabaaya'tum; wa laa yudaaarra kaatibunw wa laa shaheed; wa in taf'aloo fa innahoo fusooqum bikum; wattaqul laaha wa yu'allimu kumul laah; wallaahu bikulli shai'in 'Aleem",
    "transliteration_id": "Yā ayyuhal-lażīna āmanū iżā tadāyantum bidainin ilā ajalim musamman faktubūh(u), walyaktub bainakum kātibum bil-‘adl(i), wa lā ya'ba kātibun ay yaktuba kamā ‘allamahullāhu falyaktub, walyumlilil-lażī ‘alaihil-ḥaqqu walyattaqillāha rabbahū wa lā yabkhas minhu syai'ā(n), fa'in kānal-lażī ‘alaihil-ḥaqqu safīhan au ḍa‘īfan au lā yastaṭī‘u ay yumilla huwa falyumlil waliyyuhū bil-‘adl(i), wastasyhidū syahīdaini mir rijāliūkum, fa'illam yakūnā rajulaini farajuluw wamra'atāni mimman tarḍauna minasy-syuhadā'i an taḍilla iḥdāhumā fatużakkira iḥdāhumal-ukhrā, wa lā ya'basy-syuhadā'u iżā mā du‘ū, wa lā tas'amū an taktubūhu ṣagīran au kabīran ilā ajalih(ī), żālikum aqsaṭu ‘indallāhi wa aqwamu lisy-syahādati wa adnā allā tartābū illā an takūna tijāratan ḥāḍiratan tudīrūnahā bainakum falaisa ‘alaikum junāḥun allā taktubūhā, wa asyhidū iżā tabāya‘tum, wa lā yuḍārra kātibuw wa lā syahīd(un), wa in taf‘alū fa'innahū fusūqum bikum, wattaqullāh(a), wa yu‘allimukumullāh(u), wallāhu bikulli syai'in ‘alīm(un).",
    "translation_en": "O you who have believed, when you contract a debt for a specified term, write it down. And let a scribe write [it] between you in justice. Let no scribe refuse to write as Allah has taught him. So let him write and let the one who has the obligation dictate. And let him fear Allah, his Lord, and not leave anything out of it. But if the one who has the obligation is of limited understanding or weak or unable to dictate himself, then let his guardian dictate in justice. And bring to witness two witnesses from among your men. And if there are not two men [available], then a man and two women from those whom you accept as witnesses - so that if one of the women errs, then the other can remind her. And let not the witnesses refuse when they are called upon. And do not be [too] weary to write it, whether it is small or large, for its [specified] term. That is more just in the sight of Allah and stronger as evidence and more likely to prevent doubt between you, except when it is an immediate transaction which you conduct among yourselves. For [then] there is no blame upon you if you do not write it. And take witnesses when you conclude a contract. Let no scribe be harmed or any witness. For if you do so, indeed, it is [grave] disobedience in you. And fear Allah. And Allah teaches you. And Allah is Knowing of all things.",
    "translation_id": "Wahai orang-orang yang beriman, apabila kamu berutang piutang untuk waktu yang ditentukan, hendaklah kamu mencatatnya. Hendaklah seorang pencatat di antara kamu menuliskannya dengan benar. Janganlah pencatat menolak untuk menuliskannya sebagaimana Allah telah mengajar-kan kepadanya. Hendaklah dia mencatat(-nya) dan orang yang berutang itu mendiktekan(-nya). Hendaklah dia bertakwa kepada Allah, Tuhannya, dan janganlah dia menguranginya sedikit pun. Jika yang berutang itu orang yang kurang akalnya, lemah (keadaannya), atau tidak mampu mendiktekan sendiri, hendaklah walinya mendiktekannya dengan benar. Mintalah kesaksian dua orang saksi laki-laki di antara kamu. Jika tidak ada (saksi) dua orang laki-laki, (boleh) seorang laki-laki dan dua orang perempuan di antara orang-orang yang kamu sukai dari para saksi (yang ada) sehingga jika salah seorang (saksi perempuan) lupa, yang lain mengingatkannya. Janganlah saksi-saksi itu menolak apabila dipanggil. Janganlah kamu bosan mencatatnya sampai batas waktunya, baik (utang itu) kecil maupun besar. Yang demikian itu lebih adil di sisi Allah, lebih dapat menguatkan kesaksian, dan lebih mendekatkan kamu pada ketidakraguan, kecuali jika hal itu merupakan perniagaan tunai yang kamu jalankan di antara kamu. Maka, tidak ada dosa bagi kamu jika kamu tidak mencatatnya. Ambillah saksi apabila kamu berjual beli dan janganlah pencatat mempersulit (atau dipersulit), begitu juga saksi. Jika kamu melakukan (yang demikian), sesungguhnya hal itu suatu kefasikan padamu. Bertakwalah kepada Allah, Allah memberikan pengajaran kepadamu dan Allah Maha Mengetahui segala sesuatu."
  },
  {
    "ayat": 283,
    "arabic": "۞ وَاِنْ كُنْتُمْ عَلٰى سَفَرٍ وَّلَمْ تَجِدُوْا كَاتِبًا فَرِهٰنٌ مَّقْبُوْضَةٌ  ۗفَاِنْ اَمِنَ بَعْضُكُمْ بَعْضًا فَلْيُؤَدِّ الَّذِى اؤْتُمِنَ اَمَانَتَهٗ وَلْيَتَّقِ اللّٰهَ رَبَّهٗ ۗ وَلَا تَكْتُمُوا الشَّهَادَةَۗ وَمَنْ يَّكْتُمْهَا فَاِنَّهٗٓ اٰثِمٌ قَلْبُهٗ ۗ وَاللّٰهُ بِمَا تَعْمَلُوْنَ عَلِيْمٌ ࣖ",
    "transliteration_en": "Wa in kuntum 'alaa safarinw wa lam tajidoo kaatiban farihaanum maqboodatun fa in amina ba'dukum ba'dan falyu'addil lazi tumina amaa natahoo walyattaqil laaha Rabbah; wa laa taktumush shahaadah; wa mai yaktumhaa fa innahooo aasimun qalbuh; wallaahu bimaa ta'maloona 'Aleem",
    "transliteration_id": "Wa in kuntum ‘alā safariw wa lam tajidū kātiban fa riḥānum maqbūḍah(tun), fa'in amina ba‘ḍukum ba‘ḍan falyu'addil-lażi'tumina amānatahū walyattaqillāha rabbah(ū), wa lā taktumusy syahādah(ta), wa may yaktumhā fa'innahū āṡimun qalbuh(ū), wallāhu bimā ta‘malūna  ‘alīm(un).",
    "translation_en": "And if you are on a journey and cannot find a scribe, then a security deposit [should be] taken. And if one of you entrusts another, then let him who is entrusted discharge his trust [faithfully] and let him fear Allah, his Lord. And do not conceal testimony, for whoever conceals it - his heart is indeed sinful, and Allah is Knowing of what you do.",
    "translation_id": "Jika kamu dalam perjalanan, sedangkan kamu tidak mendapatkan seorang pencatat, hendaklah ada barang jaminan yang dipegang. Akan tetapi, jika sebagian kamu memercayai sebagian yang lain, hendaklah yang dipercayai itu menunaikan amanatnya (utangnya) dan hendaklah dia bertakwa kepada Allah, Tuhannya. Janganlah kamu menyembunyikan kesaksian karena siapa yang menyembunyikannya, sesungguhnya hatinya berdosa. Allah Maha Mengetahui apa yang kamu kerjakan."
  },
  {
    "ayat": 284,
    "arabic": "لِلّٰهِ مَا فِى السَّمٰوٰتِ وَمَا فِى الْاَرْضِ ۗ وَاِنْ تُبْدُوْا مَا فِيْٓ اَنْفُسِكُمْ اَوْ تُخْفُوْهُ يُحَاسِبْكُمْ بِهِ اللّٰهُ ۗ فَيَغْفِرُ لِمَنْ يَّشَاۤءُ وَيُعَذِّبُ مَنْ يَّشَاۤءُ ۗ وَاللّٰهُ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ",
    "transliteration_en": "Lillaahi maa fissamaawaati wa maa fil ard; wa in tubdoo maa feee anfusikum aw tukhfoohu yuhaasibkum bihil laa; fayaghfiru li mai yashaaa'u wa yu'azzibu mai yashaaa u;wallaahu 'alaa kulli shai in qadeer",
    "transliteration_id": "Lillāhi mā fis-samāwāti wa mā fil-arḍ(i), wa in tubdū mā fī anfusikum au tukhfūhu yuḥāsibkum bihillāh(u), fayagfiru limay yasyā'u wa yu‘ażżibu may yasyā'(u), wallāhu ‘alā kulli syai'in qadīr(un).",
    "translation_en": "To Allah belongs whatever is in the heavens and whatever is in the earth. Whether you show what is within yourselves or conceal it, Allah will bring you to account for it. Then He will forgive whom He wills and punish whom He wills, and Allah is over all things competent.",
    "translation_id": "Milik Allahlah apa yang ada di langit dan apa yang ada di bumi. Jika kamu menyatakan apa yang ada di dalam hatimu atau kamu menyembunyikannya, niscaya Allah memperhitungkannya bagimu. Dia mengampuni siapa saja yang Dia kehendaki dan mengazab siapa pun yang Dia kehendaki. Allah Maha Kuasa atas segala sesuatu."
  },
  {
    "ayat": 285,
    "arabic": "اٰمَنَ الرَّسُوْلُ بِمَآ اُنْزِلَ اِلَيْهِ مِنْ رَّبِّهٖ وَالْمُؤْمِنُوْنَۗ  كُلٌّ اٰمَنَ بِاللّٰهِ وَمَلٰۤىِٕكَتِهٖ وَكُتُبِهٖ وَرُسُلِهٖۗ  لَا نُفَرِّقُ بَيْنَ اَحَدٍ مِّنْ رُّسُلِهٖ ۗ وَقَالُوْا سَمِعْنَا وَاَطَعْنَا غُفْرَانَكَ رَبَّنَا وَاِلَيْكَ الْمَصِيْرُ",
    "transliteration_en": "Aamanar-Rasoolu bimaaa unzila ilaihi mir-Rabbihee walmu'minoon; kullun aamana billaahi wa Malaaa'ikathihee wa Kutubhihee wa Rusulih laa nufarriqu baina ahadim-mir-Rusulihee wa qaaloo sami'naa wa ata'naa ghufraanaka Rabbanaa wa ilaikal-maseer",
    "transliteration_id": "Āmanar-rasūlu bimā unzila ilaihi mir rabbihī wal-mu'minūn(a), kullun āmana billāhi wa malā'ikatihī wa kutubihī wa rusulih(ī), lā nufarriqu baina aḥadim mir rusulih(ī), wa qālū sami‘nā wa aṭa‘nā, gufrānaka rabbanā wa ilaikal-maṣīr(u).",
    "translation_en": "The Messenger has believed in what was revealed to him from his Lord, and [so have] the believers. All of them have believed in Allah and His angels and His books and His messengers, [saying], \"We make no distinction between any of His messengers.\" And they say, \"We hear and we obey. [We seek] Your forgiveness, our Lord, and to You is the [final] destination.\"",
    "translation_id": "Rasul (Muhammad) beriman pada apa (Al-Qur’an) yang diturunkan kepadanya dari Tuhannya, demikian pula orang-orang mukmin. Masing-masing beriman kepada Allah, malaikat-malaikat-Nya, kitab kitab-Nya, dan rasul-rasul-Nya. (Mereka berkata,) “Kami tidak membeda-bedakan seorang pun dari rasul-rasul-Nya.” Mereka juga berkata, “Kami dengar dan kami taat. Ampunilah kami, wahai Tuhan kami. Hanya kepada-Mu tempat (kami) kembali.”"
  },
  {
    "ayat": 286,
    "arabic": "لَا يُكَلِّفُ اللّٰهُ نَفْسًا اِلَّا وُسْعَهَا ۗ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَآ اِنْ نَّسِيْنَآ اَوْ اَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَآ اِصْرًا كَمَا حَمَلْتَهٗ عَلَى الَّذِيْنَ مِنْ قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهٖۚ وَاعْفُ عَنَّاۗ وَاغْفِرْ لَنَاۗ وَارْحَمْنَا ۗ اَنْتَ مَوْلٰىنَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكٰفِرِيْنَ ࣖ",
    "transliteration_en": "Laa yukalliful-laahu nafsan illaa wus'ahaa; lahaa maa kasabat wa 'alaihaa maktasabat; Rabbanaa la tu'aakhiznaa in naseenaaa aw akhtaanaa; Rabbanaa wa laa tahmil-'alainaaa isran kamaa hamaltahoo 'alal-lazeena min qablinaa; Rabbanaa wa laa tuhammilnaa maa laa taaqata lanaa bih wa'fu 'annaa waghfir lanaa warhamnaa; Anta mawlaanaa fansurnaa 'alal qawmil kaafireen",
    "transliteration_id": "Lā yukallifullāhu nafsan illā wus‘ahā, lahā mā kasabat wa ‘alaihā maktasabat, rabbanā lā tu'ākhiżnā in nasīnā au akhṭa'nā, rabbanā wa lā taḥmil ‘alainā iṣran kamā ḥamaltahū ‘alal-lażīna min qablinā, rabbanā wa lā tuḥammilnā mā lā ṭāqata lanā bih(ī), wa‘fu ‘annā, wagfir lanā, warḥamnā, anta maulānā fanṣurnā ‘alal qaumil-kāfirīn(a).",
    "translation_en": "Allah does not charge a soul except [with that within] its capacity. It will have [the consequence of] what [good] it has gained, and it will bear [the consequence of] what [evil] it has earned. \"Our Lord, do not impose blame upon us if we have forgotten or erred. Our Lord, and lay not upon us a burden like that which You laid upon those before us. Our Lord, and burden us not with that which we have no ability to bear. And pardon us; and forgive us; and have mercy upon us. You are our protector, so give us victory over the disbelieving people.\"",
    "translation_id": "Allah tidak membebani seseorang, kecuali menurut kesanggupannya. Baginya ada sesuatu (pahala) dari (kebajikan) yang diusahakannya dan terhadapnya ada (pula) sesuatu (siksa) atas (kejahatan) yang diperbuatnya. (Mereka berdoa,) “Wahai Tuhan kami, janganlah Engkau hukum kami jika kami lupa atau kami salah. Wahai Tuhan kami, janganlah Engkau bebani kami dengan beban yang berat sebagaimana Engkau bebankan kepada orang-orang sebelum kami. Wahai Tuhan kami, janganlah Engkau pikulkan kepada kami apa yang tidak sanggup kami memikulnya. Maafkanlah kami, ampunilah kami, dan rahmatilah kami. Engkaulah pelindung kami. Maka, tolonglah kami dalam menghadapi kaum kafir.”"
  }
]