[
  {
    "ayat": 51,
    "arabic": "اَثُمَّ اِذَا مَا وَقَعَ اٰمَنْتُمْ بِهٖۗ  اٰۤلْـٰٔنَ وَقَدْ كُنْتُمْ بِهٖ تَسْتَعْجِلُوْنَ",
    "transliteration_en": "Asumma izaa maa waqa'a aamantum bih; aaal'aana wa qad kuntum bihee tasta'jiloon",
    "transliteration_id": "Aṡumma iżā mā waqa‘a āmantum bih(ī), āl'āna wa qad kuntum bihī tasta‘jilūn(a).",
    "translation_en": "Then is it that when it has [actually] occurred you will believe in it? Now? And you were [once] for it impatient",
    "translation_id": "Apabila azab itu terjadi, apakah kemudian kamu baru memercayainya? Apakah (baru) sekarang (kamu beriman), padahal sebelumnya kamu selalu meminta agar ia disegerakan?"
  },
  {
    "ayat": 52,
    "arabic": "ثُمَّ قِيْلَ لِلَّذِيْنَ ظَلَمُوْا ذُوْقُوْا عَذَابَ الْخُلْدِۚ هَلْ تُجْزَوْنَ اِلَّا بِمَا كُنْتُمْ تَكْسِبُوْنَ",
    "transliteration_en": "Summa qeela lillazeena zalamoo zooqoo 'azaabal khuld hal tujzawna illaa bimaa kuntum taksiboon",
    "transliteration_id": "Ṡumma qīla lil-lażīna ẓalamū żūqū ‘ażābal-khuld(i), hal tujzauna illā bimā kuntum taksibūn(a).",
    "translation_en": "Then it will be said to those who had wronged, \"Taste the punishment of eternity; are you being recompensed except for what you used to earn?\"",
    "translation_id": "Kemudian, dikatakan kepada orang-orang yang zalim itu, “Rasakanlah olehmu azab yang kekal. (Bukankah) kamu tidak diberi balasan, melainkan (setimpal) dengan apa yang selama ini telah kamu usahakan?”"
  },
  {
    "ayat": 53,
    "arabic": "۞ وَيَسْتَنْۢبِـُٔوْنَكَ اَحَقٌّ هُوَ ۗ قُلْ اِيْ وَرَبِّيْٓ اِنَّهٗ لَحَقٌّ ۗوَمَآ اَنْتُمْ بِمُعْجِزِيْنَ ࣖ",
    "transliteration_en": "Wa yastambi'oonaka ahaqqun huwa qul ee wa Rabbeee innahoo lahaqq; wa maaa antum bimu'jizeen",
    "transliteration_id": "Wa yastambi'ūnaka aḥaqqun huw(a), qul ī wa rabbī innahū laḥaqq(un), wa mā antum bimu‘jizīn(a).",
    "translation_en": "And they ask information of you, [O Muhammad], \"Is it true?\" Say, \"Yes, by my Lord. Indeed, it is truth; and you will not cause failure [to Allah].\"",
    "translation_id": "Mereka menanyakan kepadamu (Nabi Muhammad), “Benarkah ia (azab yang dijanjikan Allah) itu?” Katakanlah, “Ya, demi Tuhanku, sesungguhnya (azab) itu pasti benar dan sekali-kali kamu tidak dapat menghindar.”"
  },
  {
    "ayat": 54,
    "arabic": "وَلَوْ اَنَّ لِكُلِّ نَفْسٍ ظَلَمَتْ مَا فِى الْاَرْضِ لَافْتَدَتْ بِهٖۗ وَاَسَرُّوا النَّدَامَةَ لَمَّا رَاَوُا الْعَذَابَۚ وَقُضِيَ بَيْنَهُمْ بِالْقِسْطِ وَهُمْ لَا يُظْلَمُوْنَ",
    "transliteration_en": "Wa law anna likulli nafsin zalamat maa fil ardi laftadat bih; wa asarrun nadaamata lammaa ra awul 'azaab, wa qudiya bainahum bilqist; wa hum laa yuzlamoon",
    "transliteration_id": "Wa lau anna likulli nafsin ẓalamat mā fil-arḍi laftadat bih(ī), wa asarrun-nadāmata lammā ra'awul-‘ażāb(a), wa quḍiya bainahum bil-qisṭi wa hum lā yuẓlamūn(a).",
    "translation_en": "And if each soul that wronged had everything on earth, it would offer it in ransom. And they will confide regret when they see the punishment; and they will be judged in justice, and they will not be wronged",
    "translation_id": "Seandainya setiap orang yang berbuat zalim itu (mempunyai) apa yang ada di bumi, tentu dia menebus diri dengannya. Mereka menyembunyikan penyesalan ketika mereka telah menyaksikan azab itu. Diputuskanlah (oleh Allah) di antara mereka dengan adil, sedangkan mereka tidak dizalimi (sedikit pun)."
  },
  {
    "ayat": 55,
    "arabic": "اَلَآ اِنَّ لِلّٰهِ مَا فِى السَّمٰوٰتِ وَالْاَرْضِۗ  اَلَآ اِنَّ وَعْدَ اللّٰهِ حَقٌّ وَّلٰكِنَّ اَكْثَرَهُمْ لَا يَعْلَمُوْنَ",
    "transliteration_en": "Alaaa inna lillaahi maa fis samaawaati wal ard; alaaa inna wa'dal laahi haqqunw wa laakinna aksarahum laa ya'lamoon",
    "transliteration_id": "Alā inna lillāhi mā fis-samāwāti wal-arḍ(i), alā inna wa‘dallāhi ḥaqquw wa lākinna akṡarahum lā ya‘lamūn(a).",
    "translation_en": "Unquestionably, to Allah belongs whatever is in the heavens and the earth. Unquestionably, the promise of Allah is truth, but most of them do not know",
    "translation_id": "Ketahuilah, sesungguhnya milik Allahlah apa yang ada di langit dan di bumi. Ketahuilah, sesungguhnya janji Allah itu benar, tetapi kebanyakan mereka tidak mengetahui."
  },
  {
    "ayat": 56,
    "arabic": "هُوَ يُحْيٖ وَيُمِيْتُ وَاِلَيْهِ تُرْجَعُوْنَ",
    "transliteration_en": "Huwa yuhyee wa yumeetu wailaihi turja'oon",
    "transliteration_id": "Huwa yuḥyī wa yumītu wa ilaihi turja‘ūn(a).",
    "translation_en": "He gives life and causes death, and to Him you will be returned",
    "translation_id": "Dialah yang menghidupkan dan mematikan serta hanya kepada-Nyalah kamu akan dikembalikan."
  },
  {
    "ayat": 57,
    "arabic": "يٰٓاَيُّهَا النَّاسُ قَدْ جَاۤءَتْكُمْ مَّوْعِظَةٌ مِّنْ رَّبِّكُمْ وَشِفَاۤءٌ لِّمَا فِى الصُّدُوْرِۙ وَهُدًى وَّرَحْمَةٌ لِّلْمُؤْمِنِيْنَ",
    "transliteration_en": "Yaaa aiyuhan naasu qad jaaa'atkum maw 'izatum mir Rabbikum wa shifaaa'ul limaa fis sudoori wa hudanw wa rahmatul lilmu'mineen",
    "transliteration_id": "Yā ayyuhan-nāsu qad jā'atkum mau‘iẓatum mir rabbikum wa syifā'ul limā fiṣ-ṣudūr(i), wa hudaw wa raḥmatul lil-mu'minīn(a).",
    "translation_en": "O mankind, there has to come to you instruction from your Lord and healing for what is in the breasts and guidance and mercy for the believers.",
    "translation_id": "Wahai manusia, sungguh telah datang kepadamu pelajaran (Al-Qur’an) dari Tuhanmu, penyembuh bagi sesuatu (penyakit) yang terdapat dalam dada, dan petunjuk serta rahmat bagi orang-orang mukmin."
  },
  {
    "ayat": 58,
    "arabic": "قُلْ بِفَضْلِ اللّٰهِ وَبِرَحْمَتِهٖ فَبِذٰلِكَ فَلْيَفْرَحُوْاۗ هُوَ خَيْرٌ مِّمَّا يَجْمَعُوْنَ",
    "transliteration_en": "Qul bifadlil laahi wa birahmatihii fabizaalika falyaf rahoo huwa khairum mimmaa yajma'oon",
    "transliteration_id": "Qul bifaḍlillāhi wa biraḥmatihī fa biżālika falyafraḥū, huwa khairum mimmā yajma‘ūn(a).",
    "translation_en": "Say, \"In the bounty of Allah and in His mercy - in that let them rejoice; it is better than what they accumulate.\"",
    "translation_id": "Katakanlah (Nabi Muhammad), “Dengan karunia Allah dan rahmat-Nya itu, hendaklah mereka bergembira. Itu lebih baik daripada apa yang mereka kumpulkan.”"
  },
  {
    "ayat": 59,
    "arabic": "قُلْ اَرَءَيْتُمْ مَّآ اَنْزَلَ اللّٰهُ لَكُمْ مِّنْ رِّزْقٍ فَجَعَلْتُمْ مِّنْهُ حَرَامًا وَّحَلٰلًا ۗ قُلْ ءٰۤاللّٰهُ اَذِنَ لَكُمْ اَمْ عَلَى اللّٰهِ تَفْتَرُوْنَ",
    "transliteration_en": "Qul ara'aitum maaa anzalal laahu lakum mir rizqin faja'altum minhu haraamanw wa halaalan qul aaallaahu azina lakum am 'alal laahi taftaroon",
    "transliteration_id": "Qul ara'aitum mā anzalallāhu lakum mir rizqin fa ja‘altum minhu ḥarāmaw wa ḥalālā(n), qul āllāhu ażina lakum am ‘alallāhi taftarūn(a).",
    "translation_en": "Say, \"Have you seen what Allah has sent down to you of provision of which you have made [some] lawful and [some] unlawful?\" Say, \"Has Allah permitted you [to do so], or do you invent [something] about Allah?\"",
    "translation_id": "Katakanlah (Nabi Muhammad), “Terangkanlah kepadaku tentang rezeki yang diturunkan Allah kepadamu, lalu kamu jadikan sebagiannya haram dan sebagiannya halal.” Katakanlah, “Apakah Allah telah memberikan izin kepadamu (tentang ini) ataukah kamu mengada-ada atas nama Allah?”"
  },
  {
    "ayat": 60,
    "arabic": "وَمَا ظَنُّ الَّذِيْنَ يَفْتَرُوْنَ عَلَى اللّٰهِ الْكَذِبَ يَوْمَ الْقِيٰمَةِ ۗاِنَّ اللّٰهَ لَذُوْ فَضْلٍ عَلَى النَّاسِ وَلٰكِنَّ اَكْثَرَهُمْ لَا يَشْكُرُوْنَ ࣖ",
    "transliteration_en": "Wa maa zannul lazeena yaftaroona 'alal laahil kaziba Yawmal Qiyaamah; innal laaha lazoo fadlin 'alan naasi wa laakinna aksarahum laa yashkuroon",
    "transliteration_id": "Wa mā ẓannul-lażīna yaftarūna ‘alallāhil-każiba yaumal-qiyāmah(ti), innallāha lażū faḍlin ‘alan-nāsi wa lākinna akṡarahum lā yasykurūn(a).",
    "translation_en": "And what will be the supposition of those who invent falsehood about Allah on the Day of Resurrection? Indeed, Allah is full of bounty to the people, but most of them are not grateful.\"",
    "translation_id": "Apakah dugaan orang-orang yang mengada-adakan kebohongan terhadap Allah (berkenaan dengan apa yang akan Allah berikan kepada mereka) pada hari Kiamat? Sesungguhnya Allah benar-benar mempunyai karunia (yang dilimpahkan-Nya) kepada manusia, tetapi kebanyakan mereka tidak bersyukur."
  },
  {
    "ayat": 61,
    "arabic": "وَمَا تَكُوْنُ فِيْ شَأْنٍ وَّمَا تَتْلُوْا مِنْهُ مِنْ قُرْاٰنٍ وَّلَا تَعْمَلُوْنَ مِنْ عَمَلٍ اِلَّا كُنَّا عَلَيْكُمْ شُهُوْدًا اِذْ تُفِيْضُوْنَ فِيْهِۗ وَمَا يَعْزُبُ عَنْ رَّبِّكَ مِنْ مِّثْقَالِ ذَرَّةٍ فِى الْاَرْضِ وَلَا فِى السَّمَاۤءِ وَلَآ اَصْغَرَ مِنْ ذٰلِكَ وَلَآ اَكْبَرَ اِلَّا فِيْ كِتٰبٍ مُّبِيْنٍ",
    "transliteration_en": "Wa maa takoonu fee shaaninw wa maa tatloo minhu min quraaninw wa laa ta'maloona min 'amalin illaa kunnaa 'alaikum shuhoodan iz tufeedoona feeh; wa maa ya'zubu 'ar Rabbika mim mis qaali zarratin fil ardi wa laa fis samaaa'i wa laaa asghara min zaalika wa laaa akbara illaa fee Kitaabim Mubeen",
    "transliteration_id": "Wa mā takūnu fī sya'niw wa mā tatlū minhu min qur'āniw wa lā ta‘malūna min ‘amalin illā kunnā ‘alaikum syuhūdan iż tufīḍūna fīh(i), wa mā ya‘zubu ‘ar rabbika mim miṡqāli żarratin fil-arḍi wa lā fis-samā'i wa lā aṣgara min żālika wa lā akbara illā fī kitābim mubīn(in).",
    "translation_en": "And, [O Muhammad], you are not [engaged] in any matter or recite any of the Qur'an and you [people] do not do any deed except that We are witness over you when you are involved in it. And not absent from your Lord is any [part] of an atom's weight within the earth or within the heaven or [anything] smaller than that or greater but that it is in a clear register.",
    "translation_id": "Engkau (Nabi Muhammad) tidak berada dalam suatu urusan, tidak membaca suatu ayat Al-Qur’an, dan tidak pula mengerjakan suatu pekerjaan, kecuali Kami menjadi saksi atasmu ketika kamu melakukannya. Tidak ada yang luput sedikit pun dari (pengetahuan) Tuhanmu, walaupun seberat zarah, baik di bumi maupun di langit. Tidak ada sesuatu yang lebih kecil dan yang lebih besar daripada itu, kecuali semua tercatat dalam kitab yang nyata (Lauhulmahfuz)."
  },
  {
    "ayat": 62,
    "arabic": "اَلَآ اِنَّ اَوْلِيَاۤءَ اللّٰهِ لَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُوْنَۚ",
    "transliteration_en": "Alaa innaa awliyaaa'al laahi laa khawfun 'alaihim wa laa hum yahzanoon",
    "transliteration_id": "Alā inna auliyā'allāhi lā khaufun ‘alaihim wa lā hum yaḥzanūn(a).",
    "translation_en": "Unquestionably, [for] the allies of Allah there will be no fear concerning them, nor will they grieve",
    "translation_id": "Ketahuilah bahwa sesungguhnya (bagi) para wali Allah itu tidak ada rasa takut yang menimpa mereka dan mereka pun tidak bersedih."
  },
  {
    "ayat": 63,
    "arabic": "اَلَّذِيْنَ اٰمَنُوْا وَكَانُوْا يَتَّقُوْنَۗ",
    "transliteration_en": "Allazeena aamanoo wa kaanoo yattaqoon",
    "transliteration_id": "Al-lażīna āmanū wa kānū yattaqūn(a).",
    "translation_en": "Those who believed and were fearing Allah",
    "translation_id": "(Mereka adalah) orang-orang yang beriman dan selalu bertakwa."
  },
  {
    "ayat": 64,
    "arabic": "لَهُمُ الْبُشْرٰى فِى الْحَيٰوةِ الدُّنْيَا وَفِى الْاٰخِرَةِۗ  لَا تَبْدِيْلَ لِكَلِمٰتِ اللّٰهِ ۗذٰلِكَ هُوَ الْفَوْزُ الْعَظِيْمُۗ",
    "transliteration_en": "Lahumul bushraa filha yaatid dunyaa wa fil Aakhirah; laa tabdeela likalimaatil laah; zaalika huwal fawzul 'azeem",
    "transliteration_id": "Lahumul-busyrā fil-ḥayātid-dun-yā wa fil-ākhirah(ti), lā tabdīla likalimātillāh(i), żālika huwal-fauzul-‘aẓīm((u).",
    "translation_en": "For them are good tidings in the worldly life and in the Hereafter. No change is there in the words of Allah. That is what is the great attainment.",
    "translation_id": "Bagi mereka berita gembira di dalam kehidupan di dunia dan di akhirat. Tidak ada perubahan bagi kalimat-kalimat (ketetapan dan janji) Allah. Demikian itulah kemenangan yang agung."
  },
  {
    "ayat": 65,
    "arabic": "وَلَا يَحْزُنْكَ قَوْلُهُمْۘ اِنَّ الْعِزَّةَ لِلّٰهِ جَمِيْعًاۗ هُوَ السَّمِيْعُ الْعَلِيْمُ",
    "transliteration_en": "Wa laa yahzunka qawluhum; innal 'izzata lillaahi jamee'aa; Huwas Samee'ul 'Aleem",
    "transliteration_id": "Wa lā yaḥzunka qauluhum, innal-‘izzata lillāhi jamī‘ā(n), huwas-samī‘ul-‘alīm(u).",
    "translation_en": "And let not their speech grieve you. Indeed, honor [due to power] belongs to Allah entirely. He is the Hearing, the Knowing.",
    "translation_id": "Janganlah engkau (Nabi Muhammad) sedih oleh perkataan mereka. Sesungguhnya kekuasaan itu seluruhnya milik Allah. Dia Maha Mendengar lagi Maha Mengetahui."
  },
  {
    "ayat": 66,
    "arabic": "اَلَآ اِنَّ لِلّٰهِ مَنْ فِى السَّمٰوٰتِ وَمَنْ فِى الْاَرْضِۗ وَمَا يَتَّبِعُ الَّذِيْنَ يَدْعُوْنَ مِنْ دُوْنِ اللّٰهِ شُرَكَاۤءَ ۗاِنْ يَّتَّبِعُوْنَ اِلَّا الظَّنَّ وَاِنْ هُمْ اِلَّا يَخْرُصُوْنَ",
    "transliteration_en": "Alaaa inna lillaahi man fis samaawaati wa man fil ard; wa maa yattabi'ul lazeena yad'oona min doonil laahi shurakaaa'; iny yattabi'oona illaz zannna wa in hum illaa yakhrusoon",
    "transliteration_id": "Alā inna lillāhi man fis-samāwāti wa man fil-arḍ(i), wa mā yattabi‘ul-lażīna yad‘ūna min dūnillāhi syurakā'(a), iy yattabi‘ūna illaẓ-ẓanna wa in hum illā yakhruṣūn(a).",
    "translation_en": "Unquestionably, to Allah belongs whoever is in the heavens and whoever is on the earth. And those who invoke other than Allah do not [actually] follow [His] \"partners.\" They follow not except assumption, and they are not but falsifying",
    "translation_id": "Ketahuilah bahwa sesungguhnya milik Allahlah siapa yang ada di langit dan siapa yang ada di bumi. Orang-orang yang menyeru sekutu-sekutu selain Allah tidaklah mengikuti (suatu kebenaran). Mereka hanya mengikuti persangkaan belaka dan mereka hanyalah menduga-duga."
  },
  {
    "ayat": 67,
    "arabic": "هُوَ الَّذِيْ جَعَلَ لَكُمُ الَّيْلَ لِتَسْكُنُوْا فِيْهِ وَالنَّهَارَ مُبْصِرًا ۗاِنَّ فِيْ ذٰلِكَ لَاٰيٰتٍ لِّقَوْمٍ يَّسْمَعُوْنَ",
    "transliteration_en": "Huwal lazee ja'ala lakumul laila litaskunoo feehi wannahaara mubsiraa; inna fee zaalika la Aayaatil liqawmai yasma'oon",
    "transliteration_id": "Huwal-lażī ja‘ala lakumul-laila litaskunū fīhi wan-nahāra mubṣirā(n), inna fī żālika la'āyātil liqaumiy yasma‘ūn(a).",
    "translation_en": "It is He who made for you the night to rest therein and the day, giving sight. Indeed in that are signs for a people who listen.",
    "translation_id": "Dialah yang menjadikan malam bagimu agar kamu beristirahat padanya dan (menjadikan) siang terang benderang. Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda (kebesaran Allah) bagi kaum yang (mau) mendengar."
  },
  {
    "ayat": 68,
    "arabic": "قَالُوا اتَّخَذَ اللّٰهُ وَلَدًا سُبْحٰنَهٗ ۗ هُوَ الْغَنِيُّ ۗ لَهٗ مَا فِى السَّمٰوٰتِ وَمَا فِى الْاَرْضِۗ اِنْ عِنْدَكُمْ مِّنْ سُلْطٰنٍۢ بِهٰذَاۗ اَتَقُوْلُوْنَ عَلَى اللّٰهِ مَا لَا تَعْلَمُوْنَ",
    "transliteration_en": "Qaalut takhazal laahu waladan Subhaanahoo Huwal Ghaniyyu lahoo maa fis samaawaati wa maa fil ard; in 'indakum min sultaanim bihaazaaa; ataqooloona 'alal laahi maa laa ta'lamoon",
    "transliteration_id": "Qāluttakhażallāhu waladan subḥānah(ū), huwal-ganiyy(u), lahū mā fis-samāwāti wa mā fil-arḍ(i), in ‘indakum min sulṭānim bihāżā, ataqūlūna ‘alallāhi  mā lā ta‘lamūn(a).",
    "translation_en": "They have said, \"Allah has taken a son.\" Exalted is He; He is the [one] Free of need. To Him belongs whatever is in the heavens and whatever is in the earth. You have no authority for this [claim]. Do you say about Allah that which you do not know?",
    "translation_id": "Mereka (yang menyekutukan Allah) berkata, “Allah mengangkat anak.” Maha Suci Dia. Dialah Yang Maha Kaya. Milik-Nyalah apa yang ada di langit dan apa yang ada di bumi. Kamu tidak mempunyai alasan kuat tentang ini. Pantaskah kamu mengatakan tentang Allah apa yang tidak kamu ketahui?"
  },
  {
    "ayat": 69,
    "arabic": "قُلْ اِنَّ الَّذِيْنَ يَفْتَرُوْنَ عَلَى اللّٰهِ الْكَذِبَ لَا يُفْلِحُوْنَۗ",
    "transliteration_en": "Qul innal lazeena yaftaroona 'alal laahil kaziba laa yuflihoon",
    "transliteration_id": "Qul innal-lażīna yaftarūna ‘alallāhil-każiba lā yufliḥūn(a).",
    "translation_en": "Say, \"Indeed, those who invent falsehood about Allah will not succeed.\"",
    "translation_id": "Katakanlah (Nabi Muhammad), “Sesungguhnya orang-orang yang mengada-adakan kebohongan terhadap Allah tidak akan beruntung.”"
  },
  {
    "ayat": 70,
    "arabic": "مَتَاعٌ فِى الدُّنْيَا ثُمَّ اِلَيْنَا مَرْجِعُهُمْ ثُمَّ نُذِيْقُهُمُ الْعَذَابَ الشَّدِيْدَ بِمَا كَانُوْا يَكْفُرُوْنَ ࣖ",
    "transliteration_en": "Mataa'un fiddunyaa summa ilainaa marji'uhum summa nuzeequhumul 'azaabash shadeeda bimaa kaanoo yakkfuroon",
    "transliteration_id": "Matā‘un fid-dun-yā ṡumma ilainā marji‘uhum ṡumma nużīquhumul-‘ażābasy syadīda bimā kānū yakfurūn(a).",
    "translation_en": "[For them is brief] enjoyment in this world; then to Us is their return; then We will make them taste the severe punishment because they used to disbelieve",
    "translation_id": "(Bagi mereka) kesenangan (sesaat) ketika di dunia, selanjutnya kepada Kamilah tempat mereka kembali, kemudian Kami jadikan mereka merasakan azab yang keras karena mereka selalu kufur."
  },
  {
    "ayat": 71,
    "arabic": "۞ وَاتْلُ عَلَيْهِمْ نَبَاَ نُوْحٍۘ اِذْ قَالَ لِقَوْمِهٖ يٰقَوْمِ اِنْ كَانَ كَبُرَ عَلَيْكُمْ مَّقَامِيْ وَتَذْكِيْرِيْ بِاٰيٰتِ اللّٰهِ فَعَلَى اللّٰهِ تَوَكَّلْتُ فَاَجْمِعُوْٓا اَمْرَكُمْ وَشُرَكَاۤءَكُمْ ثُمَّ لَا يَكُنْ اَمْرُكُمْ عَلَيْكُمْ غُمَّةً ثُمَّ اقْضُوْٓا اِلَيَّ وَلَا تُنْظِرُوْنِ",
    "transliteration_en": "Watlu 'alaihim naba-a-Noohin iz qaala liqawmihee yaa qawmi in kaana kabura 'alaikum maqaamee wa tazkeeree bi Aayaatil laahi fa'alal laahi tawakkaltu fa ajmi'ooo amrakum wa shurakaaa'akum summa laa yakun amrukum 'alaikum ghummatan summmaq dooo ilaiya wa laa tunziroon",
    "transliteration_id": "Watlu ‘alaihim naba'a nūḥ(in), iż qāla liqaumihī yā qaumi in kāna kabura ‘alaikum maqāmī wa tażkīrī bi'āyātillāhi fa ‘alallāhi tawakkaltu fa ajmi‘ū amrakum wa syurakā'akum ṡumma lā yakun amrukum ‘alaikum gummatan ṡummaqḍū ilayya wa lā tunẓirūn(i).",
    "translation_en": "And recite to them the news of Noah, when he said to his people, \"O my people, if my residence and my reminding of the signs of Allah has become burdensome upon you - then I have relied upon Allah. So resolve upon your plan and [call upon] your associates. Then let not your plan be obscure to you. Then carry it out upon me and do not give me respite.",
    "translation_id": "Bacakanlah (sampaikanlah wahai Nabi Muhammad) kepada mereka berita penting (tentang) Nuh ketika dia berkata kepada kaumnya, “Wahai kaumku, jika terasa berat bagi kamu keberadaanku tinggal (bersamamu) dan peringatanku dengan ayat-ayat Allah, kepada Allahlah aku bertawakal. Oleh karena itu, bulatkanlah keputusanmu dan kumpulkanlah sekutu-sekutumu (untuk membinasakanku), selanjutnya janganlah keputusanmu itu dirahasiakan. Kemudian, bertindaklah terhadap diriku dan janganlah kamu tunda-tunda (tindakan itu) kepadaku."
  },
  {
    "ayat": 72,
    "arabic": "فَاِنْ تَوَلَّيْتُمْ فَمَا سَاَلْتُكُمْ مِّنْ اَجْرٍۗ اِنْ اَجْرِيَ اِلَّا عَلَى اللّٰهِ ۙوَاُمِرْتُ اَنْ اَكُوْنَ مِنَ الْمُسْلِمِيْنَ",
    "transliteration_en": "Fa in tawallaitum famaa sa altukum min ajrin in ajriya illaa 'alal laahi wa umirtu an akoona minal muslimeen",
    "transliteration_id": "Fa in tawallaitum famā sa'altukum min ajr(in), in ajriya illā ‘alallāh(i), wa umirtu an akūna minal-muslimīn(a).",
    "translation_en": "And if you turn away [from my advice] then no payment have I asked of you. My reward is only from Allah, and I have been commanded to be of the Muslims.\"",
    "translation_id": "Jika kamu berpaling (dari peringatanku), aku tidak meminta imbalan sedikit pun darimu. Imbalanku tidak lain hanyalah dari Allah dan aku diperintah agar aku masuk ke dalam golongan orang-orang muslim.”"
  },
  {
    "ayat": 73,
    "arabic": "فَكَذَّبُوْهُ فَنَجَّيْنٰهُ وَمَنْ مَّعَهٗ فِى الْفُلْكِ وَجَعَلْنٰهُمْ خَلٰۤىِٕفَ وَاَغْرَقْنَا الَّذِيْنَ كَذَّبُوْا بِاٰيٰتِنَاۚ فَانْظُرْ كَيْفَ كَانَ عَاقِبَةُ الْمُنْذَرِيْنَ",
    "transliteration_en": "Fakazzaboohu fanajjainaahu wa mamm'ahoo fil fulki wa ja'alnaahum khalaaa'ifa wa aghraqnal lazeena kazzaboo bi aayaatinaa fanzur kaifa kaana 'aaqibatul munzareen",
    "transliteration_id": "Fa każżabūhu fa najjaināhu wa mam ma‘ahū fil-fulki wa ja‘alnāhum khalā'ifa wa agraqnal-lażīna każżabū bi'āyātinā, fanẓur kaifa kāna ‘āqibatul-munżarīn(a).",
    "translation_en": "And they denied him, so We saved him and those with him in the ship and made them successors, and We drowned those who denied Our signs. Then see how was the end of those who were warned.",
    "translation_id": "Mereka mendustakannya (Nuh). Lalu, Kami selamatkan dia dan orang-orang yang bersamanya di dalam bahtera serta Kami jadikan mereka sebagai generasi penerus dan Kami tenggelamkan orang-orang yang mendustakan ayat-ayat Kami. Perhatikanlah bagaimana kesudahan orang-orang yang diberi peringatan itu."
  },
  {
    "ayat": 74,
    "arabic": "ثُمَّ بَعَثْنَا مِنْۢ بَعْدِهٖ رُسُلًا اِلٰى قَوْمِهِمْ فَجَاۤءُوْهُمْ بِالْبَيِّنٰتِ فَمَا كَانُوْا لِيُؤْمِنُوْا بِمَا كَذَّبُوْا بِهٖ مِنْ قَبْلُ ۗ كَذٰلِكَ نَطْبَعُ عَلٰى قُلُوْبِ الْمُعْتَدِيْنَ",
    "transliteration_en": "Summma ba'asnaa mim ba'dihee Rusulan ilaa qawmihim fajaaa'oohum bilbaiyinaati famaa kaanoo liyu'minoo bimaa kazzaboo bihee min qabl; kazaalika natba'u 'alaa quloobil mu'tadeen",
    "transliteration_id": "Ṡumma ba‘aṡnā mim ba‘dihī rusulan ilā qaumihim fa jā'ūhum bil-bayyināti famā kānū liyu'minū bimā każżabū bihī min qabl(u), każālika naṭba‘u ‘alā qulūbil-mu‘tadīn(a).",
    "translation_en": "Then We sent after him messengers to their peoples, and they came to them with clear proofs. But they were not to believe in that which they had denied before. Thus We seal over the hearts of the transgressors",
    "translation_id": "Kemudian, Kami mengutus setelahnya (Nuh) beberapa rasul kepada kaum mereka (umat masing-masing), maka rasul-rasul itu datang kepada mereka dengan membawa bukti-bukti yang nyata, tetapi mereka tidak mau beriman karena mereka dahulu telah (biasa) mendustakannya. Demikianlah Kami mengunci hati orang-orang yang melampaui batas."
  },
  {
    "ayat": 75,
    "arabic": "ثُمَّ بَعَثْنَا مِنْۢ بَعْدِهِمْ مُّوْسٰى وَهٰرُوْنَ اِلٰى فِرْعَوْنَ وَمَلَا۟ىِٕهٖ بِاٰيٰتِنَا فَاسْتَكْبَرُوْا وَكَانُوْا قَوْمًا مُّجْرِمِيْنَ",
    "transliteration_en": "Summa ba'asnaa mim ba'dihim Moosaa Wa Haaroona ilaa Fir'awna wa mala'ihee bi aayaatinaa fastakbaroo wa kaanoo qawmam mujrimeen",
    "transliteration_id": "Ṡumma ba‘aṡnā mim ba‘dihim mūsā wa hārūna ilā fir‘auna wa mala'ihī bi'āyātinā fastakbarū wa kānū qaumam mujrimīn(a).",
    "translation_en": "Then We sent after them Moses and Aaron to Pharaoh and his establishment with Our signs, but they behaved arrogantly and were a criminal people",
    "translation_id": "Kemudian, setelah mereka Kami mengutus Musa dan Harun kepada Fir‘aun dan para pemuka kaumnya, dengan membawa tanda-tanda (kekuasaan) Kami. Lalu, mereka menyombongkan diri dan mereka adalah kaum pendurhaka."
  },
  {
    "ayat": 76,
    "arabic": "فَلَمَّا جَاۤءَهُمُ الْحَقُّ مِنْ عِنْدِنَا قَالُوْٓا اِنَّ هٰذَا لَسِحْرٌ مُّبِيْنٌ",
    "transliteration_en": "Falammaa jaaa'ahumul haqqu min 'indinaa qaalooo inna haazaa lasihrum mubeen",
    "transliteration_id": "Falammā jā'ahumul-ḥaqqu min ‘indinā qālū inna hāżā lasiḥrum mubīn(un).",
    "translation_en": "So when there came to them the truth from Us, they said, \"Indeed, this is obvious magic.\"",
    "translation_id": "Ketika telah datang kepada mereka kebenaran (mukjizat) dari sisi Kami, mereka berkata, “Sesungguhnya ini benar-benar sihir yang nyata.”"
  },
  {
    "ayat": 77,
    "arabic": "قَالَ مُوْسٰٓى اَتَقُوْلُوْنَ لِلْحَقِّ لَمَّا جَاۤءَكُمْ ۗ اَسِحْرٌ هٰذَاۗ وَلَا يُفْلِحُ السّٰحِرُوْنَ",
    "transliteration_en": "Qaalaa Moosaaa ataqooloona lilhaqqi lammmaa jaaa'a kum asihrun haazaa wa laa yuflihus saabiroon",
    "transliteration_id": "Qāla mūsā ataqūlūna lil-ḥaqqi lammā jā'akum, asiḥrun hāżā, wa lā yufliḥus-sāḥirūn(a).",
    "translation_en": "Moses said, \"Do you say [thus] about the truth when it has come to you? Is this magic? But magicians will not succeed.\"",
    "translation_id": "Musa berkata, “Apakah (pantas) kamu mengatakan terhadap kebenaran (mukjizat) ketika ia datang kepadamu, ‘sihirkah ini?’ Padahal, para penyihir itu tidaklah mendapat kemenangan.”"
  },
  {
    "ayat": 78,
    "arabic": "قَالُوْٓا اَجِئْتَنَا لِتَلْفِتَنَا عَمَّا وَجَدْنَا عَلَيْهِ اٰبَاۤءَنَا وَتَكُوْنَ لَكُمَا الْكِبْرِيَاۤءُ فِى الْاَرْضِۗ وَمَا نَحْنُ لَكُمَا بِمُؤْمِنِيْنَ",
    "transliteration_en": "Qaaloo aji'tanaa litalfitanaa 'ammaa wajadnaa 'alaihi aabaaa'anaa wa takoona lakumal kibriyaaa'u fil ardi wa maa nahnu lakumaa bimu' mineen",
    "transliteration_id": "Qālū aji'tanā litalfitanā ‘ammā wajadnā ‘alaihi ābā'anā wa takūna lakumal-kibriyā'u fil-arḍ(i), wa mā naḥnu lakumā bimu'minīn(a).",
    "translation_en": "They said, \"Have you come to us to turn us away from that upon which we found our fathers and so that you two may have grandeur in the land? And we are not believers in you.\"",
    "translation_id": "Mereka berkata, “Apakah engkau (Musa) datang kepada kami untuk memalingkan kami dari apa yang kami dapati pada nenek moyang kami (menyembah berhala), dan agar kamu berdua (Musa dan Harun) mempunyai kekuasaan di bumi (negeri Mesir)? Kami tidak akan beriman kepada kamu berdua.”"
  },
  {
    "ayat": 79,
    "arabic": "وَقَالَ فِرْعَوْنُ ائْتُوْنِيْ بِكُلِّ سٰحِرٍ عَلِيْمٍ",
    "transliteration_en": "Wa qaala Fir'awnu' toonee bikulli saahirin 'aleem",
    "transliteration_id": "Wa qāla fir‘aunu'tūnī bikulli sāḥirin ‘alīm(in).",
    "translation_en": "And Pharaoh said, \"Bring to me every learned magician.\"",
    "translation_id": "Fir‘aun berkata (kepada para pemuka kaumnya), “Datangkanlah kepadaku semua penyihir yang ulung!”"
  },
  {
    "ayat": 80,
    "arabic": "فَلَمَّا جَاۤءَ السَّحَرَةُ قَالَ لَهُمْ مُّوْسٰٓى اَلْقُوْا مَآ اَنْتُمْ مُّلْقُوْنَ",
    "transliteration_en": "Falammaa jaaa'assa haratu qaala lahum Moosaaa alqoo maaa antum mulqoon",
    "transliteration_id": "Falammā jā'as-saḥaratu qāla lahum mūsā alqū mā antum mulqūn(a).",
    "translation_en": "So when the magicians came, Moses said to them, \"Throw down whatever you will throw.\"",
    "translation_id": "Ketika para penyihir itu datang, Musa berkata kepada mereka, “Lemparkanlah apa yang hendak kamu lemparkan!”"
  },
  {
    "ayat": 81,
    "arabic": "فَلَمَّآ اَلْقَوْا قَالَ مُوْسٰى مَا جِئْتُمْ بِهِ ۙالسِّحْرُۗ اِنَّ اللّٰهَ سَيُبْطِلُهٗۗ اِنَّ اللّٰهَ لَا يُصْلِحُ عَمَلَ الْمُفْسِدِيْنَ ࣖ",
    "transliteration_en": "Falammaaa alqaw qaala Moosaa maa ji'tum bihis sihru innal laaha sa yubtiluhoo innal laaha laa yuslihu 'amalal mufsideen",
    "transliteration_id": "Falammā alqau qāla mūsā mā ji'tum bihis-siḥr(u), innallāha sayubṭiluh(ū), innallāha lā yuṣliḥu ‘amalal-mufsidīn(a).",
    "translation_en": "And when they had thrown, Moses said, \"What you have brought is [only] magic. Indeed, Allah will expose its worthlessness. Indeed, Allah does not amend the work of corrupters.",
    "translation_id": "Setelah mereka melemparkan (tali-temali), Musa berkata, “Apa yang kamu bawa itulah sihir. Sesungguhnya Allah akan membatalkan (mengalahkan)-nya. Sesungguhnya Allah tidak membiarkan perbuatan orang-orang yang berbuat kerusakan."
  },
  {
    "ayat": 82,
    "arabic": "وَيُحِقُّ اللّٰهُ الْحَقَّ بِكَلِمٰتِهٖ وَلَوْ كَرِهَ الْمُجْرِمُوْنَ",
    "transliteration_en": "Wa yuhiqqul laahul haqqa bi Kalimaatihee wa law karihal mujrimoon",
    "transliteration_id": "Wa yuḥiqqullāhul-ḥaqqa bikalimātihī wa lau karihal-mujrimūn(a).",
    "translation_en": "And Allah will establish the truth by His words, even if the criminals dislike it.\"",
    "translation_id": "Allah akan mengukuhkan kebenaran dengan ketetapan-ketetapan-Nya, walaupun para pendurhaka tidak menyukainya."
  },
  {
    "ayat": 83,
    "arabic": "فَمَآ اٰمَنَ لِمُوْسٰىٓ اِلَّا ذُرِّيَّةٌ مِّنْ قَوْمِهٖ عَلٰى خَوْفٍ مِّنْ فِرْعَوْنَ وَمَلَا۟ىِٕهِمْ اَنْ يَّفْتِنَهُمْ ۗوَاِنَّ فِرْعَوْنَ لَعَالٍ فِى الْاَرْضِۚ وَاِنَّهٗ لَمِنَ الْمُسْرِفِيْنَ",
    "transliteration_en": "Famaaa aamana li-Moosaaa illaa zurriyyatum min qawmihee 'alaa khawfim min Fir'awna wa mala'ihim ai yaftinahum; wa inna Fir'awna la'aalin fil ardi wa innahoo laminal musrifeen",
    "transliteration_id": "Famā āmana limūsā illā żurriyyatum min qaumihī ‘alā khaufim min fir‘auna wa mala'ihim ay yaftinahum, wa inna fir‘auna la‘ālin fil-arḍ(i), wa innahū laminal-musrifīn(a).",
    "translation_en": "But no one believed Moses, except [some] youths among his people, for fear of Pharaoh and his establishment that they would persecute them. And indeed, Pharaoh was haughty within the land, and indeed, he was of the transgressors",
    "translation_id": "Tidak ada yang beriman kepada Musa selain keturunan dari kaumnya disertai ketakutan kepada Fir‘aun dan para pemuka kaumnya yang akan menyiksa mereka. Sesungguhnya Fir‘aun benar-benar sewenang-wenang di bumi. Sesungguhnya ia benar-benar termasuk orang-orang yang melampaui batas."
  },
  {
    "ayat": 84,
    "arabic": "وَقَالَ مُوْسٰى يٰقَوْمِ اِنْ كُنْتُمْ اٰمَنْتُمْ بِاللّٰهِ فَعَلَيْهِ تَوَكَّلُوْٓا اِنْ كُنْتُمْ مُّسْلِمِيْنَ",
    "transliteration_en": "Wa qaala Moosaa yaa qawmi in kuntum aamantum billaahi fa'alaihi tawakkalooo in kuntum muslimeen",
    "transliteration_id": "Wa qāla mūsā yā qaumi in kuntum āmantum billāhi fa ‘alaihi tawakkalū in kuntum muslimīn(a).",
    "translation_en": "And Moses said, \"O my people, if you have believed in Allah, then rely upon Him, if you should be Muslims.\"",
    "translation_id": "Musa berkata, “Wahai kaumku, jika kamu sungguh-sungguh beriman kepada Allah, bertawakallah hanya kepada-Nya apabila kamu benar-benar orang-orang muslim (yang berserah diri kepada Allah).”"
  },
  {
    "ayat": 85,
    "arabic": "فَقَالُوْا عَلَى اللّٰهِ تَوَكَّلْنَا ۚرَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلْقَوْمِ الظّٰلِمِيْنَ",
    "transliteration_en": "Faqaaloo 'alal laahi tawakkalnaa Rabbanaa laa taj'alnaa fitnatal lilqawmiz zaalimeen",
    "transliteration_id": "Fa qālū ‘alallāhi tawakkalnā, rabbanā lā taj‘alnā fitnatal lil-qaumiẓ-ẓālimīn(a).",
    "translation_en": "So they said, \"Upon Allah do we rely. Our Lord, make us not [objects of] trial for the wrongdoing people",
    "translation_id": "Mereka pun berkata, “Kepada Allahlah kami bertawakal. Ya Tuhan kami, janganlah Engkau jadikan kami (sasaran) fitnah bagi kaum yang zalim."
  },
  {
    "ayat": 86,
    "arabic": "وَنَجِّنَا بِرَحْمَتِكَ مِنَ الْقَوْمِ الْكٰفِرِيْنَ",
    "transliteration_en": "Wa najjinaa birahmatika minal qawmil kaafireen",
    "transliteration_id": "Wa najjinā biraḥmatika minal-qaumil-kāfirīn(a).",
    "translation_en": "And save us by Your mercy from the disbelieving people.\"",
    "translation_id": "Selamatkanlah pula kami dengan rahmat-Mu dari kaum yang kafir.”"
  },
  {
    "ayat": 87,
    "arabic": "وَاَوْحَيْنَآ اِلٰى مُوْسٰى وَاَخِيْهِ اَنْ تَبَوَّاٰ لِقَوْمِكُمَا بِمِصْرَ بُيُوْتًا وَّاجْعَلُوْا بُيُوْتَكُمْ قِبْلَةً وَّاَقِيْمُوا الصَّلٰوةَۗ وَبَشِّرِ الْمُؤْمِنِيْنَ",
    "transliteration_en": "Wa awhainaaa ilaa Moosaa wa akheehi an tabaw wa aa liqawmikuma bi Misra bu yootanw waj'aloo bu yootakum qiblatanw wa aqeemus Salaah; wa bashshiril mu'mineen",
    "transliteration_id": "Wa auḥainā ilā mūsā wa akhīhi an tabawwa'ā liqaumikumā bimiṣra buyūtaw waj‘alū buyūtakum qiblataw wa aqīmuṣ-ṣalāh(ta), wa basysyiril-mu'minīn(a).",
    "translation_en": "And We inspired to Moses and his brother, \"Settle your people in Egypt in houses and make your houses [facing the] qiblah and establish prayer and give good tidings to the believers.\"",
    "translation_id": "Telah Kami wahyukan kepada Musa dan saudaranya (Harun), “Ambillah oleh kamu berdua beberapa rumah di Mesir untuk tempat tinggal kaummu, jadikanlah rumah-rumahmu itu kiblat (tempat ibadah), dan tegakkanlah salat. Gembirakanlah orang-orang mukmin.”"
  },
  {
    "ayat": 88,
    "arabic": "وَقَالَ مُوْسٰى رَبَّنَآ اِنَّكَ اٰتَيْتَ فِرْعَوْنَ وَمَلَاَهٗ زِيْنَةً وَّاَمْوَالًا فِى الْحَيٰوةِ الدُّنْيَاۗ رَبَّنَا لِيُضِلُّوْا عَنْ سَبِيْلِكَ ۚرَبَّنَا اطْمِسْ عَلٰٓى اَمْوَالِهِمْ وَاشْدُدْ عَلٰى قُلُوْبِهِمْ فَلَا يُؤْمِنُوْا حَتّٰى يَرَوُا الْعَذَابَ الْاَلِيْمَ",
    "transliteration_en": "Wa qaala Mosaa Rabbanaaa innaka aataita Fir'awna wa mala ahoo zeenatanw wa amwaalan fil hayaatid dunyaa Rabbanaa liyudillo 'ansabeelika Rabbanat mis 'alaaa amwaalihim washdud 'alaa quloobihim falaa yu'minoo hatta yarawul 'azaabal aleem",
    "transliteration_id": "Wa qāla mūsā rabbanā innaka ātaita fir‘auna wa mala'ahū zīnataw wa amwālan fil-ḥayātid-dun-yā, rabbanā liyuḍillū ‘an sabīlik(a), rabbanaṭmis ‘alā amwālihim wasydud ‘alā qulūbihim falā yu'minū ḥattā yarawul-‘ażābal-alīm(a).",
    "translation_en": "And Moses said, \"Our Lord, indeed You have given Pharaoh and his establishment splendor and wealth in the worldly life, our Lord, that they may lead [men] astray from Your way. Our Lord, obliterate their wealth and harden their hearts so that they will not believe until they see the painful punishment.\"",
    "translation_id": "Musa berkata, “Ya Tuhan kami, sesungguhnya Engkau telah memberikan kepada Fir‘aun dan para pemuka kaumnya perhiasan dan harta kekayaan (yang banyak) dalam kehidupan dunia. Ya Tuhan kami, (akibat pemberian itu) mereka menyesatkan (manusia) dari jalan-Mu. Ya Tuhan kami, binasakanlah harta benda mereka dan kunci matilah hati mereka sehingga mereka tidak beriman sampai mereka melihat azab yang sangat pedih.”"
  },
  {
    "ayat": 89,
    "arabic": "قَالَ قَدْ اُجِيْبَتْ دَّعْوَتُكُمَا فَاسْتَقِيْمَا وَلَا تَتَّبِعٰۤنِّ سَبِيْلَ الَّذِيْنَ لَا يَعْلَمُوْنَ",
    "transliteration_en": "Qaala qad ujeebad da'watukumaa fastaqeemaa wa laa tattabi'aaanni sabeelal lazeena laaya'lamoon",
    "transliteration_id": "Qāla qad ujībad da‘watukumā fastaqīmā wa lā tattabi‘ānni sabīlal-lażīna lā ya‘lamūn(a).",
    "translation_en": "[Allah] said, \"Your supplication has been answered.\" So remain on a right course and follow not the way of those who do not know.\"",
    "translation_id": "Dia (Allah) berfirman, “Sungguh, permohonan kamu berdua telah diperkenankan. Maka, tetaplah kamu berdua (pada jalan yang lurus) dan janganlah sekali-kali kamu berdua mengikuti jalan orang-orang yang tidak mengetahui.”"
  },
  {
    "ayat": 90,
    "arabic": "۞ وَجَاوَزْنَا بِبَنِيْٓ اِسْرَاۤءِيْلَ الْبَحْرَ فَاَتْبَعَهُمْ فِرْعَوْنُ وَجُنُوْدُهٗ بَغْيًا وَّعَدْوًا ۗحَتّٰىٓ اِذَآ اَدْرَكَهُ الْغَرَقُ قَالَ اٰمَنْتُ اَنَّهٗ لَآ اِلٰهَ اِلَّا الَّذِيْٓ اٰمَنَتْ بِهٖ بَنُوْٓا اِسْرَاۤءِيْلَ وَاَنَا۠ مِنَ الْمُسْلِمِيْنَ",
    "transliteration_en": "Wa jaawaznaa bi Baneee Israaa'eelal bahra fa atba'ahum Fir'awnu wa junooduhoo baghyanw wa 'adwan hattaaa izaaa adrakahul gharaqu qaala aamantu annnahoo laaa ilaaha illal lazeee aamanat bihee Banooo Israaa'eela wa ana minal muslimeen",
    "transliteration_id": "Wa jāwaznā bibanī isrā'īlal-baḥra fa atba‘ahum fir‘aunu wa junūduhū bagyaw wa ‘adwā(n), ḥattā iżā adrakahul-garaqu qāla āmantu annahū lā ilāha illal-lażī āmanat bihī banū isrā'īla wa ana minal-muslimīn(a).",
    "translation_en": "And We took the Children of Israel across the sea, and Pharaoh and his soldiers pursued them in tyranny and enmity until, when drowning overtook him, he said, \"I believe that there is no deity except that in whom the Children of Israel believe, and I am of the Muslims.\"",
    "translation_id": "Kami jadikan Bani Israil bisa melintasi laut itu (Laut Merah). Lalu, Fir‘aun dan bala tentaranya mengikuti mereka untuk menganiaya dan menindas hingga ketika Fir‘aun hampir (mati) tenggelam, dia berkata, “Aku percaya bahwa tidak ada tuhan selain (Tuhan) yang telah dipercayai oleh Bani Israil dan aku termasuk orang-orang muslim (yang berserah diri kepada-Nya).”"
  },
  {
    "ayat": 91,
    "arabic": "اٰۤلْـٰٔنَ وَقَدْ عَصَيْتَ قَبْلُ وَكُنْتَ مِنَ الْمُفْسِدِيْنَ",
    "transliteration_en": "Aaal'aana wa qad 'asaita qablu wa kunta minal mufsideen",
    "transliteration_id": "Āl'āna wa qad ‘aṣaita qablu wa kunta minal-mufsidīn(a).",
    "translation_en": "Now? And you had disobeyed [Him] before and were of the corrupters?",
    "translation_id": "Apakah (baru) sekarang (kamu beriman), padahal sungguh kamu telah durhaka sejak dahulu dan kamu termasuk orang-orang yang berbuat kerusakan?"
  },
  {
    "ayat": 92,
    "arabic": "فَالْيَوْمَ نُنَجِّيْكَ بِبَدَنِكَ لِتَكُوْنَ لِمَنْ خَلْفَكَ اٰيَةً ۗوَاِنَّ كَثِيْرًا مِّنَ النَّاسِ عَنْ اٰيٰتِنَا لَغٰفِلُوْنَ ࣖ",
    "transliteration_en": "Falyawma nunajjeeka bibadanika litakoona liman khalfaka Aayah; wa inna kaseeram minan naasi 'an aayaatinaa laghaafiloon",
    "transliteration_id": "Fal yauma nunajjīka bibadanika litakūna liman khalfaka āyah(tan), wa inna kaṡīram minan-nāsi ‘an āyātinā lagāfilūn(a).",
    "translation_en": "So today We will save you in body that you may be to those who succeed you a sign. And indeed, many among the people, of Our signs, are heedless",
    "translation_id": "Pada hari ini Kami selamatkan jasadmu agar kamu menjadi pelajaran bagi orang-orang yang datang setelah kamu. Sesungguhnya kebanyakan manusia benar-benar lengah (tidak mengindahkan) tanda-tanda (kekuasaan) Kami."
  },
  {
    "ayat": 93,
    "arabic": "وَلَقَدْ بَوَّأْنَا بَنِيْٓ اِسْرَاۤءِيْلَ مُبَوَّاَ صِدْقٍ وَّرَزَقْنٰهُمْ مِّنَ الطَّيِّبٰتِ ۚفَمَا اخْتَلَفُوْا حَتّٰى جَاۤءَهُمُ الْعِلْمُ ۗاِنَّ رَبَّكَ يَقْضِيْ بَيْنَهُمْ يَوْمَ الْقِيٰمَةِ فِيْمَا كَانُوْا فِيْهِ يَخْتَلِفُوْنَ",
    "transliteration_en": "Wa laqad bawwaanaa Baneee Israaa'eela mubawwa-a sidqinw wa razaqnaahum minnat taiyibaati famakh talafoo hattaa jaaa'ahmul 'ilm; inna Rabbaka yaqdee bainahum Yawmal Qiyaamati feemaa kaanoo feehi yakhtalifoon",
    "transliteration_id": "Wa laqad bawwa'nā banī isrā'īla mubawwa'a ṣidqiw wa razaqnāhum minaṭ-ṭayyibāt(i), famākhtalafū ḥattā jā'ahumul-‘ilm(u), inna rabbaka yaqḍī bainahum yaumal-qiyāmati fīmā kānū fīhi yakhtalifūn(a).",
    "translation_en": "And We had certainty settled the Children of Israel in an agreeable settlement and provided them with good things. And they did not differ until [after] knowledge had come to them. Indeed, your Lord will judge between them on the Day of Resurrection concerning that over which they used to differ",
    "translation_id": "Sungguh, Kami benar-benar telah menempatkan Bani Israil di tempat kediaman yang benar (bagus dan nyaman) dan Kami beri mereka rezeki yang baik. Maka, mereka tidak berselisih hingga datang kepada mereka pengetahuan (yang tersurat dalam Taurat). Sesungguhnya Tuhanmu akan memberi keputusan antara mereka pada hari Kiamat tentang apa yang selalu mereka perselisihkan."
  },
  {
    "ayat": 94,
    "arabic": "فَاِنْ كُنْتَ فِيْ شَكٍّ مِّمَّآ اَنْزَلْنَآ اِلَيْكَ فَسْـَٔلِ الَّذِيْنَ يَقْرَءُوْنَ الْكِتٰبَ مِنْ قَبْلِكَ ۚ لَقَدْ جَاۤءَكَ الْحَقُّ مِنْ رَّبِّكَ فَلَا تَكُوْنَنَّ مِنَ الْمُمْتَرِيْنَۙ",
    "transliteration_en": "Fa in kunta fee shakkim mimmaaa anzalnaaa ilaika fas'alil lazeena yaqra'oonal Kitaaba min qablik; laqad jaaa'akal haqqu mir Rabbika falaa takoonanna minal mumtareen",
    "transliteration_id": "Fa in kunta fī syakkim mimmā anzalnā ilaika fas'alil-lażīna yaqra'ūnal-kitāba min qablik(a), laqad jā'akal-ḥaqqu mir rabbika falā takūnanna minal-mumtarīn(a).",
    "translation_en": "So if you are in doubt, [O Muhammad], about that which We have revealed to you, then ask those who have been reading the Scripture before you. The truth has certainly come to you from your Lord, so never be among the doubters.",
    "translation_id": "Jika engkau (Nabi Muhammad) berada dalam keraguan tentang apa (kisah nabi-nabi terdahulu) yang Kami turunkan kepadamu, tanyakanlah kepada orang-orang yang membaca kitab sebelum kamu. Sungguh, telah datang kebenaran kepadamu dari Tuhanmu. Maka, janganlah sekali-kali engkau termasuk orang-orang yang ragu."
  },
  {
    "ayat": 95,
    "arabic": "وَلَا تَكُوْنَنَّ مِنَ الَّذِيْنَ كَذَّبُوْا بِاٰيٰتِ اللّٰهِ فَتَكُوْنَ مِنَ الْخٰسِرِيْنَ",
    "transliteration_en": "Wa laa takoonanna minal lazeena kazzaboo bi Aayaatil laahi fatakoona minal khaasireen",
    "transliteration_id": "Wa lā takūnanna minal-lażīna każżabū bi'āyātillāhi fa takūna minal-khāsirīn(a).",
    "translation_en": "And never be of those who deny the signs of Allah and [thus] be among the losers.",
    "translation_id": "Janganlah sekali-kali kamu termasuk orang-orang yang mendustakan ayat-ayat Allah yang menyebabkan kamu tergolong orang-orang yang merugi."
  },
  {
    "ayat": 96,
    "arabic": "اِنَّ الَّذِيْنَ حَقَّتْ عَلَيْهِمْ كَلِمَةُ رَبِّكَ لَا يُؤْمِنُوْنَ",
    "transliteration_en": "Innal lazeena haqqat 'alaihim Kalimatu Rabbika laa yu'minoon",
    "transliteration_id": "Innal-lażīna ḥaqqat ‘alaihim kalimatu rabbika lā yu'minūn(a).",
    "translation_en": "Indeed, those upon whom the word of your Lord has come into effect will not believe,",
    "translation_id": "Sesungguhnya orang-orang yang telah pasti mendapatkan ketentuan Tuhanmu (menjadi kufur atas pilihan sendiri) itu tidak akan beriman."
  },
  {
    "ayat": 97,
    "arabic": "وَلَوْ جَاۤءَتْهُمْ كُلُّ اٰيَةٍ حَتّٰى يَرَوُا الْعَذَابَ الْاَلِيْمَ",
    "transliteration_en": "Wa law jaaa'at hum kullu Aayatin hattaa yarawul 'azaabal aleem",
    "transliteration_id": "Wa lau jā'athum kullu āyatin ḥattā yarawul-‘ażābal-alīm(a).",
    "translation_en": "Even if every sign should come to them, until they see the painful punishment.",
    "translation_id": "Meskipun semua tanda-tanda (kebesaran Allah) datang kepada mereka, (mereka tidak juga beriman) hingga mereka menyaksikan azab yang sangat pedih."
  },
  {
    "ayat": 98,
    "arabic": "فَلَوْلَا كَانَتْ قَرْيَةٌ اٰمَنَتْ فَنَفَعَهَآ اِيْمَانُهَآ اِلَّا قَوْمَ يُوْنُسَۗ  لَمَّآ اٰمَنُوْا كَشَفْنَا عَنْهُمْ عَذَابَ الْخِزْيِ فِى الْحَيٰوةِ الدُّنْيَا وَمَتَّعْنٰهُمْ اِلٰى حِيْنٍ",
    "transliteration_en": "Falaw laa kaanat qaryatun aamanat fanafa'ahaaa eemaanuhaaa illaa qawma Yoonusa lammaaa aamanoo kashafnaa 'anhum 'azaabal khizyi fil hayaatid dunyaa wa matta'naahum ilaa heen",
    "transliteration_id": "Falau lā kānat qaryatun āmanat fa nafa‘ahā īmānuhā illā qauma yūnus(a), lammā āmanū kasyafnā ‘anhum ‘ażābal-khizyi fil-ḥayātid-dun-yā wa matta‘nāhum ilā ḥīn(in).",
    "translation_en": "Then has there not been a [single] city that believed so its faith benefited it except the people of Jonah? When they believed, We removed from them the punishment of disgrace in worldly life and gave them enjoyment for a time.",
    "translation_id": "Mengapa tidak ada (penduduk) suatu negeri pun yang segera beriman sehingga imannya itu bermanfaat kepadanya, selain kaum Yunus? Ketika mereka beriman, Kami hilangkan dari mereka azab yang menghinakan dalam kehidupan dunia dan Kami berikan kesenangan hidup (sementara) kepada mereka sampai waktu yang ditentukan."
  },
  {
    "ayat": 99,
    "arabic": "وَلَوْ شَاۤءَ رَبُّكَ لَاٰمَنَ مَنْ فِى الْاَرْضِ كُلُّهُمْ جَمِيْعًاۗ اَفَاَنْتَ تُكْرِهُ النَّاسَ حَتّٰى يَكُوْنُوْا مُؤْمِنِيْنَ",
    "transliteration_en": "Wa law shaaa'a Rabbuka la aamana man fil ardi kulluhum jamee'aa; afa anta tukrihun naasa hattaa yakoonoo mu'mineen",
    "transliteration_id": "Wa lau syā'a rabbuka la'āmana man fil-arḍi kulluhum jamī‘ā(n), afa anta tukrihun-nāsa ḥattā yakūnū mu'minīn(a).",
    "translation_en": "And had your Lord willed, those on earth would have believed - all of them entirely. Then, [O Muhammad], would you compel the people in order that they become believers?",
    "translation_id": "Seandainya Tuhanmu menghendaki, tentulah semua orang di bumi seluruhnya beriman. Apakah engkau (Nabi Muhammad) akan memaksa manusia hingga mereka menjadi orang-orang mukmin?"
  },
  {
    "ayat": 100,
    "arabic": "وَمَا كَانَ لِنَفْسٍ اَنْ تُؤْمِنَ اِلَّا بِاِذْنِ اللّٰهِ ۗوَيَجْعَلُ الرِّجْسَ عَلَى الَّذِيْنَ لَا يَعْقِلُوْنَ",
    "transliteration_en": "Wa maa kaana linafsin an tu'mina illaa bi iznil laah; wa yaj'alur rijsa 'alal lazeena laa ya'qiloon",
    "transliteration_id": "Wa mā kāna linafsin an tu'mina illā bi'iżnillāh(i), wa yaj‘alur-rijsa ‘alal-lażīna lā ya‘qilūn(a).",
    "translation_en": "And it is not for a soul to believe except by permission of Allah, and He will place defilement upon those who will not use reason.",
    "translation_id": "Tidak seorang pun akan beriman, kecuali dengan izin Allah dan Dia menimpakan azab kepada orang-orang yang tidak mau mengerti."
  }
]