[
  {
    "ayat": 1,
    "arabic": "طٰسۤمّۤ",
    "transliteration_en": "Taa-Seeen-Meeem",
    "transliteration_id": "Ṭā Sīm Mīm.",
    "translation_en": "Ta, Seen, Meem.",
    "translation_id": "Ṭā Sīn Mīm."
  },
  {
    "ayat": 2,
    "arabic": "تِلْكَ اٰيٰتُ الْكِتٰبِ الْمُبِيْنِ",
    "transliteration_en": "Tilka Aayaatul Kitaabil Mubeen",
    "transliteration_id": "Tilka āyātul-kitābil-mubīn(i).",
    "translation_en": "These are the verses of the clear Book.",
    "translation_id": "Itulah ayat-ayat Kitab (Al-Qur’an) yang jelas."
  },
  {
    "ayat": 3,
    "arabic": "لَعَلَّكَ بَاخِعٌ نَّفْسَكَ اَلَّا يَكُوْنُوْا مُؤْمِنِيْنَ",
    "transliteration_en": "La'allaka baakhi'un nafsaka allaa yakoonoo mu'mineen",
    "transliteration_id": "La‘allaka bākhi‘un nafsaka allā yakūnū mu'minīn(a).",
    "translation_en": "Perhaps, [O Muhammad], you would kill yourself with grief that they will not be believers.",
    "translation_id": "Boleh jadi engkau (Nabi Muhammad) akan membinasakan dirimu (dengan kesedihan) karena mereka (penduduk Makkah) tidak beriman."
  },
  {
    "ayat": 4,
    "arabic": "اِنْ نَّشَأْ نُنَزِّلْ عَلَيْهِمْ مِّنَ السَّمَاۤءِ اٰيَةً فَظَلَّتْ اَعْنَاقُهُمْ لَهَا خٰضِعِيْنَ",
    "transliteration_en": "In nashaa nunazzil 'alaihim minas samaaa'i Aayatan fazallat a'naaquhum lahaa khaadi'een",
    "transliteration_id": "In nasya' nunazzil ‘alaihim minas-samā'i āyatan fa ẓallat a‘nāquhum lahā khāḍi‘īn(a).",
    "translation_en": "If We willed, We could send down to them from the sky a sign for which their necks would remain humbled.",
    "translation_id": "Jika berkehendak, niscaya Kami turunkan bukti (mukjizat) kepada mereka dari langit sehingga tengkuk mereka selalu tunduk kepadanya."
  },
  {
    "ayat": 5,
    "arabic": "وَمَا يَأْتِيْهِمْ مِّنْ ذِكْرٍ مِّنَ الرَّحْمٰنِ مُحْدَثٍ اِلَّا كَانُوْا عَنْهُ مُعْرِضِيْنَ",
    "transliteration_en": "Wa maa yaateehim min zikrim minar Rahmaani muhdasin illaa kaanoo 'anhu mu'rideen",
    "transliteration_id": "Wa mā ya'tīhim min żikrim minar-raḥmāni muḥdaṡin illā kānū ‘anhu mu‘riḍīn(a).",
    "translation_en": "And no revelation comes to them anew from the Most Merciful except that they turn away from it.",
    "translation_id": "Tidak datang kepada mereka suatu peringatan baru (ayat Al-Qur’an) dari Tuhan Yang Maha Pengasih, kecuali mereka selalu berpaling darinya."
  },
  {
    "ayat": 6,
    "arabic": "فَقَدْ كَذَّبُوْا فَسَيَأْتِيْهِمْ اَنْۢبـٰۤؤُا مَا كَانُوْا بِهٖ يَسْتَهْزِءُوْنَ",
    "transliteration_en": "Faqad kazzaboo fasa yaateehim ambaaa'u maa kaanoo bihee yastahzi'oon",
    "transliteration_id": "Faqad każżabū fa saya'tīhim ambā'u mā kānū bihī yastahzi'ūn(a).",
    "translation_en": "For they have already denied, but there will come to them the news of that which they used to ridicule.",
    "translation_id": "Sungguh, mereka telah mendustakan (Al-Qur’an). Maka, kelak akan datang kepada mereka (kebenaran) berita-berita mengenai apa (azab) yang selalu mereka perolok-olokkan."
  },
  {
    "ayat": 7,
    "arabic": "اَوَلَمْ يَرَوْا اِلَى الْاَرْضِ كَمْ اَنْۢبَتْنَا فِيْهَا مِنْ كُلِّ زَوْجٍ كَرِيْمٍ",
    "transliteration_en": "Awa lam yaraw ilal ardi kam ambatnaa feehaa min kulli zawjin kareem",
    "transliteration_id": "Awalam yarau ilal-arḍi kam ambatnā fīhā min kulli zaujin karīm(in).",
    "translation_en": "Did they not look at the earth - how much We have produced therein from every noble kind?",
    "translation_id": "Apakah mereka tidak memperhatikan bumi, betapa banyak Kami telah menumbuhkan di sana segala jenis (tanaman) yang tumbuh baik?"
  },
  {
    "ayat": 8,
    "arabic": "اِنَّ فِيْ ذٰلِكَ لَاٰيَةًۗ وَمَا كَانَ اَكْثَرُهُمْ مُّؤْمِنِيْنَ",
    "transliteration_en": "Inn fee zaalika la Aayah; wa maa kaana aksaruhum mu'mineen",
    "transliteration_id": "Inna fī żālika la'āyah(tan), wa mā kāna akṡaruhum mu'minīn(a).",
    "translation_en": "Indeed in that is a sign, but most of them were not to be believers.",
    "translation_id": "Sesungguhnya pada yang demikian itu benar-benar terdapat tanda (kekuasaan Allah), tetapi kebanyakan mereka tidak beriman."
  },
  {
    "ayat": 9,
    "arabic": "وَاِنَّ رَبَّكَ لَهُوَ الْعَزِيْزُ الرَّحِيْمُ ࣖ",
    "transliteration_en": "Wa inna Rabbaka la Huwal 'Azeezur Raheem",
    "transliteration_id": "Inna rabbaka lahuwal-‘azīzur-raḥīm(u).",
    "translation_en": "And indeed, your Lord - He is the Exalted in Might, the Merciful.",
    "translation_id": "Sesungguhnya Tuhanmu, Dialah yang benar-benar Maha Perkasa lagi Maha Penyayang."
  },
  {
    "ayat": 10,
    "arabic": "وَاِذْ نَادٰى رَبُّكَ مُوْسٰٓى اَنِ ائْتِ الْقَوْمَ الظّٰلِمِيْنَ ۙ",
    "transliteration_en": "Wa iz naadaa Rabbuka Moosaaa ani'-til qawmaz zaalimeen",
    "transliteration_id": "Wa iż nādā rabbuka mūsā ani'til-qaumaẓ-ẓālimīn(a).",
    "translation_en": "And [mention] when your Lord called Moses, [saying], \"Go to the wrongdoing people -",
    "translation_id": "(Ingatlah) ketika Tuhanmu menyeru Musa (dengan firman-Nya), “Datangilah kaum yang zalim itu."
  },
  {
    "ayat": 11,
    "arabic": "قَوْمَ فِرْعَوْنَ ۗ اَلَا يَتَّقُوْنَ",
    "transliteration_en": "Qawma Fir'awn; alaa yattaqoon",
    "transliteration_id": "Qauma fir‘aun(a), alā yattaqūn(a).",
    "translation_en": "The people of Pharaoh. Will they not fear Allah?\"",
    "translation_id": "(Yaitu) kaum Fir‘aun. Mengapa mereka tidak bertakwa?”"
  },
  {
    "ayat": 12,
    "arabic": "قَالَ رَبِّ اِنِّيْٓ اَخَافُ اَنْ يُّكَذِّبُوْنِ ۗ",
    "transliteration_en": "Qaala Rabbi inneee akhaafu ai yukazziboon",
    "transliteration_id": "Qāla rabbi innī akhāfu ay yukażżibūn(i).",
    "translation_en": "He said, \"My Lord, indeed I fear that they will deny me",
    "translation_id": "Dia (Musa) berkata, “Wahai Tuhanku, sesungguhnya aku takut mereka akan mendustakanku."
  },
  {
    "ayat": 13,
    "arabic": "وَيَضِيْقُ صَدْرِيْ وَلَا يَنْطَلِقُ لِسَانِيْ فَاَرْسِلْ اِلٰى هٰرُوْنَ",
    "transliteration_en": "Wa yadeequ sadree wa laa yantaliqu lisaanee fa arsil ilaa Haaroon",
    "transliteration_id": "Wa yaḍīqu ṣadrī wa lā yanṭaliqu lisānī fa arsil ilā hārūn(a).",
    "translation_en": "And that my breast will tighten and my tongue will not be fluent, so send for Aaron.",
    "translation_id": "Dadaku terasa sempit dan lidahku kelu. Maka, utuslah Harun (bersamaku)."
  },
  {
    "ayat": 14,
    "arabic": "وَلَهُمْ عَلَيَّ ذَنْۢبٌ فَاَخَافُ اَنْ يَّقْتُلُوْنِ  ۚ",
    "transliteration_en": "Wa lahum 'alaiya zambun fa akhaafu ai yaqtuloon",
    "transliteration_id": "Wa lahum ‘alayya żambun fa akhāfu ay yaqtulūn(i).",
    "translation_en": "And they have upon me a [claim due to] sin, so I fear that they will kill me.\"",
    "translation_id": "Aku berdosa terhadap mereka. Maka, aku takut mereka akan membunuhku.”"
  },
  {
    "ayat": 15,
    "arabic": "قَالَ كَلَّا ۚفَاذْهَبَا بِاٰيٰتِنَآ اِنَّا مَعَكُمْ مُّسْتَمِعُوْنَ ۙ",
    "transliteration_en": "Qaala kallaa fazhabaa bi Aayaatinaaa innaa ma'akum mustami'oon",
    "transliteration_id": "Qāla kallā, fażhabā bi'āyātinā innā ma‘akum mustami‘ūn(a).",
    "translation_en": "[Allah] said, \"No. Go both of you with Our signs; indeed, We are with you, listening.",
    "translation_id": "Dia (Allah) berfirman, “Tidak (mereka tidak akan dapat membunuhmu). Maka, pergilah berdua dengan membawa ayat-ayat Kami (mukjizat). Sesungguhnya Kami menyertaimu mendengarkan (apa yang mereka katakan)."
  },
  {
    "ayat": 16,
    "arabic": "فَأْتِيَا فِرْعَوْنَ فَقُوْلَآ اِنَّا رَسُوْلُ رَبِّ الْعٰلَمِيْنَ ۙ",
    "transliteration_en": "Faatiyaa Fir'awna faqoolaaa innaa Rasoolu Rabbil 'aalameen",
    "transliteration_id": "Fa'tiyā fir‘auna faqūlā innā rasūlu rabbil-‘ālamīn(a).",
    "translation_en": "Go to Pharaoh and say, 'We are the messengers of the Lord of the worlds,",
    "translation_id": "Maka, datanglah berdua kepada Fir‘aun dan katakanlah, ‘Sesungguhnya kami adalah utusan Tuhan semesta alam."
  },
  {
    "ayat": 17,
    "arabic": "اَنْ اَرْسِلْ مَعَنَا بَنِيْٓ اِسْرَاۤءِيْلَ ۗ",
    "transliteration_en": "An arsil ma'anaa Baneee Israaa'eel",
    "transliteration_id": "An arsil ma‘anā banī isrā'īl(a).",
    "translation_en": "[Commanded to say], \"Send with us the Children of Israel.\"'\"",
    "translation_id": "Lepaskanlah Bani Israil (pergi) bersama kami (menuju Baitulmaqdis).’”"
  },
  {
    "ayat": 18,
    "arabic": "قَالَ اَلَمْ نُرَبِّكَ فِيْنَا وَلِيْدًا وَّلَبِثْتَ فِيْنَا مِنْ عُمُرِكَ سِنِيْنَ ۗ",
    "transliteration_en": "Qaala alam nurabbika feenaa waleedanw wa labista feenaa min 'umurika sineen",
    "transliteration_id": "Qāla alam nurabbika fīnā walīdaw wa labiṡta fīnā min ‘umurika sinīn(a).",
    "translation_en": "[Pharaoh] said, \"Did we not raise you among us as a child, and you remained among us for years of your life?",
    "translation_id": "Dia (Fir‘aun) berkata, “Bukankah kami telah mengasuhmu dalam lingkungan (keluarga) kami, waktu engkau masih bayi dan engkau tinggal bersama kami beberapa tahun dari umurmu."
  },
  {
    "ayat": 19,
    "arabic": "وَفَعَلْتَ فَعْلَتَكَ الَّتِيْ فَعَلْتَ وَاَنْتَ مِنَ الْكٰفِرِيْنَ",
    "transliteration_en": "Wa fa'alta fa'latakal latee fa'alta wa anta minal kaafireen",
    "transliteration_id": "Wa fa‘alta fa‘latakal-latī fa‘alta wa anta minal-kāfirīn(a).",
    "translation_en": "And [then] you did your deed which you did, and you were of the ungrateful.\"",
    "translation_id": "Engkau (Musa) telah melakukan (kesalahan berupa) perbuatan yang telah engkau lakukan (membunuh seseorang dari kaumku) dan engkau termasuk orang yang ingkar (terhadap kebaikan dan ketuhananku).”"
  },
  {
    "ayat": 20,
    "arabic": "قَالَ فَعَلْتُهَآ اِذًا وَّاَنَا۠ مِنَ الضَّاۤلِّيْنَ",
    "transliteration_en": "Qaala fa'altuhaaa izanw wa ana minad daaaleen",
    "transliteration_id": "Qāla fa‘altuhā iżaw wa ana minaḍ-ḍāllīn(a).",
    "translation_en": "[Moses] said, \"I did it, then, while I was of those astray.",
    "translation_id": "Dia (Musa) berkata, “Aku telah melakukannya. Kalau begitu, saat itu aku termasuk orang-orang yang sesat."
  },
  {
    "ayat": 21,
    "arabic": "فَفَرَرْتُ مِنْكُمْ لَمَّا خِفْتُكُمْ فَوَهَبَ لِيْ رَبِّيْ حُكْمًا وَّجَعَلَنِيْ مِنَ الْمُرْسَلِيْنَ",
    "transliteration_en": "Fafarartu minkum lam maa khiftukum fawahaba lee Rabbee hukmanw wa ja'alanee minal mursaleen",
    "transliteration_id": "Fa farartu minkum lammā khiftukum fa wahaba lī rabbī ḥukmaw wa ja‘alanī minal-mursalīn(a).",
    "translation_en": "So I fled from you when I feared you. Then my Lord granted me wisdom and prophethood and appointed me [as one] of the messengers.",
    "translation_id": "Kemudian, aku lari darimu karena takut kepadamu. Lalu, Tuhanku menganugerahkan kepadaku hukum (ilmu dan kearifan) dan menjadikanku salah seorang rasul."
  },
  {
    "ayat": 22,
    "arabic": "وَتِلْكَ نِعْمَةٌ تَمُنُّهَا عَلَيَّ اَنْ عَبَّدْتَّ بَنِيْٓ اِسْرَاۤءِيْلَ ۗ",
    "transliteration_en": "Wa tilka ni'matun tamun nuhaa 'alaiya an 'abbatta Baneee Israaa'eel",
    "transliteration_id": "Wa tilka ni‘matun tamunnuhā ‘alayya an ‘abbatta banī isrā'īl(a).",
    "translation_en": "And is this a favor of which you remind me - that you have enslaved the Children of Israel?\"",
    "translation_id": "Itulah kenikmatan yang engkau berikan kepadaku, (sedangkan) engkau memperbudak Bani Israil.”"
  },
  {
    "ayat": 23,
    "arabic": "قَالَ فِرْعَوْنُ وَمَا رَبُّ الْعٰلَمِيْنَ ۗ",
    "transliteration_en": "Qaala Fir'awnu wa maa Rabbul 'aalameen",
    "transliteration_id": "Qāla fir‘aunu wa mā rabbul-‘ālamīn(a).",
    "translation_en": "Said Pharaoh, \"And what is the Lord of the worlds?\"",
    "translation_id": "Fir‘aun berkata, “Siapa Tuhan semesta alam itu?”"
  },
  {
    "ayat": 24,
    "arabic": "قَالَ رَبُّ السَّمٰوٰتِ وَالْاَرْضِ وَمَا بَيْنَهُمَاۗ اِنْ كُنْتُمْ مُّوْقِنِيْنَ",
    "transliteration_en": "Qaala Rabbus samaawaati wal ardi wa maa bainahumaa in kuntum mooqineen",
    "transliteration_id": "Qāla rabbus-samāwāti wal-arḍi wa mā bainahumā, in kuntum mūqinīn(a).",
    "translation_en": "[Moses] said, \"The Lord of the heavens and earth and that between them, if you should be convinced.\"",
    "translation_id": "Dia (Musa) menjawab, “Tuhan (pencipta dan pemelihara) langit, bumi, dan segala yang ada di antaranya jika kamu orang-orang yang yakin.”"
  },
  {
    "ayat": 25,
    "arabic": "قَالَ لِمَنْ حَوْلَهٗٓ اَلَا تَسْتَمِعُوْنَ",
    "transliteration_en": "Qaala liman hawlahooo alaa tastami'oon",
    "transliteration_id": "Qāla liman ḥaulahū alā tastami‘ūn(a).",
    "translation_en": "[Pharaoh] said to those around him, \"Do you not hear?\"",
    "translation_id": "Dia (Fir‘aun) berkata kepada orang-orang di sekitarnya, “Tidakkah kamu mendengar (apa yang dikatakannya)?”"
  },
  {
    "ayat": 26,
    "arabic": "قَالَ رَبُّكُمْ وَرَبُّ اٰبَاۤىِٕكُمُ الْاَوَّلِيْنَ",
    "transliteration_en": "Qaala Rabbukum wa Rabbu aabaaa'ikumul awwaleen",
    "transliteration_id": "Qāla rabbukum wa rabbu ābā'ikumul-awwalīn(a).",
    "translation_en": "[Moses] said, \"Your Lord and the Lord of your first forefathers.\"",
    "translation_id": "Dia (Musa) berkata, “(Dia) Tuhanmu dan Tuhan nenek moyangmu terdahulu.”"
  },
  {
    "ayat": 27,
    "arabic": "قَالَ اِنَّ رَسُوْلَكُمُ الَّذِيْٓ اُرْسِلَ اِلَيْكُمْ لَمَجْنُوْنٌ",
    "transliteration_en": "Qaala inna Rasoolakumul lazee ursila ilaikum lamajnoon",
    "transliteration_id": "Qāla inna rasūlakumul-lażī ursila ilaikum lamajnūn(un).",
    "translation_en": "[Pharaoh] said, \"Indeed, your 'messenger' who has been sent to you is mad.\"",
    "translation_id": "Dia (Fir‘aun) berkata, “Sesungguhnya rasulmu yang diutus kepadamu benar-benar gila.”"
  },
  {
    "ayat": 28,
    "arabic": "قَالَ رَبُّ الْمَشْرِقِ وَالْمَغْرِبِ وَمَا بَيْنَهُمَاۗ اِنْ كُنْتُمْ تَعْقِلُوْنَ",
    "transliteration_en": "Qaala Rabbul mashriqi wal maghribi wa maa baina humaa in kuntum ta'qiloon",
    "transliteration_id": "Qāla rabbul-masyriqi wal-magribi wa mā bainahumā, in kuntum ta‘qilūn(a).",
    "translation_en": "[Moses] said, \"Lord of the east and the west and that between them, if you were to reason.\"",
    "translation_id": "Dia (Musa) berkata, “(Dia) Tuhan (yang menguasai) timur dan barat serta segala yang ada di antaranya jika kamu mengerti.”"
  },
  {
    "ayat": 29,
    "arabic": "قَالَ لَىِٕنِ اتَّخَذْتَ اِلٰهًا غَيْرِيْ لَاَجْعَلَنَّكَ مِنَ الْمَسْجُوْنِيْنَ",
    "transliteration_en": "Qaala la'init takhazta ilaahan ghairee la aj'alannaka minal masjooneen",
    "transliteration_id": "Qāla la'inittakhażta ilāhan gairī la'aj‘alannaka minal-masjūnīn(a).",
    "translation_en": "[Pharaoh] said, \"If you take a god other than me, I will surely place you among those imprisoned.\"",
    "translation_id": "Dia (Fir‘aun) berkata, “Sungguh, jika engkau menyembah Tuhan selainku, niscaya aku benar-benar akan menjadikanmu termasuk orang-orang yang dipenjarakan.”"
  },
  {
    "ayat": 30,
    "arabic": "قَالَ اَوَلَوْ جِئْتُكَ بِشَيْءٍ مُّبِيْنٍ",
    "transliteration_en": "Qaala awalw ji'tuka bishai'im mubeen",
    "transliteration_id": "Qāla awalau ji'tuka bisyai'im mubīn(in).",
    "translation_en": "[Moses] said, \"Even if I brought you proof manifest?\"",
    "translation_id": "Dia (Musa) berkata, “Apakah (engkau akan melakukan itu) sekalipun aku mendatangkan kepadamu sesuatu (bukti) yang jelas?”"
  },
  {
    "ayat": 31,
    "arabic": "قَالَ فَأْتِ بِهٖٓ اِنْ كُنْتَ مِنَ الصّٰدِقِيْنَ",
    "transliteration_en": "Qaala faati biheee in kunta minas saadiqeen",
    "transliteration_id": "Qāla fa'ti bihī in kunta minaṣ-ṣādiqīn(a).",
    "translation_en": "[Pharaoh] said, \"Then bring it, if you should be of the truthful.\"",
    "translation_id": "Dia (Fir‘aun) berkata, “Datangkanlah (bukti yang jelas) itu jika engkau termasuk orang-orang yang benar!”"
  },
  {
    "ayat": 32,
    "arabic": "فَاَلْقٰى عَصَاهُ فَاِذَا هِيَ ثُعْبَانٌ مُّبِيْنٌ ۚ",
    "transliteration_en": "Fa alqaa 'asaahu fa izaaa hiya su'baanum mubeen",
    "transliteration_id": "Fa alqā ‘aṣāhu fa iżā hiya ṡu‘bānum mubīn(un).",
    "translation_en": "So [Moses] threw his staff, and suddenly it was a serpent manifest.",
    "translation_id": "Maka, dia (Musa) melemparkan tongkatnya, tiba-tiba ia (tongkat itu) menjadi ular besar yang nyata."
  },
  {
    "ayat": 33,
    "arabic": "وَنَزَعَ يَدَهٗ فَاِذَا هِيَ بَيْضَاۤءُ لِلنّٰظِرِيْنَ ࣖ",
    "transliteration_en": "Wa naza'a yadahoo faizaa hiya baidaaa'u linnaa zireen",
    "transliteration_id": "Wa naza‘a yadahū fa iżā hiya baiḍā'u lin-nāẓirīn(a).",
    "translation_en": "And he drew out his hand; thereupon it was white for the observers.",
    "translation_id": "Dia menarik tangannya, tiba-tiba ia (tangan itu) menjadi putih (bercahaya) bagi orang-orang yang melihat(-nya)."
  },
  {
    "ayat": 34,
    "arabic": "قَالَ لِلْمَلَاِ حَوْلَهٗٓ اِنَّ هٰذَا لَسٰحِرٌ عَلِيْمٌ ۙ",
    "transliteration_en": "Qaala lilmala-i hawlahooo inna haazaa lasaahirun 'aleem",
    "transliteration_id": "Qāla lil-mala'i ḥaulahū inna hāżā lasāḥirun ‘alīm(un).",
    "translation_en": "[Pharaoh] said to the eminent ones around him, \"Indeed, this is a learned magician.",
    "translation_id": "Dia (Fir‘aun) berkata kepada para pemuka di sekitarnya, “Sesungguhnya dia (Musa) ini benar-benar seorang penyihir yang sangat pandai."
  },
  {
    "ayat": 35,
    "arabic": "يُّرِيْدُ اَنْ يُّخْرِجَكُمْ مِّنْ اَرْضِكُمْ بِسِحْرِهٖۖ فَمَاذَا تَأْمُرُوْنَ",
    "transliteration_en": "Yureedu ai yukhrijakum min ardikum bisihrihee famaazaa taamuroon",
    "transliteration_id": "Yurīdu ay yukhrijakum min arḍikum bisiḥrih(ī), fa māżā ta'murūn(a).",
    "translation_en": "He wants to drive you out of your land by his magic, so what do you advise?\"",
    "translation_id": "Dia hendak mengeluarkanmu dari negerimu dengan sihirnya. Maka, apa yang kamu sarankan?”"
  },
  {
    "ayat": 36,
    "arabic": "قَالُوْٓا اَرْجِهْ وَاَخَاهُ وَابْعَثْ فِى الْمَدَاۤىِٕنِ حٰشِرِيْنَ ۙ",
    "transliteration_en": "Qaalooo arjih wa akhaahu wab'as filmadaaa'ini haashireen",
    "transliteration_id": "Qālū arjih wa akhāhu wab‘aṡ fil-madā'ini ḥāsyirīn(a).",
    "translation_en": "They said, \"Postpone [the matter of] him and his brother and send among the cities gatherers",
    "translation_id": "Mereka berkata, “Tahanlah (untuk sementara) dia dan saudaranya serta utuslah ke seluruh negeri orang-orang yang akan mengumpulkan (penyihir)."
  },
  {
    "ayat": 37,
    "arabic": "يَأْتُوْكَ بِكُلِّ سَحَّارٍ عَلِيْمٍ",
    "transliteration_en": "Yaatooka bikulli sah haarin 'aleem",
    "transliteration_id": "Ya'tūka bikulli saḥḥārin ‘alīm(in).",
    "translation_en": "Who will bring you every learned, skilled magician.\"",
    "translation_id": "Mereka akan mendatangkan kepadamu semua penyihir yang sangat pandai.”"
  },
  {
    "ayat": 38,
    "arabic": "فَجُمِعَ السَّحَرَةُ لِمِيْقَاتِ يَوْمٍ مَّعْلُوْمٍ ۙ",
    "transliteration_en": "Fa jumi'as saharatu limeeqaati Yawmim ma'loom",
    "transliteration_id": "Fa jumi‘as-saḥaratu limīqāti yaumim ma‘lūm(in).",
    "translation_en": "So the magicians were assembled for the appointment of a well-known day.",
    "translation_id": "Maka, dikumpulkanlah para penyihir pada waktu (yang ditetapkan) pada hari yang telah ditentukan."
  },
  {
    "ayat": 39,
    "arabic": "وَّقِيْلَ لِلنَّاسِ هَلْ اَنْتُمْ مُّجْتَمِعُوْنَ ۙ",
    "transliteration_en": "Wa qeela linnaasi hal antum mujtami'oon",
    "transliteration_id": "Wa qīla lin-nāsi hal antum mujtami‘ūn(a).",
    "translation_en": "And it was said to the people, \"Will you congregate",
    "translation_id": "Lalu, diumumkan kepada orang banyak, “Apakah kamu semua sudah berkumpul?"
  },
  {
    "ayat": 40,
    "arabic": "لَعَلَّنَا نَتَّبِعُ السَّحَرَةَ اِنْ كَانُوْا هُمُ الْغٰلِبِيْنَ",
    "transliteration_en": "La'allanaa nattabi'us saharata in kaanoo humul ghaalibeen",
    "transliteration_id": "La‘allanā nattabi‘us-saḥarata in kānū humul-gālibīn(a).",
    "translation_en": "That we might follow the magicians if they are the predominant?\"",
    "translation_id": "(Tujuannya) supaya kita mengikuti para penyihir itu jika mereka jadi para pemenang.”"
  },
  {
    "ayat": 41,
    "arabic": "فَلَمَّا جَاۤءَ السَّحَرَةُ قَالُوْا لِفِرْعَوْنَ اَىِٕنَّ لَنَا لَاَجْرًا اِنْ كُنَّا نَحْنُ الْغٰلِبِيْنَ",
    "transliteration_en": "Falammaa jaaa'as saharatu qaaloo li Fir'awna a'inna lanaa la ajjran in kunnaa nahnul ghaalibeen",
    "transliteration_id": "Falammā jā'as-saḥaratu qālū lifir‘auna a'inna lanā la'ajran in kunnā naḥnul-gālibīn(a).",
    "translation_en": "And when the magicians arrived, they said to Pharaoh, \"Is there indeed for us a reward if we are the predominant?\"",
    "translation_id": "Maka, ketika para penyihir datang, mereka berkata kepada Fir‘aun, “Apakah kami benar-benar akan memperoleh imbalan besar jika kami yang menjadi pemenang?”"
  },
  {
    "ayat": 42,
    "arabic": "قَالَ نَعَمْ وَاِنَّكُمْ اِذًا لَّمِنَ الْمُقَرَّبِيْنَ",
    "transliteration_en": "Qaala na'am wa innakum izal laminal muqarrabeen",
    "transliteration_id": "Qāla na‘am wa innakum iżal laminal-muqarrabīn(a).",
    "translation_en": "He said, \"Yes, and indeed, you will then be of those near [to me].\"",
    "translation_id": "Dia (Fir‘aun) menjawab, “Ya, bahkan kamu pasti akan menjadi orang-orang yang dekat (kepadaku).”"
  },
  {
    "ayat": 43,
    "arabic": "قَالَ لَهُمْ مُّوْسٰٓى اَلْقُوْا مَآ اَنْتُمْ مُّلْقُوْنَ",
    "transliteration_en": "Qaala lahum Moosaaa alqoo maaa antum mulqoon",
    "transliteration_id": "Qāla lahum mūsā alqū mā antum mulqūn(a).",
    "translation_en": "Moses said to them, \"Throw whatever you will throw.\"",
    "translation_id": "Musa berkata kepada mereka, “Lemparkanlah apa yang hendak kamu lemparkan!”"
  },
  {
    "ayat": 44,
    "arabic": "فَاَلْقَوْا حِبَالَهُمْ وَعِصِيَّهُمْ وَقَالُوْا بِعِزَّةِ فِرْعَوْنَ اِنَّا لَنَحْنُ الْغٰلِبُوْنَ",
    "transliteration_en": "Fa alqaw hibaalahum wa 'isiyyahum wa qaaloo bi'izzati Fir'awna innaa lanahnul ghaaliboon",
    "transliteration_id": "Fa alqau ḥibālahum wa ‘iṣiyyahum wa qālū bi‘izzati fir‘auna innā lanaḥnul-gālibūn(a).",
    "translation_en": "So they threw their ropes and their staffs and said, \"By the might of Pharaoh, indeed it is we who are predominant.\"",
    "translation_id": "Lalu, mereka melemparkan tali-tali dan tongkat-tongkat mereka seraya berkata, “Demi kekuasaan Fir‘aun, sesungguhnya kamilah yang benar-benar sebagai pemenang.”"
  },
  {
    "ayat": 45,
    "arabic": "فَاَلْقٰى مُوْسٰى عَصَاهُ فَاِذَا هِيَ تَلْقَفُ مَا يَأْفِكُوْنَ ۚ",
    "transliteration_en": "Fa alqaa Moosaa 'asaahu fa izaa hiya talqafu maa yaafikoon",
    "transliteration_id": "Fa alqā mūsā ‘aṣāhu fa iżā hiya talqafu mā ya'fikūn(a).",
    "translation_en": "Then Moses threw his staff, and at once it devoured what they falsified.",
    "translation_id": "Kemudian, Musa melemparkan tongkatnya, tiba-tiba ia (tongkatnya yang sudah menjadi ular) menelan segala yang mereka ada-adakan itu."
  },
  {
    "ayat": 46,
    "arabic": "فَاُلْقِيَ السَّحَرَةُ سٰجِدِيْنَ ۙ",
    "transliteration_en": "Fa ulqiyas saharatu saajideen",
    "transliteration_id": "Fa ulqiyas-saḥaratu sājidīn(a).",
    "translation_en": "So the magicians fell down in prostration [to Allah].",
    "translation_id": "Maka, tersungkurlah para penyihir itu (dalam keadaan) bersujud."
  },
  {
    "ayat": 47,
    "arabic": "قَالُوْٓا اٰمَنَّا بِرَبِّ الْعٰلَمِيْنَ ۙ",
    "transliteration_en": "Qaalooo aamannaa bi Rabbil 'aalameen",
    "transliteration_id": "Qālū āmannā birabbil-‘ālamīn(a).",
    "translation_en": "They said, \"We have believed in the Lord of the worlds,",
    "translation_id": "Mereka berkata, “Kami beriman kepada Tuhan semesta alam,"
  },
  {
    "ayat": 48,
    "arabic": "رَبِّ مُوْسٰى وَهٰرُوْنَ",
    "transliteration_en": "Rabbi Moosaa wa Haaroon",
    "transliteration_id": "Rabbi mūsā wa hārūn(a).",
    "translation_en": "The Lord of Moses and Aaron.\"",
    "translation_id": "(yaitu) Tuhannya Musa dan Harun.”"
  },
  {
    "ayat": 49,
    "arabic": "قَالَ اٰمَنْتُمْ لَهٗ قَبْلَ اَنْ اٰذَنَ لَكُمْۚ اِنَّهٗ لَكَبِيْرُكُمُ الَّذِيْ عَلَّمَكُمُ السِّحْرَۚ فَلَسَوْفَ تَعْلَمُوْنَ ەۗ لَاُقَطِّعَنَّ اَيْدِيَكُمْ وَاَرْجُلَكُمْ مِّنْ خِلَافٍ وَّلَاُصَلِّبَنَّكُمْ اَجْمَعِيْنَۚ",
    "transliteration_en": "Qaala aamantum lahoo qabla an aazana lakum innahoo lakabeerukumul lazee 'alla makumus sihra falasawfa ta'lamoon; la uqatti'anna aidiyakum wa arjulakum min khilaafinw wa la usallibanna kum ajma'een",
    "transliteration_id": "Qāla āmantum lahū qabla an āżana lakum, innahū lakabīrukumul-lażī ‘allamakumus-siḥr(a), fa lasaufa ta‘lamūn(a), la'uqaṭṭi‘anna aidiyakum wa arjulakum min khilāfiw wa la'uṣallibannakum  ajma'īn(a).",
    "translation_en": "[Pharaoh] said, \"You believed Moses before I gave you permission. Indeed, he is your leader who has taught you magic, but you are going to know. I will surely cut off your hands and your feet on opposite sides, and I will surely crucify you all.\"",
    "translation_id": "Dia (Fir‘aun) berkata, “Apakah kamu sekalian beriman kepadanya (Musa) sebelum aku mengizinkanmu? Sesungguhnya dia benar-benar pemimpinmu yang mengajarkan sihir kepadamu. Maka, kamu tentu akan tahu (akibat perbuatanmu). Pasti kupotong tangan dan kakimu secara bersilang dan benar-benar akan kusalib kamu semua.”"
  },
  {
    "ayat": 50,
    "arabic": "قَالُوْا لَا ضَيْرَ ۖاِنَّآ اِلٰى رَبِّنَا مُنْقَلِبُوْنَ ۚ",
    "transliteration_en": "Qaaloo la daira innaaa ilaa Rabbinaa munqalliboon",
    "transliteration_id": "Qālū lā ḍair(a), innā ilā rabbinā munqalibūn(a).",
    "translation_en": "They said, \"No harm. Indeed, to our Lord we will return.",
    "translation_id": "Mereka menjawab, “Tidak ada yang kami takutkan. Sesungguhnya kami akan kembali kepada Tuhan kami."
  }
]