[
  {
    "ayat": 1,
    "arabic": "قۤ  ۗوَالْقُرْاٰنِ الْمَجِيْدِ  ۖ",
    "transliteration_en": "Qaaaf; wal Qur aanil Majeed",
    "transliteration_id": "Qāf, wal-qur'ānil-majīd(i).",
    "translation_en": "Qaf. By the honored Qur'an...",
    "translation_id": "Qāf. Demi Al-Qur’an yang mulia."
  },
  {
    "ayat": 2,
    "arabic": "بَلْ عَجِبُوْٓا اَنْ جَاۤءَهُمْ مُّنْذِرٌ مِّنْهُمْ فَقَالَ الْكٰفِرُوْنَ هٰذَا شَيْءٌ عَجِيْبٌ ۚ",
    "transliteration_en": "Bal 'ajibooo an jaa'ahum munzirum minhum faqaalal kaafiroona haazaa shai'un 'ajeeb",
    "transliteration_id": "Bal ‘ajibū an jā'ahum munżirum minhum faqālal-kāfirūna hāżā syai'un ‘ajīb(un).",
    "translation_en": "But they wonder that there has come to them a warner from among themselves, and the disbelievers say, \"This is an amazing thing.",
    "translation_id": "(Mereka menolaknya,) bahkan mereka heran karena telah datang kepada mereka seorang pemberi peringatan dari (kalangan) mereka sendiri. Berkatalah orang-orang kafir, “Ini adalah sesuatu yang sangat mengherankan."
  },
  {
    "ayat": 3,
    "arabic": "ءَاِذَا مِتْنَا وَكُنَّا تُرَابًا ۚ ذٰلِكَ رَجْعٌۢ بَعِيْدٌ",
    "transliteration_en": "'A-izaa mitnaa wa kunnaa turaaban zaalika raj'um ba'eed",
    "transliteration_id": "A'iżā mitnā wa kunnā turābā(n), żālika raj‘um ba‘īd(un).",
    "translation_en": "When we have died and have become dust, [we will return to life]? That is a distant return.\"",
    "translation_id": "Apakah setelah kami mati dan sudah menjadi tanah (akan dikembalikan)? Itu adalah pengembalian yang sangat jauh.”"
  },
  {
    "ayat": 4,
    "arabic": "قَدْ عَلِمْنَا مَا تَنْقُصُ الْاَرْضُ مِنْهُمْ ۚوَعِنْدَنَا كِتٰبٌ حَفِيْظٌ",
    "transliteration_en": "Qad 'alimnaa maa tanqu-sul-ardu minhum wa 'indanaa Kitaabun Hafeez",
    "transliteration_id": "Qad ‘alimnā mā tanquṣul-arḍu minhum, wa ‘indanā kitābun ḥafīẓ(un).",
    "translation_en": "We know what the earth diminishes of them, and with Us is a retaining record.",
    "translation_id": "Sungguh, Kami telah mengetahui apa yang dimakan bumi dari (tubuh) mereka karena pada Kami ada kitab (catatan) yang terpelihara baik."
  },
  {
    "ayat": 5,
    "arabic": "بَلْ كَذَّبُوْا بِالْحَقِّ لَمَّا جَاۤءَهُمْ فَهُمْ فِيْٓ اَمْرٍ مَّرِيْجٍ",
    "transliteration_en": "Bal kazzaboo bilhaqqi lammaa jaaa'ahum fahum feee amrim mareej",
    "transliteration_id": "Bal każżabū bil-ḥaqqi lammā jā'ahum fahum fī amrim marīj(in).",
    "translation_en": "But they denied the truth when it came to them, so they are in a confused condition.",
    "translation_id": "Bahkan, mereka mendustakan kebenaran ketika datang kepadanya. Maka, mereka berada dalam keadaan kacau balau."
  },
  {
    "ayat": 6,
    "arabic": "اَفَلَمْ يَنْظُرُوْٓا اِلَى السَّمَاۤءِ فَوْقَهُمْ كَيْفَ بَنَيْنٰهَا وَزَيَّنّٰهَا وَمَا لَهَا مِنْ فُرُوْجٍ",
    "transliteration_en": "Afalam yanzurooo ilas samaaa'i fawqahum kaifa banainaahaa wa zaiyannaahaa wa maa lahaa min furooj",
    "transliteration_id": "Afalam yanẓurū ilas-samā'i fauqahum kaifa banaināhā wa zayyanāhā wa mā lahā min furūj(in).",
    "translation_en": "Have they not looked at the heaven above them - how We structured it and adorned it and [how] it has no rifts?",
    "translation_id": "Apakah mereka tidak memperhatikan langit yang ada di atas mereka, bagaimana cara Kami membangunnya dan menghiasinya tanpa ada retak-retak padanya sedikit pun?"
  },
  {
    "ayat": 7,
    "arabic": "وَالْاَرْضَ مَدَدْنٰهَا وَاَلْقَيْنَا فِيْهَا رَوَاسِيَ وَاَنْۢبَتْنَا فِيْهَا مِنْ كُلِّ زَوْجٍۢ بَهِيْجٍۙ",
    "transliteration_en": "Wal arda madadnaahaa wa alqainaa feehaa rawaasiya wa ambatnaa feehaa min kulli zawjim baheej",
    "transliteration_id": "Wal-arḍa madadnāhā wa alqainā fīhā rawāsiya wa ambatnā fīhā min kulli zaujim bahīj(in).",
    "translation_en": "And the earth - We spread it out and cast therein firmly set mountains and made grow therein [something] of every beautiful kind,",
    "translation_id": "(Demikian pula) bumi yang Kami hamparkan serta Kami pancangkan di atasnya gunung-gunung yang kukuh dan Kami tumbuhkan di atasnya berbagai jenis (tetumbuhan) yang indah"
  },
  {
    "ayat": 8,
    "arabic": "تَبْصِرَةً وَّذِكْرٰى لِكُلِّ عَبْدٍ مُّنِيْبٍ",
    "transliteration_en": "Tabsiratanw wa zikraa likulli 'abdim muneeb",
    "transliteration_id": "Tabṣirataw wa żikrā likulli ‘abdim munīb(in).",
    "translation_en": "Giving insight and a reminder for every servant who turns [to Allah].",
    "translation_id": "untuk menjadi pelajaran dan pengingat bagi setiap hamba yang kembali (tunduk kepada Allah)."
  },
  {
    "ayat": 9,
    "arabic": "وَنَزَّلْنَا مِنَ السَّمَاۤءِ مَاۤءً مُّبٰرَكًا فَاَنْۢبَتْنَا بِهٖ جَنّٰتٍ وَّحَبَّ الْحَصِيْدِۙ",
    "transliteration_en": "Wa nazzalnaa minas samaaa'i maaa'am mubaarakan fa ambatnaa bihee jannaatinw wa habbal haseed",
    "transliteration_id": "Wa nazzalnā minas-samā'i mā'am mubārakan fa'ambatnā bihī jannātiw wa ḥabbal-ḥaṣīd(i).",
    "translation_en": "And We have sent down blessed rain from the sky and made grow thereby gardens and grain from the harvest",
    "translation_id": "Kami turunkan dari langit air yang diberkahi, lalu Kami tumbuhkan dengannya kebun-kebun dan biji-bijian yang dapat dipanen."
  },
  {
    "ayat": 10,
    "arabic": "وَالنَّخْلَ بٰسِقٰتٍ لَّهَا طَلْعٌ نَّضِيْدٌۙ",
    "transliteration_en": "Wannakhla baasiqaatil laha tal'un nadeed",
    "transliteration_id": "Wan-nakhla bāsiqātil lahā ṭal‘un naḍīd(un).",
    "translation_en": "And lofty palm trees having fruit arranged in layers -",
    "translation_id": "Begitu pula pohon-pohon kurma yang tinggi yang mayangnya bersusun-susun"
  },
  {
    "ayat": 11,
    "arabic": "رِّزْقًا لِّلْعِبَادِۙ وَاَحْيَيْنَا بِهٖ بَلْدَةً مَّيْتًاۗ  كَذٰلِكَ الْخُرُوْجُ",
    "transliteration_en": "Rizqal lil'ibaad, wa ahyainaa bihee baldatam maitaa; kazaalikal khurooj",
    "transliteration_id": "Rizqal lil-‘ibād(i), wa aḥyainā bihī baldatam maitā(n), każālikal-khurūj(u).",
    "translation_en": "As provision for the servants, and We have given life thereby to a dead land. Thus is the resurrection.",
    "translation_id": "sebagai rezeki bagi hamba-hamba (Kami). Kami hidupkan pula dengan (air) itu negeri yang mati (tandus). Seperti itulah terjadinya kebangkitan (dari kubur)."
  },
  {
    "ayat": 12,
    "arabic": "كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوْحٍ وَّاَصْحٰبُ الرَّسِّ وَثَمُوْدُ",
    "transliteration_en": "Kazzabat qablahum qawmu Noohinw wa Ashaabur Rassi wa Samood",
    "transliteration_id": "Każżabat qablahum qaumu nūḥiw wa aṣḥābur-rassi wa ṡamūd(u).",
    "translation_en": "The people of Noah denied before them, and the companions of the well and Thamud",
    "translation_id": "Sebelum mereka, kaum Nuh, penduduk Rass, dan (kaum) Samud telah mendustakan (rasul-rasul)."
  },
  {
    "ayat": 13,
    "arabic": "وَعَادٌ وَّفِرْعَوْنُ وَاِخْوَانُ لُوْطٍۙ",
    "transliteration_en": "Wa 'Aadunw wa Fir'awnu wikhwaanu loot",
    "transliteration_id": "Wa ‘āduw wa fir‘aunu wa ikhwānu lūṭ(in).",
    "translation_en": "And 'Aad and Pharaoh and the brothers of Lot",
    "translation_id": "(Demikian juga kaum) ‘Ad, Fir‘aun, kaum Lut,"
  },
  {
    "ayat": 14,
    "arabic": "وَّاَصْحٰبُ الْاَيْكَةِ وَقَوْمُ تُبَّعٍۗ كُلٌّ كَذَّبَ الرُّسُلَ فَحَقَّ وَعِيْدِ",
    "transliteration_en": "Wa Ashaabul Aykati wa qawmu Tubba'; kullun kazzabar Rusula fahaqqa wa'eed",
    "transliteration_id": "Wa aṣḥābul-aikati wa qaumu tubba‘(in), kullun każżabar-rusula faḥaqqa wa‘īd(i).",
    "translation_en": "And the companions of the thicket and the people of Tubba'. All denied the messengers, so My threat was justly fulfilled.",
    "translation_id": "penduduk Aikah, dan kaum Tubba‘. Semuanya telah mendustakan rasul-rasul, maka berlakulah ancaman-Ku (atas mereka)."
  },
  {
    "ayat": 15,
    "arabic": "اَفَعَيِيْنَا بِالْخَلْقِ الْاَوَّلِۗ بَلْ هُمْ فِيْ لَبْسٍ مِّنْ خَلْقٍ جَدِيْدٍ ࣖ",
    "transliteration_en": "Afa'a yeenaa bilkhalqil awwal; bal hum fee labsim min khalqin jadeed",
    "transliteration_id": "Afa ‘ayīna bil-khalqil-awwal(i), bal hum fī labsim min khalqin jadīd(in).",
    "translation_en": "Did We fail in the first creation? But they are in confusion over a new creation.",
    "translation_id": "Apakah Kami letih dengan penciptaan yang pertama? (Sama sekali tidak,) bahkan mereka dalam keadaan ragu tentang penciptaan yang baru."
  },
  {
    "ayat": 16,
    "arabic": "وَلَقَدْ خَلَقْنَا الْاِنْسَانَ وَنَعْلَمُ مَا تُوَسْوِسُ بِهٖ نَفْسُهٗ ۖوَنَحْنُ اَقْرَبُ اِلَيْهِ مِنْ حَبْلِ الْوَرِيْدِ",
    "transliteration_en": "Wa laqad khalaqnal insaana wa na'lamu maa tuwaswisu bihee nafsuhoo wa Nahnu aqrabu ilaihi min hablil wareed",
    "transliteration_id": "Wa laqad khalaqnal-insāna wa na‘lamu mā tuwaswisu bihī nafsuh(ū), wa naḥnu aqrabu ilaihi min ḥablil-warīd(i).",
    "translation_en": "And We have already created man and know what his soul whispers to him, and We are closer to him than [his] jugular vein",
    "translation_id": "Sungguh, Kami benar-benar telah menciptakan manusia dan mengetahui apa yang dibisikkan oleh dirinya. Kami lebih dekat kepadanya daripada urat lehernya."
  },
  {
    "ayat": 17,
    "arabic": "اِذْ يَتَلَقَّى الْمُتَلَقِّيٰنِ عَنِ الْيَمِيْنِ وَعَنِ الشِّمَالِ قَعِيْدٌ",
    "transliteration_en": "'Iz yatalaqqal mutalaqqi yaani 'anil yameeni wa 'anish shimaali qa'eed",
    "transliteration_id": "Iż yatalaqqal-mutalaqqiyāni ‘anil-yamīni wa ‘anisy-syimāli qa‘īd(un).",
    "translation_en": "When the two receivers receive, seated on the right and on the left.",
    "translation_id": "(Ingatlah) ketika dua malaikat mencatat (perbuatannya). Yang satu duduk di sebelah kanan dan yang lain di sebelah kiri."
  },
  {
    "ayat": 18,
    "arabic": "مَا يَلْفِظُ مِنْ قَوْلٍ اِلَّا لَدَيْهِ رَقِيْبٌ عَتِيْدٌ",
    "transliteration_en": "Maa yalfizu min qawlin illaa ladaihi raqeebun 'ateed",
    "transliteration_id": "Mā yalfiẓu min qaulin illā ladaihi raqībun ‘atīd(un).",
    "translation_en": "Man does not utter any word except that with him is an observer prepared [to record].",
    "translation_id": "Tidak ada suatu kata pun yang terucap, melainkan ada di sisinya malaikat pengawas yang selalu siap (mencatat)."
  },
  {
    "ayat": 19,
    "arabic": "وَجَاۤءَتْ سَكْرَةُ الْمَوْتِ بِالْحَقِّ ۗذٰلِكَ مَا كُنْتَ مِنْهُ تَحِيْدُ",
    "transliteration_en": "Wa jaaa'at kullu nafsim ma'ahaa saaa'iqunw wa shaheed",
    "transliteration_id": "Wa jā'at sakratul-mauti bil-ḥaqq(i), żālika mā kunta minhu taḥīd(u).",
    "translation_en": "And the intoxication of death will bring the truth; that is what you were trying to avoid.",
    "translation_id": "(Seketika itu) datanglah sakratulmautdengan sebenar-benarnya. Itulah yang dahulu hendak engkau hindari."
  },
  {
    "ayat": 20,
    "arabic": "وَنُفِخَ فِى الصُّوْرِۗ ذٰلِكَ يَوْمُ الْوَعِيْدِ",
    "transliteration_en": "Wa nufikha fis Soor; zaalika yawmul wa'eed",
    "transliteration_id": "Wa nufikha fiṣ-ṣūr(i), żālika yaumul-wa‘īd(i).",
    "translation_en": "And the Horn will be blown. That is the Day of [carrying out] the threat.",
    "translation_id": "Ditiuplah sangkakala. Itulah hari yang diancamkan."
  },
  {
    "ayat": 21,
    "arabic": "وَجَاۤءَتْ كُلُّ نَفْسٍ مَّعَهَا سَاۤىِٕقٌ وَّشَهِيْدٌ",
    "transliteration_en": "Wa jaaa'at kullu nafsim ma'ahaa saaa'iqunw wa shaheed",
    "transliteration_id": "Wa jā'at kullu nafsim ma‘ahā sā'iquw wa syahīd(un).",
    "translation_en": "And every soul will come, with it a driver and a witness.",
    "translation_id": "Lalu, setiap orang akan datang bersama (malaikat) penggiring dan saksi."
  },
  {
    "ayat": 22,
    "arabic": "لَقَدْ كُنْتَ فِيْ غَفْلَةٍ مِّنْ هٰذَا فَكَشَفْنَا عَنْكَ غِطَاۤءَكَ فَبَصَرُكَ الْيَوْمَ حَدِيْدٌ",
    "transliteration_en": "Laqad kunta fee ghaf latim min haazaa fakashafnaa 'anka ghitaaa'aka fabasarukal yawma hadeed",
    "transliteration_id": "Laqad kunta fī gaflatim min hāżā fakasyafnā ‘anka giṭā'aka fabaṣarukal-yauma ḥadīd(un).",
    "translation_en": "[It will be said], \"You were certainly in unmindfulness of this, and We have removed from you your cover, so your sight, this Day, is sharp.\"",
    "translation_id": "Sungguh, kamu dahulu benar-benar lalai tentang (peristiwa) ini, maka Kami singkapkan penutup matamu, sehingga penglihatanmu pada hari ini sangat tajam."
  },
  {
    "ayat": 23,
    "arabic": "وَقَالَ قَرِيْنُهٗ هٰذَا مَا لَدَيَّ عَتِيْدٌۗ",
    "transliteration_en": "Wa qaala qareenuhoo haazaa maa ladaiya 'ateed",
    "transliteration_id": "Wa qāla qarīnuhū hāżā mā ladayya ‘atīd(un).",
    "translation_en": "And his companion, [the angel], will say, \"This [record] is what is with me, prepared.\"",
    "translation_id": "(Malaikat) yang menyertainya berkata, “Inilah (catatan perbuatan) yang ada padaku.”"
  },
  {
    "ayat": 24,
    "arabic": "اَلْقِيَا فِيْ جَهَنَّمَ كُلَّ كَفَّارٍ عَنِيْدٍ",
    "transliteration_en": "Alqiyaa fee Jahannama kulla kaffaarin 'aneed",
    "transliteration_id": "Alqiyā fī jahannama kulla kaffārin ‘anīd(in).",
    "translation_en": "[Allah will say], \"Throw into Hell every obstinate disbeliever,",
    "translation_id": "(Allah berfirman,) “Lemparkanlah olehmu berdua ke dalam (neraka) Jahanam semua orang yang sangat ingkar, keras kepala,"
  },
  {
    "ayat": 25,
    "arabic": "مَنَّاعٍ لِّلْخَيْرِ مُعْتَدٍ مُّرِيْبٍۙ",
    "transliteration_en": "Mannaa'il lilkhayri mu'tadim mureeb",
    "transliteration_id": "Mannā‘il lil-khairi mu‘tadim murīb(in).",
    "translation_en": "Preventer of good, aggressor, and doubter,",
    "translation_id": "sangat enggan melakukan kebajikan, melampaui batas, bersikap ragu-ragu,"
  },
  {
    "ayat": 26,
    "arabic": "ۨالَّذِيْ جَعَلَ مَعَ اللّٰهِ اِلٰهًا اٰخَرَ فَاَلْقِيٰهُ فِى الْعَذَابِ الشَّدِيْدِ",
    "transliteration_en": "Allazee ja'ala ma'al laahi ilaahan aakhara fa alqiyaahu fil'azaabish shadeed",
    "transliteration_id": "Allażī ja‘ala ma‘allāhi ilāhan ākhara fa'alqiyāhu fil-‘ażābisy-syadīd(i).",
    "translation_en": "Who made [as equal] with Allah another deity; then throw him into the severe punishment.\"",
    "translation_id": "(dan) yang mempersekutukan Allah dengan tuhan lain. Maka, lemparkanlah dia ke dalam azab yang keras.”"
  },
  {
    "ayat": 27,
    "arabic": "۞ قَالَ قَرِيْنُهٗ رَبَّنَا مَآ اَطْغَيْتُهٗ وَلٰكِنْ كَانَ فِيْ ضَلٰلٍۢ بَعِيْدٍ",
    "transliteration_en": "Qaala qareenuhoo Rabbanaa maaa atghaituhoo wa laakin kaana fee dalaahim ba'eed",
    "transliteration_id": "Qāla qarīnuhū rabbanā mā aṭgaituhū wa lākin kāna fī ḍalālim ba‘īd(in).",
    "translation_en": "His [devil] companion will say, \"Our Lord, I did not make him transgress, but he [himself] was in extreme error.\"",
    "translation_id": "(Setan) yang menyertainya berkata (pula), “Ya Tuhan kami, aku tidak menyesatkannya, tetapi dia sendiri yang berada dalam kesesatan yang jauh.”"
  },
  {
    "ayat": 28,
    "arabic": "قَالَ لَا تَخْتَصِمُوْا لَدَيَّ وَقَدْ قَدَّمْتُ اِلَيْكُمْ بِالْوَعِيْدِ",
    "transliteration_en": "Qaala laa takhtasimoo ladaayya wa qad qaddamtu ilaikum bilwa'eed",
    "transliteration_id": "Qāla lā takhtaṣimū ladayya wa qad qaddamtu ilaikum bil-wa‘īd(i).",
    "translation_en": "[Allah] will say, \"Do not dispute before Me, while I had already presented to you the warning.",
    "translation_id": "(Allah) berfirman, “Janganlah bertengkar di hadapan-Ku dan sungguh, dahulu Aku telah memberikan ancaman kepadamu."
  },
  {
    "ayat": 29,
    "arabic": "مَا يُبَدَّلُ الْقَوْلُ لَدَيَّ وَمَآ اَنَا۠ بِظَلَّامٍ لِّلْعَبِيْدِ ࣖ",
    "transliteration_en": "Maa yubaddalul qawlu ladaiya wa maaa ana bizal laamil lil'abeed",
    "transliteration_id": "Mā yubaddalul-qaulu ladayya wa mā ana biẓallāmil lil-‘abīd(i).",
    "translation_en": "The word will not be changed with Me, and never will I be unjust to the servants.\"",
    "translation_id": "Keputusan-Ku tidak dapat diubah dan Aku (sama sekali) tidak menzalimi hamba-hamba-Ku.”"
  },
  {
    "ayat": 30,
    "arabic": "يَوْمَ نَقُوْلُ لِجَهَنَّمَ هَلِ امْتَلَـْٔتِ وَتَقُوْلُ هَلْ مِنْ مَّزِيْدٍ",
    "transliteration_en": "Yawma naqoolu li'jahannama halim talaati wa taqoolu hal mim mazeed",
    "transliteration_id": "Yauma naqūlu lijahannama halimtala'ti wa taqūlu hal mim mazīd(in).",
    "translation_en": "On the Day We will say to Hell, \"Have you been filled?\" and it will say, \"Are there some more,\"",
    "translation_id": "(Ingatlah) pada hari (ketika) Kami bertanya kepada (neraka) Jahanam, “Apakah kamu sudah penuh?” Ia menjawab, “Adakah tambahan lagi?”"
  },
  {
    "ayat": 31,
    "arabic": "وَاُزْلِفَتِ الْجَنَّةُ لِلْمُتَّقِيْنَ غَيْرَ بَعِيْدٍ",
    "transliteration_en": "Wa uzlifatil jannatu lil muttaqeena ghaira ba'eed",
    "transliteration_id": "Wa uzlifatil-jannatu lil-muttaqīna gaira ba‘īd(in).",
    "translation_en": "And Paradise will be brought near to the righteous, not far,",
    "translation_id": "Adapun surga didekatkan kepada orang-orang yang bertakwa pada tempat yang tidak jauh (dari mereka)."
  },
  {
    "ayat": 32,
    "arabic": "هٰذَا مَا تُوْعَدُوْنَ لِكُلِّ اَوَّابٍ حَفِيْظٍۚ",
    "transliteration_en": "Haaza maa too'adoona likulli awwaabin hafeez",
    "transliteration_id": "Hāżā mā tū‘adūna likulli awwābin ḥafīẓ(in).",
    "translation_en": "[It will be said], \"This is what you were promised - for every returner [to Allah] and keeper [of His covenant]",
    "translation_id": "(Dikatakan kepada mereka,) “Inilah yang dijanjikan kepadamu, (yaitu) kepada setiap hamba yang bertobat lagi patuh."
  },
  {
    "ayat": 33,
    "arabic": "مَنْ خَشِيَ الرَّحْمٰنَ بِالْغَيْبِ وَجَاۤءَ بِقَلْبٍ مُّنِيْبٍۙ",
    "transliteration_en": "Man khashiyar Rahmaana bilghaibi wa jaaa'a biqalbim muneeb",
    "transliteration_id": "Man khasyiyar-raḥmāna bil-gaibi wa jā'a biqalbim munīb(in).",
    "translation_en": "Who feared the Most Merciful unseen and came with a heart returning [in repentance].",
    "translation_id": "(Dialah) orang yang takut kepada Zat Yang Maha Pengasih (sekalipun) dia tidak melihat-Nya dan dia datang (menghadap Allah) dengan hati yang bertobat."
  },
  {
    "ayat": 34,
    "arabic": "ۨادْخُلُوْهَا بِسَلٰمٍ ۗذٰلِكَ يَوْمُ الْخُلُوْدِ",
    "transliteration_en": "Udkhuloohaa bisalaamin zaalika yawmul khulood",
    "transliteration_id": "Udkhulūhā bisalām(in), żālika yaumul-khulūd(i).",
    "translation_en": "Enter it in peace. This is the Day of Eternity.\"",
    "translation_id": "Masuklah ke (dalam surga) dengan aman dan damai. Itulah hari yang abadi.”"
  },
  {
    "ayat": 35,
    "arabic": "لَهُمْ مَّا يَشَاۤءُوْنَ فِيْهَا وَلَدَيْنَا مَزِيْدٌ",
    "transliteration_en": "Lahum maa yashaaa'oona feehaa wa ladainaa mazeed",
    "transliteration_id": "Lahum mā yasyā'ūna fīhā wa ladainā mazīd(un).",
    "translation_en": "They will have whatever they wish therein, and with Us is more.",
    "translation_id": "Mereka di dalamnya memperoleh apa yang mereka kehendaki dan pada Kami masih ada lagi tambahan (nikmat)."
  },
  {
    "ayat": 36,
    "arabic": "وَكَمْ اَهْلَكْنَا قَبْلَهُمْ مِّنْ قَرْنٍ هُمْ اَشَدُّ مِنْهُمْ بَطْشًا فَنَقَّبُوْا فِى الْبِلَادِۗ هَلْ مِنْ مَّحِيْصٍ",
    "transliteration_en": "Wa kam ahlaknaa qablahum min qarnin hum ashaddu minhum batshan fanaqqaboo fil bilaad, hal mim mahees",
    "transliteration_id": "Wa kam ahlaknā qablahum min qarnin hum asyaddu minhum baṭsyan fanaqqabū fil-bilād(i), hal mim maḥīṣ(in).",
    "translation_en": "And how many a generation before them did We destroy who were greater than them in [striking] power and had explored throughout the lands. Is there any place of escape?",
    "translation_id": "Betapa banyak umat sebelumnya (kaum kafir Quraisy) yang telah Kami binasakan! Mereka itu lebih hebat kekuatannya daripada (kaum kafir Quraisy) itu, sehingga mampu menjelajah (dan mengamati) beberapa negeri. Adakah tempat pelarian (bagi mereka dari kebinasaan)?"
  },
  {
    "ayat": 37,
    "arabic": "اِنَّ فِيْ ذٰلِكَ لَذِكْرٰى لِمَنْ كَانَ لَهٗ قَلْبٌ اَوْ اَلْقَى السَّمْعَ وَهُوَ شَهِيْدٌ",
    "transliteration_en": "Inna fee zaalika lazikraa liman kaana lahoo qalbun aw alqas sam'a wa huwa shaheed",
    "transliteration_id": "Inna fī żālika lażikrā liman kāna lahū qalbun au alqas-sam‘a wa huwa syahīd(un).",
    "translation_en": "Indeed in that is a reminder for whoever has a heart or who listens while he is present [in mind].",
    "translation_id": "Sesungguhnya pada yang demikian itu pasti terdapat peringatan bagi orang-orang yang mempunyai hati atau yang menggunakan pendengarannya dan dia menyaksikan."
  },
  {
    "ayat": 38,
    "arabic": "وَلَقَدْ خَلَقْنَا السَّمٰوٰتِ وَالْاَرْضَ وَمَا بَيْنَهُمَا فِيْ سِتَّةِ اَيَّامٍۖ وَّمَا مَسَّنَا مِنْ لُّغُوْبٍ",
    "transliteration_en": "Wa laqad khalaqnas samaawaati wal arda wa maa bainahumaa fee sittati ayyaamin wa maa massanaa mil lughoob",
    "transliteration_id": "Wa laqad khalaqnas-samāwāti wal-arḍa wa mā bainahumā fī sittati ayyām(in), wa mā massanā mil lugūb(in).",
    "translation_en": "And We did certainly create the heavens and earth and what is between them in six days, and there touched Us no weariness.",
    "translation_id": "Sungguh, Kami benar-benar telah menciptakan langit, bumi, dan apa yang ada antara keduanya dalam enam masa dan Kami tidak merasa letih sedikit pun."
  },
  {
    "ayat": 39,
    "arabic": "فَاصْبِرْ عَلٰى مَا يَقُوْلُوْنَ وَسَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوْعِ الشَّمْسِ وَقَبْلَ الْغُرُوْبِ ۚ",
    "transliteration_en": "Fasbir 'alaa maa yaqooloona wa sabbih bihamdi Rabbika qabla tuloo'ish shamsi wa qablal ghuroob",
    "transliteration_id": "Faṣbir ‘alā mā yaqūlūna wa sabbiḥ biḥamdi rabbika qabla ṭulū‘isy-syamsi wa qablal-gurūb(i).",
    "translation_en": "So be patient, [O Muhammad], over what they say and exalt [Allah] with praise of your Lord before the rising of the sun and before its setting,",
    "translation_id": "Maka, bersabarlah engkau (Nabi Muhammad) terhadap apa yang mereka katakan dan bertasbihlah seraya bertahmid (memuji) Tuhanmu sebelum terbit dan terbenamnya matahari."
  },
  {
    "ayat": 40,
    "arabic": "وَمِنَ الَّيْلِ فَسَبِّحْهُ وَاَدْبَارَ السُّجُوْدِ",
    "transliteration_en": "Wa minal laili fasabbih hu wa adbaaras sujood",
    "transliteration_id": "Wa minal-laili fasabbiḥhu wa adbāras-sujūd(i).",
    "translation_en": "And [in part] of the night exalt Him and after prostration.",
    "translation_id": "Bertasbihlah pula kepada-Nya pada sebagian malam hari dan setiap selesai salat."
  },
  {
    "ayat": 41,
    "arabic": "وَاسْتَمِعْ يَوْمَ يُنَادِ الْمُنَادِ مِنْ مَّكَانٍ قَرِيْبٍ",
    "transliteration_en": "Wastami' yawma yunaa dil munaadi mim makaanin qareeb",
    "transliteration_id": "Wastami‘ yauma yunādil-munādi mim makānin qarīb(in).",
    "translation_en": "And listen on the Day when the Caller will call out from a place that is near -",
    "translation_id": "Dengarkanlah (seruan) pada hari (ketika malaikat) penyeru memanggil dari tempat yang dekat!"
  },
  {
    "ayat": 42,
    "arabic": "يَوْمَ يَسْمَعُوْنَ الصَّيْحَةَ بِالْحَقِّ ۗذٰلِكَ يَوْمُ الْخُرُوْجِ",
    "transliteration_en": "Yawma yasmaoonas sai hata bilhaqq zaalika yawmul khurooj",
    "transliteration_id": "Yauma yasma‘ūnaṣ-ṣaiḥata bil-ḥaqq(i), żālika yaumul-khurūj(i).",
    "translation_en": "The Day they will hear the blast [of the Horn] in truth. That is the Day of Emergence [from the graves].",
    "translation_id": "Pada hari itulah mereka mendengar suara dahsyat dengan sebenar-benarnya. Itulah hari (ketika manusia) keluar (dari kubur)."
  },
  {
    "ayat": 43,
    "arabic": "اِنَّا نَحْنُ نُحْيٖ وَنُمِيْتُ وَاِلَيْنَا الْمَصِيْرُۙ",
    "transliteration_en": "Innaa Nahnu nuhyee wa numeetu wa ilainal maseer",
    "transliteration_id": "Innā naḥnu nuḥyī wa numītu wa ilainal-maṣīr(u).",
    "translation_en": "Indeed, it is We who give life and cause death, and to Us is the destination",
    "translation_id": "Sesungguhnya Kamilah yang menghidupkan dan mematikan dan kepada Kamilah kembalinya (seluruh makhluk)."
  },
  {
    "ayat": 44,
    "arabic": "يَوْمَ تَشَقَّقُ الْاَرْضُ عَنْهُمْ سِرَاعًا ۗذٰلِكَ حَشْرٌ عَلَيْنَا يَسِيْرٌ",
    "transliteration_en": "Yawma tashaqqaqul ardu 'anhum siraa'aa; zaalika hashrun 'alainaa yaseer",
    "transliteration_id": "Yauma tasyaqqaqul-arḍu ‘anhum sirā‘ā(n), żālika ḥasyrun ‘alainā yasīr(un).",
    "translation_en": "On the Day the earth breaks away from them [and they emerge] rapidly; that is a gathering easy for Us.",
    "translation_id": "Pada hari itu bumi terbelah dengan mengeluarkan mereka, (kemudian mereka) bergegas (menuju Padang Mahsyar). Yang demikian itu adalah pengumpulan yang mudah bagi Kami."
  },
  {
    "ayat": 45,
    "arabic": "نَحْنُ اَعْلَمُ بِمَا يَقُوْلُوْنَ وَمَآ اَنْتَ عَلَيْهِمْ بِجَبَّارٍۗ فَذَكِّرْ بِالْقُرْاٰنِ مَنْ يَّخَافُ وَعِيْدِ ࣖ",
    "transliteration_en": "Nahnu a'lamu bimaa yaqooloona wa maaa anta 'alihim bijabbaarin fazakkir bil quraani many yakhaafu wa'eed",
    "transliteration_id": "Naḥnu a‘lamu bimā yaqūlūna wa mā anta ‘alaihim bijabbār(in), fażakkir bil-qur'āni may yakhāfu wa‘īd(i).",
    "translation_en": "We are most knowing of what they say, and you are not over them a tyrant. But remind by the Qur'an whoever fears My threat.",
    "translation_id": "Kami lebih mengetahui apa yang mereka katakan dan engkau (Nabi Muhammad) bukanlah seorang pemaksa terhadap mereka. Maka, berilah peringatan dengan Al-Qur’an kepada siapa pun yang takut pada ancaman-Ku."
  }
]