[
  {
    "ayat": 51,
    "arabic": "اِنَّا لَنَنْصُرُ رُسُلَنَا وَالَّذِيْنَ اٰمَنُوْا فِى الْحَيٰوةِ الدُّنْيَا وَيَوْمَ يَقُوْمُ الْاَشْهَادُۙ",
    "transliteration_en": "Innaa lanansuru Rusulanaa wallazeena aamanoo fil hayaatid dunyaa wa Yawma yaqoomul ashhaad",
    "transliteration_id": "Innā lananṣuru rusulanā wal-lażīna āmanū fil-ḥayātid-dun-yā wa yauma yaqūmul-asyhād(u).",
    "translation_en": "Indeed, We will support Our messengers and those who believe during the life of this world and on the Day when the witnesses will stand -",
    "translation_id": "Sesungguhnya Kami akan menolong rasul-rasul Kami dan orang-orang yang beriman dalam kehidupan dunia dan pada hari dihadirkannya para saksi (hari Kiamat),"
  },
  {
    "ayat": 52,
    "arabic": "يَوْمَ لَا يَنْفَعُ الظّٰلِمِيْنَ مَعْذِرَتُهُمْ وَلَهُمُ اللَّعْنَةُ وَلَهُمْ سُوْۤءُ الدَّارِ",
    "transliteration_en": "Yawma laa yanfa'uz zaalimeena ma'ziratuhum wa lahumul la'natu wa lahum soooud daar",
    "transliteration_id": "Yauma lā yanfa‘uẓ-ẓālimīna ma‘żiratuhum wa lahumul-la‘natu wa lahum sū'ud-dār(i).",
    "translation_en": "The Day their excuse will not benefit the wrongdoers, and they will have the curse, and they will have the worst home.",
    "translation_id": "(yaitu) hari (ketika) permintaan maaf tidak berguna bagi orang-orang zalim. Bagi mereka laknat dan tempat tinggal yang buruk."
  },
  {
    "ayat": 53,
    "arabic": "وَلَقَدْاٰتَيْنَا مُوْسَى الْهُدٰى وَاَوْرَثْنَا بَنِيْٓ اِسْرَاۤءِيْلَ الْكِتٰبَۙ",
    "transliteration_en": "Wa laqad aatainaa Moosal hudaa wa awrasnaa Baneee Israaa 'eelal Kitaab",
    "transliteration_id": "Wa laqad ātainā mūsal-hudā wa auraṡnā banī isrā'īlal-kitāb(a).",
    "translation_en": "And We had certainly given Moses guidance, and We caused the Children of Israel to inherit the Scripture",
    "translation_id": "Sungguh, Kami benar-benar telah menganugerahkan petunjuk kepada Musa dan mewariskan Kitab (Taurat) kepada Bani Israil"
  },
  {
    "ayat": 54,
    "arabic": "هُدًى وَّذِكْرٰى لِاُولِى الْاَلْبَابِ",
    "transliteration_en": "Hudanw wa zikraa li ulil albaab",
    "transliteration_id": "Hudaw wa żikrā li'ulil-albāb(i).",
    "translation_en": "As guidance and a reminder for those of understanding.",
    "translation_id": "untuk menjadi petunjuk dan peringatan bagi orang-orang yang berpikiran sehat."
  },
  {
    "ayat": 55,
    "arabic": "فَاصْبِرْ اِنَّ وَعْدَ اللّٰهِ حَقٌّ وَّاسْتَغْفِرْ لِذَنْۢبِكَ وَسَبِّحْ بِحَمْدِ رَبِّكَ بِالْعَشِيِّ وَالْاِبْكَارِ",
    "transliteration_en": "Fasbir inna wa'dal laahi haqqunw wastaghfir lizambika wa sabbih bihamdi Rabbika bil'ashiyyi wal ibkaar",
    "transliteration_id": "Faṣbir inna wa‘dallāhi ḥaqquw wastagfir liżambika wa sabbiḥ biḥamdi rabbika bil-‘asyiyyi wal-ibkār(i).",
    "translation_en": "So be patient, [O Muhammad]. Indeed, the promise of Allah is truth. And ask forgiveness for your sin and exalt [Allah] with praise of your Lord in the evening and the morning.",
    "translation_id": "Bersabarlah, sesungguhnya janji Allah itu benar, mohonlah ampun untuk dosamu, dan bertasbihlah seraya memuji Tuhanmu pada waktu petang dan pagi!"
  },
  {
    "ayat": 56,
    "arabic": "اِنَّ الَّذِيْنَ يُجَادِلُوْنَ فِيْٓ اٰيٰتِ اللّٰهِ بِغَيْرِ سُلْطٰنٍ اَتٰىهُمْ ۙاِنْ فِيْ صُدُوْرِهِمْ اِلَّا كِبْرٌ مَّا هُمْ بِبَالِغِيْهِۚ فَاسْتَعِذْ بِاللّٰهِ ۗاِنَّهٗ هُوَ السَّمِيْعُ الْبَصِيْرُ",
    "transliteration_en": "Innal lazeena yujaadi loona feee Aayaatil laahi bighairi sultaanin ataahum in fee sudoorihim illaa kibrum maa hum bibaaligheeh; fasta'iz billaahi innahoo Huwas Samee'ul Baseer",
    "transliteration_id": "Innal-lażīna yujādilūna fī āyātillāhi bigairi sulṭānin atāhum, in fī ṣudūrihim illā kibrum mā hum bibāligīh(i), fasta‘iż billāh(i), innahū huwas-samī‘ul-baṣīr(u).",
    "translation_en": "Indeed, those who dispute concerning the signs of Allah without [any] authority having come to them - there is not within their breasts except pride, [the extent of] which they cannot reach. So seek refuge in Allah. Indeed, it is He who is the Hearing, the Seeing.",
    "translation_id": "Sesungguhnya orang-orang yang membantah ayat-ayat Allah tanpa alasan (bukti) yang sampai kepada mereka, tidaklah ada dalam dada mereka kecuali kesombongan (untuk tujuan) yang tidak akan mereka capai, maka mintalah pelindungan kepada Allah. Sesungguhnya Dia Maha Mendengar lagi Maha Melihat."
  },
  {
    "ayat": 57,
    "arabic": "لَخَلْقُ السَّمٰوٰتِ وَالْاَرْضِ اَكْبَرُ مِنْ خَلْقِ النَّاسِ وَلٰكِنَّ اَكْثَرَ النَّاسِ لَا يَعْلَمُوْنَ",
    "transliteration_en": "Lakhalqus samaawaati wal ardi akbaru min khalqin naasi wa laakinna aksaran naasi laa ya'lamoon",
    "transliteration_id": "Lakhalqus-samāwāti wal-arḍi akbaru min khalqin-nāsi wa lākinna akṡaran-nāsi lā ya‘lamūn(a).",
    "translation_en": "The creation of the heavens and earth is greater than the creation of mankind, but most of the people do not know.",
    "translation_id": "Penciptaan langit dan bumi itu sungguh lebih besar daripada penciptaan manusia, tetapi kebanyakan manusia tidak mengetahui."
  },
  {
    "ayat": 58,
    "arabic": "وَمَا يَسْتَوِى الْاَعْمٰى وَالْبَصِيْرُ ەۙ وَالَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ وَلَا الْمُسِيْۤئُ ۗقَلِيْلًا مَّا تَتَذَكَّرُوْنَ",
    "transliteration_en": "Wa maa yastawil a'maa walbaseeru wallazeena aamanoo wa 'amilus saalihaati wa lal museee'; qaleelam maa tatazakkaroon",
    "transliteration_id": "Wa mā yastawil-a‘mā wal-baṣīr(u), wal-lażīna āmanū wa ‘amiluṣ-ṣāliḥāti wa lal-musī'(u), qalīlam mā tatażakkarūn(a).",
    "translation_en": "And not equal are the blind and the seeing, nor are those who believe and do righteous deeds and the evildoer. Little do you remember.",
    "translation_id": "Tidak sama orang buta dengan orang melihat. Tidak (sama) pula orang-orang yang beriman dan mengerjakan kebajikan dengan orang-orang yang berbuat keburukan. Sedikit sekali kamu mengambil pelajaran."
  },
  {
    "ayat": 59,
    "arabic": "اِنَّ السَّاعَةَ لَاٰتِيَةٌ لَّا رَيْبَ فِيْهَا ۖوَلٰكِنَّ اَكْثَرَ النَّاسِ لَا يُؤْمِنُوْنَ",
    "transliteration_en": "Innas Saa'ata la aatiyatul laa raiba feehaa wa laakinna aksaran naasi laa yu'minoon",
    "transliteration_id": "Innas-sā‘ata la'ātiyatul lā raiba fīhā, wa lākinna akṡaran-nāsi lā yu'minūn(a).",
    "translation_en": "Indeed, the Hour is coming - no doubt about it - but most of the people do not believe.",
    "translation_id": "Sesungguhnya hari Kiamat pasti akan datang. Tidak ada keraguan tentangnya, tetapi kebanyakan manusia tidak beriman."
  },
  {
    "ayat": 60,
    "arabic": "وَقَالَ رَبُّكُمُ ادْعُوْنِيْٓ اَسْتَجِبْ لَكُمْ ۗاِنَّ الَّذِيْنَ يَسْتَكْبِرُوْنَ عَنْ عِبَادَتِيْ سَيَدْخُلُوْنَ جَهَنَّمَ دَاخِرِيْنَ ࣖ",
    "transliteration_en": "Wa qaala Rabbukumud 'ooneee astajib lakum; innal lazeena yastakbiroona an 'ibaadatee sa yadkhuloona jahannama daakhireen",
    "transliteration_id": "Wa qāla rabbukumud‘ūnī astajib lakum, innal-lażīna yastakbirūna ‘an ‘ibādatī sayadkhulūna jahannama dākhirīn(a).",
    "translation_en": "And your Lord says, \"Call upon Me; I will respond to you.\" Indeed, those who disdain My worship will enter Hell [rendered] contemptible.",
    "translation_id": "Tuhanmu berfirman, “Berdoalah kepada-Ku, niscaya akan Aku perkenankan bagimu (apa yang kamu harapkan). Sesungguhnya orang-orang yang menyombongkan diri tidak mau beribadah kepada-Ku akan masuk (neraka) Jahanam dalam keadaan hina dina.”"
  },
  {
    "ayat": 61,
    "arabic": "اَللّٰهُ الَّذِيْ جَعَلَ لَكُمُ الَّيْلَ لِتَسْكُنُوْا فِيْهِ وَالنَّهَارَ مُبْصِرًا ۗاِنَّ اللّٰهَ لَذُوْ فَضْلٍ عَلَى النَّاسِ وَلٰكِنَّ اَكْثَرَ النَّاسِ لَا يَشْكُرُوْنَ",
    "transliteration_en": "Allaahul lazee ja'ala lakumul laila litqaskunoo feehi wannahaara mubsiraa; innal laaha lazoo fadlin 'alan naasi wa laakinna aksaran naasi laa yashkuroon",
    "transliteration_id": "Allāhul-lażī ja‘ala lakumul-laila litaskunū fīhi wan-nahāra mubṣirā(n), innallāha lażū faḍlin ‘alan-nāsi wa lākinna akṡaran-nāsi lā yasykurūn(a).",
    "translation_en": "It is Allah who made for you the night that you may rest therein and the day giving sight. Indeed, Allah is full of bounty to the people, but most of the people are not grateful.",
    "translation_id": "Allahlah yang menjadikan malam untukmu agar kamu beristirahat padanya (dan menjadikan) siang terang-benderang (agar kamu bekerja). Sesungguhnya Allah benar-benar memiliki karunia (yang dilimpahkan) kepada manusia, tetapi kebanyakan manusia tidak bersyukur."
  },
  {
    "ayat": 62,
    "arabic": "ذٰلِكُمُ اللّٰهُ رَبُّكُمْ خَالِقُ كُلِّ شَيْءٍۘ  لَآ اِلٰهَ اِلَّا هُوَ ۖفَاَنّٰى تُؤْفَكُوْنَ",
    "transliteration_en": "Zaalikumul laahu Rabbukum khaaliqu kulli shai'; laaa ilaaha illaa Huwa fa annaa tu'fakoon",
    "transliteration_id": "Żālikumullāhu rabbukum khāliqu kulli syai'(in),  lā ilāha illā huw(a), fa'annā tu'fakūn(a).",
    "translation_en": "That is Allah, your Lord, Creator of all things; there is no deity except Him, so how are you deluded?",
    "translation_id": "Demikianlah Allah, Tuhanmu, Pencipta segala sesuatu, tidak ada tuhan selain Dia; maka bagaimanakah kamu dapat dipalingkan?"
  },
  {
    "ayat": 63,
    "arabic": "كَذٰلِكَ يُؤْفَكُ الَّذِيْنَ كَانُوْا بِاٰيٰتِ اللّٰهِ يَجْحَدُوْنَ",
    "transliteration_en": "Kazaalika yu'fakul loazeena kaanoo bi Aayaatil laahi yajhadoon",
    "transliteration_id": "Każālika yu'fakul-lażīna kānū bi'āyātillāhi yajḥadūn(a).",
    "translation_en": "Thus were those [before you] deluded who were rejecting the signs of Allah.",
    "translation_id": "Seperti itulah orang-orang yang selalu mengingkari ayat-ayat Allah dipalingkan."
  },
  {
    "ayat": 64,
    "arabic": "اَللّٰهُ الَّذِيْ جَعَلَ لَكُمُ الْاَرْضَ قَرَارًا وَّالسَّمَاۤءَ بِنَاۤءً وَّصَوَّرَكُمْ فَاَحْسَنَ صُوَرَكُمْ وَرَزَقَكُمْ مِّنَ الطَّيِّبٰتِ ۗذٰلِكُمُ اللّٰهُ رَبُّكُمْ ۚ فَتَبٰرَكَ اللّٰهُ رَبُّ الْعٰلَمِيْنَ",
    "transliteration_en": "Allaahul lazee ja'ala lakumul arda qaraaranw wassa maaa'a binaaa'anw wa sawwarakum fa ahsana suwarakum wa razaqakum minat taiyibaat; zaalikumul laahu Rabbukum fatabaarakal laahu Rabbul 'aalameen",
    "transliteration_id": "Allāhul-lażī ja‘ala lakumul-arḍa qarāraw was-samā'a binā'aw wa ṣawwarakum fa'aḥsana ṣuwarakum wa razaqakum minaṭ-ṭayyibāt(i), żālikumullāhu rabbukum, fatabārakallāhu rabbul-‘ālamīn(a).",
    "translation_en": "It is Allah who made for you the earth a place of settlement and the sky a ceiling and formed you and perfected your forms and provided you with good things. That is Allah, your Lord; then blessed is Allah, Lord of the worlds.",
    "translation_id": "Allahlah yang menjadikan bumi untukmu sebagai tempat menetap dan langit sebagai atap. (Dia pula yang) membentukmu, lalu memperindah bentukmu, serta memberimu rezeki dari yang baik-baik. Demikianlah Allah Tuhanmu. Maha Suci Allah, Tuhan semesta alam."
  },
  {
    "ayat": 65,
    "arabic": "هُوَ الْحَيُّ لَآ اِلٰهَ اِلَّا هُوَ فَادْعُوْهُ مُخْلِصِيْنَ لَهُ الدِّيْنَ ۗ اَلْحَمْدُ لِلّٰهِ رَبِّ الْعٰلَمِيْنَ",
    "transliteration_en": "Huwal Hayyu laaa ilaaha illaa Huwa fad'oohu mukh liseena lahudeen; alhamdu lillaahi Rabbil 'aalameen",
    "transliteration_id": "Huwal-ḥayyu lā ilāha illā huwa fad‘ūhu mukhliṣīna lahud-dīn(a), al-ḥamdu lillāhi rabbil-‘ālamīn(a).",
    "translation_en": "He is the Ever-Living; there is no deity except Him, so call upon Him, [being] sincere to Him in religion. [All] praise is [due] to Allah, Lord of the worlds.",
    "translation_id": "Dialah yang hidup kekal, tidak ada tuhan selain Dia, maka berdoalah kepada-Nya dengan mengikhlaskan ketaatan kepada-Nya. Segala puji bagi Allah, Tuhan semesta alam."
  },
  {
    "ayat": 66,
    "arabic": "۞ قُلْ اِنِّيْ نُهِيْتُ اَنْ اَعْبُدَ الَّذِيْنَ تَدْعُوْنَ مِنْ دُوْنِ اللّٰهِ لَمَّا جَاۤءَنِيَ الْبَيِّنٰتُ مِنْ رَّبِّيْ وَاُمِرْتُ اَنْ اُسْلِمَ لِرَبِّ الْعٰلَمِيْنَ",
    "transliteration_en": "Qul innee nuheetu an a'budal lazeena tad'oona min doonil laahi lammaa jaaa'a niyal biyinaatu mir Rabbee wa umirtu an uslima li Rabbil 'aalameen",
    "transliteration_id": "Qul innī nuhītu an a‘budal-lażīna tad‘ūna min dūnillāhi lammā jā'aniyal-bayyinātu mir rabbī wa umirtu an uslima lirabbil-‘ālamīn(a).",
    "translation_en": "Say, [O Muhammad], \"Indeed, I have been forbidden to worship those you call upon besides Allah once the clear proofs have come to me from my Lord, and I have been commanded to submit to the Lord of the worlds.\"",
    "translation_id": "Katakanlah (Nabi Muhammad), “Sesungguhnya aku dilarang menyembah (sekutu-sekutu) yang kamu seru selain Allah setelah datang kepadaku keterangan-keterangan dari Tuhanku. Aku diperintahkan agar berserah diri kepada Tuhan semesta alam.”"
  },
  {
    "ayat": 67,
    "arabic": "هُوَ الَّذِيْ خَلَقَكُمْ مِّنْ تُرَابٍ ثُمَّ مِنْ نُّطْفَةٍ ثُمَّ مِنْ عَلَقَةٍ ثُمَّ يُخْرِجُكُمْ طِفْلًا ثُمَّ لِتَبْلُغُوْٓا اَشُدَّكُمْ ثُمَّ لِتَكُوْنُوْا شُيُوْخًا ۚوَمِنْكُمْ مَّنْ يُّتَوَفّٰى مِنْ قَبْلُ وَلِتَبْلُغُوْٓا اَجَلًا مُّسَمًّى وَّلَعَلَّكُمْ تَعْقِلُوْنَ",
    "transliteration_en": "Huwal lazee khalaqakum min turaabin summa min nutfatin summa min 'alaqatin summa yukhrijukum tiflan summa litablughooo ashuddakum summa litakoonoo shuyookhaa; wa minkum mai yutawaffaa min qablu wa litablughooo ajalam musam manw-wa la'allakum ta'qiloon",
    "transliteration_id": "Huwal-lażī khalaqakum min turābin ṡumma min nuṭfatin ṡumma min ‘alaqatin ṡumma yukhrijukum ṭiflan ṡumma litablugū asyuddakum ṡumma litakūnū syuyūkhā(n), wa minkum may yutawaffā min qablu wa litablugū ajalam musammaw wa la‘allakum ta‘qilūn(a).",
    "translation_en": "It is He who created you from dust, then from a sperm-drop, then from a clinging clot; then He brings you out as a child; then [He develops you] that you reach your [time of] maturity, then [further] that you become elders. And among you is he who is taken in death before [that], so that you reach a specified term; and perhaps you will use reason.",
    "translation_id": "Dialah yang menciptakanmu dari tanah, kemudian dari setetes mani, lalu dari darah yang menggumpal, kemudian Dia lahirkan kamu sebagai seorang anak kecil, kemudian (Dia membiarkan) kamu sampai dewasa, lalu menjadi tua. (Akan tetapi,) di antara kamu ada yang dimatikan sebelum itu. (Dia pun membiarkan) agar kamu sampai kepada kurun waktu yang ditentukan dan agar kamu mengerti."
  },
  {
    "ayat": 68,
    "arabic": "هُوَ الَّذِيْ يُحْيٖ وَيُمِيْتُۚ فَاِذَا قَضٰىٓ اَمْرًا فَاِنَّمَا يَقُوْلُ لَهٗ كُنْ فَيَكُوْنُ ࣖ",
    "transliteration_en": "Huwal lazee yuhyee wa yumeetu fa izaa qadaaa amran fa innamaa yaqoolu lahoo kun fa yakon",
    "transliteration_id": "Huwal-lażī yuḥyī wa yumīt(u), fa'iżā qaḍā amran fa'innamā yaqūlu lahū kun fa yakūn(u).",
    "translation_en": "He it is who gives life and causes death; and when He decrees a matter, He but says to it, \"Be,\" and it is.",
    "translation_id": "Dialah yang menghidupkan dan mematikan. Maka, apabila Dia hendak menetapkan sesuatu urusan, Dia hanya berkata kepadanya, “Jadilah!” Maka jadilah sesuatu itu."
  },
  {
    "ayat": 69,
    "arabic": "اَلَمْ تَرَ اِلَى الَّذِيْنَ يُجَادِلُوْنَ فِيْٓ اٰيٰتِ اللّٰهِ ۗاَنّٰى يُصْرَفُوْنَۚ",
    "transliteration_en": "Alam tara ilal lazeena yujaadiloona feee Aayaatil laahi annaa yusrafoon",
    "transliteration_id": "Alam tara ilal-lażīna yujādilūna fī āyātillāh(i), annā yuṣrafūn(a).",
    "translation_en": "Do you not consider those who dispute concerning the signs of Allah - how are they averted?",
    "translation_id": "Apakah kamu tidak memperhatikan orang-orang yang (selalu) membantah ayat-ayat Allah, bagaimana mereka dapat dipalingkan?"
  },
  {
    "ayat": 70,
    "arabic": "اَلَّذِيْنَ كَذَّبُوْا بِالْكِتٰبِ وَبِمَآ اَرْسَلْنَا بِهٖ رُسُلَنَا ۗفَسَوْفَ يَعْلَمُوْنَۙ",
    "transliteration_en": "Allazeena kazzaboo bil Kitaabi wa bimaa arsalnaa bihee Rusulanaa fasawfa ya'lamoon",
    "transliteration_id": "Allażīna każżabū bil kitābi wa bimā arsalnā bihī rusulanā, fasaufa ya‘lamūn(a).",
    "translation_en": "Those who deny the Book and that with which We sent Our messengers - they are going to know,",
    "translation_id": "(Mereka adalah) orang-orang yang mendustakan Kitab (Al-Qur’an) dan wahyu yang dengannya para rasul Kami utus. Kelak mereka akan mengetahui"
  },
  {
    "ayat": 71,
    "arabic": "اِذِ الْاَغْلٰلُ فِيْٓ اَعْنَاقِهِمْ وَالسَّلٰسِلُۗ يُسْحَبُوْنَۙ",
    "transliteration_en": "Izil aghlaalu feee a'naaqi-him wassalaasilu yashaboon",
    "transliteration_id": "Iżil-aglālu fī a‘nāqihim was-salāsil(u), yusḥabūn(a).",
    "translation_en": "When the shackles are around their necks and the chains; they will be dragged",
    "translation_id": "ketika belenggu dan rantai (dipasang) di leher mereka, seraya mereka diseret"
  },
  {
    "ayat": 72,
    "arabic": "فِى الْحَمِيْمِ ەۙ ثُمَّ فِى النَّارِ يُسْجَرُوْنَۚ",
    "transliteration_en": "Fil hameemi summa fin Naari Yasjaroon",
    "transliteration_id": "Fil-ḥamīm(i), ṡumma fin-nāri yusjarūn(a).",
    "translation_en": "In boiling water; then in the Fire they will be filled [with flame].",
    "translation_id": "ke dalam air yang sangat panas. Mereka kemudian dibakar ke dalam api."
  },
  {
    "ayat": 73,
    "arabic": "ثُمَّ قِيْلَ لَهُمْ اَيْنَ مَا كُنْتُمْ تُشْرِكُوْنَۙ",
    "transliteration_en": "Summaa qeela lahum ayna maa kuntum tushrikoon",
    "transliteration_id": "Ṡumma qīla lahum aina mā kuntum tusyrikūn(a).",
    "translation_en": "Then it will be said to them, \"Where is that which you used to associate [with Him in worship]",
    "translation_id": "Lalu, dikatakan kepada mereka, “Manakah berhala-berhala yang selalu kamu persekutukan"
  },
  {
    "ayat": 74,
    "arabic": "مِنْ دُوْنِ اللّٰهِ ۗقَالُوْا ضَلُّوْا عَنَّا بَلْ لَّمْ نَكُنْ نَّدْعُوْا مِنْ قَبْلُ شَيْـًٔاۗ  كَذٰلِكَ يُضِلُّ اللّٰهُ الْكٰفِرِيْنَ",
    "transliteration_en": "Min doonil laahi qaaloo dalloo 'annaa bal lam nakun nad'oo min qablu shai'aa; kazaalika yudillul laahul kaafireen",
    "transliteration_id": "Min dūnillāh(i), qālū ḍallū ‘annā bal lam nakun nad‘ū min qablu syai'ā(n), każālika yuḍillullāhul-kāfirīn(a).",
    "translation_en": "Other than Allah?\" They will say, \"They have departed from us; rather, we did not used to invoke previously anything.\" Thus does Allah put astray the disbelievers.",
    "translation_id": "selain Allah?” Mereka menjawab, “Mereka telah lenyap dari (hadapan) kami. Sebenarnya kami dahulu tidak pernah menyembah sesuatu pun.” Demikianlah Allah membiarkan orang-orang kafir menjadi sesat."
  },
  {
    "ayat": 75,
    "arabic": "ذٰلِكُمْ بِمَا كُنْتُمْ تَفْرَحُوْنَ فِى الْاَرْضِ بِغَيْرِ الْحَقِّ وَبِمَا كُنْتُمْ تَمْرَحُوْنَ",
    "transliteration_en": "Zaalikum bimaa kuntum tafrahoona fil ardi bighairil haqqi wa bimaa kuntum tamrahoon",
    "transliteration_id": "Żālikum bimā kuntum tafraḥūna fil-arḍi bigairil-ḥaqqi wa bimā kuntum tamraḥūn(a).",
    "translation_en": "[The angels will say], \"That was because you used to exult upon the earth without right and you used to behave insolently.",
    "translation_id": "Yang demikian itu karena kamu bersuka ria di bumi tanpa (alasan) yang benar dan karena kamu selalu bersuka ria (dalam kemaksiatan)."
  },
  {
    "ayat": 76,
    "arabic": "اُدْخُلُوْٓا اَبْوَابَ جَهَنَّمَ خٰلِدِيْنَ فِيْهَا ۚفَبِئْسَ مَثْوَى الْمُتَكَبِّرِيْنَ",
    "transliteration_en": "Udkhulooo abwaaba Jahannama khaalideena feehaa fabi'sa maswal mutakabbireen",
    "transliteration_id": "Udkhlulū abwāba jahannama khālidīna fīhā, fabi'sa maṡwal-mutakabūbirīn(a).",
    "translation_en": "Enter the gates of Hell to abide eternally therein, and wretched is the residence of the arrogant.\"",
    "translation_id": "(Dikatakan kepada mereka,) “Masuklah ke pintu-pintu (neraka) Jahanam dan kamu kekal di dalamnya. Itulah seburuk-buruk tempat bagi orang-orang yang sombong.”"
  },
  {
    "ayat": 77,
    "arabic": "فَاصْبِرْ اِنَّ وَعْدَ اللّٰهِ حَقٌّ ۚفَاِمَّا نُرِيَنَّكَ بَعْضَ الَّذِيْ نَعِدُهُمْ اَوْ نَتَوَفَّيَنَّكَ فَاِلَيْنَا يُرْجَعُوْنَ",
    "transliteration_en": "Fasbir inna wa'dal laahi haqq; fa immaa nuriyannak ba'dal lazee na'i duhum aw natawaffayannaka fa ilainaa yurja'oon",
    "transliteration_id": "Faṣbir inna wa‘dallāhi ḥaqq(un), fa'immā nuriyannaka ba‘ḍal-lażī  na‘iduhum au natawaffayannaka fa'ilainā yurja‘ūn(a).",
    "translation_en": "So be patient, [O Muhammad]; indeed, the promise of Allah is truth. And whether We show you some of what We have promised them or We take you in death, it is to Us they will be returned.",
    "translation_id": "Bersabarlah (Nabi Muhammad)! Sesungguhnya janji Allah itu benar. Jika Kami benar-benar memperlihatkan kepadamu sebagian dari (siksa) yang Kami janjikan kepada mereka (di dunia), ataupun jika Kami mewafatkanmu, (bagaimanapun juga) kepada Kamilah mereka dikembalikan."
  },
  {
    "ayat": 78,
    "arabic": "وَلَقَدْ اَرْسَلْنَا رُسُلًا مِّنْ قَبْلِكَ مِنْهُمْ مَّنْ قَصَصْنَا عَلَيْكَ وَمِنْهُمْ مَّنْ لَّمْ نَقْصُصْ عَلَيْكَ ۗوَمَا كَانَ لِرَسُوْلٍ اَنْ يَّأْتِيَ بِاٰيَةٍ اِلَّا بِاِذْنِ اللّٰهِ ۚفَاِذَا جَاۤءَ اَمْرُ اللّٰهِ قُضِيَ بِالْحَقِّ وَخَسِرَ هُنَالِكَ الْمُبْطِلُوْنَ ࣖ",
    "transliteration_en": "Wa laqad arsalnaa Rusulam min qablika minhum man qasasnaa 'alaika wa minhum mal lam naqsus 'alaik; wa maa kaana li Rasoolin any yaatiya bi Aayatin illaa bi iznil laah; fa izaa jaaa'a amrul laahi qudiya bilhaqqi wa khasira hunaalikal mubtiloon",
    "transliteration_id": "Wa laqad arsalnā rusulam min qablika minhum man qaṣaṣnā ‘alaika wa minhum mal lam naqṣuṣ ‘alaik(a), wa mā kāna lirasūlin ay ya'tiya bi'āyatin illā bi'iżnillāh(i), fa'iżā jā'a amrullāhi quḍiya bil-ḥaqqi wa khasira hunālikal-mubṭilūn(a).",
    "translation_en": "And We have already sent messengers before you. Among them are those [whose stories] We have related to you, and among them are those [whose stories] We have not related to you. And it was not for any messenger to bring a sign [or verse] except by permission of Allah. So when the command of Allah comes, it will be concluded in truth, and the falsifiers will thereupon lose [all].",
    "translation_id": "Sungguh, Kami benar-benar telah mengutus rasul-rasul sebelum engkau (Nabi Muhammad). Di antara mereka ada yang Kami ceritakan kepadamu dan ada (pula) yang tidak Kami ceritakan kepadamu. Tidak ada seorang rasul pun membawa suatu mukjizat, kecuali seizin Allah. Maka, apabila telah datang perintah Allah (hari Kiamat), diputuskanlah (segala perkara) dengan adil. Ketika itu, rugilah para pelaku kebatilan."
  },
  {
    "ayat": 79,
    "arabic": "اَللّٰهُ الَّذِيْ جَعَلَ لَكُمُ الْاَنْعَامَ لِتَرْكَبُوْا مِنْهَا وَمِنْهَا تَأْكُلُوْنَۖ",
    "transliteration_en": "Allaahul lazee ja'ala lakumul an'aama litarkaboo minhaa wa minhaa taakuloon",
    "transliteration_id": "Allāhul-lażī ja‘ala lakumul-an‘āma litarkabū minhā wa minhā ta'kulūn(a).",
    "translation_en": "It is Allah who made for you the grazing animals upon which you ride, and some of them you eat.",
    "translation_id": "Allahlah yang menjadikan hewan ternak untukmu. Sebagian untuk kamu kendarai dan sebagian lagi untuk kamu makan."
  },
  {
    "ayat": 80,
    "arabic": "وَلَكُمْ فِيْهَا مَنَافِعُ وَلِتَبْلُغُوْا عَلَيْهَا حَاجَةً فِيْ صُدُوْرِكُمْ وَعَلَيْهَا وَعَلَى الْفُلْكِ تُحْمَلُوْنَۗ",
    "transliteration_en": "Wa lakum feehaa manaafi'u wa litablughoo 'alaihaa haajatan fee sudoorikum wa 'alaihaa wa 'alal fulki tuhmaloon",
    "transliteration_id": "Wa lakum fīhā manāfi‘u wa litablugū ‘alaihā ḥājatan fī ṣudūrikum wa ‘alaihā wa ‘alal-fulki tuḥmalūn(a).",
    "translation_en": "And for you therein are [other] benefits and that you may realize upon them a need which is in your breasts; and upon them and upon ships you are carried.",
    "translation_id": "Bagimu (ada) manfaat-manfaat lain darinya (hewan ternak itu). Dengan mengendarainya, kamu bisa memenuhi keperluan yang kamu inginkan. Di atasnya (hewan-hewan ternak) dan di atas kapal-kapal kamu diangkut."
  },
  {
    "ayat": 81,
    "arabic": "وَيُرِيْكُمْ اٰيٰتِهٖۖ فَاَيَّ اٰيٰتِ اللّٰهِ تُنْكِرُوْنَ",
    "transliteration_en": "Wa yureekum Aayaatihee fa ayya Aayaatil laahi tunkiroon",
    "transliteration_id": "Wa yurīkum āyātih(ī), fa ayya āyātillāhi tunkirūn(a).",
    "translation_en": "And He shows you His signs. So which of the signs of Allah do you deny?",
    "translation_id": "Dia memperlihatkan tanda-tanda (kebesaran-Nya) kepadamu, maka tanda-tanda (kebesaran) Allah manakah yang kamu ingkari?"
  },
  {
    "ayat": 82,
    "arabic": "اَفَلَمْ يَسِيْرُوْا فِى الْاَرْضِ فَيَنْظُرُوْا كَيْفَ كَانَ عَاقِبَةُ الَّذِيْنَ مِنْ قَبْلِهِمْ ۗ كَانُوْٓا اَكْثَرَ مِنْهُمْ وَاَشَدَّ قُوَّةً وَّاٰثَارًا فِى الْاَرْضِ فَمَآ اَغْنٰى عَنْهُمْ مَّا كَانُوْا يَكْسِبُوْنَ",
    "transliteration_en": "Afalam yaseeroo fil ardi fa yanzuroo kaifa kaana 'aaqibatul lazeena min qablihim; kaanoo aksara minhum wa ashadda quwwatanw wa aasaaran fil ardi famaaa aghnaa 'anhum maa kaanoo yaksiboon",
    "transliteration_id": "Afalam yasīrū fil-arḍi fa yanẓurū kaifa kāna ‘āqibatul-lażīna min qablihim, kānū akṡara minhum wa asyadda quwwataw wa āṡāran fil-arḍi famā agnā ‘anhum mā kānū yaksibūn(a).",
    "translation_en": "Have they not traveled through the land and observed how was the end of those before them? They were more numerous than themselves and greater in strength and in impression on the land, but they were not availed by what they used to earn.",
    "translation_id": "Apakah mereka tidak mengadakan perjalanan di bumi, lalu mereka memperhatikan bagaimana kesudahan orang-orang yang sebelum mereka? Mereka itu lebih banyak dan lebih hebat kekuatannya serta (lebih banyak) jejak-jejak peradabannya di bumi. Apa yang mereka usahakan itu tidak dapat menolong mereka."
  },
  {
    "ayat": 83,
    "arabic": "فَلَمَّا جَاۤءَتْهُمْ رُسُلُهُمْ بِالْبَيِّنٰتِ فَرِحُوْا بِمَا عِنْدَهُمْ مِّنَ الْعِلْمِ وَحَاقَ بِهِمْ مَّا كَانُوْا بِهٖ يَسْتَهْزِءُوْنَ",
    "transliteration_en": "Falammaa jaaa'at hum Rusuluhum bilbaiyinaati farihoo bimaa 'indahum minal 'ilmi wa haaqa bihim maa kaanoo bihee yastahzi'oon",
    "transliteration_id": "Falammā jā'athum rusuluhum bil-bayyināti fariḥū bimā ‘indahum minal-‘ilmi wa ḥāqa bihim mā kānū bihī yastahzi'ūn(a).",
    "translation_en": "And when their messengers came to them with clear proofs, they [merely] rejoiced in what they had of knowledge, but they were enveloped by what they used to ridicule.",
    "translation_id": "Ketika para rasul datang kepada mereka dengan membawa bukti-bukti yang nyata, mereka merasa senang dengan pengetahuan yang ada pada mereka. (Pada saat itulah) mereka dikepung oleh (azab) yang dahulu mereka perolok-olokkan."
  },
  {
    "ayat": 84,
    "arabic": "فَلَمَّا رَاَوْا بَأْسَنَاۗ قَالُوْٓا اٰمَنَّا بِاللّٰهِ وَحْدَهٗ وَكَفَرْنَا بِمَا كُنَّا بِهٖ مُشْرِكِيْنَ",
    "transliteration_en": "Falammaa ra aw baasanaa qaalooo aamannaa billaahi wahdahoo wa kafarnaa bimaa kunnaa bihee mushrikeen",
    "transliteration_id": "Falammā ra'au ba'sanā qālū āmannā billāhi waḥdahū wa kafarnā bimā kunnā bihī musyrikīn(a).",
    "translation_en": "And when they saw Our punishment, they said,\" We believe in Allah alone and disbelieve in that which we used to associate with Him.\"",
    "translation_id": "Ketika mereka melihat azab Kami, mereka berkata, “Kami hanya beriman kepada Allah saja dan kami ingkar kepada sesembahan yang telah kami persekutukan dengan-Nya.”"
  },
  {
    "ayat": 85,
    "arabic": "فَلَمْ يَكُ يَنْفَعُهُمْ اِيْمَانُهُمْ لَمَّا رَاَوْا بَأْسَنَا ۗسُنَّتَ اللّٰهِ الَّتِيْ قَدْ خَلَتْ فِيْ عِبَادِهٖۚ وَخَسِرَ هُنَالِكَ الْكٰفِرُوْنَ ࣖ",
    "transliteration_en": "Falam yaku tanfa 'uhum eemaanuhum lammaa ra-aw baasana sunnatal laahil latee qad khalat fee 'ibaadihee wa khasira hunaalikal kaafiroon",
    "transliteration_id": "Falam yaku yanfa‘uhum īmānuhum lammā ra'au ba'sanā, sunnatallāhil latī qad khalat fī ‘ibādih(ī), wa khasira hunālikal-kāfirūn(a).",
    "translation_en": "But never did their faith benefit them once they saw Our punishment. [It is] the established way of Allah which has preceded among His servants. And the disbelievers thereupon lost [all].",
    "translation_id": "Tidak berguna lagi iman mereka setelah melihat azab Kami. (Yang demikian itu) merupakan sunatullah yang telah berlaku terhadap hamba-hamba-Nya. Ketika itu, rugilah orang-orang kafir."
  }
]