[
  {
    "ayat": 151,
    "arabic": "۞ قُلْ تَعَالَوْا اَتْلُ مَا حَرَّمَ رَبُّكُمْ عَلَيْكُمْ اَلَّا تُشْرِكُوْا بِهٖ شَيْـًٔا وَّبِالْوَالِدَيْنِ اِحْسَانًاۚ وَلَا تَقْتُلُوْٓا اَوْلَادَكُمْ مِّنْ اِمْلَاقٍۗ نَحْنُ نَرْزُقُكُمْ وَاِيَّاهُمْ ۚوَلَا تَقْرَبُوا الْفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَۚ وَلَا تَقْتُلُوا النَّفْسَ الَّتِيْ حَرَّمَ اللّٰهُ اِلَّا بِالْحَقِّۗ ذٰلِكُمْ وَصّٰىكُمْ بِهٖ لَعَلَّكُمْ تَعْقِلُوْنَ",
    "transliteration_en": "Qul ta'aalaw atlu maa harrama Rabbukum 'alaikum allaa tushrikoo bihee shai'anw wa bilwaalidaini ihsaananw wa laa taqtulooo aw alaadakum min imlaaq; nahnu narzuqukum wa iyyaahum wa laa taqrabul fawaahisha maa zahara minhaa wa maa batana wa laa taqtulun nafsal latee harramal laahu illaa bilhaqq; zaalikum wassaakum bihee la'allakum ta'qiloon",
    "transliteration_id": "Qul ta‘ālau atlu mā ḥarrama rabbukum ‘alaikum allā tusyrikū bihī syai'aw wa bil-wālidaini iḥsānā(n), wa lā taqtulū aulādakum min imlāq(in), naḥnu narzuqukum wa iyyāhum, wa lā taqrabul-fawāḥisya mā ẓahara minhā wa mā baṭan(a), wa lā taqtulun-nafsal-latī ḥarramallāhu illā bil-ḥaqq(i), żālikum waṣṣākum bihī la‘allakum ta‘qilūn(a).",
    "translation_en": "Say, \"Come, I will recite what your Lord has prohibited to you. [He commands] that you not associate anything with Him, and to parents, good treatment, and do not kill your children out of poverty; We will provide for you and them. And do not approach immoralities - what is apparent of them and what is concealed. And do not kill the soul which Allah has forbidden [to be killed] except by [legal] right. This has He instructed you that you may use reason.\"",
    "translation_id": "Katakanlah (Nabi Muhammad), “Kemarilah! Aku akan membacakan apa yang diharamkan Tuhan kepadamu, (yaitu) janganlah mempersekutukan-Nya dengan apa pun, berbuatbaiklah kepada kedua orang tua, dan janganlah membunuh anak-anakmu karena kemiskinan. (Tuhanmu berfirman,) ‘Kamilah yang memberi rezeki kepadamu dan kepada mereka.’ Janganlah pula kamu mendekati perbuatan keji, baik yang terlihat maupun yang tersembunyi. Janganlah kamu membunuh orang yang diharamkan Allah, kecuali dengan alasan yang benar. Demikian itu Dia perintahkan kepadamu agar kamu mengerti."
  },
  {
    "ayat": 152,
    "arabic": "وَلَا تَقْرَبُوْا مَالَ الْيَتِيْمِ اِلَّا بِالَّتِيْ هِيَ اَحْسَنُ حَتّٰى يَبْلُغَ اَشُدَّهٗ ۚوَاَوْفُوا الْكَيْلَ وَالْمِيْزَانَ بِالْقِسْطِۚ  لَا نُكَلِّفُ نَفْسًا اِلَّا وُسْعَهَاۚ وَاِذَا قُلْتُمْ فَاعْدِلُوْا وَلَوْ كَانَ ذَا قُرْبٰىۚ وَبِعَهْدِ اللّٰهِ اَوْفُوْاۗ ذٰلِكُمْ وَصّٰىكُمْ بِهٖ لَعَلَّكُمْ تَذَكَّرُوْنَۙ",
    "transliteration_en": "Wa laa taqraboo maalal yateemi illaa billatee hiyaa ahsanu hattaa yablugha ashuddahoo wa awful kaila walmeezaana bilqisti laa nukallifu nafsan illaa wus'ahaa wa izaa qultum fa'diloo wa law kaana zaa qurbaa wa bi 'ahdil laahi awfoo; zaalikum wassaakum bihee la'allakum tazakkarron",
    "transliteration_id": "Wa lā taqrabū mālal-yatīmi illā bil-latī hiya aḥsanu ḥattā yabluga asyuddah(ū), wa auful-kaila wal-mīzāna bil-qisṭ(i), lā nukallifu nafsan illā wus‘ahā, wa iżā qultum fa‘dilū wa lau kāna żā qurbā, wa bi‘ahdillāhi aufū, żālikum waṣṣākum bihī la‘allakum tażakkarūn(a).",
    "translation_en": "And do not approach the orphan's property except in a way that is best until he reaches maturity. And give full measure and weight in justice. We do not charge any soul except [with that within] its capacity. And when you testify, be just, even if [it concerns] a near relative. And the covenant of Allah fulfill. This has He instructed you that you may remember.",
    "translation_id": "Janganlah kamu mendekati (menggunakan) harta anak yatim, kecuali dengan cara yang lebih bermanfaat, sampai dia mencapai (usia) dewasa. Sempurnakanlah takaran dan timbangan dengan adil. Kami tidak membebani seseorang melainkan menurut kesanggupannya. Apabila kamu berbicara, lakukanlah secara adil sekalipun dia kerabat(-mu). Penuhilah pula janji Allah. Demikian itu Dia perintahkan kepadamu agar kamu mengambil pelajaran.”"
  },
  {
    "ayat": 153,
    "arabic": "وَاَنَّ هٰذَا صِرَاطِيْ مُسْتَقِيْمًا فَاتَّبِعُوْهُ ۚوَلَا تَتَّبِعُوا السُّبُلَ فَتَفَرَّقَ بِكُمْ عَنْ سَبِيْلِهٖ ۗذٰلِكُمْ وَصّٰىكُمْ بِهٖ لَعَلَّكُمْ تَتَّقُوْنَ",
    "transliteration_en": "Wa annna haazaa Siraatee mustaqeeman fattabi'oohu wa laa tattabi'us subula fatafarraqa bikum 'an sabeelih; zaalikum wassaakum bihee la'allakum tattaqoon",
    "transliteration_id": "Wa anna hāżā ṣirāṭī mustaqīman fattabi‘ūh(u), wa lā tattabi‘us-subula fa tafarraqa bikum ‘an sabīlih(ī), żālikum waṣṣākum bihī la‘allakum tattaqūn(a).",
    "translation_en": "And, [moreover], this is My path, which is straight, so follow it; and do not follow [other] ways, for you will be separated from His way. This has He instructed you that you may become righteous.",
    "translation_id": "Sungguh, inilah jalan-Ku yang lurus, maka ikutilah! Jangan kamu ikuti jalan-jalan (yang lain) sehingga mencerai-beraikanmu dari jalan-Nya. Demikian itu Dia perintahkan kepadamu agar kamu bertakwa."
  },
  {
    "ayat": 154,
    "arabic": "ثُمَّ اٰتَيْنَا مُوْسَى الْكِتٰبَ تَمَامًا عَلَى الَّذِيْٓ اَحْسَنَ وَتَفْصِيْلًا لِّكُلِّ شَيْءٍ وَّهُدًى وَّرَحْمَةً لَّعَلَّهُمْ بِلِقَاۤءِ رَبِّهِمْ يُؤْمِنُوْنَ ࣖ",
    "transliteration_en": "Summa aatainaa Moosal Kitaaba tammaaman 'alal lazeee ahsana wa tafseelal likulli shai'inw wa hudanw wa rahmatal la'allahum biliqaaa'i Rabbihim yu'minoon",
    "transliteration_id": "Ṡumma ātainā mūsal-kitāba tamāman ‘alal-lażī aḥsana wa tafṣīlal likulli syai'iw wa hudaw wa raḥmatal la‘allahum biliqā'i rabbihim yu'minūn(a).",
    "translation_en": "Then We gave Moses the Scripture, making complete [Our favor] upon the one who did good and as a detailed explanation of all things and as guidance and mercy that perhaps in [the matter of] the meeting with their Lord they would believe.",
    "translation_id": "Kemudian, Kami telah menganugerahkan kepada Musa Kitab (Taurat) untuk menyempurnakan (nikmat Kami) kepada orang yang berbuat kebaikan, menjelaskan secara rinci segala sesuatu, serta memberi petunjuk dan rahmat agar mereka beriman kepada pertemuan dengan Tuhannya."
  },
  {
    "ayat": 155,
    "arabic": "وَهٰذَا كِتٰبٌ اَنْزَلْنٰهُ مُبٰرَكٌ فَاتَّبِعُوْهُ وَاتَّقُوْا لَعَلَّكُمْ تُرْحَمُوْنَۙ",
    "transliteration_en": "Wa haazaa Kitaabun anzalnaahu Mubaarakun fattabi'oohu wattaqoo la'al lakum urhamoon",
    "transliteration_id": "Wa hāżā kitābun anzalnāhu mubārakun fattabi‘ūhu wattaqū la‘allakum turḥamūn(a).",
    "translation_en": "And this [Qur'an] is a Book We have revealed [which is] blessed, so follow it and fear Allah that you may receive mercy.",
    "translation_id": "(Al-Qur’an) ini adalah Kitab yang Kami turunkan lagi diberkahi. Maka, ikutilah dan bertakwalah agar kamu dirahmati."
  },
  {
    "ayat": 156,
    "arabic": "اَنْ تَقُوْلُوْٓا اِنَّمَآ اُنْزِلَ الْكِتٰبُ عَلٰى طَاۤىِٕفَتَيْنِ مِنْ قَبْلِنَاۖ وَاِنْ كُنَّا عَنْ دِرَاسَتِهِمْ لَغٰفِلِيْنَۙ",
    "transliteration_en": "An taqooloo innammaaa unzilal Kitaabu 'alaa taaa'ifataini min qablinaa wa in kunnaa 'an diraasatihim laghaafileen",
    "transliteration_id": "An taqūlū innamā unzilal-kitābu ‘alā ṭā'ifataini min qablinā, wa in kunnā ‘an dirāsatihim lagāfilīn(a).",
    "translation_en": "[We revealed it] lest you say, \"The Scripture was only sent down to two groups before us, but we were of their study unaware,\"",
    "translation_id": "(Kami turunkan Al-Qur’an itu) supaya kamu (tidak) mengatakan, “Kitab itu hanya diturunkan kepada dua golongan sebelum kami (Yahudi dan Nasrani) dan sesungguhnya kami lengah dari apa yang mereka baca,”"
  },
  {
    "ayat": 157,
    "arabic": "اَوْ تَقُوْلُوْا لَوْ اَنَّآ اُنْزِلَ عَلَيْنَا الْكِتٰبُ لَكُنَّآ اَهْدٰى مِنْهُمْۚ فَقَدْ جَاۤءَكُمْ بَيِّنَةٌ مِّنْ رَّبِّكُمْ وَهُدًى وَّرَحْمَةٌ ۚفَمَنْ اَظْلَمُ مِمَّنْ كَذَّبَ بِاٰيٰتِ اللّٰهِ وَصَدَفَ عَنْهَا ۗسَنَجْزِى الَّذِيْنَ يَصْدِفُوْنَ عَنْ اٰيٰتِنَا سُوْۤءَ الْعَذَابِ بِمَا كَانُوْا يَصْدِفُوْنَ",
    "transliteration_en": "Aw taqooloo law annaaa unzila 'alainal kitaabu lakunnaaa ahdaa minhum; faqad jaaa'akum baiyinatum mir Rabbikum wa hudanw wa rahmah; faman azlamu mimman kazzaba bi Aayaatil laahi wa sadaf 'anhaa; sanajzil lazeena yasdifoona 'an Aayaatinaa sooo'al 'azaabi bimaa kaanoo yasdifoon",
    "transliteration_id": "Au taqūlū lau annā unzila ‘alainal-kitābu lakunnā ahdā minhum, faqad jā'akum bayyinatum mir rabbikum wa hudaw wa raḥmah(tun), faman aẓlamu mimman każżaba bi'āyātillāhi wa ṣadafa ‘anhā, sanajzil-lażīna yaṣdifūna ‘an āyātinā sū'al-‘ażābi bimā kānū yaṣdifūn(a).",
    "translation_en": "Or lest you say, \"If only the Scripture had been revealed to us, we would have been better guided than they.\" So there has [now] come to you a clear evidence from your Lord and a guidance and mercy. Then who is more unjust than one who denies the verses of Allah and turns away from them? We will recompense those who turn away from Our verses with the worst of punishment for their having turned away.",
    "translation_id": "atau supaya kamu (tidak) mengatakan, “Sesungguhnya jikalau Kitab itu diturunkan kepada kami, tentulah kami lebih mendapat petunjuk daripada mereka.” Sungguh, telah datang kepadamu penjelasan yang nyata, petunjuk, dan rahmat dari Tuhanmu. Maka, siapakah yang lebih zalim daripada orang yang mendustakan ayat-ayat Allah dan berpaling darinya? Kelak, Kami akan memberi balasan kepada orang-orang yang berpaling dari ayat-ayat Kami dengan siksaan yang buruk karena mereka selalu berpaling."
  },
  {
    "ayat": 158,
    "arabic": "هَلْ يَنْظُرُوْنَ اِلَّآ اَنْ تَأْتِيَهُمُ الْمَلٰۤىِٕكَةُ اَوْ يَأْتِيَ رَبُّكَ اَوْ يَأْتِيَ بَعْضُ اٰيٰتِ رَبِّكَ ۗيَوْمَ يَأْتِيْ بَعْضُ اٰيٰتِ رَبِّكَ لَا يَنْفَعُ نَفْسًا اِيْمَانُهَا لَمْ تَكُنْ اٰمَنَتْ مِنْ قَبْلُ اَوْ كَسَبَتْ فِيْٓ اِيْمَانِهَا خَيْرًاۗ قُلِ انْتَظِرُوْٓا اِنَّا مُنْتَظِرُوْنَ",
    "transliteration_en": "hal yanzuroona illaaa an taatiyahumul malaaa'ikatu aw yaatiya Rabbuka aw yaatiya ba'du Aayaati Rabbik; yawma yaatee ba'du Aayaati Rabbika laa yanfa'u nafsan eemaanuhaa lam takun aamanat min qablu aw kasabat feee eemaanihaa khairaa; qulin tazirooo innaa muntaziroon",
    "transliteration_id": "Hal yanẓurūna illā an ta'tiyahumul-malā'ikatu au ya'tiya rabbuka au ya'tiya ba‘ḍu āyāti rabbik(a), yauma ya'tī ba‘ḍu āyāti rabbika lā yanfa‘u nafsan īmānuhā lam takun āmanat min qablu au kasabat fī īmānihā khairā(n), qulintaẓirū innā muntaẓirūn(a).",
    "translation_en": "Do they [then] wait for anything except that the angels should come to them or your Lord should come or that there come some of the signs of your Lord? The Day that some of the signs of your Lord will come no soul will benefit from its faith as long as it had not believed before or had earned through its faith some good. Say, \"Wait. Indeed, we [also] are waiting.\"",
    "translation_id": "Yang mereka nanti-nantikan hanyalah kedatangan malaikat kepada mereka, kedatangan Tuhanmu, atau sebagian tanda-tanda dari Tuhanmu. Pada hari datangnya sebagian tanda-tanda Tuhanmu tidak bermanfaat lagi iman seseorang yang belum beriman sebelum itu atau (belum) berusaha berbuat kebajikan dalam masa imannya itu. Katakanlah, “Tunggulah! Sesungguhnya Kami pun menunggu.”"
  },
  {
    "ayat": 159,
    "arabic": "اِنَّ الَّذِيْنَ فَرَّقُوْا دِيْنَهُمْ وَكَانُوْا شِيَعًا لَّسْتَ مِنْهُمْ فِيْ شَيْءٍۗ اِنَّمَآ اَمْرُهُمْ اِلَى اللّٰهِ ثُمَّ يُنَبِّئُهُمْ بِمَا كَانُوْا يَفْعَلُوْنَ",
    "transliteration_en": "Innal lazeena farraqoo deenahum wa kaanoo shiya'allasta minhum fee shai'; innamaaa amruhum ilallaahi summma yunabbi'uhum bimaa kaanoo yaf'aloon",
    "transliteration_id": "Innal-lażīna farraqū dīnahum wa kānū syiya‘al lasta minhum fī syai'(in), innamā amruhum ilallāhi ṡumma yunabbi'uhum bimā kānū yaf‘alūn(a).",
    "translation_en": "Indeed, those who have divided their religion and become sects - you, [O Muhammad], are not [associated] with them in anything. Their affair is only [left] to Allah; then He will inform them about what they used to do.",
    "translation_id": "Sesungguhnya orang-orang yang memecah belah agamanya dan mereka menjadi (terpecah) dalam golongan-golongan, sedikit pun engkau (Nabi Muhammad) tidak bertanggung jawab terhadap mereka. Sesungguhnya urusan mereka (terserah) hanya kepada Allah. Kemudian, Dia akan memberitahukan kepada mereka apa yang telah mereka perbuat."
  },
  {
    "ayat": 160,
    "arabic": "مَنْ جَاۤءَ بِالْحَسَنَةِ فَلَهٗ عَشْرُ اَمْثَالِهَا ۚوَمَنْ جَاۤءَ بِالسَّيِّئَةِ فَلَا يُجْزٰٓى اِلَّا مِثْلَهَا وَهُمْ لَا يُظْلَمُوْنَ",
    "transliteration_en": "man jaaa'a bilhasanati falahoo 'ashru amsaalihaa wa man jaaa'a bissaiyi'ati falaa yujzaaa illaa mislahaa wa hum laa yuzlamoon",
    "transliteration_id": "Man jā'a bil-ḥasanati fa lahū ‘asyru amṡālihā, wa man jā'a bis-sayyi'ati falā yujzā illā miṡlahā wa hum lā yuẓlamūn(a).",
    "translation_en": "Whoever comes [on the Day of Judgement] with a good deed will have ten times the like thereof [to his credit], and whoever comes with an evil deed will not be recompensed except the like thereof; and they will not be wronged.",
    "translation_id": "Siapa yang berbuat kebaikan, dia akan mendapat balasan sepuluh kali lipatnya. Siapa yang berbuat keburukan, dia tidak akan diberi balasan melainkan yang seimbang dengannya. Mereka (sedikit pun) tidak dizalimi (dirugikan)."
  },
  {
    "ayat": 161,
    "arabic": "قُلْ اِنَّنِيْ هَدٰىنِيْ رَبِّيْٓ اِلٰى صِرَاطٍ مُّسْتَقِيْمٍ ەۚ دِيْنًا قِيَمًا مِّلَّةَ اِبْرٰهِيْمَ حَنِيْفًاۚ وَمَا كَانَ مِنَ الْمُشْرِكِيْنَ",
    "transliteration_en": "Qul innanee hadaanee Rabbeee ilaa Siraatim Mustaqeemin deenan qiyamam Millata Ibraaheema haneefaa; wa maa kaana minal mushrikeen",
    "transliteration_id": "Qul innanī hadānī rabbī ilā ṣirāṭim mustaqīm(in), dīnan qiyamam millata ibrāhīma ḥanīfā(n), wa mā kāna minal-musyrikīn(a).",
    "translation_en": "Say, \"Indeed, my Lord has guided me to a straight path - a correct religion - the way of Abraham, inclining toward truth. And he was not among those who associated others with Allah.\"",
    "translation_id": "Katakanlah (Nabi Muhammad), “Sesungguhnya Tuhanku telah membimbingku ke jalan yang lurus, agama yang benar, agama Ibrahim yang lurus, dan dia (Ibrahim) tidak termasuk orang-orang musyrik.”"
  },
  {
    "ayat": 162,
    "arabic": "قُلْ اِنَّ صَلَاتِيْ وَنُسُكِيْ وَمَحْيَايَ وَمَمَاتِيْ لِلّٰهِ رَبِّ الْعٰلَمِيْنَۙ",
    "transliteration_en": "Qul inna Salaatee wa nusukee wa mahyaaya wa mamaatee lillaahi Rabbil 'aalameen",
    "transliteration_id": "Qul inna ṣalātī wa nusukī wa maḥyāya wa mamātī lillāhi rabbil-‘ālamīn(a).",
    "translation_en": "Say, \"Indeed, my prayer, my rites of sacrifice, my living and my dying are for Allah, Lord of the worlds.",
    "translation_id": "Katakanlah (Nabi Muhammad), “Sesungguhnya salatku, ibadahku, hidupku, dan matiku hanyalah untuk Allah, Tuhan semesta alam."
  },
  {
    "ayat": 163,
    "arabic": "لَا شَرِيْكَ لَهٗ ۚوَبِذٰلِكَ اُمِرْتُ وَاَنَا۠ اَوَّلُ الْمُسْلِمِيْنَ",
    "transliteration_en": "Laa shareeka lahoo wa bizaalika umirtu wa ana awwalul muslimeen",
    "transliteration_id": "Lā syarīka lah(ū), wa biżālika umirtu wa ana awwalul-muslimīn(a).",
    "translation_en": "No partner has He. And this I have been commanded, and I am the first [among you] of the Muslims.\"",
    "translation_id": "Tidak ada sekutu bagi-Nya. Itulah yang diperintahkan kepadaku. Aku adalah orang yang pertama dalam kelompok orang muslim.”"
  },
  {
    "ayat": 164,
    "arabic": "قُلْ اَغَيْرَ اللّٰهِ اَبْغِيْ رَبًّا وَّهُوَ رَبُّ كُلِّ شَيْءٍۗ وَلَا تَكْسِبُ كُلُّ نَفْسٍ اِلَّا عَلَيْهَاۚ وَلَا تَزِرُ وَازِرَةٌ وِّزْرَ اُخْرٰىۚ ثُمَّ اِلٰى رَبِّكُمْ مَّرْجِعُكُمْ فَيُنَبِّئُكُمْ بِمَا كُنْتُمْ فِيْهِ تَخْتَلِفُوْنَ",
    "transliteration_en": "Qul aghairal laahi abhee Rabbanw wa Huwa Rabbu kulli shai'; wa laa taksibu kullu nafsin illaa 'alaihaa; wa laa taziru waaziratunw wizra ukhraa; summa ilaa Rabbikum marji'ukum fa yunabbi'ukum bimaa kuntum feehi takhtalifoon",
    "transliteration_id": "Qul agairallāhi abgī rabbaw wa huwa rabbu kulli syai'(in), wa lā taksibu kullu nafsin illā ‘alaihā, wa lā taziru wāziratuw wizra ukhrā, ṡumma ilā rabbikum marji‘ukum fa yunabbi'ukum bimā kuntum fīhi takhtalifūn(a).",
    "translation_en": "Say, \"Is it other than Allah I should desire as a lord while He is the Lord of all things? And every soul earns not [blame] except against itself, and no bearer of burdens will bear the burden of another. Then to your Lord is your return, and He will inform you concerning that over which you used to differ.\"",
    "translation_id": "Katakanlah (Nabi Muhammad), “Apakah aku (pantas) mencari tuhan selain Allah, padahal Dialah Tuhan bagi segala sesuatu. Setiap orang yang berbuat dosa, dirinya sendirilah yang akan bertanggung jawab. Seseorang tidak akan memikul beban dosa orang lain. Kemudian, kepada Tuhanmulah kamu kembali, lalu Dia akan memberitahukan kepadamu apa yang dahulu kamu perselisihkan.”"
  },
  {
    "ayat": 165,
    "arabic": "وَهُوَ الَّذِيْ جَعَلَكُمْ خَلٰۤىِٕفَ الْاَرْضِ وَرَفَعَ بَعْضَكُمْ فَوْقَ بَعْضٍ دَرَجٰتٍ لِّيَبْلُوَكُمْ فِيْ مَآ اٰتٰىكُمْۗ اِنَّ رَبَّكَ سَرِيْعُ الْعِقَابِۖ وَاِنَّهٗ لَغَفُوْرٌ رَّحِيْمٌ ࣖ",
    "transliteration_en": "Wa Huwal lazee ja'alakum khalaaa'ifal ardi wa rafa'a ba'dakum fawqa ba'din darajaatil liyabluwakum fee maaa aataakum; inna Rabbaka saree'ul 'iqaab; wa innahoo la Ghafoorur Raheem",
    "transliteration_id": "Wa huwal-lażī ja‘alakum khalā'ifal-arḍi wa rafa‘a ba‘ḍakum fauqa ba‘ḍin darajātil liyabluwakum fī mā ātākum, inna rabbaka sarī‘ul-‘iqāb(i), wa innahū lagafūrur raḥīm(un).",
    "translation_en": "And it is He who has made you successors upon the earth and has raised some of you above others in degrees [of rank] that He may try you through what He has given you. Indeed, your Lord is swift in penalty; but indeed, He is Forgiving and Merciful.",
    "translation_id": "Dialah yang menjadikan kamu sebagai khalifah-khalifah di bumi dan Dia meninggikan sebagian kamu beberapa derajat atas sebagian (yang lain) untuk menguji kamu atas apa yang diberikan-Nya kepadamu. Sesungguhnya Tuhanmu sangat cepat hukuman-Nya. Sesungguhnya Dia Maha Pengampun lagi Maha Penyayang."
  }
]