[
  {
    "ayat": 51,
    "arabic": "وَاَنْذِرْ بِهِ الَّذِيْنَ يَخَافُوْنَ اَنْ يُّحْشَرُوْٓا اِلٰى رَبِّهِمْ لَيْسَ لَهُمْ مِّنْ دُوْنِهٖ وَلِيٌّ وَّلَا شَفِيْعٌ لَّعَلَّهُمْ يَتَّقُوْنَ",
    "transliteration_en": "Wa anzir bihil lazeena yakhaafoona ai yuhsharooo ilaa Rabbihim laisa lahum min doonihee waliyyunw wa laa shafee'ul la'allahum yattaqoon",
    "transliteration_id": "Wa anżir bihil-lażīna yakhāfūna ay yuḥsyarū ilā rabbihim  laisa lahum min dūnihī waliyyuw wa lā syafī‘ul la‘allahum yattaqūn(a).",
    "translation_en": "And warn by the Qur'an those who fear that they will be gathered before their Lord - for them besides Him will be no protector and no intercessor - that they might become righteous.",
    "translation_id": "Peringatkanlah dengannya (Al-Qur’an) orang-orang yang takut akan dikumpulkan menghadap Tuhannya (pada hari Kiamat). Tidak ada bagi mereka pelindung dan pemberi syafaat (pertolongan) selain Allah, agar mereka bertakwa."
  },
  {
    "ayat": 52,
    "arabic": "وَلَا تَطْرُدِ الَّذِيْنَ يَدْعُوْنَ رَبَّهُمْ بِالْغَدٰوةِ وَالْعَشِيِّ يُرِيْدُوْنَ وَجْهَهٗ ۗمَا عَلَيْكَ مِنْ حِسَابِهِمْ مِّنْ شَيْءٍ وَّمَا مِنْ حِسَابِكَ عَلَيْهِمْ مِّنْ شَيْءٍ فَتَطْرُدَهُمْ فَتَكُوْنَ مِنَ الظّٰلِمِيْنَ",
    "transliteration_en": "Wa laa tatrudil lazeena yad'oona Rabbahum bilghadaati wal 'ashiyyi yureedoona Wajhahoo ma 'alaika min hisaabihim min shai'inw wa maa min hisaabika 'alaihim min shai'in fatatrudahum fatakoona minaz zaalimeen",
    "transliteration_id": "Wa lā taṭrudil-lażīna yad‘ūna rabbahum bil-gadāti wal-‘asyiyyi yurīdūna wajhah(ū), mā ‘alaika min ḥisābihim min syai'iw wa mā min ḥisābika  ‘alaihim min syai'in fa taṭrudahum fa takūna minaẓ-ẓālimīn(a).",
    "translation_en": "And do not send away those who call upon their Lord morning and afternoon, seeking His countenance. Not upon you is anything of their account and not upon them is anything of your account. So were you to send them away, you would [then] be of the wrongdoers.",
    "translation_id": "Janganlah engkau (Nabi Muhammad) mengusir orang-orang yang menyeru Tuhannya pada pagi dan petang hari, sedangkan mereka mengharapkan keridaan-Nya. Engkau tidak memikul tanggung jawab sedikit pun terhadap perbuatan mereka dan mereka (pun) tidak memikul tanggung jawab sedikit pun terhadap perbuatanmu, sehingga engkau (tidak berhak) mengusir mereka. (Jika dilakukan,) engkau termasuk orang-orang yang zalim."
  },
  {
    "ayat": 53,
    "arabic": "وَكَذٰلِكَ فَتَنَّا بَعْضَهُمْ بِبَعْضٍ لِّيَقُوْلُوْٓا اَهٰٓؤُلَاۤءِ مَنَّ اللّٰهُ عَلَيْهِمْ مِّنْۢ بَيْنِنَاۗ  اَلَيْسَ اللّٰهُ بِاَعْلَمَ بِالشّٰكِرِيْنَ",
    "transliteration_en": "Wa kazaalika fatannaa ba'dahum biba'dil liyaqoolooo ahaaa'ulaaa'i mannal laahu 'alaihim mim baininaa; alaisal laahu bi-a'lama bish shaakireen",
    "transliteration_id": "Wa każālika fatannā ba‘ḍahum biba‘ḍil liyaqūlū ahā'ulā'i mannallāhu ‘alaihim mim baininā, alaisallāhu bi'a‘lama bisy-syākirīn(a).",
    "translation_en": "And thus We have tried some of them through others that the disbelievers might say, \"Is it these whom Allah has favored among us?\" Is not Allah most knowing of those who are grateful?",
    "translation_id": "Demikianlah Kami telah menguji sebagian mereka (yang kaya dan berkuasa) dengan sebagian yang lain (yang miskin dan menderita), sehingga mereka (yang kaya dan kufur itu) berkata, “Orang-orang semacam inikah (yang status sosialnya rendah) di antara kita yang diberi anugerah oleh Allah?” (Allah berfirman,) “Tidakkah Allah lebih mengetahui tentang mereka yang bersyukur (kepada-Nya)?”"
  },
  {
    "ayat": 54,
    "arabic": "وَاِذَا جَاۤءَكَ الَّذِيْنَ يُؤْمِنُوْنَ بِاٰيٰتِنَا فَقُلْ سَلٰمٌ عَلَيْكُمْ كَتَبَ رَبُّكُمْ عَلٰى نَفْسِهِ الرَّحْمَةَۙ اَنَّهٗ مَنْ عَمِلَ مِنْكُمْ سُوْۤءًاۢ بِجَهَالَةٍ ثُمَّ تَابَ مِنْۢ بَعْدِهٖ وَاَصْلَحَ فَاَنَّهٗ غَفُوْرٌ رَّحِيْمٌ",
    "transliteration_en": "Wa izaa jaaa'akal lazeena yu'minoona bi Aayaatinaa faqul salaamun 'alaikum kataba Rabbukum 'alaa nafsihir rahmata annahoo man 'amila minkum sooo'am bijahaalatin summa taaba mim ba'dihee wa aslaha fa annahoo Ghafoorur Raheem",
    "transliteration_id": "Wa iżā jā'akal-lażīna yu'minūna bi'āyātinā fa qul salāmun ‘alaikum kataba rabbukum ‘alā nafsihir-raḥmah(ta), annahū man ‘amila minkum sū'am bijahālatin ṡumma tāba mim ba‘dihī wa aṣlaḥa fa annahū gafūrur raḥīm(un).",
    "translation_en": "And when those come to you who believe in Our verses, say, \"Peace be upon you. Your Lord has decreed upon Himself mercy: that any of you who does wrong out of ignorance and then repents after that and corrects himself - indeed, He is Forgiving and Merciful.\"",
    "translation_id": "Apabila orang-orang yang beriman pada ayat-ayat Kami datang kepadamu, katakanlah, “Salāmun ‘alaikum (semoga keselamatan tercurah kepadamu).” Tuhanmu telah menetapkan sifat kasih sayang pada diri-Nya, (yaitu) siapa yang berbuat kejahatan di antara kamu karena kejahilan (kebodohan, kecerobohan, dorongan nafsu, amarah dan sebagainya), kemudian dia bertobat setelah itu dan memperbaiki diri, maka sesungguhnya Dia Maha Pengampun lagi Maha Penyayang."
  },
  {
    "ayat": 55,
    "arabic": "وَكَذٰلِكَ نُفَصِّلُ الْاٰيٰتِ وَلِتَسْتَبِيْنَ سَبِيْلُ الْمُجْرِمِيْنَ ࣖ",
    "transliteration_en": "Wa kazaalika nufassilul Aayaati wa litastabeena sabeelul mujrimeen",
    "transliteration_id": "Wa każālika nufaṣṣilul-āyāti wa litastabīna sabīlal-mujrimīn(a).",
    "translation_en": "And thus do We detail the verses, and [thus] the way of the criminals will become evident.",
    "translation_id": "Demikianlah Kami terangkan ayat-ayat Al-Qur’an secara terperinci (agar terlihat jelas jalan kebenaran) dan agar terlihat jelas (pula) jalan para pendurhaka."
  },
  {
    "ayat": 56,
    "arabic": "قُلْ اِنِّيْ نُهِيْتُ اَنْ اَعْبُدَ الَّذِيْنَ تَدْعُوْنَ مِنْ دُوْنِ اللّٰهِ ۗ قُلْ لَّآ اَتَّبِعُ اَهْوَاۤءَكُمْۙ قَدْ ضَلَلْتُ اِذًا وَّمَآ اَنَا۠ مِنَ الْمُهْتَدِيْنَ",
    "transliteration_en": "Qul innee nuheetu an a'budal lazeena tad'oona min doonil laah; qul laaa attabi'u ahwaaa'akum qad dalaltu izanw wa maaa ana minal muhtadeen",
    "transliteration_id": "Qul innī nuhītu an a‘budal-lażīna tad‘ūna min dūnillāh(i), qul lā attabi‘u ahwā'akum, qad ḍalaltu iżaw wa mā ana minal-muhtadīn(a).",
    "translation_en": "Say, \"Indeed, I have been forbidden to worship those you invoke besides Allah.\" Say, \"I will not follow your desires, for I would then have gone astray, and I would not be of the [rightly] guided.\"",
    "translation_id": "Katakanlah (Nabi Muhammad), “Sesungguhnya aku dilarang menyembah tuhan-tuhan yang kamu sembah selain Allah.” Katakanlah, “Aku tidak akan mengikuti keinginanmu. Jika berbuat demikian, sungguh tersesatlah aku, dan aku tidak termasuk orang yang mendapat petunjuk.”"
  },
  {
    "ayat": 57,
    "arabic": "قُلْ اِنِّيْ عَلٰى بَيِّنَةٍ مِّنْ رَّبِّيْ وَكَذَّبْتُمْ بِهٖۗ مَا عِنْدِيْ مَا تَسْتَعْجِلُوْنَ بِهٖۗ اِنِ الْحُكْمُ اِلَّا لِلّٰهِ ۗيَقُصُّ الْحَقَّ وَهُوَ خَيْرُ الْفٰصِلِيْنَ",
    "transliteration_en": "Qul innee 'alaa baiyinatim mir Rabbee wa kazzabtum bih; maa 'indee maa tasta'jiloona bih; inil hukmu illaa lillaahi yaqussul haqqa wa Huwa khairul faasileen",
    "transliteration_id": "Qul innī ‘alā bayyinatim mir rabbī wa każżabtum bih(ī), mā ‘indī mā tasta‘jilūna bih(ī), inil-ḥukmu illā lillāh(i), yaquṣṣul-ḥaqqa wa huwa khairul-fāṣilīn(a).",
    "translation_en": "Say, \"Indeed, I am on clear evidence from my Lord, and you have denied it. I do not have that for which you are impatient. The decision is only for Allah. He relates the truth, and He is the best of deciders.\"",
    "translation_id": "Katakanlah (Nabi Muhammad), “Aku (berada) di atas keterangan yang nyata (kebenarannya, yaitu Al-Qur’an) dari Tuhanku, sedangkan kamu mendustakannya. Bukanlah kewenanganku (untuk menurunkan azab) yang kamu tuntut untuk disegerakan kedatangannya. Menetapkan hukum itu hanyalah hak Allah. Dia menerangkan kebenaran dan Dia pemberi keputusan yang terbaik.”"
  },
  {
    "ayat": 58,
    "arabic": "قُلْ لَّوْ اَنَّ عِنْدِيْ مَا تَسْتَعْجِلُوْنَ بِهٖ لَقُضِيَ الْاَمْرُ بَيْنِيْ وَبَيْنَكُمْ ۗوَاللّٰهُ اَعْلَمُ بِالظّٰلِمِيْنَ",
    "transliteration_en": "Qul law anna 'indee maa tasta'jiloona bihee laqudiyal amru bainee wa bainakum; wallaahu a'lamu bizzaalimeen",
    "transliteration_id": "Qul lau anna ‘indī mā tasta‘jilūna bihī laquḍiyal-amru bainī wa bainakum, wallāhu a‘lamu biẓ-ẓālimīn(a).",
    "translation_en": "Say, \"If I had that for which you are impatient, the matter would have been decided between me and you, but Allah is most knowing of the wrongdoers.\"",
    "translation_id": "Katakanlah (Nabi Muhammad), “Seandainya ada padaku (kewenangan untuk menurunkan) apa (azab) yang kamu minta agar disegerakan kedatangannya, tentu selesailah segala perkara antara aku dan kamu.” Allah lebih mengetahui tentang orang-orang yang zalim."
  },
  {
    "ayat": 59,
    "arabic": "۞ وَعِنْدَهٗ مَفَاتِحُ الْغَيْبِ لَا يَعْلَمُهَآ اِلَّا هُوَۗ وَيَعْلَمُ مَا فِى الْبَرِّ وَالْبَحْرِۗ وَمَا تَسْقُطُ مِنْ وَّرَقَةٍ اِلَّا يَعْلَمُهَا وَلَا حَبَّةٍ فِيْ ظُلُمٰتِ الْاَرْضِ وَلَا رَطْبٍ وَّلَا يَابِسٍ اِلَّا فِيْ كِتٰبٍ مُّبِيْنٍ",
    "transliteration_en": "Wa 'indahoo mafaatihul ghaibi laa ya'lamuhaaa illaa Hoo; wa ya'lamu maa fil barri walbahr; wa maa tasqutu minw waraqatin illaa ya'lamuhaa wa laa habbatin fee zulumaatil ardi wa laa ratbinw wa laa yaabisin illaa fee Kitaabim Mubeen",
    "transliteration_id": "Wa ‘indahū mafātiḥul-gaibi lā ya‘lamuhā illā huw(a), wa ya‘lamu mā fil-barri wal-baḥr(i), wa mā tasquṭu miw waraqatin illā ya‘lamuhā wa lā ḥabbatin fī ẓulumātil-arḍi wa lā raṭbiw wa lā yābisin illā fī kitābim mubīn(in).",
    "translation_en": "And with Him are the keys of the unseen; none knows them except Him. And He knows what is on the land and in the sea. Not a leaf falls but that He knows it. And no grain is there within the darknesses of the earth and no moist or dry [thing] but that it is [written] in a clear record.",
    "translation_id": "Kunci-kunci semua yang gaib ada pada-Nya; tidak ada yang mengetahuinya selain Dia. Dia mengetahui apa yang ada di darat dan di laut. Tidak ada sehelai daun pun yang gugur yang tidak diketahui-Nya. Tidak ada sebutir biji pun dalam kegelapan bumi dan tidak pula sesuatu yang basah atau yang kering, melainkan (tertulis) dalam kitab yang nyata (Lauhulmahfuz)."
  },
  {
    "ayat": 60,
    "arabic": "وَهُوَ الَّذِيْ يَتَوَفّٰىكُمْ بِالَّيْلِ وَيَعْلَمُ مَا جَرَحْتُمْ بِالنَّهَارِ ثُمَّ يَبْعَثُكُمْ فِيْهِ لِيُقْضٰٓى اَجَلٌ مُّسَمًّىۚ ثُمَّ اِلَيْهِ مَرْجِعُكُمْ ثُمَّ يُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُوْنَ ࣖ",
    "transliteration_en": "Wa Huwal lazee yatawaf faakum billaili wa ya'lamu maa jarahtum binnahaari summa yab'asukum fee liyuqdaaa ajalum musamman summa ilaihi marji'ukum summa yunabbi 'ukum bimaa kuntum ta'maloon",
    "transliteration_id": "Wa huwal-lażī yatawaffākum bil-laili wa ya‘lamu mā jaraḥtum bin-nahāri ṡumma yab‘aṡukum fīhi liyuqḍā ajalum musammā(n), ṡumma ilaihi marji‘ukum ṡumma yunabbi'ukum bimā kuntum ta‘malūn(a).",
    "translation_en": "And it is He who takes your souls by night and knows what you have committed by day. Then He revives you therein that a specified term may be fulfilled. Then to Him will be your return; then He will inform you about what you used to do.",
    "translation_id": "Dialah yang menidurkan kamu pada malam hari dan Dia mengetahui apa yang kamu kerjakan pada siang hari. Kemudian, Dia membangunkan kamu padanya (siang hari) untuk disempurnakan umurmu yang telah ditetapkan. Kemudian kepada-Nya tempat kamu kembali, lalu Dia memberitahukan kepadamu apa yang telah kamu kerjakan."
  },
  {
    "ayat": 61,
    "arabic": "وَهُوَ الْقَاهِرُ فَوْقَ عِبَادِهٖ وَيُرْسِلُ عَلَيْكُمْ حَفَظَةً ۗحَتّٰٓى اِذَا جَاۤءَ اَحَدَكُمُ الْمَوْتُ تَوَفَّتْهُ رُسُلُنَا وَهُمْ لَا يُفَرِّطُوْنَ",
    "transliteration_en": "Wa huwal qaahiru fawqa 'ibaadihee wa yursilu 'alaikum hafazatan hattaaa izaa jaaa'a ahadakumul mawtu tawaffathu rusulunaa wa hum laa yufarritoon",
    "transliteration_id": "Wa huwal-qāhiru fauqa ‘ibādihī wa yursilu ‘alaikum ḥafaẓah(tan), ḥattā iżā jā'a aḥadakumul-mautu tawaffathu rusulunā wa hum lā yufarriṭūn(a).",
    "translation_en": "And He is the subjugator over His servants, and He sends over you guardian-angels until, when death comes to one of you, Our messengers take him, and they do not fail [in their duties].",
    "translation_id": "Dialah Penguasa mutlak di atas semua hamba-Nya, dan Dia mengutus kepadamu malaikat-malaikat penjaga, sehingga apabila kematian datang kepada salah seorang di antara kamu, malaikat-malaikat Kami mencabut nyawanya, dan mereka tidak melalaikan tugasnya."
  },
  {
    "ayat": 62,
    "arabic": "ثُمَّ رُدُّوْٓا اِلَى اللّٰهِ مَوْلٰىهُمُ الْحَقِّۗ  اَلَا لَهُ الْحُكْمُ وَهُوَ اَسْرَعُ الْحٰسِبِيْنَ",
    "transliteration_en": "Summa ruddooo ilallaahi mawlaahumul haqq; alaa lahul hukmu wa Huwa asra'ul haasibeen",
    "transliteration_id": "Ṡumma ruddū ilallāhi maulāhumul-ḥaqq(i), alā lahul-ḥukmu wa huwa asra‘ul-ḥāsibīn(a).",
    "translation_en": "Then they His servants are returned to Allah, their true Lord. Unquestionably, His is the judgement, and He is the swiftest of accountants.",
    "translation_id": "Kemudian mereka (hamba-hamba Allah) dikembalikan kepada Allah, Penguasa mereka yang sebenarnya. Ketahuilah bahwa segala hukum (pada hari itu) hanya milik-Nya, Dialah pembuat perhitungan yang paling cepat."
  },
  {
    "ayat": 63,
    "arabic": "قُلْ مَنْ يُّنَجِّيْكُمْ مِّنْ ظُلُمٰتِ الْبَرِّ وَالْبَحْرِ تَدْعُوْنَهٗ تَضَرُّعًا وَّخُفْيَةً ۚ لَىِٕنْ اَنْجٰىنَا مِنْ هٰذِهٖ لَنَكُوْنَنَّ مِنَ الشّٰكِرِيْنَ",
    "transliteration_en": "Qul mai yunajjeekum min zulumaatil barri walbahri tad'oonahoo tadarru'anw wa khufyatann la'in anjaanaa min haazihee lanakoonana minash shaakireen",
    "transliteration_id": "Qul may yunajjīkum min ẓulumātil-barri wal-baḥri tad‘ūnahū taḍarru‘aw wa khufyah(tan), la'in anjānā min hāżihī lanakūnanna minasy- syākirīn(a).",
    "translation_en": "Say, \"Who rescues you from the darknesses of the land and sea [when] you call upon Him imploring [aloud] and privately, 'If He should save us from this [crisis], we will surely be among the thankful.' \"",
    "translation_id": "Katakanlah (Nabi Muhammad), “Siapakah yang dapat menyelamatkanmu dari berbagai kegelapan (bencana) di darat dan di laut, ketika kamu berdoa kepada-Nya dengan rendah hati dan dengan suara yang lembut (dengan berkata), ‘Sungguh, jika Dia menyelamatkan kami dari (bencana) ini, tentulah kami menjadi orang-orang yang bersyukur.’”"
  },
  {
    "ayat": 64,
    "arabic": "قُلِ اللّٰهُ يُنَجِّيْكُمْ مِّنْهَا وَمِنْ كُلِّ كَرْبٍ ثُمَّ اَنْتُمْ تُشْرِكُوْنَ",
    "transliteration_en": "Qulil laahu yunajjjeekum minhaa wa min kulli karbin summa antum tushrikoon",
    "transliteration_id": "Qulillāhu yunajjīkum minhā wa min kulli karbin ṡumma antum tusyrikūn(a).",
    "translation_en": "Say, \"It is Allah who saves you from it and from every distress; then you [still] associate others with Him.\"",
    "translation_id": "Katakanlah (Nabi Muhammad), “Allah yang menyelamatkanmu darinya (bencana itu) dan dari segala macam kesusahan. Kemudian, kamu (kembali) mempersekutukan-Nya.”"
  },
  {
    "ayat": 65,
    "arabic": "قُلْ هُوَ الْقَادِرُ عَلٰٓى اَنْ يَّبْعَثَ عَلَيْكُمْ عَذَابًا مِّنْ فَوْقِكُمْ اَوْ مِنْ تَحْتِ اَرْجُلِكُمْ اَوْ يَلْبِسَكُمْ شِيَعًا وَّيُذِيْقَ بَعْضَكُمْ بَأْسَ بَعْضٍۗ  اُنْظُرْ كَيْفَ نُصَرِّفُ الْاٰيٰتِ لَعَلَّهُمْ يَفْقَهُوْنَ",
    "transliteration_en": "Qul huwal Qaadiru 'alaaa ai yab'asa 'alaikum 'azaabam min fawqikum aw min tahti arjulikum aw yalbisakum shiya'anw wa yuzeeqa ba'dakum baasa ba'd; unzur kaifa nusarriful Aayaati la'allahum yafqahoon",
    "transliteration_id": "Qul huwal-qādiru ‘alā ay yab‘aṡa ‘alaikum ‘ażābam min fauqikum au min taḥti arjulikum au yalbisakum syiya‘aw wa yużīqa ba‘ḍakum ba'sa ba‘ḍ(in), unẓur kaifa nuṣarriful-āyāti la‘allahum yafqahūn(a).",
    "translation_en": "Say, \"He is the [one] Able to send upon you affliction from above you or from beneath your feet or to confuse you [so you become] sects and make you taste the violence of one another.\" Look how We diversify the signs that they might understand.",
    "translation_id": "Katakanlah (Nabi Muhammad), “Dialah Yang Maha Kuasa mengirimkan azab kepadamu, dari atas atau dari bawah kakimu atau Dia memecah belah kamu menjadi golongan-golongan (yang saling bertentangan) dan merasakan kepada sebagian kamu keganasan sebagian yang lain.” Perhatikanlah, bagaimana Kami menjelaskan berulang-ulang tanda-tanda (kekuasaan Kami) agar mereka memahami(-nya)."
  },
  {
    "ayat": 66,
    "arabic": "وَكَذَّبَ بِهٖ قَوْمُكَ وَهُوَ الْحَقُّۗ قُلْ لَّسْتُ عَلَيْكُمْ بِوَكِيْلٍ ۗ",
    "transliteration_en": "Wa kaz zaba bihee qawmuka wa huwal haqq; qul lastu'alaikum biwakeel",
    "transliteration_id": "Wa każżaba bihī qaumuka  wa huwal-ḥaqq(u), qul lastu ‘alaikum biwakīl(in).",
    "translation_en": "But your people have denied it while it is the truth. Say, \"I am not over you a manager.\"",
    "translation_id": "Kaummu mendustakannya (azab) padahal (azab) itu benar adanya. Katakanlah (Nabi Muhammad), “Aku ini bukanlah penanggung jawab kamu.”"
  },
  {
    "ayat": 67,
    "arabic": "لِكُلِّ نَبَاٍ مُّسْتَقَرٌّ وَّسَوْفَ تَعْلَمُوْنَ",
    "transliteration_en": "Likulli naba im mustaqar runw wa sawfa ta'lamoon",
    "transliteration_id": "Likulli naba'im mustaqarruw wa saufa ta‘lamūn(a).",
    "translation_en": "For every happening is a finality; and you are going to know.",
    "translation_id": "Setiap berita (yang dibawa oleh rasul) ada (waktu) terjadinya dan kelak kamu akan mengetahui."
  },
  {
    "ayat": 68,
    "arabic": "وَاِذَا رَاَيْتَ الَّذِيْنَ يَخُوْضُوْنَ فِيْٓ اٰيٰتِنَا فَاَعْرِضْ عَنْهُمْ حَتّٰى يَخُوْضُوْا فِيْ حَدِيْثٍ غَيْرِهٖۗ وَاِمَّا يُنْسِيَنَّكَ الشَّيْطٰنُ فَلَا تَقْعُدْ بَعْدَ الذِّكْرٰى مَعَ الْقَوْمِ الظّٰلِمِيْنَ",
    "transliteration_en": "Wa izaa ra aital lazeena yakhoodoona feee Aayaatinaa fa a'rid 'anhum hattaa yakkhoodoo fee hadeesin ghairih; wa immaa yunsiyannakash Shaitaanu falaa taq'ud ba'dazzikraa ma'al qawmiz zaalimeen",
    "transliteration_id": "Wa iżā ra'aital-lażīna yakhūḍūna fī āyātinā fa a‘riḍ ‘anhum ḥattā yakhūḍū fī ḥadīṡin gairih(ī), wa immā yunsiyannakasy-syaiṭānu falā taq‘ud ba‘daż-żikrā ma‘al-qaumiẓ-ẓālimīn(a).",
    "translation_en": "And when you see those who engage in [offensive] discourse concerning Our verses, then turn away from them until they enter into another conversation. And if Satan should cause you to forget, then do not remain after the reminder with the wrongdoing people.",
    "translation_id": "Apabila engkau (Nabi Muhammad) melihat orang-orang memperolok-olokkan ayat-ayat Kami, maka tinggalkanlah mereka hingga mereka beralih ke pembicaraan lain. Jika setan benar-benar menjadikan engkau lupa (akan larangan ini), setelah ingat kembali janganlah engkau duduk bersama kaum yang zalim."
  },
  {
    "ayat": 69,
    "arabic": "وَمَا عَلَى الَّذِيْنَ يَتَّقُوْنَ مِنْ حِسَابِهِمْ مِّنْ شَيْءٍ وَّلٰكِنْ ذِكْرٰى لَعَلَّهُمْ يَتَّقُوْنَ",
    "transliteration_en": "Wa maa 'alal lazeena yattaqoona min hisaabihim min shai'inw wa laakin zikraa la'allahum yattaqoon",
    "transliteration_id": "Wa mā ‘alal-lażīna yattaqūna min ḥisābihim min syai'iw wa lākin żikrā la‘allahum yattaqūn(a).",
    "translation_en": "And those who fear Allah are not held accountable for the disbelievers at all, but [only for] a reminder - that perhaps they will fear Him.",
    "translation_id": "Orang-orang yang bertakwa tidak ada tanggung jawab sedikit pun atas (dosa-dosa) mereka, tetapi (berkewajiban memberi) peringatan agar mereka (juga) bertakwa."
  },
  {
    "ayat": 70,
    "arabic": "وَذَرِ الَّذِيْنَ اتَّخَذُوْا دِيْنَهُمْ لَعِبًا وَّلَهْوًا وَّغَرَّتْهُمُ الْحَيٰوةُ الدُّنْيَا وَذَكِّرْ بِهٖٓ اَنْ تُبْسَلَ نَفْسٌۢ بِمَا كَسَبَتْۖ  لَيْسَ لَهَا مِنْ دُوْنِ اللّٰهِ وَلِيٌّ وَّلَا شَفِيْعٌ ۚوَاِنْ تَعْدِلْ كُلَّ عَدْلٍ لَّا يُؤْخَذْ مِنْهَاۗ اُولٰۤىِٕكَ الَّذِيْنَ اُبْسِلُوْا بِمَا كَسَبُوْا لَهُمْ شَرَابٌ مِّنْ حَمِيْمٍ وَّعَذَابٌ اَلِيْمٌ ۢبِمَا كَانُوْا يَكْفُرُوْنَ ࣖ",
    "transliteration_en": "Wa zaril lazeenat takhazoo deenahum la'ibanwwa lahwanw wa gharrat humul ha yaatud dunyaa; wa zakkir biheee an tubsala nafsum bimaa kasabat laisa lahaa min doonil laahi waliyyunw wa laa shafee'unw wa in ta'dil kulla 'adlil laa yu'khaz minhaa; ulaaa 'ikal lazeena ubsiloo bimaa kasaboo lahum sharaabum min hameeminw wa 'azaabun aleemum bimaa kaanoo yakkfuroon",
    "transliteration_id": "Wa żaril-lażīnattakhażū dīnahum la‘ibaw wa lahwaw wa garrathumul-ḥayātud-dun-yā wa żakkir bihī an tubsala nafsum bimā kasabat, laisa lahā min dūnillāhi waliyyuw wa lā syafī‘(un), wa in ta‘dil kulla ‘adlil lā yu'khaż minhā, ulā'ikal-lażīna ubsilū bimā kasabū lahum syarābum min ḥamīmiw wa ‘ażābun alīmum bimā kānū yakfurūn(a).",
    "translation_en": "And leave those who take their religion as amusement and diversion and whom the worldly life has deluded. But remind with the Qur'an, lest a soul be given up to destruction for what it earned; it will have other than Allah no protector and no intercessor. And if it should offer every compensation, it would not be taken from it. Those are the ones who are given to destruction for what they have earned. For them will be a drink of scalding water and a painful punishment because they used to disbelieve.",
    "translation_id": "Tinggalkanlah orang-orang yang menjadikan agamanya sebagai permainan dan kelengahan, dan mereka telah tertipu oleh kehidupan dunia. Peringatkanlah (mereka) dengannya (Al-Qur’an) agar seseorang tidak terjerumus (ke dalam neraka), karena perbuatannya sendiri. Tidak ada baginya pelindung dan pemberi syafaat (pertolongan) selain Allah. Jika dia hendak menebus dengan segala macam tebusan apa pun, niscaya tidak akan diterima. Mereka itulah orang-orang yang dijerumuskan (ke dalam neraka), karena perbuatan mereka sendiri. Mereka mendapat minuman dari air yang mendidih dan azab yang pedih karena mereka selalu kufur."
  },
  {
    "ayat": 71,
    "arabic": "قُلْ اَنَدْعُوْا مِنْ دُوْنِ اللّٰهِ مَا لَا يَنْفَعُنَا وَلَا يَضُرُّنَا وَنُرَدُّ عَلٰٓى اَعْقَابِنَا بَعْدَ اِذْ هَدٰىنَا اللّٰهُ كَالَّذِى اسْتَهْوَتْهُ الشَّيٰطِيْنُ فِى الْاَرْضِ حَيْرَانَ لَهٗٓ اَصْحٰبٌ يَّدْعُوْنَهٗٓ اِلَى الْهُدَى ائْتِنَا ۗ قُلْ اِنَّ هُدَى اللّٰهِ هُوَ الْهُدٰىۗ وَاُمِرْنَا لِنُسْلِمَ لِرَبِّ الْعٰلَمِيْنَۙ",
    "transliteration_en": "Qul anad'oo min doonil laahi maa laa yanfa'unaa wa laa yadurrunaa wa nuraddu 'alaaa a'qaabina ba'da iz hadaanal laahu kallazis tahwat hush Shayaateenu fil ardi hairaana lahooo ashaabuny yad'oo nahooo ilal huda' tinaa; qul inna hudal laahi huwal hudaa wa umirnaa linuslima li Rabbil 'aalameen",
    "transliteration_id": "Qul anad‘ū min dūnillāhi mā lā yanfa‘unā wa lā yaḍurrunā wa nuraddu ‘alā a‘qābinā ba‘da iż hadānallāhu kal-lażīstahwathusy-syayāṭīnu fil-arḍi ḥairāna lahū aṣḥābuy yad‘ūnahū ilal-huda'tinā, qul inna hudallāhi huwal-hudā, wa umirnā linuslima lirabbil-‘ālamīn(a).",
    "translation_en": "Say, \"Shall we invoke instead of Allah that which neither benefits us nor harms us and be turned back on our heels after Allah has guided us? [We would then be] like one whom the devils enticed [to wander] upon the earth confused, [while] he has companions inviting him to guidance, [calling], 'Come to us.' \" Say, \"Indeed, the guidance of Allah is the [only] guidance; and we have been commanded to submit to the Lord of the worlds.",
    "translation_id": "Katakanlah (Nabi Muhammad), “Apakah kita akan memohon pada sesuatu selain Allah, yang tidak dapat memberi manfaat dan tidak (pula) mendatangkan mudarat kepada kita, dan (apakah) kita akan dikembalikan ke belakang (kufur dan sesat), setelah Allah memberi petunjuk kepada kita, seperti orang yang telah disesatkan oleh setan di bumi, dalam keadaan kebingungan,” sedangkan dia mempunyai kawan-kawan yang selalu mengajaknya ke jalan yang lurus (dengan mengatakan), ‘Ikutilah kami.’?” Katakanlah, “Sesungguhnya petunjuk Allah itulah petunjuk (yang sebenarnya). Kita diperintahkan agar berserah diri kepada Tuhan semesta alam,"
  },
  {
    "ayat": 72,
    "arabic": "وَاَنْ اَقِيْمُوا الصَّلٰوةَ وَاتَّقُوْهُۗ وَهُوَ الَّذِيْٓ اِلَيْهِ تُحْشَرُوْنَ",
    "transliteration_en": "Wa an aqeemus Salaata wattaqooh; wa Hual lazeee ilaihi tuhsharoon",
    "transliteration_id": "Wa aqīmuṣ-ṣalāta wattaqūh(u), wa huwal-lażī ilaihi tuḥsyarūn(a).",
    "translation_en": "And to establish prayer and fear Him.\" And it is He to whom you will be gathered.",
    "translation_id": "dan agar melaksanakan salat serta bertakwa kepada-Nya.” Dialah Tuhan yang hanya kepada-Nya kamu semua akan dihimpun."
  },
  {
    "ayat": 73,
    "arabic": "وَهُوَ الَّذِيْ خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ بِالْحَقِّۗ وَيَوْمَ يَقُوْلُ كُنْ فَيَكُوْنُۚ قَوْلُهُ الْحَقُّۗ وَلَهُ الْمُلْكُ يَوْمَ يُنْفَخُ فِى الصُّوْرِۗ عٰلِمُ الْغَيْبِ وَالشَّهَادَةِ وَهُوَ الْحَكِيْمُ الْخَبِيْرُ",
    "transliteration_en": "Wa an Huwal lazee khalaqas samaawaati wal arda bilhaqq; wa Yawma yaqoolu kun fa yakoon; Qawluhul haqq; wa lahul mulku Yawma yunfakhu fis Soor; 'Aalimul Ghaibi wash shahaadah; wa Huwal Hakeemul Khabeer",
    "transliteration_id": "Wa huwal-lażī khalaqas-samāwāti wal-arḍa bil-ḥaqq(i), wa yauma yaqūlu kun fa yakūn(u), qauluhul-ḥaqq(u), wa lahul-mulku yauma yunfakhu fiṣ-ṣūr(i), ‘ālimul-gaibi wasy-syahādati wa huwal-ḥakīmul-khabīr(u).",
    "translation_en": "And it is He who created the heavens and earth in truth. And the day He says, \"Be,\" and it is, His word is the truth. And His is the dominion [on] the Day the Horn is blown. [He is] Knower of the unseen and the witnessed; and He is the Wise, the Acquainted.",
    "translation_id": "Dialah yang menciptakan langit dan bumi dengan hak (benar). (Sungguh benar ketetapan-Nya) pada hari (ketika) Dia berkata, “Jadilah!” Maka, jadilah sesuatu itu. Firman-Nya adalah benar, dan milik-Nyalah segala kekuasaan pada waktu sangkakala ditiup. Dia mengetahui yang gaib dan yang nyata. Dialah Yang Maha Bijaksana lagi Maha Teliti."
  },
  {
    "ayat": 74,
    "arabic": "۞ وَاِذْ قَالَ اِبْرٰهِيْمُ لِاَبِيْهِ اٰزَرَ اَتَتَّخِذُ اَصْنَامًا اٰلِهَةً ۚاِنِّيْٓ اَرٰىكَ وَقَوْمَكَ فِيْ ضَلٰلٍ مُّبِيْنٍ",
    "transliteration_en": "Wa iz qaala Ibraaheemu li abeehi Aazara a-tattakhizu asnaaman aalihatan inneee araaka wa qawmaka fee dalaalim mmubeen",
    "transliteration_id": "Wa iż qāla ibrāhīmu li'abīhi āzara atattakhiżu aṣnāman ālihah(tan), innī arāka wa qaumaka fī ḍalālim mubīn(in).",
    "translation_en": "And [mention, O Muhammad], when Abraham said to his father Azar, \"Do you take idols as deities? Indeed, I see you and your people to be in manifest error.\"",
    "translation_id": "(Ingatlah) ketika Ibrahim berkata kepada ayahnya, Azar, “Apakah (pantas) engkau menjadikan berhala-berhala itu sebagai tuhan? Sesungguhnya aku melihat engkau dan kaummu dalam kesesatan yang nyata.”"
  },
  {
    "ayat": 75,
    "arabic": "وَكَذٰلِكَ نُرِيْٓ اِبْرٰهِيْمَ مَلَكُوْتَ السَّمٰوٰتِ وَالْاَرْضِ وَلِيَكُوْنَ مِنَ الْمُوْقِنِيْنَ",
    "transliteration_en": "Wa kazaalika nureee Ibraaheema malakootas samaawaati wal ardi wa liyakoona minal mooqineen",
    "transliteration_id": "Wa każālika nurī ibrāhīma malakūtas-samāwāti wal-arḍi wa liyakūna minal-mūqinīn(a).",
    "translation_en": "And thus did We show Abraham the realm of the heavens and the earth that he would be among the certain [in faith]",
    "translation_id": "Demikianlah Kami memperlihatkan kepada Ibrahim kekuasaan (Kami yang terdapat) di langit dan bumi dan agar dia termasuk orang-orang yang yakin."
  },
  {
    "ayat": 76,
    "arabic": "فَلَمَّا جَنَّ عَلَيْهِ الَّيْلُ رَاٰ كَوْكَبًا ۗقَالَ هٰذَا رَبِّيْۚ فَلَمَّآ اَفَلَ قَالَ لَآ اُحِبُّ الْاٰفِلِيْنَ",
    "transliteration_en": "Falammaa janna 'alaihil lailu ra aa kawkabaan qaala haaza Rabbee falammaaa afala qaala laaa uhibbul aafileen",
    "transliteration_id": "Falammā janna ‘alaihil-lailu ra'ā kaukabā(n), qāla hāżā rabbī, falammā afala qāla lā uḥibbul-āfilīn(a).",
    "translation_en": "So when the night covered him [with darkness], he saw a star. He said, \"This is my lord.\" But when it set, he said, \"I like not those that disappear.\"",
    "translation_id": "Ketika malam telah menjadi gelap, dia (Ibrahim) melihat sebuah bintang (lalu) dia berkata, “Inilah Tuhanku.” Maka, ketika bintang itu terbenam dia berkata, “Aku tidak suka kepada yang terbenam.”"
  },
  {
    "ayat": 77,
    "arabic": "فَلَمَّا رَاَ الْقَمَرَ بَازِغًا قَالَ هٰذَا رَبِّيْ ۚفَلَمَّآ اَفَلَ قَالَ لَىِٕنْ لَّمْ يَهْدِنِيْ رَبِّيْ لَاَكُوْنَنَّ مِنَ الْقَوْمِ الضَّاۤلِّيْنَ",
    "transliteration_en": "Falammmaa ra al qamara baazighan qaala haazaa Rabbee falammmmaaa afala qaala la'il lam yahdinee Rabbee la akoonanna minal qawmid daaalleen",
    "transliteration_id": "Falammā ra'al-qamara bāzigan qāla hāżā rabbī, falammā afala qāla la'illam yahdinī rabbī la'akūnanna minal-qaumiḍ-ḍāllīn(a).",
    "translation_en": "And when he saw the moon rising, he said, \"This is my lord.\" But when it set, he said, \"Unless my Lord guides me, I will surely be among the people gone astray.\"",
    "translation_id": "Kemudian, ketika dia melihat bulan terbit dia berkata (kepada kaumnya), “Inilah Tuhanku.” Akan tetapi, ketika bulan itu terbenam dia berkata, “Sungguh, jika Tuhanku tidak memberi petunjuk kepadaku, pastilah aku termasuk kaum yang sesat.”"
  },
  {
    "ayat": 78,
    "arabic": "فَلَمَّا رَاَ الشَّمْسَ بَازِغَةً قَالَ هٰذَا رَبِّيْ هٰذَآ اَكْبَرُۚ فَلَمَّآ اَفَلَتْ قَالَ يٰقَوْمِ اِنِّيْ بَرِيْۤءٌ مِّمَّا تُشْرِكُوْنَ",
    "transliteration_en": "Falammmaa ra ashshamsa baazighatan qaala haazaa Rabbee haazaaa akbaru falammaaa afalat qaala yaa qawmi innee bareee'um mimmaa tushrikoon",
    "transliteration_id": "Falammā ra'asy-syamsa bāzigatan qāla hāżā rabbī hāżā akbar(u), falammā afalat qāla yā qaumi innī barī'um mimmā tusyrikūn(a).",
    "translation_en": "And when he saw the sun rising, he said, \"This is my lord; this is greater.\" But when it set, he said, \"O my people, indeed I am free from what you associate with Allah.",
    "translation_id": "Kemudian, ketika dia melihat matahari terbit dia berkata (lagi kepada kaumnya), “Inilah Tuhanku. Ini lebih besar.” Akan tetapi, ketika matahari terbenam dia berkata, “Wahai kaumku, sesungguhnya aku berlepas diri dari yang kamu persekutukan.”"
  },
  {
    "ayat": 79,
    "arabic": "اِنِّيْ وَجَّهْتُ وَجْهِيَ لِلَّذِيْ فَطَرَ السَّمٰوٰتِ وَالْاَرْضَ حَنِيْفًا وَّمَآ اَنَا۠ مِنَ الْمُشْرِكِيْنَۚ",
    "transliteration_en": "Innnee wajjahtu wajhiya lillazee fataras samaawaati wal arda haneefanw wa maaa ana minal mushrikeen",
    "transliteration_id": "Innī wajjahtu wajhiya lil-lażī faṭaras-samāwāti wal-arḍa ḥanīfaw wa mā ana minal-musyrikīn(a).",
    "translation_en": "Indeed, I have turned my face toward He who created the heavens and the earth, inclining toward truth, and I am not of those who associate others with Allah.\"",
    "translation_id": "Sesungguhnya aku menghadapkan wajahku (hanya) kepada Yang menciptakan langit dan bumi dengan (mengikuti) agama yang lurus dan aku bukanlah termasuk orang-orang musyrik."
  },
  {
    "ayat": 80,
    "arabic": "وَحَاۤجَّهٗ قَوْمُهٗ ۗقَالَ اَتُحَاۤجُّوْۤنِّيْ فِى اللّٰهِ وَقَدْ هَدٰىنِۗ وَلَآ اَخَافُ مَا تُشْرِكُوْنَ بِهٖٓ اِلَّآ اَنْ يَّشَاۤءَ رَبِّيْ شَيْـًٔا ۗوَسِعَ رَبِّيْ كُلَّ شَيْءٍ عِلْمًا ۗ اَفَلَا تَتَذَكَّرُوْنَ",
    "transliteration_en": "Wa haaajjahoo qawmuh; qaala a-tuh aaajjooonnnee fillaahi wa qad hadaan; wa laaa akhaafu mmaa tushrikoona bihee illaaa ai yashaaa'a Rabbee shai'anw wasi'a Rabbee kulla shai'in 'ilman afalaa tatazakkaroon",
    "transliteration_id": "Wa ḥājjahū qaumuh(ū), qāla atuḥājjūnnī fillāhi wa qad hadān(i), wa lā akhāfu mā tusyrikūna bihī illā ay yasyā'a rabbī syai'ā(n), wasi‘a rabbī kulla syai'in ‘ilmā(n), afalā tatażakkarūn(a).",
    "translation_en": "And his people argued with him. He said, \"Do you argue with me concerning Allah while He has guided me? And I fear not what you associate with Him [and will not be harmed] unless my Lord should will something. My Lord encompasses all things in knowledge; then will you not remember?",
    "translation_id": "Kaumnya membantah. Dia (Ibrahim) berkata, “Apakah kamu hendak membantahku tentang Allah, padahal Dia benar-benar telah memberi petunjuk kepadaku? Aku tidak takut kepada yang kamu persekutukan dengan-Nya, kecuali Tuhanku menghendaki sesuatu. Ilmu Tuhanku meliputi segala sesuatu. Tidakkah kamu dapat mengambil pelajaran?”"
  },
  {
    "ayat": 81,
    "arabic": "وَكَيْفَ اَخَافُ مَآ اَشْرَكْتُمْ وَلَا تَخَافُوْنَ اَنَّكُمْ اَشْرَكْتُمْ بِاللّٰهِ مَا لَمْ يُنَزِّلْ بِهٖ عَلَيْكُمْ سُلْطٰنًا ۗفَاَيُّ الْفَرِيْقَيْنِ اَحَقُّ بِالْاَمْنِۚ اِنْ كُنْتُمْ تَعْلَمُوْنَۘ",
    "transliteration_en": "Wa kaifa akhaafu maaa ashraktum wa laa takhaafoona annakum ashraktum billaahi maa lam yunazzil bihee 'alaikum sultaanaa; fa aiyul fareeqaini ahaqqu bil amni in kuntum ta'lamoon",
    "transliteration_id": "Wa kaifa akhāfu mā asyraktum wa lā takhāfūna annakum asyraktum billāhi mā lam yunazzil bihī ‘alaikum sulṭānā(n), fa ayyul-farīqaini aḥaqqu bil-amn(i), in kuntum ta‘lamūn(a).",
    "translation_en": "And how should I fear what you associate while you do not fear that you have associated with Allah that for which He has not sent down to you any authority? So which of the two parties has more right to security, if you should know?",
    "translation_id": "Bagaimana mungkin aku takut kepada yang kamu sekutukan (dengan Allah), padahal kamu tidak takut menyekutukan sesuatu dengan Allah yang Dia (sendiri) tidak pernah menurunkan kepadamu alasan apa pun. Maka, golongan yang manakah dari keduanya yang lebih berhak mendapat keamanan (dari malapetaka) jika kamu mengetahui?”"
  },
  {
    "ayat": 82,
    "arabic": "اَلَّذِيْنَ اٰمَنُوْا وَلَمْ يَلْبِسُوْٓا اِيْمَانَهُمْ بِظُلْمٍ اُولٰۤىِٕكَ لَهُمُ الْاَمْنُ وَهُمْ مُّهْتَدُوْنَ ࣖ",
    "transliteration_en": "Allazeena aamanoo wa lam yalbisooo eemaanahum bizulmin ulaaa'ika lahumul amnu wa hum muhtadoon",
    "transliteration_id": "Al-lażīna āmanū wa lam yalbisū īmānahum biẓulmin ulā'ika lahumul-amnu wa hum muhtadūn(a).",
    "translation_en": "They who believe and do not mix their belief with injustice - those will have security, and they are [rightly] guided.",
    "translation_id": "Orang-orang yang beriman dan tidak mencampuradukkan iman mereka dengan kezaliman (syirik), merekalah orang-orang yang mendapat rasa aman dan mendapat petunjuk."
  },
  {
    "ayat": 83,
    "arabic": "وَتِلْكَ حُجَّتُنَآ اٰتَيْنٰهَآ اِبْرٰهِيْمَ عَلٰى قَوْمِهٖۗ نَرْفَعُ دَرَجٰتٍ مَّنْ نَّشَاۤءُۗ اِنَّ رَبَّكَ حَكِيْمٌ عَلِيْمٌ",
    "transliteration_en": "Wa tilka hujjatunaaa aatainaahaaa Ibraaheema 'alaa qawmih; narfa'u darajaatim man nashaaa'; inna Rabbaka Hakeemun 'Aleem",
    "transliteration_id": "Wa tilka ḥujjatunā ātaināhā ibrāhīma ‘alā qaumih(ī), narfa‘u darajātim man nasyā'(u), inna rabbaka ḥakīmun ‘alīm(un).",
    "translation_en": "And that was Our [conclusive] argument which We gave Abraham against his people. We raise by degrees whom We will. Indeed, your Lord is Wise and Knowing.",
    "translation_id": "Itulah keterangan yang Kami anugerahkan kepada Ibrahim untuk menghadapi kaumnya. Kami tinggikan orang yang Kami kehendaki beberapa derajat. Sesungguhnya Tuhanmu Maha Bijaksana lagi Maha Mengetahui."
  },
  {
    "ayat": 84,
    "arabic": "وَوَهَبْنَا لَهٗٓ اِسْحٰقَ وَيَعْقُوْبَۗ  كُلًّا هَدَيْنَا وَنُوْحًا هَدَيْنَا مِنْ قَبْلُ وَمِنْ ذُرِّيَّتِهٖ دَاوٗدَ وَسُلَيْمٰنَ وَاَيُّوْبَ وَيُوْسُفَ وَمُوْسٰى وَهٰرُوْنَ ۗوَكَذٰلِكَ نَجْزِى الْمُحْسِنِيْنَۙ",
    "transliteration_en": "Wa wahabnaa lahoo ishaaqa wa ya'qoob; kullan hadainaa; wa Noohan hadainaa min qablu wa min zurriyyatihee Daawooda wa Sulaimaana wa Ayyooba wa Yoosufa wa Moosaa wa haaroon; wa kazaalika najzil muhsineen",
    "transliteration_id": "Wa wahabnā lahū isḥāqa wa ya‘qūb(a), kullan hadainā wa nūḥan hadainā min qablu wa min żurriyyatihī dāwūda wa sulaimāna wa ayyūba wa yūsufa wa mūsā wa hārūna wa każālika najzil-muḥsinīn(a).",
    "translation_en": "And We gave to Abraham, Isaac and Jacob - all [of them] We guided. And Noah, We guided before; and among his descendants, David and Solomon and Job and Joseph and Moses and Aaron. Thus do We reward the doers of good.",
    "translation_id": "Kami telah menganugerahkan kepadanya Ishaq dan Ya‘qub. Tiap-tiap mereka telah Kami beri petunjuk. Sebelumnya Kami telah menganugerahkan petunjuk kepada Nuh. (Kami juga menganugerahkan petunjuk) kepada sebagian dari keturunannya, yaitu Daud, Sulaiman, Ayyub, Yusuf, Musa, dan Harun. Demikianlah Kami memberi balasan kepada orang-orang yang berbuat kebaikan."
  },
  {
    "ayat": 85,
    "arabic": "وَزَكَرِيَّا وَيَحْيٰى وَعِيْسٰى وَاِلْيَاسَۗ  كُلٌّ مِّنَ الصّٰلِحِيْنَۙ",
    "transliteration_en": "Wa Zakariyyaa wa Yahyaa wa 'Eesaa wa Illyaasa kullum minas saaliheen",
    "transliteration_id": "Wa zakariyyā wa yaḥyā wa ‘īsā wa ilyās(a), kullum minaṣ-ṣāliḥīn(a).",
    "translation_en": "And Zechariah and John and Jesus and Elias - and all were of the righteous.",
    "translation_id": "(Demikian juga kepada) Zakaria, Yahya, Isa, dan Ilyas. Semuanya termasuk orang-orang yang saleh."
  },
  {
    "ayat": 86,
    "arabic": "وَاِسْمٰعِيْلَ وَالْيَسَعَ وَيُوْنُسَ وَلُوْطًاۗ وَكُلًّا فَضَّلْنَا عَلَى الْعٰلَمِيْنَۙ",
    "transliteration_en": "Wa Ismaa'eela wal Yasa'a wa Yoonusa wa Lootaa; wa kullan faddalnaa 'alal 'aalameen",
    "transliteration_id": "Wa ismā‘īla wal-yasa‘a wa yūnusa wa lūṭā(n), wa kullan faḍḍalnā ‘alal-‘ālamīn(a).",
    "translation_en": "And Ishmael and Elisha and Jonah and Lot - and all [of them] We preferred over the worlds.",
    "translation_id": "(Begitu juga kepada) Ismail, Ilyasa’, Yunus, dan Lut. Tiap-tiap mereka Kami lebihkan daripada (umat) seluruh alam (pada masanya)."
  },
  {
    "ayat": 87,
    "arabic": "وَمِنْ اٰبَاۤىِٕهِمْ وَذُرِّيّٰتِهِمْ وَاِخْوَانِهِمْ ۚوَاجْتَبَيْنٰهُمْ وَهَدَيْنٰهُمْ اِلٰى صِرَاطٍ مُّسْتَقِيْمٍ",
    "transliteration_en": "Wa min aabaaa'ihim wa zurriyyaatihim wa ikhwaanihim wajtabainaahum wa hadainaahum ilaa Siraatim Mustaqeem",
    "transliteration_id": "Wa min ābā'ihim wa żurriyyātihim wa ikhwānihim, wajtabaināhum wa hadaināhum ilā ṣirāṭim mustaqīm(in).",
    "translation_en": "And [some] among their fathers and their descendants and their brothers - and We chose them and We guided them to a straight path.",
    "translation_id": "(Kami lebihkan pula) sebagian dari nenek moyang mereka, keturunan mereka, dan saudara-saudara mereka. Kami telah memilih mereka (menjadi nabi dan rasul) dan Kami memberi mereka petunjuk menuju jalan yang lurus."
  },
  {
    "ayat": 88,
    "arabic": "ذٰلِكَ هُدَى اللّٰهِ يَهْدِيْ بِهٖ مَنْ يَّشَاۤءُ مِنْ عِبَادِهٖ ۗوَلَوْ اَشْرَكُوْا لَحَبِطَ عَنْهُمْ مَّا كَانُوْا يَعْمَلُوْنَ",
    "transliteration_en": "Zaalika hudal laahi yahdee bihee mai yashaaa'u min 'ibaadih; wa law ashrakoo lahabita 'anhum maa kaanoo ya'maloon",
    "transliteration_id": "Żālika hudallāhi yahdī bihī may yasyā'u min ‘ibādih(ī), wa lau asyrakū laḥabiṭa ‘anhum mā kānū ya‘malūn(a).",
    "translation_en": "That is the guidance of Allah by which He guides whomever He wills of His servants. But if they had associated others with Allah, then worthless for them would be whatever they were doing.",
    "translation_id": "Demikian itu petunjuk Allah. Dengannya Dia memberi petunjuk kepada siapa saja di antara hamba-hamba-Nya yang Dia kehendaki. Seandainya mereka mempersekutukan Allah, pasti sia-sialah amal yang telah mereka kerjakan."
  },
  {
    "ayat": 89,
    "arabic": "اُولٰۤىِٕكَ الَّذِيْنَ اٰتَيْنٰهُمُ الْكِتٰبَ وَالْحُكْمَ وَالنُّبُوَّةَ ۚفَاِنْ يَّكْفُرْ بِهَا هٰٓؤُلَاۤءِ فَقَدْ وَكَّلْنَا بِهَا قَوْمًا لَّيْسُوْا بِهَا بِكٰفِرِيْنَ",
    "transliteration_en": "Ulaaa'ikal lazeena aatainaahumul Kitaaba wal hukma wan Nubuwwah; fa iny yakfur bihaa haaa'ulaaa'i faqad wakkalnaa bihaa qawmal laisoo bihaa bikaafireen",
    "transliteration_id": "Ulā'ikal-lażīna ātaināhumul-kitāba wal-ḥukma wan-nubuwwah(ta), fa iy yakfur bihā hā'ulā'i faqad wakkalnā bihā qaumal laisū bihā bikāfirīn(a).",
    "translation_en": "Those are the ones to whom We gave the Scripture and authority and prophethood. But if the disbelievers deny it, then We have entrusted it to a people who are not therein disbelievers.",
    "translation_id": "Mereka itulah orang-orang yang telah Kami anugerahi kitab, hikmah, dan kenabian. Jika orang-orang (Quraisy) itu mengingkarinya, Kami akan menyerahkannya kepada kaum yang tidak mengingkarinya."
  },
  {
    "ayat": 90,
    "arabic": "اُولٰۤىِٕكَ الَّذِيْنَ هَدَى اللّٰهُ فَبِهُدٰىهُمُ اقْتَدِهْۗ قُلْ لَّآ اَسْـَٔلُكُمْ عَلَيْهِ اَجْرًاۗ اِنْ هُوَ اِلَّا ذِكْرٰى لِلْعٰلَمِيْنَ ࣖ",
    "transliteration_en": "Ulaaa'ikal lazeena hadal laahu fabihudaahumuq tadih; qul laaa as'alukum 'alaihi ajran in huwa illaa zikraa lil 'aalameen",
    "transliteration_id": "Ulā'ikal-lażīna hadallāhu fa bihudāūhumuqtadih, qul lā as'alukum ‘alaihi ajrā(n), in huwa illā żikrā lil-‘ālamīn(a).",
    "translation_en": "Those are the ones whom Allah has guided, so from their guidance take an example. Say, \"I ask of you for this message no payment. It is not but a reminder for the worlds.\"",
    "translation_id": "Mereka itulah (para nabi) yang telah diberi petunjuk oleh Allah. Maka, ikutilah petunjuk mereka. Katakanlah (Nabi Muhammad), “Aku tidak meminta imbalan kepadamu atasnya (menyampaikan Al-Qur’an).” (Al-Qur’an) itu hanyalah peringatan untuk (umat) seluruh alam."
  },
  {
    "ayat": 91,
    "arabic": "وَمَا قَدَرُوا اللّٰهَ حَقَّ قَدْرِهٖٓ اِذْ قَالُوْا مَآ اَنْزَلَ اللّٰهُ عَلٰى بَشَرٍ مِّنْ شَيْءٍۗ  قُلْ مَنْ اَنْزَلَ الْكِتٰبَ الَّذِيْ جَاۤءَ بِهٖ مُوْسٰى نُوْرًا وَّهُدًى لِّلنَّاسِ تَجْعَلُوْنَهٗ قَرَاطِيْسَ تُبْدُوْنَهَا وَتُخْفُوْنَ كَثِيْرًاۚ وَعُلِّمْتُمْ مَّا لَمْ تَعْلَمُوْٓا اَنْتُمْ وَلَآ اٰبَاۤؤُكُمْ ۗقُلِ اللّٰهُ ۙثُمَّ ذَرْهُمْ فِيْ خَوْضِهِمْ يَلْعَبُوْنَ",
    "transliteration_en": "Wa maa qadarul laaha haqqa qadriheee iz qaaloo maaa anzalal laahu 'alaa basharim min shai'; qul man anzalal Kitaabal lazee jaaa'a bihee Moosaa nooranw wa hudal linnaasi taj'aloonahoo qaraateesa tubdoonahaa wa tukhfoona kaseeranw wa 'ullimtum maa lam ta'lamooo antum wa laaa aabaaa'ukum qulil laahu summa zarhum fee khawdihim yal'aboon",
    "transliteration_id": "Wa mā qadarullāha ḥaqqa qadrihī iż qālū mā anzalallāhu ‘alā basyarim min syai'(in), qul man anzalal-kitābal-lażī  jā'a bihī mūsā nūraw wa hudal lin-nāsi taj‘alūnahū qarāṭīsa tubdūnahā wa tukhfūna kaṡīrā(n), wa ‘ullimtum mā lam ta‘lamū antum wa lā ābā'ukum, qulillāh(u), ṡumma żarhum fī khauḍihim yal‘abūn(a).",
    "translation_en": "And they did not appraise Allah with true appraisal when they said, \"Allah did not reveal to a human being anything.\" Say, \"Who revealed the Scripture that Moses brought as light and guidance to the people? You [Jews] make it into pages, disclosing [some of] it and concealing much. And you were taught that which you knew not - neither you nor your fathers.\" Say, \"Allah [revealed it].\" Then leave them in their [empty] discourse, amusing themselves.",
    "translation_id": "Mereka (Bani Israil) tidak mengagungkan Allah sebagaimana mestinya ketika mereka berkata, “Allah tidak menurunkan sesuatu pun kepada manusia.” Katakanlah (Nabi Muhammad), “Siapakah yang menurunkan kitab suci (Taurat) yang dibawa Musa sebagai cahaya dan petunjuk bagi manusia? Kamu (Bani Israil) menjadikannya lembaran-lembaran lepas. Kamu memperlihatkan (sebagiannya) dan banyak yang kamu sembunyikan, padahal telah diajarkan kepadamu apa yang tidak diketahui baik olehmu maupun oleh nenek moyangmu.” Katakanlah, “Allah.” Kemudian, biarkanlah mereka bermain-main dalam kesesatannya."
  },
  {
    "ayat": 92,
    "arabic": "وَهٰذَا كِتٰبٌ اَنْزَلْنٰهُ مُبٰرَكٌ مُّصَدِّقُ الَّذِيْ بَيْنَ يَدَيْهِ وَلِتُنْذِرَ اُمَّ الْقُرٰى وَمَنْ حَوْلَهَاۗ وَالَّذِيْنَ يُؤْمِنُوْنَ بِالْاٰخِرَةِ يُؤْمِنُوْنَ بِهٖ وَهُمْ عَلٰى صَلَاتِهِمْ يُحٰفِظُوْنَ",
    "transliteration_en": "Wa haazaa Kitaabun anzalnaahu Mubaarakum musaddiqul lazee bainaa yadaihi wa litunzira ummal Quraa wa man hawlahaa; wallazeena yu'minoona bil Aakhirati yu'minoona bihee wa hum'alaa Salaatihim yuhaafizoon",
    "transliteration_id": "Wa hāżā kitābun anzalnāhu mubārakum muṣaddiqul-lażī baina yadaihi wa litunżira ummal-qurā wa man ḥaulahā, wal-lażīna yu'minūna bil-ākhirati yu'minūna bihī wa hum ‘alā ṣalātihim yuḥāfiẓūn(a).",
    "translation_en": "And this is a Book which We have sent down, blessed and confirming what was before it, that you may warn the Mother of Cities and those around it. Those who believe in the Hereafter believe in it, and they are maintaining their prayers.",
    "translation_id": "Ini (Al-Qur’an) adalah kitab suci yang telah Kami turunkan lagi diberkahi yang membenarkan kitab-kitab yang (diturunkan) sebelumnya dan agar engkau memberi peringatan kepada (penduduk) Ummul Qura (Makkah) dan orang-orang yang ada di sekitarnya. Orang-orang yang beriman pada (kehidupan) akhirat (tentu) beriman padanya (Al-Qur’an) dan mereka selalu memelihara salatnya."
  },
  {
    "ayat": 93,
    "arabic": "وَمَنْ اَظْلَمُ مِمَّنِ افْتَرٰى عَلَى اللّٰهِ كَذِبًا اَوْ قَالَ اُوْحِيَ اِلَيَّ وَلَمْ يُوْحَ اِلَيْهِ شَيْءٌ وَّمَنْ قَالَ سَاُنْزِلُ مِثْلَ مَآ اَنْزَلَ اللّٰهُ ۗوَلَوْ تَرٰٓى اِذِ الظّٰلِمُوْنَ فِيْ غَمَرٰتِ الْمَوْتِ وَالْمَلٰۤىِٕكَةُ بَاسِطُوْٓا اَيْدِيْهِمْۚ اَخْرِجُوْٓا اَنْفُسَكُمْۗ  اَلْيَوْمَ تُجْزَوْنَ عَذَابَ الْهُوْنِ بِمَا كُنْتُمْ تَقُوْلُوْنَ عَلَى اللّٰهِ غَيْرَ الْحَقِّ وَكُنْتُمْ عَنْ اٰيٰتِهٖ تَسْتَكْبِرُوْنَ",
    "transliteration_en": "Wa man azlamu mimmanif taraa 'alal laahi kaziban aw qaala oohiya ilaiya wa lam yooha ilaihi shai'un wa man qaala sa unzilu misla maaa anzalal laah; wa law taraaa iziz zaalimoona fee ghamaraatil mawti walmalaaa'ikatu baasitooo aideehim akhrijooo anfusakum; al yawma tujzawna 'azaabal hooni bimaa kuntum taqooloona 'alal laahi ghairal haqqi wa kuntum 'an aayaatihee tastakbiroon",
    "transliteration_id": "Wa man aẓlamu mimmaniftarā ‘alallāhi każiban au qāla ūḥiya ilayya wa lam yūḥa ilaihi syai'uw wa man qāla sa'unzilu miṡla mā anzalallāh(u), wa lau tarā iżiẓ-ẓālimūna fī gamarātil-mauti wal-malā'ikatu bāsiṭū aidīhim, akhirjū anfusakum, al-yauma tujzauna ‘ażābal-hūni bimā kuntum taqūlūna ‘alallāhi gairal-ḥaqqi wa kuntum ‘an āyātihī tastakbirūn(a).",
    "translation_en": "And who is more unjust than one who invents a lie about Allah or says, \"It has been inspired to me,\" while nothing has been inspired to him, and one who says, \"I will reveal [something] like what Allah revealed.\" And if you could but see when the wrongdoers are in the overwhelming pangs of death while the angels extend their hands, [saying], \"Discharge your souls! Today you will be awarded the punishment of [extreme] humiliation for what you used to say against Allah other than the truth and [that] you were, toward His verses, being arrogant.\"",
    "translation_id": "Siapakah yang lebih zalim daripada orang-orang yang mengada-adakan dusta terhadap Allah atau yang berkata, “Telah diwahyukan kepadaku,” padahal tidak diwahyukan sesuatu pun kepadanya dan orang yang berkata, “Aku akan mendatangkan seperti yang diturunkan Allah.” Seandainya saja engkau melihat pada waktu orang-orang zalim itu (berada) dalam kesakitan sakratulmaut, sedang para malaikat memukul dengan tangannya (sembari berkata), “Keluarkanlah nyawamu!” Pada hari ini kamu akan dibalas dengan azab yang sangat menghinakan karena kamu mengatakan terhadap Allah (perkataan) yang tidak benar dan (karena) kamu menyombongkan diri terhadap ayat-ayat-Nya."
  },
  {
    "ayat": 94,
    "arabic": "وَلَقَدْ جِئْتُمُوْنَا فُرَادٰى كَمَا خَلَقْنٰكُمْ اَوَّلَ مَرَّةٍ وَّتَرَكْتُمْ مَّا خَوَّلْنٰكُمْ وَرَاۤءَ ظُهُوْرِكُمْۚ وَمَا نَرٰى مَعَكُمْ شُفَعَاۤءَكُمُ الَّذِيْنَ زَعَمْتُمْ اَنَّهُمْ فِيْكُمْ شُرَكٰۤؤُا ۗ لَقَدْ تَّقَطَّعَ بَيْنَكُمْ وَضَلَّ عَنْكُمْ مَّا كُنْتُمْ تَزْعُمُوْنَ ࣖ",
    "transliteration_en": "Wa laqad ji'tumoonaa furaadaa kamaa khalaqnaakum awwala marratinw wa taraktum maa khawwalnaakum waraaa'a zuhoorikum wa maa naraa ma'akum shufa'aaa' akumul lazeena za'amtum annahum feekum shurakaaa'; laqat taqatta'a bainakum wa dalla 'annkum maa kuntum taz'umoon",
    "transliteration_id": "Wa laqad ji'tumūnā furādā kamā khalaqnākum awwala marratiw wa taraktum mā khawwalnākum warā'a ẓuhūrikum, wa mā narā ma‘akum syufa‘ā'akumul-lażīna  za‘amtum annahum fīkum syurakā'(u), laqat taqaṭṭa‘a bainakum wa ḍalla ‘ankum mā kuntum taz‘umūn(a).",
    "translation_en": "[It will be said to them], \"And you have certainly come to Us alone as We created you the first time, and you have left whatever We bestowed upon you behind you. And We do not see with you your 'intercessors' which you claimed that they were among you associates [of Allah]. It has [all] been severed between you, and lost from you is what you used to claim.\"",
    "translation_id": "(Kini) kamu benar-benar datang kepada Kami sendiri-sendiri sebagaimana Kami ciptakan kamu pada mulanya. Kamu sudah meninggalkan di belakangmu (di dunia) apa yang telah Kami karuniakan kepadamu. Kami tidak melihat bersamamu para pemberi syafaat (pertolongan) yang kamu anggap bagi dirimu sebagai sekutu-sekutu(-Ku). Sungguh, telah terputus (semua pertalian) antara kamu dan telah lenyap dari kamu apa yang dahulu kamu sangka (sebagai sekutu Allah)."
  },
  {
    "ayat": 95,
    "arabic": "۞ اِنَّ اللّٰهَ فَالِقُ الْحَبِّ وَالنَّوٰىۗ  يُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ وَمُخْرِجُ الْمَيِّتِ مِنَ الْحَيِّ ۗذٰلِكُمُ اللّٰهُ فَاَنّٰى تُؤْفَكُوْنَ",
    "transliteration_en": "Innal laaha faaliqul habbi wannawaa yukhrijul haiya minal maiyiti wa mukhrijul maiyiti minal haiy; zaalikumul laahu fa annaa tu'fakoon",
    "transliteration_id": "Innallāha fāliqul-ḥabbi wan-nawā, yukhrijul-ḥayya minal-mayyiti wa mukhrijul-mayyiti minal-ḥayy(i), żālikumullāhu fa annā tu'fakūn(a).",
    "translation_en": "Indeed, Allah is the cleaver of grain and date seeds. He brings the living out of the dead and brings the dead out of the living. That is Allah; so how are you deluded?",
    "translation_id": "Sesungguhnya Allah yang menumbuhkan butir (padi-padian) dan biji (buah-buahan). Dia mengeluarkan yang hidup dari yang mati dan mengeluarkan yang mati dari yang hidup. Itulah (kekuasaan) Allah. Maka, bagaimana kamu dapat dipalingkan?"
  },
  {
    "ayat": 96,
    "arabic": "فَالِقُ الْاِصْبَاحِۚ وَجَعَلَ الَّيْلَ سَكَنًا وَّالشَّمْسَ وَالْقَمَرَ حُسْبَانًا ۗذٰلِكَ تَقْدِيْرُ الْعَزِيْزِ الْعَلِيْمِ",
    "transliteration_en": "Faaliqul isbaahi wa ja'alal laila sakananw washh shamsa walqamara husbaanaa; zaalika taqdeerul 'Azeezil 'Aleem",
    "transliteration_id": "Fāliqul-iṣbāḥ(i), wa ja‘alal-laila sakanaw wasy-syamsa wal-qamara ḥusbānā(n), żālika taqdīrul-‘azīzil-‘alīm(i).",
    "translation_en": "[He is] the cleaver of daybreak and has made the night for rest and the sun and moon for calculation. That is the determination of the Exalted in Might, the Knowing.",
    "translation_id": "(Dia) yang menyingsingkan pagi dan menjadikan malam untuk beristirahat, serta (menjadikan) matahari dan bulan untuk perhitungan. Itulah ketetapan Allah Yang Maha Perkasa lagi Maha Mengetahui."
  },
  {
    "ayat": 97,
    "arabic": "وَهُوَ الَّذِيْ جَعَلَ لَكُمُ النُّجُوْمَ لِتَهْتَدُوْا بِهَا فِيْ ظُلُمٰتِ الْبَرِّ وَالْبَحْرِۗ قَدْ فَصَّلْنَا الْاٰيٰتِ لِقَوْمٍ يَّعْلَمُوْنَ",
    "transliteration_en": "Wa Huwal lazee ja'ala lakumun nujooma litahtadoo bihaa fee zulumaatil barri walbahr; qad fassalnal Aayaati liqawminy ya'lamoon",
    "transliteration_id": "Wa huwal-lażī ja‘ala lakumun-nujūma litahtadū bihā fī ẓulumātil-barri wal-baḥr(i), qad faṣṣalnal-āyāti liqaumiy ya‘lamūn(a).",
    "translation_en": "And it is He who placed for you the stars that you may be guided by them through the darknesses of the land and sea. We have detailed the signs for a people who know.",
    "translation_id": "Dialah yang menjadikan bagimu bintang-bintang agar kamu menjadikannya petunjuk dalam kegelapan (yang pekat) di darat dan di laut. Sungguh, Kami telah memerinci tanda-tanda (kekuasaan Kami) kepada kaum yang mengetahui."
  },
  {
    "ayat": 98,
    "arabic": "وَهُوَ الَّذِيْٓ اَنْشَاَكُمْ مِّنْ نَّفْسٍ وَّاحِدَةٍ فَمُسْتَقَرٌّ وَّمُسْتَوْدَعٌ  ۗقَدْ فَصَّلْنَا الْاٰيٰتِ لِقَوْمٍ يَّفْقَهُوْنَ",
    "transliteration_en": "Wa hhuwal lazeee ansha akum min nasinw waahidatin famustaqarrunw wa mustawda'; qad fassalnal Aayaati liqaw miny-yafqahoon",
    "transliteration_id": "Wa huwal-lażī ansya'akum min nafsiw wāḥidatin fa mustaqarruw wa mustauda‘(un), qad faṣṣalnal-āyāti liqaumiy yafqahūn(a).",
    "translation_en": "And it is He who produced you from one soul and [gave you] a place of dwelling and of storage. We have detailed the signs for a people who understand.",
    "translation_id": "Dialah yang menciptakanmu dari diri yang satu (Adam), maka (bagimu) ada tempat menetap dan tempat menyimpan. Sungguh, Kami telah memerinci tanda-tanda (kekuasaan Kami) kepada kaum yang memahami."
  },
  {
    "ayat": 99,
    "arabic": "وَهُوَ الَّذِيْٓ اَنْزَلَ مِنَ السَّمَاۤءِ مَاۤءًۚ فَاَخْرَجْنَا بِهٖ نَبَاتَ كُلِّ شَيْءٍ فَاَخْرَجْنَا مِنْهُ خَضِرًا نُّخْرِجُ مِنْهُ حَبًّا مُّتَرَاكِبًاۚ وَمِنَ النَّخْلِ مِنْ طَلْعِهَا قِنْوَانٌ دَانِيَةٌ وَّجَنّٰتٍ مِّنْ اَعْنَابٍ وَّالزَّيْتُوْنَ وَالرُّمَّانَ مُشْتَبِهًا وَّغَيْرَ مُتَشَابِهٍۗ اُنْظُرُوْٓا اِلٰى ثَمَرِهٖٓ اِذَٓا اَثْمَرَ وَيَنْعِهٖ ۗاِنَّ فِيْ ذٰلِكُمْ لَاٰيٰتٍ لِّقَوْمٍ يُّؤْمِنُوْنَ",
    "transliteration_en": "Wa Huwal lazeee anzala minas samaaa'i maaa'an fa akhrajnaa bihee nabaata kulli shai'in fa akhrajnaa minhu khadiran nukhriju minhu habbam mutaraakibanw wa minan nakhli min tal'ihaa qinwaanun daaniyatunw wa jannaatim min a'naabinw wazzaitoona warrummaana mushhtabihanw wa ghaira mutashaabih; unzurooo ilaa samariheee izaaa asmars wa yan'ih; inna fee zaalikum la Aayaatil liqawminy yu'minoon",
    "transliteration_id": "Wa huwal-lażī anzala minas-samā'i mā'ā(n), fa akhrajnā bihī nabāta kulli syai'in fa akhrajnā minhu khaḍiran nukhriju minhu ḥabbam mutarākibā(n), wa minan nakhli min ṭal‘ihā qinwānun dāniyatuw wa jannātim min a‘nābiw waz-zaitūna war-rummāna musytabihaw wa gaira mutasyābih(in), unẓurū ilā ṡamarihī iżā aṡmara wa yan‘ih(ī), inna fī żālikum la'āyātil liqaumiy yu'minūn(a).",
    "translation_en": "And it is He who sends down rain from the sky, and We produce thereby the growth of all things. We produce from it greenery from which We produce grains arranged in layers. And from the palm trees - of its emerging fruit are clusters hanging low. And [We produce] gardens of grapevines and olives and pomegranates, similar yet varied. Look at [each of] its fruit when it yields and [at] its ripening. Indeed in that are signs for a people who believe.",
    "translation_id": "Dialah yang menurunkan air dari langit lalu dengannya Kami menumbuhkan segala macam tumbuhan. Maka, darinya Kami mengeluarkan tanaman yang menghijau. Darinya Kami mengeluarkan butir yang bertumpuk (banyak). Dari mayang kurma (mengurai) tangkai-tangkai yang menjuntai. (Kami menumbuhkan) kebun-kebun anggur. (Kami menumbuhkan pula) zaitun dan delima yang serupa dan yang tidak serupa. Perhatikanlah buahnya pada waktu berbuah dan menjadi masak. Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda (kekuasaan Allah) bagi kaum yang beriman."
  },
  {
    "ayat": 100,
    "arabic": "وَجَعَلُوْا لِلّٰهِ شُرَكَاۤءَ الْجِنَّ وَخَلَقَهُمْ وَخَرَقُوْا لَهٗ بَنِيْنَ وَبَنٰتٍۢ بِغَيْرِ عِلْمٍۗ سُبْحٰنَهٗ وَتَعٰلٰى عَمَّا يَصِفُوْنَ ࣖ",
    "transliteration_en": "Wa ja'aloo lillaahi shurakaaa'al jinna wa khalaqa hum wa kharaqoo lahoo baneena wa banaatim bighairi 'ilm Subhaanahoo wa Ta'aalaa 'amma yasifoon",
    "transliteration_id": "Wa ja‘alū lillāhi syurakā'al-jinna wa khalaqahum wa kharaqū lahū banīna wa banātim bigairi ‘ilm(in), subḥānahū wa ta‘ālā ‘ammā yaṣifūn(a).",
    "translation_en": "But they have attributed to Allah partners - the jinn, while He has created them - and have fabricated for Him sons and daughters. Exalted is He and high above what they describe",
    "translation_id": "Mereka (orang-orang musyrik) menjadikan jin sekutu-sekutu bagi Allah, padahal Dia yang menciptakannya (jin-jin itu). Mereka berbohong terhadap-Nya (dengan mengatakan bahwa Allah mempunyai) anak laki-laki dan anak perempuan, tanpa (dasar) pengetahuan. Maha Suci dan Maha Tinggi Dia dari sifat-sifat yang mereka gambarkan."
  }
]