[
  {
    "ayat": 1,
    "arabic": "يٰٓاَيُّهَا الْمُزَّمِّلُۙ",
    "transliteration_en": "Yaw ayyuhal muzzammil",
    "transliteration_id": "Yā ayyuhal-muzzammil(u).",
    "translation_en": "O you who wraps himself [in clothing],",
    "translation_id": "Wahai orang yang berkelumun (Nabi Muhammad),"
  },
  {
    "ayat": 2,
    "arabic": "قُمِ الَّيْلَ اِلَّا قَلِيْلًاۙ",
    "transliteration_en": "Qumil laila illaa qaleelaa",
    "transliteration_id": "Qumil-laila illā qalīlā(n).",
    "translation_en": "Arise [to pray] the night, except for a little -",
    "translation_id": "bangunlah (untuk salat) pada malam hari, kecuali sebagian kecil,"
  },
  {
    "ayat": 3,
    "arabic": "نِّصْفَهٗٓ اَوِ انْقُصْ مِنْهُ قَلِيْلًاۙ",
    "transliteration_en": "Nisfahooo awinqus minhu qaleelaa",
    "transliteration_id": "Niṣfahū awinquṣ minhu qalīlā(n).",
    "translation_en": "Half of it - or subtract from it a little",
    "translation_id": "(yaitu) seperduanya, kurang sedikit dari itu,"
  },
  {
    "ayat": 4,
    "arabic": "اَوْ زِدْ عَلَيْهِ وَرَتِّلِ الْقُرْاٰنَ تَرْتِيْلًاۗ",
    "transliteration_en": "Aw zid 'alaihi wa rattilil Qur'aana tarteela",
    "transliteration_id": "Au zid ‘alaihi wa rattilil-qur'āna tartīlā(n).",
    "translation_en": "Or add to it, and recite the Qur'an with measured recitation.",
    "translation_id": "atau lebih dari (seperdua) itu. Bacalah Al-Qur’an itu dengan perlahan-lahan."
  },
  {
    "ayat": 5,
    "arabic": "اِنَّا سَنُلْقِيْ عَلَيْكَ قَوْلًا ثَقِيْلًا",
    "transliteration_en": "Innaa sanulqee 'alika qawalan saqeelaa",
    "transliteration_id": "Innā sanulqī ‘alaika qaulan ṡaqīlā(n).",
    "translation_en": "Indeed, We will cast upon you a heavy word.",
    "translation_id": "Sesungguhnya Kami akan menurunkan perkataan yang berat kepadamu."
  },
  {
    "ayat": 6,
    "arabic": "اِنَّ نَاشِئَةَ الَّيْلِ هِيَ اَشَدُّ وَطْـًٔا وَّاَقْوَمُ قِيْلًاۗ",
    "transliteration_en": "Inn naashi'atal laili hiya ashadddu wat anw wa aqwamu qeelaa",
    "transliteration_id": "Inna nāsyi'atal-laili hiya asyaddu waṭ'aw wa aqwamu qīlā(n).",
    "translation_en": "Indeed, the hours of the night are more effective for concurrence [of heart and tongue] and more suitable for words.",
    "translation_id": "Sesungguhnya bangun malam itu lebih kuat (pengaruhnya terhadap jiwa) dan lebih mantap ucapannya."
  },
  {
    "ayat": 7,
    "arabic": "اِنَّ لَكَ فِى النَّهَارِ سَبْحًا طَوِيْلًاۗ",
    "transliteration_en": "Inna laka fin nahaari sabhan taweelaa",
    "transliteration_id": "Inna laka fin-nahāri sabḥan ṭawīlā(n).",
    "translation_en": "Indeed, for you by day is prolonged occupation.",
    "translation_id": "Sesungguhnya pada siang hari engkau memiliki kesibukan yang panjang."
  },
  {
    "ayat": 8,
    "arabic": "وَاذْكُرِ اسْمَ رَبِّكَ وَتَبَتَّلْ اِلَيْهِ تَبْتِيْلًاۗ",
    "transliteration_en": "Wazkuris ma rabbika wa tabattal ilaihi tabteelaa",
    "transliteration_id": "Ważkurisma rabbika wa tabattal ilaihi tabtīlā(n).",
    "translation_en": "And remember the name of your Lord and devote yourself to Him with [complete] devotion.",
    "translation_id": "Sebutlah nama Tuhanmu dan beribadahlah kepada-Nya dengan sepenuh hati."
  },
  {
    "ayat": 9,
    "arabic": "رَبُّ الْمَشْرِقِ وَالْمَغْرِبِ لَآ اِلٰهَ اِلَّا هُوَ فَاتَّخِذْهُ وَكِيْلًا",
    "transliteration_en": "Rabbul mashriqi wal maghriibi laaa ilaaha illaa Huwa fattakhizhu wakeelaa",
    "transliteration_id": "Rabbul-masyriqi wal-magribi lā ilāha illā huwa fattakhiżhu wakīlā(n).",
    "translation_en": "[He is] the Lord of the East and the West; there is no deity except Him, so take Him as Disposer of [your] affairs.",
    "translation_id": "(Allah) adalah Tuhan timur dan barat. Tidak ada tuhan selain Dia. Maka, jadikanlah Dia sebagai pelindung."
  },
  {
    "ayat": 10,
    "arabic": "وَاصْبِرْ عَلٰى مَا يَقُوْلُوْنَ وَاهْجُرْهُمْ هَجْرًا جَمِيْلًا",
    "transliteration_en": "Wasbir 'alaa maa yaqoo loona wahjurhum hajran jameelaa",
    "transliteration_id": "Waṣbir ‘alā mā yaqūlūna wahjurhum hajran jamīlā(n).",
    "translation_en": "And be patient over what they say and avoid them with gracious avoidance.",
    "translation_id": "Bersabarlah (Nabi Muhammad) terhadap apa yang mereka katakan dan tinggalkanlah mereka dengan cara yang baik."
  },
  {
    "ayat": 11,
    "arabic": "وَذَرْنِيْ وَالْمُكَذِّبِيْنَ اُولِى النَّعْمَةِ وَمَهِّلْهُمْ قَلِيْلًا",
    "transliteration_en": "Wa zarnee walmukaz zibeena ulin na'mati wa mahhilhum qaleelaa",
    "transliteration_id": "Wa żarnī wal-mukażżibīna ulin-na‘mati wa mahhilhum qalīlā(n).",
    "translation_en": "And leave Me with [the matter of] the deniers, those of ease [in life], and allow them respite a little.",
    "translation_id": "Biarkanlah Aku (yang bertindak) terhadap para pendusta yang memiliki segala kenikmatan hidup dan berilah mereka penangguhan sementara."
  },
  {
    "ayat": 12,
    "arabic": "اِنَّ لَدَيْنَآ اَنْكَالًا وَّجَحِيْمًاۙ",
    "transliteration_en": "Inna ladainaaa ankaalanw wa jaheemaa",
    "transliteration_id": "Inna ladainā ankālaw wa jaḥīmā(n).",
    "translation_en": "Indeed, with Us [for them] are shackles and burning fire",
    "translation_id": "Sesungguhnya di sisi Kami ada belenggu-belenggu (yang berat), (neraka) Jahim,"
  },
  {
    "ayat": 13,
    "arabic": "وَّطَعَامًا ذَا غُصَّةٍ وَّعَذَابًا اَلِيْمًا",
    "transliteration_en": "Wa ta'aaman zaa ghussa tinw wa'azaaban aleemaa",
    "transliteration_id": "Wa ṭa‘āman żā guṣṣatiw wa ‘ażāban alīmā(n).",
    "translation_en": "And food that chokes and a painful punishment -",
    "translation_id": "makanan yang menyumbat kerongkongan, dan azab yang pedih."
  },
  {
    "ayat": 14,
    "arabic": "يَوْمَ تَرْجُفُ الْاَرْضُ وَالْجِبَالُ وَكَانَتِ الْجِبَالُ كَثِيْبًا مَّهِيْلًا",
    "transliteration_en": "Yawma tarjuful ardu waljibaalu wa kaanatil jibaalu kaseebam maheelaa",
    "transliteration_id": "Yauma tarjuful-arḍu wal-jibālu wa kānatil-jibālu kaṡībam mahīlā(n).",
    "translation_en": "On the Day the earth and the mountains will convulse and the mountains will become a heap of sand pouring down.",
    "translation_id": "(Ingatlah) pada hari (ketika) bumi dan gunung-gunung berguncang keras dan gunung-gunung itu menjadi seperti onggokan pasir yang tercurah."
  },
  {
    "ayat": 15,
    "arabic": "اِنَّآ اَرْسَلْنَآ اِلَيْكُمْ رَسُوْلًا ەۙ شَاهِدًا عَلَيْكُمْ كَمَآ اَرْسَلْنَآ اِلٰى فِرْعَوْنَ رَسُوْلًا ۗ",
    "transliteration_en": "Innaa arsalnaaa ilaikum rasoolan shahidan 'alikum kamaaa arsalnaaa ilaa Fir'awna Rasoolna",
    "transliteration_id": "Innā arsalnā ilaikum rasūlā(n), syāhidan ‘alaikum kamā arsalnā ilā fir‘auna rasūlā(n).",
    "translation_en": "Indeed, We have sent to you a Messenger as a witness upon you just as We sent to Pharaoh a messenger.",
    "translation_id": "Sesungguhnya Kami telah mengutus seorang rasul (Nabi Muhammad) kepadamu sebagai saksi atasmu, sebagaimana Kami telah mengutus seorang rasul kepada Fir‘aun."
  },
  {
    "ayat": 16,
    "arabic": "فَعَصٰى فِرْعَوْنُ الرَّسُوْلَ فَاَخَذْنٰهُ اَخْذًا وَّبِيْلًاۚ",
    "transliteration_en": "Fa'asaa Fir'awnur Rasoola fa akhaznaahu akhzanw wabeelaa",
    "transliteration_id": "Fa ‘aṣā fir‘aunar-rasūla fa akhażnāhu akhżaw wabīlā(n).",
    "translation_en": "But Pharaoh disobeyed the messenger, so We seized him with a ruinous seizure.",
    "translation_id": "Namun, Fir‘aun mendurhakai rasul itu sehingga Kami siksa dia dengan siksaan yang berat."
  },
  {
    "ayat": 17,
    "arabic": "فَكَيْفَ تَتَّقُوْنَ اِنْ كَفَرْتُمْ يَوْمًا يَّجْعَلُ الْوِلْدَانَ شِيْبًاۖ",
    "transliteration_en": "Fakaifa tattaqoona in kafartum yawmany yaj'alul wildaana sheeba",
    "transliteration_id": "Fakaifa tattaqūna in kafartum yaumay yaj‘alul-wildāna syībā(n).",
    "translation_en": "Then how can you fear, if you disbelieve, a Day that will make the children white- haired?",
    "translation_id": "Lalu, bagaimanakah kamu akan dapat menjaga dirimu (dari azab) hari yang menjadikan anak-anak beruban jika kamu tetap kufur?"
  },
  {
    "ayat": 18,
    "arabic": "ۨالسَّمَاۤءُ مُنْفَطِرٌۢ بِهٖۗ كَانَ وَعْدُهٗ مَفْعُوْلًا",
    "transliteration_en": "Assamaaa'u munfatirum bih; kaana wa'duhoo maf'oola",
    "transliteration_id": "As-samā'u munfaṭirum bih(ī), kāna wa‘duhū maf‘ūlā(n).",
    "translation_en": "The heaven will break apart therefrom; ever is His promise fulfilled.",
    "translation_id": "Langit terbelah padanya (hari itu). Janji-Nya pasti terlaksana."
  },
  {
    "ayat": 19,
    "arabic": "اِنَّ هٰذِهٖ تَذْكِرَةٌ ۚ فَمَنْ شَاۤءَ اتَّخَذَ اِلٰى رَبِّهٖ سَبِيْلًا ࣖ",
    "transliteration_en": "Inna haazihee tazkiratun fa man shaaa'at takhaza ilaa Rabbihee sabeelaa",
    "transliteration_id": "Inna hāżihī tażkirah(tun), faman syā'attakhaża ilā rabbihī sabīlā(n).",
    "translation_en": "Indeed, this is a reminder, so whoever wills may take to his Lord a way.",
    "translation_id": "Sesungguhnya ini adalah peringatan. Siapa yang berkehendak niscaya mengambil jalan (yang lurus) kepada Tuhannya."
  },
  {
    "ayat": 20,
    "arabic": "۞ اِنَّ رَبَّكَ يَعْلَمُ اَنَّكَ تَقُوْمُ اَدْنٰى مِنْ ثُلُثَيِ الَّيْلِ وَنِصْفَهٗ وَثُلُثَهٗ وَطَاۤىِٕفَةٌ مِّنَ الَّذِيْنَ مَعَكَۗ وَاللّٰهُ يُقَدِّرُ الَّيْلَ وَالنَّهَارَۗ عَلِمَ اَنْ لَّنْ تُحْصُوْهُ فَتَابَ عَلَيْكُمْ فَاقْرَءُوْا مَا تَيَسَّرَ مِنَ الْقُرْاٰنِۗ عَلِمَ اَنْ سَيَكُوْنُ مِنْكُمْ مَّرْضٰىۙ وَاٰخَرُوْنَ يَضْرِبُوْنَ فِى الْاَرْضِ يَبْتَغُوْنَ مِنْ فَضْلِ اللّٰهِ ۙوَاٰخَرُوْنَ يُقَاتِلُوْنَ فِيْ سَبِيْلِ اللّٰهِ ۖفَاقْرَءُوْا مَا تَيَسَّرَ مِنْهُۙ وَاَقِيْمُوا الصَّلٰوةَ وَاٰتُوا الزَّكٰوةَ وَاَقْرِضُوا اللّٰهَ قَرْضًا حَسَنًاۗ وَمَا تُقَدِّمُوْا لِاَنْفُسِكُمْ مِّنْ خَيْرٍ تَجِدُوْهُ عِنْدَ اللّٰهِ ۙهُوَ خَيْرًا وَّاَعْظَمَ اَجْرًاۗ وَاسْتَغْفِرُوا اللّٰهَ ۗاِنَّ اللّٰهَ غَفُوْرٌ رَّحِيْمٌ ࣖ",
    "transliteration_en": "Inna Rabbaka ya'lamu annaka taqoomu adnaa min sulusa yil laili wa nisfahoo wa sulusahoo wa taaa'ifatum minal lazeena ma'ak; wal laahu yuqaddirul laila wanna haar; 'alima al lan tuhsoohu fataaba 'alaikum faqra'oo maa tayassara minal quraan; 'alima an sa yakoonu minkum mardaa wa aakharoona yadriboona fil ardi yabtaghoona min fadlil laahi wa aakharoona yuqaatiloona fee sabeelil laahi faqra'oo ma tayassara minhu wa aqeemus salaata wa aatuz zakaata wa aqridul laaha qardan hasanaa; wa maa tuqadimoo li anfusikum min khairin tajidoohu 'indal laahi huwa khayranw wa a'zama ajraa; wastaghfirul laahaa innal laaha ghafoorur raheem.",
    "transliteration_id": "Inna rabbaka ya‘lamu annaka taqūmu adnā min ṡuluṡayil-laili wa niṣfahū wa ṡuluṡahū wa ṭā'ifatum minal-lażīna ma‘ak(a), wallāhu yuqaddirul-laila wan-nahār(a), ‘alima allan tuḥṣūhu fa tāba ‘alaikum faqra'ū mā tayassara minal-qur'ān(i), ‘alima an sayakūnu minkum marḍā, wa ākharūna yaḍribūna fil-arḍi yabtagūna min faḍlillāh(i), wa ākharūna yuqātilūna fī sabīlillāh(i), faqra'ū mā tayassara minh(u), wa aqīmuṣ-ṣalāta wa ātuz-zakāta wa aqriḍullāha qarḍan ḥasanā(n), wa mā tuqaddimū li'anfusikum min khairin tajidūhu ‘indallāh(i), huwa khairaw wa a‘ẓama ajrā(n), wastagfirullāh(a), innallāha gafūrur raḥīm(un).",
    "translation_en": "Indeed, your Lord knows, [O Muhammad], that you stand [in prayer] almost two thirds of the night or half of it or a third of it, and [so do] a group of those with you. And Allah determines [the extent of] the night and the day. He has known that you [Muslims] will not be able to do it and has turned to you in forgiveness, so recite what is easy [for you] of the Qur'an. He has known that there will be among you those who are ill and others traveling throughout the land seeking [something] of the bounty of Allah and others fighting for the cause of Allah. So recite what is easy from it and establish prayer and give zakah and loan Allah a goodly loan. And whatever good you put forward for yourselves - you will find it with Allah. It is better and greater in reward. And seek forgiveness of Allah. Indeed, Allah is Forgiving and Merciful.",
    "translation_id": "Sesungguhnya Tuhanmu mengetahui bahwa engkau (Nabi Muhammad) berdiri (salat) kurang dari dua pertiga malam, atau seperdua malam atau sepertiganya dan (demikian pula) segolongan dari orang-orang yang bersamamu. Allah menetapkan ukuran malam dan siang. Allah mengetahui bahwa kamu tidak dapat menghitungnya (secara terperinci waktu-waktu tersebut sehingga menyulitkanmu dalam melaksanakan salat malam). Maka, Dia kembali (memberi keringanan) kepadamu. Oleh karena itu, bacalah (ayat) Al-Qur’an yang mudah (bagimu). Dia mengetahui bahwa akan ada di antara kamu orang-orang yang sakit, dan yang lain berjalan di bumi mencari sebagian karunia Allah serta yang lain berperang di jalan Allah, maka bacalah apa yang mudah (bagimu) darinya (Al-Qur’an). Tegakkanlah salat, tunaikanlah zakat, dan berikanlah pinjaman kepada Allah pinjaman yang baik. Kebaikan apa saja yang kamu perbuat untuk dirimu niscaya kamu memperoleh (balasan)-nya di sisi Allah sebagai balasan yang paling baik dan yang paling besar pahalanya. Mohonlah ampunan kepada Allah. Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang."
  }
]