[
  {
    "ayat": 151,
    "arabic": "سَنُلْقِيْ فِيْ قُلُوْبِ الَّذِيْنَ كَفَرُوا الرُّعْبَ بِمَٓا اَشْرَكُوْا بِاللّٰهِ مَا لَمْ يُنَزِّلْ بِهٖ سُلْطٰنًا ۚ وَمَأْوٰىهُمُ النَّارُ ۗ وَبِئْسَ مَثْوَى الظّٰلِمِيْنَ",
    "transliteration_en": "Sanulqee fee quloobil lazeena kafarur ru'ba bimaaa ashrakoo billaahi maa lam yunazzil bihee sultaana-nw wa maawaahumun Naar; wa bi'sa maswaz zaalimeen",
    "transliteration_id": "Sanulqī fī qulūbil-lażīna kafarur-ru‘ba bimā asyrakū billāhi mā lam yunazzil bihī sulṭānā(n), wa ma'wāhumun nār(u), wa bi'sa maṡwaẓ-ẓālimīn(a).",
    "translation_en": "We will cast terror into the hearts of those who disbelieve for what they have associated with Allah of which He had not sent down [any] authority. And their refuge will be the Fire, and wretched is the residence of the wrongdoers.",
    "translation_id": "Kami akan memasukkan rasa takut ke dalam hati orang-orang yang kufur karena mereka mempersekutukan Allah dengan sesuatu yang Allah tidak menurunkan keterangan tentangnya. Tempat kembali mereka adalah neraka. (Itulah) seburuk-buruk tempat tinggal (bagi) orang-orang zalim."
  },
  {
    "ayat": 152,
    "arabic": "وَلَقَدْ صَدَقَكُمُ اللّٰهُ وَعْدَهٗٓ اِذْ تَحُسُّوْنَهُمْ بِاِذْنِهٖ ۚ حَتّٰىٓ اِذَا فَشِلْتُمْ وَتَنَازَعْتُمْ فِى الْاَمْرِ وَعَصَيْتُمْ مِّنْۢ بَعْدِ مَآ اَرٰىكُمْ مَّا تُحِبُّوْنَ ۗ مِنْكُمْ مَّنْ يُّرِيْدُ الدُّنْيَا وَمِنْكُمْ مَّنْ يُّرِيْدُ الْاٰخِرَةَ ۚ ثُمَّ صَرَفَكُمْ عَنْهُمْ لِيَبْتَلِيَكُمْ ۚ وَلَقَدْ عَفَا عَنْكُمْ ۗ وَاللّٰهُ ذُوْ فَضْلٍ عَلَى الْمُؤْمِنِيْنَ",
    "transliteration_en": "Wa laqad sadaqakumul laahu wa'dahooo iz tahussoo nahum bi iznihee hattaaa izaa fashiltim wa tanaaza'tum fil amri wa 'asaitum mim ba'di maaa araakum maa tuhibboon; minkum mai yureedud dunyaa wa minkum mai yureedul Aakhirah; summa sarafakum 'anhum sarafakum 'anhum liyabtaliyakum wa laqad 'afaa 'ankum; wallaahu zoo fadlin 'alal mu'mineen",
    "transliteration_id": "Wa laqad ṣadaqakumullāhu wa‘dahū iż taḥussūnahum bi'iżnih(ī), ḥattā iżā fasyiltum wa tanāza‘tum fil-amri wa ‘aṣaitum mim ba‘di mā arākum mā tuḥibbūn(a), minkum may yurīdud-dun-yā wa minkum may yurīdul-ākhirah(ta), ṡumma ṣarafakum ‘anhum liyabtaliyakum, wa laqad ‘afā ‘ankum, wallāhu żū faḍlin ‘alal-mu'minīn(a).",
    "translation_en": "And Allah had certainly fulfilled His promise to you when you were killing the enemy by His permission until [the time] when you lost courage and fell to disputing about the order [given by the Prophet] and disobeyed after He had shown you that which you love. Among you are some who desire this world, and among you are some who desire the Hereafter. Then he turned you back from them [defeated] that He might test you. And He has already forgiven you, and Allah is the possessor of bounty for the believers.",
    "translation_id": "Sungguh, Allah benar-benar telah memenuhi janji-Nya kepadamu ketika kamu membunuh mereka dengan izin-Nya sampai pada saat kamu (dalam keadaan) lemah, berselisih dalam urusan itu, dan mengabaikan (perintah Rasul) setelah Allah memperlihatkan kepadamu apa yang kamu sukai. Di antara kamu ada orang yang menghendaki dunia dan di antara kamu ada (pula) orang yang menghendaki akhirat. Kemudian, Allah memalingkan kamu dari mereka untuk mengujimu. Sungguh, Dia benar-benar telah memaafkan kamu. Allah mempunyai karunia (yang diberikan) kepada orang-orang mukmin."
  },
  {
    "ayat": 153,
    "arabic": "۞ اِذْ تُصْعِدُوْنَ وَلَا تَلْوٗنَ عَلٰٓى اَحَدٍ وَّالرَّسُوْلُ يَدْعُوْكُمْ فِيْٓ اُخْرٰىكُمْ فَاَثَابَكُمْ غَمًّا ۢبِغَمٍّ لِّكَيْلَا تَحْزَنُوْا عَلٰى مَا فَاتَكُمْ وَلَا مَآ اَصَابَكُمْ ۗ وَاللّٰهُ خَبِيْرٌ ۢبِمَا تَعْمَلُوْنَ",
    "transliteration_en": "Iz tus'idoona wa laa talwoona 'alaaa ahadinw war Rasoolu yad'ookum feee ukhraakum fa asaabakum ghammam bighammil likailaa tahzanoo 'alaa maa faatakum wa laa maaa asaabakum; wallaahu khabeerum bimaa ta'maloon",
    "transliteration_id": "Iż tuṣ‘idūna wa lā talwūna ‘alā aḥadiw war-rasūlu yad‘ūkum fī ukhrākum fa aṡābakum gammam bigammil likailā taḥzanū ‘alā mā fātakum wa lā mā aṣābakum, wallāhu khabīrum bimā ta‘malūn(a).",
    "translation_en": "[Remember] when you [fled and] climbed [the mountain] without looking aside at anyone while the Messenger was calling you from behind. So Allah repaid you with distress upon distress so you would not grieve for that which had escaped you [of victory and spoils of war] or [for] that which had befallen you [of injury and death]. And Allah is [fully] Acquainted with what you do.",
    "translation_id": "(Ingatlah) ketika kamu lari dan tidak menoleh kepada siapa pun, sedangkan Rasul (Muhammad) memanggilmu dari belakang. Oleh karena itu, Allah menimpakan kepadamu kesedihan demi kesedihan agar kamu tidak bersedih hati (lagi) terhadap apa yang luput dari kamu dan terhadap apa yang menimpamu. Allah Maha Teliti terhadap apa yang kamu kerjakan."
  },
  {
    "ayat": 154,
    "arabic": "ثُمَّ اَنْزَلَ عَلَيْكُمْ مِّنْۢ بَعْدِ الْغَمِّ اَمَنَةً نُّعَاسًا يَّغْشٰى طَۤاىِٕفَةً مِّنْكُمْ ۙ وَطَۤاىِٕفَةٌ قَدْ اَهَمَّتْهُمْ اَنْفُسُهُمْ يَظُنُّوْنَ بِاللّٰهِ غَيْرَ الْحَقِّ ظَنَّ الْجَاهِلِيَّةِ ۗ يَقُوْلُوْنَ هَلْ لَّنَا مِنَ الْاَمْرِ مِنْ شَيْءٍ ۗ قُلْ اِنَّ الْاَمْرَ كُلَّهٗ لِلّٰهِ ۗ  يُخْفُوْنَ فِيْٓ اَنْفُسِهِمْ مَّا لَا يُبْدُوْنَ لَكَ ۗ يَقُوْلُوْنَ لَوْ كَانَ لَنَا مِنَ الْاَمْرِ شَيْءٌ مَّا قُتِلْنَا هٰهُنَا ۗ قُلْ لَّوْ كُنْتُمْ فِيْ بُيُوْتِكُمْ لَبَرَزَ الَّذِيْنَ كُتِبَ عَلَيْهِمُ الْقَتْلُ اِلٰى مَضَاجِعِهِمْ ۚ وَلِيَبْتَلِيَ اللّٰهُ مَا فِيْ صُدُوْرِكُمْ وَلِيُمَحِّصَ مَا فِيْ قُلُوْبِكُمْ ۗ وَاللّٰهُ عَلِيْمٌ ۢبِذَاتِ الصُّدُوْرِ",
    "transliteration_en": "Summa anzala 'alaikum mim ba'dil ghammi amanatan nu'aasai yaghshaa taaa' ifatam minkum wa taaa'ifatun qad ahammathum anfusuhum yazunnoona billaahi ghairal haqqi zannal jaahiliyyati yaqooloona hal lanaa minal amri min shai'; qul innal amra kullahoo lillaah; yukhfoona fee anfusihim maa laa yubdoona laka yaqooloona law kaana lanaa minal amri shai'ummaa qutilnaa haahunaa; qul law kuntum fee buyootikum labarazal lazeena kutiba 'alaihimul qatlu ilaa madaaji'ihim wa liyabtaliyal laahu maa fee sudoorikum wa liyumah hisa maa fee quloobikum; wallaahu 'aleemum bizaatis sudoor",
    "transliteration_id": "Ṡumma anzala ‘alaikum mim ba‘dil-gammi amanatan nu‘āsay yagsyā ṭā'ifatam minkum, wa ṭā'ifatun qad ahammathum  anfusuhum yaẓunnūna billāhi gairal-ḥaqqi ẓanal-jāhiliyyah(ti), yaqūlūna hal lanā minal-amri min syai'(in), qul innal-amra kullahū lillāh(i), yukhfūna fī anfusihim mā lā yubdūna lak(a), yaqūlūna lau kāna lanā minal-amri syai'um mā qutilnā hāhunā, qul lau kuntum fī buyūtikum labarazal-lażīna kutiba ‘alaihimul-qatlu ilā maḍāji‘ihim, wa liyabtaliyallāhu mā fī ṣudūrikum wa liyumaḥḥiṣa mā fī qulūbikum, wallāhu ‘alīmum biżātiṣ-ṣudūr(i).",
    "translation_en": "Then after distress, He sent down upon you security [in the form of] drowsiness, overcoming a faction of you, while another faction worried about themselves, thinking of Allah other than the truth - the thought of ignorance, saying, \"Is there anything for us [to have done] in this matter?\" Say, \"Indeed, the matter belongs completely to Allah.\" They conceal within themselves what they will not reveal to you. They say, \"If there was anything we could have done in the matter, some of us would not have been killed right here.\" Say, \"Even if you had been inside your houses, those decreed to be killed would have come out to their death beds.\" [It was] so that Allah might test what is in your breasts and purify what is in your hearts. And Allah is Knowing of that within the breasts.",
    "translation_id": "Setelah kamu ditimpa kesedihan, kemudian Dia menurunkan rasa aman kepadamu (berupa) kantuk yang meliputi segolongan dari kamu, sedangkan segolongan lagi telah mencemaskan diri mereka sendiri. Mereka berprasangka yang tidak benar terhadap Allah seperti sangkaan jahiliah. Mereka berkata, “Adakah sesuatu yang dapat kita perbuat dalam urusan ini?” Katakanlah (Nabi Muhammad), “Sesungguhnya segala urusan itu di tangan Allah.” Mereka menyembunyikan dalam hatinya apa yang tidak mereka terangkan kepadamu. Mereka berkata, “Seandainya ada sesuatu yang dapat kami perbuat dalam urusan ini, niscaya kami tidak akan dibunuh (dikalahkan) di sini.” Katakanlah (Nabi Muhammad), “Seandainya kamu ada di rumahmu, niscaya orang-orang yang telah ditetapkan akan mati terbunuh itu keluar (juga) ke tempat mereka terbunuh.” Allah (berbuat demikian) untuk menguji yang ada dalam dadamu dan untuk membersihkan yang ada dalam hatimu. Allah Maha Mengetahui segala isi hati."
  },
  {
    "ayat": 155,
    "arabic": "اِنَّ الَّذِيْنَ تَوَلَّوْا مِنْكُمْ يَوْمَ الْتَقَى الْجَمْعٰنِۙ اِنَّمَا اسْتَزَلَّهُمُ الشَّيْطٰنُ بِبَعْضِ مَا كَسَبُوْا ۚ وَلَقَدْ عَفَا اللّٰهُ عَنْهُمْ ۗ اِنَّ اللّٰهَ غَفُوْرٌ حَلِيْمٌ ࣖ",
    "transliteration_en": "Innal lazeena tawallaw minkum yawmal taqal jam'aani innamas tazallahumush Shaitaanu biba'di maa kasaboo wa laqad 'afal laahu 'anhum; innnal laaha Ghafoorum Haleem",
    "transliteration_id": "Innal-lażīna tawallau minkum yaumal-taqal-jam‘ān(i), innamastazallahumusy-syaiṭānu biba‘ḍi mā kasabū, wa laqad ‘afallāhu ‘anhum, innallāha gafūrun ḥalīm(un).",
    "translation_en": "Indeed, those of you who turned back on the day the two armies met, it was Satan who caused them to slip because of some [blame] they had earned. But Allah has already forgiven them. Indeed, Allah is Forgiving and Forbearing.",
    "translation_id": "Sesungguhnya orang-orang yang berpaling di antara kamu pada hari ketika dua pasukan bertemu, sesungguhnya mereka hanyalah digelincirkan oleh setan disebabkan sebagian kesalahan (dosa) yang telah mereka perbuat. Allah benar-benar telah memaafkan mereka. Sesungguhnya Allah Maha Pengampun lagi Maha Penyantun."
  },
  {
    "ayat": 156,
    "arabic": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا تَكُوْنُوْا كَالَّذِيْنَ كَفَرُوْا وَقَالُوْا لِاِخْوَانِهِمْ اِذَا ضَرَبُوْا فِى الْاَرْضِ اَوْ كَانُوْا غُزًّى لَّوْ كَانُوْا عِنْدَنَا مَا مَاتُوْا وَمَا قُتِلُوْاۚ  لِيَجْعَلَ اللّٰهُ ذٰلِكَ حَسْرَةً فِيْ قُلُوْبِهِمْ ۗ وَاللّٰهُ يُحْيٖ وَيُمِيْتُ ۗ وَاللّٰهُ بِمَا تَعْمَلُوْنَ بَصِيْرٌ",
    "transliteration_en": "Yaaa ayyuhul lazeena aamanoo laa takoonoo kallazeena kafaroo wa qaaloo li ikhwaanihim izaa daraboo fil ardi aw kaanoo ghuzzal law kaanoo 'indanaa maa maatoo wa maa qutiloo liyaj'alal laahu zaalika hasratan fee quloobihim; qallaahu yuhyee wa yumeet; wallaahu bimaa ta'maloona Baseer",
    "transliteration_id": "Yā ayyuhal-lażīna āmanū lā takūnū kal-lażīna kafarū wa qālū li'ikhwānihim iżā ḍarabū fil-arḍi au kānū guzzal lau kānū ‘indanā mā mātū wa mā qutilū, liyaj‘alallāhu żālika ḥasratan fī qulūbihim, wallāhu yuḥyī wa yumīt(u), wallāhu  bimā ta‘malūna baṣīr(un).",
    "translation_en": "O you who have believed, do not be like those who disbelieved and said about their brothers when they traveled through the land or went out to fight, \"If they had been with us, they would not have died or have been killed,\" so Allah makes that [misconception] a regret within their hearts. And it is Allah who gives life and causes death, and Allah is Seeing of what you do.",
    "translation_id": "Wahai orang-orang yang beriman, janganlah seperti orang-orang yang kufur dan berbicara tentang saudara-saudaranya, apabila mereka mengadakan perjalanan di bumi atau berperang, “Seandainya mereka tetap bersama kami, tentulah mereka tidak mati dan tidak terbunuh.” (Allah membiarkan mereka bersikap demikian) karena Allah hendak menjadikan itu (kelak) sebagai penyesalan di hati mereka. Allah menghidupkan dan mematikan. Allah Maha Melihat apa yang kamu kerjakan."
  },
  {
    "ayat": 157,
    "arabic": "وَلَىِٕنْ قُتِلْتُمْ فِيْ سَبِيْلِ اللّٰهِ اَوْ مُتُّمْ لَمَغْفِرَةٌ مِّنَ اللّٰهِ وَرَحْمَةٌ خَيْرٌ مِّمَّا يَجْمَعُوْنَ",
    "transliteration_en": "Wa la'in qutiltum fee sabeelil laahi aw muttum lamaghfiratum minal laahi wa rahmatun khairum mimmaa yajma'oon",
    "transliteration_id": "Wa la'in qutiltum fī sabīlillāhi au muttum lamagfiratum minallāhi wa raḥmatun khairum mimmā yajma‘ūn(a).",
    "translation_en": "And if you are killed in the cause of Allah or die - then forgiveness from Allah and mercy are better than whatever they accumulate [in this world].",
    "translation_id": "Sungguh, jika kamu gugur di jalan Allah atau mati, pastilah ampunan Allah dan rahmat-Nya lebih baik (bagimu) daripada apa (harta rampasan) yang mereka kumpulkan."
  },
  {
    "ayat": 158,
    "arabic": "وَلَىِٕنْ مُّتُّمْ اَوْ قُتِلْتُمْ لَاِلَى اللّٰهِ تُحْشَرُوْنَ",
    "transliteration_en": "Wa la'im muttum 'aw qutiltumla ilal laahi tuhsharoon",
    "transliteration_id": "Wa la'im muttum au qutiltum la'ilallāhi tuḥsyarūn(a).",
    "translation_en": "And whether you die or are killed, unto Allah you will be gathered.",
    "translation_id": "Sungguh, jika kamu mati atau gugur, pastilah kepada Allah kamu dikumpulkan."
  },
  {
    "ayat": 159,
    "arabic": "فَبِمَا رَحْمَةٍ مِّنَ اللّٰهِ لِنْتَ لَهُمْ ۚ وَلَوْ كُنْتَ فَظًّا غَلِيْظَ الْقَلْبِ لَانْفَضُّوْا مِنْ حَوْلِكَ ۖ فَاعْفُ عَنْهُمْ وَاسْتَغْفِرْ لَهُمْ وَشَاوِرْهُمْ فِى الْاَمْرِۚ فَاِذَا عَزَمْتَ فَتَوَكَّلْ عَلَى اللّٰهِ ۗ اِنَّ اللّٰهَ يُحِبُّ الْمُتَوَكِّلِيْنَ",
    "transliteration_en": "Fabimaa rahmatim minal laahi linta lahum wa law kunta fazzan ghaleezal qalbi lanfaddoo min hawlika fafu 'anhum wastaghfir lahum wa shaawirhum fil amri fa izaa 'azamta fatawakkal 'alal laah; innallaaha yuhibbul mutawak kileen",
    "transliteration_id": "Fabimā raḥmatim minallāhi linta lahum, wa lau kunta faẓẓan galīẓal-qalbi lanfaḍḍū min ḥaulik(a), fa‘fu ‘anhum wastagfir lahum wa syāwirhum fil-amr(i), fa iżā ‘azamta  fa tawakkal ‘alallāh(i), innallāha yuḥibbul-mutawakkilīn(a).",
    "translation_en": "So by mercy from Allah, [O Muhammad], you were lenient with them. And if you had been rude [in speech] and harsh in heart, they would have disbanded from about you. So pardon them and ask forgiveness for them and consult them in the matter. And when you have decided, then rely upon Allah. Indeed, Allah loves those who rely [upon Him].",
    "translation_id": "Maka, berkat rahmat Allah engkau (Nabi Muhammad) berlaku lemah lembut terhadap mereka. Seandainya engkau bersikap keras dan berhati kasar, tentulah mereka akan menjauh dari sekitarmu. Oleh karena itu, maafkanlah mereka, mohonkanlah ampunan untuk mereka, dan bermusyawarahlah dengan mereka dalam segala urusan (penting). Kemudian, apabila engkau telah membulatkan tekad, bertawakallah kepada Allah. Sesungguhnya Allah mencintai orang-orang yang bertawakal."
  },
  {
    "ayat": 160,
    "arabic": "اِنْ يَّنْصُرْكُمُ اللّٰهُ فَلَا غَالِبَ لَكُمْ ۚ وَاِنْ يَّخْذُلْكُمْ فَمَنْ ذَا الَّذِيْ يَنْصُرُكُمْ مِّنْۢ بَعْدِهٖ ۗ وَعَلَى اللّٰهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُوْنَ",
    "transliteration_en": "Iny-yansurkumul laahu falaa ghaaliba lakum wa iny-yakhzulkum faman zal lazee yansurukum mim ba'dih; wa 'alal laahi falyatawakkalil mu'minoon",
    "transliteration_id": "Iy yanṣurkumullāhu falā gāliba lakum, wa iy yakhżulkum faman żal-lażī yanṣurukum mim ba‘dih(ī),  wa ‘alallāhi falyatawakkalil-mu'minūn(a).",
    "translation_en": "If Allah should aid you, no one can overcome you; but if He should forsake you, who is there that can aid you after Him? And upon Allah let the believers rely.",
    "translation_id": "Jika Allah menolongmu, tidak ada yang (dapat) mengalahkanmu dan jika Dia membiarkanmu (tidak memberimu pertolongan), siapa yang (dapat) menolongmu setelah itu? Oleh karena itu, hendaklah kepada Allah saja orang-orang mukmin bertawakal."
  },
  {
    "ayat": 161,
    "arabic": "وَمَا كَانَ لِنَبِيٍّ اَنْ يَّغُلَّ  ۗوَمَنْ يَّغْلُلْ يَأْتِ بِمَا غَلَّ يَوْمَ الْقِيٰمَةِ ۚ ثُمَّ تُوَفّٰى كُلُّ نَفْسٍ مَّا كَسَبَتْ وَهُمْ لَا يُظْلَمُوْنَ",
    "transliteration_en": "Wa maa kaana li Nabiyyin ai yaghull; wa mai yaghlul yaati bimaa ghalla Yawmal Qiyaamah; summa tuwaffaa kullu nafsim maa kasabat wa hum laa yuzlamoon",
    "transliteration_id": "Wa mā kāna linabiyyin ay yagull(a), wa may yaglul ya'ti  bimā galla yaumal-qiyāmah(ti), ṡumma tuwaffā kullu nafsim mā kasabat wa hum lā yuẓlamūn(a).",
    "translation_en": "It is not [attributable] to any prophet that he would act unfaithfully [in regard to war booty]. And whoever betrays, [taking unlawfully], will come with what he took on the Day of Resurrection. Then will every soul be [fully] compensated for what it earned, and they will not be wronged.",
    "translation_id": "Tidak layak seorang nabi menyelewengkan (harta rampasan perang). Siapa yang menyelewengkan (-nya), niscaya pada hari Kiamat dia akan datang membawa apa yang diselewengkannya itu. Kemudian, setiap orang akan diberi balasan secara sempurna sesuai apa yang mereka lakukan dan mereka tidak dizalimi."
  },
  {
    "ayat": 162,
    "arabic": "اَفَمَنِ اتَّبَعَ رِضْوَانَ اللّٰهِ كَمَنْۢ بَاۤءَ بِسَخَطٍ مِّنَ اللّٰهِ وَمَأْوٰىهُ جَهَنَّمُ ۗ وَبِئْسَ الْمَصِيْرُ",
    "transliteration_en": "Afamanit taba'a Ridwaanal laahi kamam baaa'a bisakhatim minal laahi wa maawaahu Jahannam; wa bi'sal maseer",
    "transliteration_id": "Afamanittaba‘a riḍwānallāhi kamam bā'a bisakhaṭim minallāhi wa ma'wāhu jahannam(u), wa bi'sal-maṣīr(u),",
    "translation_en": "So is one who pursues the pleasure of Allah like one who brings upon himself the anger of Allah and whose refuge is Hell? And wretched is the destination.",
    "translation_id": "Apakah orang yang mengikuti (jalan) rida Allah sama dengan orang yang kembali dengan membawa kemurkaan dari Allah dan tempatnya adalah (neraka) Jahanam? Itulah seburuk-buruk tempat kembali."
  },
  {
    "ayat": 163,
    "arabic": "هُمْ دَرَجٰتٌ عِنْدَ اللّٰهِ ۗ وَاللّٰهُ بَصِيْرٌ ۢبِمَا يَعْمَلُوْنَ",
    "transliteration_en": "Hum darajaatun 'indal laah; wallaahu baseerum bimaa ya'maloon",
    "transliteration_id": "Hum darajātun ‘indallāh(i), wallāhu baṣīrum bimā ya‘malūn(a).",
    "translation_en": "They are [varying] degrees in the sight of Allah, and Allah is Seeing of whatever they do.",
    "translation_id": "Mereka bertingkat-tingkat di sisi Allah. Allah Maha Melihat apa yang mereka kerjakan."
  },
  {
    "ayat": 164,
    "arabic": "لَقَدْ مَنَّ اللّٰهُ عَلَى الْمُؤْمِنِيْنَ اِذْ بَعَثَ فِيْهِمْ رَسُوْلًا مِّنْ اَنْفُسِهِمْ يَتْلُوْا عَلَيْهِمْ اٰيٰتِهٖ وَيُزَكِّيْهِمْ وَيُعَلِّمُهُمُ الْكِتٰبَ وَالْحِكْمَةَۚ وَاِنْ كَانُوْا مِنْ قَبْلُ لَفِيْ ضَلٰلٍ مُّبِيْنٍ",
    "transliteration_en": "Laqad mannal laahu 'alal mu'mineena iz ba'asa feehim Rasoolam min anfusihim yatloo 'alaihim Aayaatihee wa yuzakkeehim wa yu'allimu humul Kitaaba wal Hikmata wa in kaanoo min qablu lafee dalaalim mubeen",
    "transliteration_id": "Laqad mannallāhu ‘alal-mu'minīna iż ba‘aṡa fīhim rasūlam min anfusihim yatlū ‘alaihim āyātihī wa yuzakkīhim wa yu‘allimuhumul-kitāba wal-ḥikmah(ta), wa in kānū min qablu lafī ḍalālim mubīn(in).",
    "translation_en": "Certainly did Allah confer [great] favor upon the believers when He sent among them a Messenger from themselves, reciting to them His verses and purifying them and teaching them the Book and wisdom, although they had been before in manifest error.",
    "translation_id": "Sungguh, Allah benar-benar telah memberi karunia kepada orang-orang mukmin ketika (Dia) mengutus di tengah-tengah mereka seorang Rasul (Muhammad) dari kalangan mereka sendiri yang membacakan kepada mereka ayat-ayat-Nya, menyucikan (jiwa) mereka, dan mengajarkan kepada mereka Kitab Suci (Al-Qur’an) dan hikmah. Sesungguhnya mereka sebelum itu benar-benar dalam kesesatan yang nyata."
  },
  {
    "ayat": 165,
    "arabic": "اَوَلَمَّآ اَصَابَتْكُمْ مُّصِيْبَةٌ قَدْ اَصَبْتُمْ مِّثْلَيْهَاۙ قُلْتُمْ اَنّٰى هٰذَا ۗ قُلْ هُوَ مِنْ عِنْدِ اَنْفُسِكُمْ ۗ اِنَّ اللّٰهَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ",
    "transliteration_en": "Awa lammaaa asaabatkum museebatun qad asabtum mislaihaa qultum annaa haazaa qul huwa min 'indi anfusikum; innal laaha 'alaa kulli shai'in Qadeer",
    "transliteration_id": "Awa lammā aṣābatkum muṣībatun qad aṣabtum miṡlaihā, qultum annā hāżā, qul huwa min ‘indi anfusikum, innallāha ‘alā kulli syai'in qadīr(un).",
    "translation_en": "Why [is it that] when a [single] disaster struck you [on the day of Uhud], although you had struck [the enemy in the battle of Badr] with one twice as great, you said, \"From where is this?\" Say, \"It is from yourselves.\" Indeed, Allah is over all things competent.",
    "translation_id": "Apakah ketika kamu ditimpa musibah (kekalahan pada Perang Uhud), padahal kamu telah memperoleh (kenikmatan) dua kali lipatnya (pada Perang Badar), kamu berkata, “Dari mana datangnya (kekalahan) ini?” Katakanlah, “Itu dari (kesalahan) dirimu sendiri.” Sesungguhnya Allah Maha Kuasa atas segala sesuatu."
  },
  {
    "ayat": 166,
    "arabic": "وَمَآ اَصَابَكُمْ يَوْمَ الْتَقَى الْجَمْعٰنِ فَبِاِذْنِ اللّٰهِ وَلِيَعْلَمَ الْمُؤْمِنِيْنَۙ",
    "transliteration_en": "Wa maa asaabakum yawmal taqal jam'aani fabiiznil laahi wa liya'lamal mu'mineen",
    "transliteration_id": "Wa mā aṣābakum yaumal-taqal-jam‘āni fa bi'iżnillāhi wa liya‘lamal-mu'minīn(a).",
    "translation_en": "And what struck you on the day the two armies met was by permission of Allah that He might make evident the [true] believers.",
    "translation_id": "Apa yang menimpa kamu pada hari ketika dua pasukan bertemu terjadi atas izin Allah dan agar Dia mengetahui siapa orang (yang benar-benar) beriman"
  },
  {
    "ayat": 167,
    "arabic": "وَلِيَعْلَمَ الَّذِيْنَ نَافَقُوْا ۖوَقِيْلَ لَهُمْ تَعَالَوْا قَاتِلُوْا فِيْ سَبِيْلِ اللّٰهِ اَوِ ادْفَعُوْا ۗ قَالُوْا لَوْ نَعْلَمُ قِتَالًا لَّاتَّبَعْنٰكُمْ ۗ هُمْ لِلْكُفْرِ يَوْمَىِٕذٍ اَقْرَبُ مِنْهُمْ لِلْاِيْمَانِ ۚ يَقُوْلُوْنَ بِاَفْوَاهِهِمْ مَّا لَيْسَ فِيْ قُلُوْبِهِمْ ۗ وَاللّٰهُ اَعْلَمُ بِمَا يَكْتُمُوْنَۚ",
    "transliteration_en": "Wa liya'lamal lazeena naafaqoo; wa qeela lahum ta'aalaw qaatiloo fee sabeelil laahi awid fa'oo qaaloo law na'lamu qitaalallat taba'naakum; hum lilkufri yawma'izin aqrabu minhum lil eemaan; yaqooloona bi afwaahihim maa laisa fee quloobihim; wallaahu a'lamu bimaa yaktumoon",
    "transliteration_id": "Wa liya‘lamal-lażīna nāfaqū, wa qīla lahum  ta‘ālau qātilū fī sabīlillāhi awidfa‘ū, qālū lau na‘lamu qitālal lattaba‘nākum, hum lil-kufri yauma'iżin aqrabu minhum lil-īmān(i), yaqūlūna bi'afwāhihim mā laisa fī qulūbihim, walllāhu a‘lamu bimā yaktumūn(a).",
    "translation_en": "And that He might make evident those who are hypocrites. For it was said to them, \"Come, fight in the way of Allah or [at least] defend.\" They said, \"If we had known [there would be] fighting, we would have followed you.\" They were nearer to disbelief that day than to faith, saying with their mouths what was not in their hearts. And Allah is most Knowing of what they conceal -",
    "translation_id": "dan mengetahui orang-orang yang munafik. Dikatakan kepada mereka, “Marilah berperang di jalan Allah atau pertahankanlah (dirimu).” Mereka menjawab, “Seandainya kami mengetahui (bagaimana cara) berperang, tentulah kami mengikutimu.” Mereka pada hari itu lebih dekat pada kekufuran daripada keimanan. Mereka mengatakan dengan mulutnya sesuatu yang tidak ada dalam hatinya. Allah lebih mengetahui segala sesuatu yang mereka sembunyikan."
  },
  {
    "ayat": 168,
    "arabic": "اَلَّذِيْنَ قَالُوْا لِاِخْوَانِهِمْ وَقَعَدُوْا لَوْ اَطَاعُوْنَا مَا قُتِلُوْا ۗ قُلْ فَادْرَءُوْا عَنْ اَنْفُسِكُمُ الْمَوْتَ اِنْ كُنْتُمْ صٰدِقِيْنَ",
    "transliteration_en": "Allazeena qaaloo liikhwaanihim wa qa'adoo law ataa'oonaa maa qutiloo; qul fadra'oo'an anfusikumul mawta in kuntum saadiqeen",
    "transliteration_id": "Al-lażīna qālū li'ikhwānihim wa qa‘adū lau aṭā‘ūnā mā qutilū, qul fadra'ū ‘an anfusikumul-mauta in kuntum ṣādiqīn(a).",
    "translation_en": "Those who said about their brothers while sitting [at home], \"If they had obeyed us, they would not have been killed.\" Say, \"Then prevent death from yourselves, if you should be truthful.\"",
    "translation_id": "(Mereka itu adalah) orang-orang yang berbicara tentang saudara-saudaranya (yang ikut berperang dan terbunuh), sedangkan mereka sendiri tidak turut berperang, “Seandainya mereka mengikuti kami, tentulah mereka tidak terbunuh.” Katakanlah, “Cegahlah kematian itu dari dirimu jika kamu orang-orang benar.”"
  },
  {
    "ayat": 169,
    "arabic": "وَلَا تَحْسَبَنَّ الَّذِيْنَ قُتِلُوْا فِيْ سَبِيْلِ اللّٰهِ اَمْوَاتًا ۗ بَلْ اَحْيَاۤءٌ عِنْدَ رَبِّهِمْ يُرْزَقُوْنَۙ",
    "transliteration_en": "Wa laa tahsabannal lazeena qutiloo fee sabeelillaahi amwaata; bal ahyaaa'un 'inda Rabbihim yurzaqoon",
    "transliteration_id": "Wa lā taḥsabannal-lażīna qutilū fī sabīlillāhi amwātā(n), bal aḥyā'un 'inda rabbihim yurzaqūn(a).",
    "translation_en": "And never think of those who have been killed in the cause of Allah as dead. Rather, they are alive with their Lord, receiving provision,",
    "translation_id": "Jangan sekali-kali kamu mengira bahwa orang-orang yang gugur di jalan Allah itu mati. Sebenarnya, mereka itu hidup dan dianugerahi rezeki di sisi Tuhannya."
  },
  {
    "ayat": 170,
    "arabic": "فَرِحِيْنَ بِمَآ اٰتٰىهُمُ اللّٰهُ مِنْ فَضْلِهٖۙ وَيَسْتَبْشِرُوْنَ بِالَّذِيْنَ لَمْ يَلْحَقُوْا بِهِمْ مِّنْ خَلْفِهِمْ ۙ اَلَّا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُوْنَۘ",
    "transliteration_en": "Fariheena bimaaa aataa humul laahu min fadlihee wa yastabshiroona billazeena lam yalhaqoo bihim min fadlihee wa yastabshiroona billazeena lam yalhaqoo bihim min khalfihim allaa khawfun 'alaihim wa laa hum yahzanoon",
    "transliteration_id": "Fariḥīna bimā ātāhumullāhu min faḍlih(ī), wa yastabsyirūna bil-lażīna lam yalḥaqū bihim  min khalfihim, allā khaufun ‘alaihim wa lā hum yaḥzanūn(a).",
    "translation_en": "Rejoicing in what Allah has bestowed upon them of His bounty, and they receive good tidings about those [to be martyred] after them who have not yet joined them - that there will be no fear concerning them, nor will they grieve.",
    "translation_id": "Mereka bergembira dengan karunia yang Allah anugerahkan kepadanya dan bergirang hati atas (keadaan) orang-orang yang berada di belakang yang belum menyusul mereka, yaitu bahwa tidak ada rasa takut pada mereka dan mereka tidak bersedih hati."
  },
  {
    "ayat": 171,
    "arabic": "۞ يَسْتَبْشِرُوْنَ بِنِعْمَةٍ مِّنَ اللّٰهِ وَفَضْلٍۗ وَاَنَّ اللّٰهَ لَا يُضِيْعُ اَجْرَ الْمُؤْمِنِيْنَ ࣖ",
    "transliteration_en": "Yastabshiroona bini'matim minal laahi wa fad linw wa annal laaha laa yudee'u ajral mu'mineen",
    "transliteration_id": "Yastabsyirūna bini‘matim minallāhi wa faḍl(in), wa annallāha lā yuḍī‘u ajral-mu'minīn(a).",
    "translation_en": "They receive good tidings of favor from Allah and bounty and [of the fact] that Allah does not allow the reward of believers to be lost -",
    "translation_id": "Mereka bergirang hati dengan nikmat dan karunia dari Allah dan bahwa sesungguhnya Allah tidak menyia-nyiakan pahala orang-orang mukmin,"
  },
  {
    "ayat": 172,
    "arabic": "اَلَّذِيْنَ اسْتَجَابُوْا لِلّٰهِ وَالرَّسُوْلِ مِنْۢ بَعْدِ مَآ اَصَابَهُمُ الْقَرْحُ ۖ لِلَّذِيْنَ اَحْسَنُوْا مِنْهُمْ وَاتَّقَوْا اَجْرٌ عَظِيْمٌۚ",
    "transliteration_en": "Allazeenas tajaaboo lil laahi war Rasooli mim ba'di maaa asaabahumulqarh; lillazeena ahsanoo minhum wattaqaw ajrun 'azeem",
    "transliteration_id": "Al-lażīnastajābū lillāhi war-rasūli mim ba‘di mā aṣābahumul-qarḥ(u), lil-lażīna aḥsanū minhum wattaqau ajrun ‘aẓīm(un).",
    "translation_en": "Those [believers] who responded to Allah and the Messenger after injury had struck them. For those who did good among them and feared Allah is a great reward -",
    "translation_id": "(yaitu) orang-orang yang memenuhi (seruan) Allah dan Rasul setelah mereka menderita luka-luka (dalam Perang Uhud). Orang-orang yang berbuat kebaikan dan bertakwa di antara mereka akan mendapat pahala yang sangat besar,"
  },
  {
    "ayat": 173,
    "arabic": "اَلَّذِيْنَ قَالَ لَهُمُ النَّاسُ اِنَّ النَّاسَ قَدْ جَمَعُوْا لَكُمْ فَاخْشَوْهُمْ فَزَادَهُمْ اِيْمَانًاۖ وَّقَالُوْا حَسْبُنَا اللّٰهُ وَنِعْمَ الْوَكِيْلُ",
    "transliteration_en": "Allazeena qaala lahumun naasu innan naasa qad jama'oo lakum fakhshawhuin fazaadahum eemaannanwa wa qaaloo hasbunal laahu wa ni'malwakeel",
    "transliteration_id": "Al-lażīna qāla lahumun-nāsu innan-nāsa qad jama‘ū lakum fakhsyauhum fa zādahum īmānā(n), wa qālū ḥasbunallāhu wa ni‘mal-wakīl(u).",
    "translation_en": "Those to whom hypocrites said, \"Indeed, the people have gathered against you, so fear them.\" But it [merely] increased them in faith, and they said, \"Sufficient for us is Allah, and [He is] the best Disposer of affairs.\"",
    "translation_id": "(yaitu) mereka yang (ketika ada) orang-orang mengatakan kepadanya, “Sesungguhnya orang-orang (Quraisy) telah mengumpulkan (pasukan) untuk (menyerang) kamu. Oleh karena itu, takutlah kepada mereka,” ternyata (ucapan) itu menambah (kuat) iman mereka dan mereka menjawab, “Cukuplah Allah (menjadi penolong) bagi kami dan Dia sebaik-baik pelindung.”"
  },
  {
    "ayat": 174,
    "arabic": "فَانْقَلَبُوْا بِنِعْمَةٍ مِّنَ اللّٰهِ وَفَضْلٍ لَّمْ يَمْسَسْهُمْ سُوْۤءٌۙ وَّاتَّبَعُوْا رِضْوَانَ اللّٰهِ ۗ وَاللّٰهُ ذُوْ فَضْلٍ عَظِيْمٍ",
    "transliteration_en": "Fanqalaboo bini'matim minal laahi wa fadlil lam yamsashum sooo'unw wattaba'oo ridwaanal laah; wallaahu zoo fadlin 'azeem",
    "transliteration_id": "Fanqalabū bi ni‘matim minallāhi wa faḍlil lam yamsashum sū'(un), wattaba‘ū riḍwānallāh(i), wallahu żū faḍlin ‘aẓīm(in).",
    "translation_en": "So they returned with favor from Allah and bounty, no harm having touched them. And they pursued the pleasure of Allah, and Allah is the possessor of great bounty.",
    "translation_id": "Mereka kembali dengan nikmat dan karunia dari Allah. Mereka tidak ditimpa suatu bencana dan mereka mengikuti (jalan) rida Allah. Allah mempunyai karunia yang besar."
  },
  {
    "ayat": 175,
    "arabic": "اِنَّمَا ذٰلِكُمُ الشَّيْطٰنُ يُخَوِّفُ اَوْلِيَاۤءَهٗۖ فَلَا تَخَافُوْهُمْ وَخَافُوْنِ اِنْ كُنْتُمْ مُّؤْمِنِيْنَ",
    "transliteration_en": "Innamaa zaalikumush Shaitaanu yukhawwifu awliyaaa'ahoo falaa takhaafoohum wa khaafooni in kuntum mu'mineen",
    "transliteration_id": "Innamā żālikumusy-syaiṭānu yukhawwifu auliyā'ah(ū), falā takhāfūhum wa khāfūni in kuntum mu'minīn(a).",
    "translation_en": "That is only Satan who frightens [you] of his supporters. So fear them not, but fear Me, if you are [indeed] believers.",
    "translation_id": "Sesungguhnya mereka hanyalah setan yang menakut-nakuti (kamu) dengan teman-teman setianya. Oleh karena itu, janganlah takut kepada mereka, tetapi takutlah kepada-Ku, jika kamu orang-orang mukmin."
  },
  {
    "ayat": 176,
    "arabic": "وَلَا يَحْزُنْكَ الَّذِيْنَ يُسَارِعُوْنَ فِى الْكُفْرِۚ اِنَّهُمْ لَنْ يَّضُرُّوا اللّٰهَ شَيْـًٔا ۗ يُرِيْدُ اللّٰهُ اَلَّا يَجْعَلَ لَهُمْ حَظًّا فِى الْاٰخِرَةِ  وَلَهُمْ عَذَابٌ عَظِيْمٌۚ",
    "transliteration_en": "Wa laa yahzunkal lazeena yusaari'oona fil Kufr; innahum lai yadurrul laaha shai'aa; yureedul laahu allaa yaj'ala lahum hazzan fil Aakhirati wa lahum 'azaabun 'azeem",
    "transliteration_id": "Wa lā yaḥzunkal-lażīna yusāri‘ūna fil-kufr(i), innahum lay yaḍurrullāha syai'ā(n), yurīdullāhu allā yaj‘ala  lahum ḥaẓẓan fil-ākhirati wa lahum ‘ażābun ‘aẓīm(un).",
    "translation_en": "And do not be grieved, [O Muhammad], by those who hasten into disbelief. Indeed, they will never harm Allah at all. Allah intends that He should give them no share in the Hereafter, and for them is a great punishment.",
    "translation_id": "Janganlah engkau (Nabi Muhammad) dirisaukan oleh orang-orang yang dengan cepat melakukan kekufuran. Sesungguhnya sedikit pun mereka tidak merugikan Allah. Allah tidak akan memberi bagian (pahala) kepada mereka di akhirat dan mereka akan mendapat azab yang sangat besar."
  },
  {
    "ayat": 177,
    "arabic": "اِنَّ الَّذِيْنَ اشْتَرَوُا الْكُفْرَ بِالْاِيْمَانِ لَنْ يَّضُرُّوا اللّٰهَ شَيْـًٔاۚ وَلَهُمْ عَذَابٌ اَلِيْمٌ",
    "transliteration_en": "Innal lazeenash tarawul kufra bil eemaani lai yadurrul laaha shai anw wa lahum 'azdaabun aleem",
    "transliteration_id": "Innal-lażīnasytarawul-kufra bil-īmāni lay yaḍurrullāha syai'ā(n), wa lahum ‘ażābun alīm(un).",
    "translation_en": "Indeed, those who purchase disbelief [in exchange] for faith - never will they harm Allah at all, and for them is a painful punishment.",
    "translation_id": "Sesungguhnya orang-orang yang membeli kekufuran dengan iman sedikit pun tidak merugikan Allah dan akan mendapat azab yang sangat pedih."
  },
  {
    "ayat": 178,
    "arabic": "وَلَا يَحْسَبَنَّ الَّذِيْنَ كَفَرُوْٓا اَنَّمَا نُمْلِيْ لَهُمْ خَيْرٌ لِّاَنْفُسِهِمْ ۗ اِنَّمَا نُمْلِيْ لَهُمْ لِيَزْدَادُوْٓا اِثْمًا ۚ وَلَهُمْ عَذَابٌ مُّهِيْنٌ",
    "transliteration_en": "Wa laa yahsabannal lazeena kafarooo annamaa numlee lahum khairulli anfusihim; innamaa numlee lahum liyazdaadooo ismaa wa lahum 'azaabum muheen",
    "transliteration_id": "Wa lā yaḥsabannal-lażīna  kafarū annamā numlī lahum khairul li'anfusihim, innamā numlī lahum liyazdādū iṡmā(n), wa lahum ‘ażābum muhīn(un).",
    "translation_en": "And let not those who disbelieve ever think that [because] We extend their time [of enjoyment] it is better for them. We only extend it for them so that they may increase in sin, and for them is a humiliating punishment.",
    "translation_id": "Jangan sekali-kali orang-orang kafir mengira bahwa sesungguhnya tenggang waktu yang Kami berikan kepadanya baik bagi dirinya. Sesungguhnya Kami memberinya tenggang waktu hanya agar dosa mereka makin bertambah dan mereka akan mendapat azab yang menghinakan."
  },
  {
    "ayat": 179,
    "arabic": "مَا كَانَ اللّٰهُ لِيَذَرَ الْمُؤْمِنِيْنَ عَلٰى مَآ اَنْتُمْ عَلَيْهِ حَتّٰى يَمِيْزَ الْخَبِيْثَ مِنَ الطَّيِّبِ ۗ وَمَا كَانَ اللّٰهُ لِيُطْلِعَكُمْ عَلَى الْغَيْبِ وَلٰكِنَّ اللّٰهَ يَجْتَبِيْ مِنْ رُّسُلِهٖ مَنْ يَّشَاۤءُ ۖ فَاٰمِنُوْا بِاللّٰهِ وَرُسُلِهٖ ۚ وَاِنْ تُؤْمِنُوْا وَتَتَّقُوْا فَلَكُمْ اَجْرٌ عَظِيْمٌ",
    "transliteration_en": "Maa kaanal laahu liyazaral mu'mineena 'alaa maaa antum 'alaihi hattaa yameezal khabeesa minat taiyib; wa maa kaanal laahu liyutli'akum 'alal ghaibi wa laakinnal laaha yajtabee mir Rusulihii mai yashaaa'u fa aaminoo billaahi wa Rusulih; wa in tu 'minoo wa tattaqoo falakum ajrun 'azeem",
    "transliteration_id": "Mā kānallāhu liyażaral-mu'minīna ‘alā mā antum ‘alaihi ḥattā yamīzal-khabīṡa minaṭ-ṭayyib(i), wa mā kānallāhu liyuṭli‘akum ‘alal-gaibi wa lākinnallāha yajtabī mir rusulihī may yasyā'(u), fa āminū billāhi wa rusulih(ī), wa in tu'minū wa tattaqū fa lakum ajrun ‘aẓīm(un).",
    "translation_en": "Allah would not leave the believers in that [state] you are in [presently] until He separates the evil from the good. Nor would Allah reveal to you the unseen. But [instead], Allah chooses of His messengers whom He wills, so believe in Allah and His messengers. And if you believe and fear Him, then for you is a great reward.",
    "translation_id": "Allah tidak akan membiarkan orang-orang mukmin dalam keadaan sebagaimana kamu sekarang ini, (tetapi Allah akan mengujinya) sehingga Dia membedakan yang buruk dari yang baik. Allah tidak akan memperlihatkan kepadamu hal-hal yang gaib, tetapi Allah memilih siapa yang Dia kehendaki di antara rasul-rasul-Nya. Oleh karena itu, berimanlah kepada Allah dan rasul-rasul-Nya. Jika kamu beriman dan bertakwa, kamu akan mendapat pahala yang sangat besar."
  },
  {
    "ayat": 180,
    "arabic": "وَلَا يَحْسَبَنَّ الَّذِيْنَ يَبْخَلُوْنَ بِمَآ اٰتٰىهُمُ اللّٰهُ مِنْ فَضْلِهٖ هُوَ خَيْرًا لَّهُمْ ۗ بَلْ هُوَ شَرٌّ لَّهُمْ ۗ سَيُطَوَّقُوْنَ مَا بَخِلُوْا بِهٖ يَوْمَ الْقِيٰمَةِ ۗ وَلِلّٰهِ مِيْرَاثُ السَّمٰوٰتِ وَالْاَرْضِۗ وَاللّٰهُ بِمَا تَعْمَلُوْنَ خَبِيْرٌ ࣖ",
    "transliteration_en": "Wa laa yahsabannal lazeena yabkhaloon bimaa aataahumul lahu min fadilhee huwa khairal lahum bal huwa sharrul lahum sayutaw waqoona maa bakhiloo bihee Yawmal Qiyaamah; wa lillaahi meeraasus samaawaati wal ard; wallaahu bimaa ta'maloona Khabeer",
    "transliteration_id": "Wa lā yaḥsabannal-lażīna yabkhalūna bimā ātāhumullāhu min faḍlihī huwa khairal lahum, bal huwa syarrul lahum, sayuṭawwaqūna mā bakhilū bihī yaumal-qiyāmah(ti), wa lillāhi mīrāṡus-samāwāti wal-arḍ(i), wallāhu bimā ta‘malūna khabīr(un).",
    "translation_en": "And let not those who [greedily] withhold what Allah has given them of His bounty ever think that it is better for them. Rather, it is worse for them. Their necks will be encircled by what they withheld on the Day of Resurrection. And to Allah belongs the heritage of the heavens and the earth. And Allah, with what you do, is [fully] Acquainted.",
    "translation_id": "Jangan sekali-kali orang-orang yang kikir dengan karunia yang Allah anugerahkan kepadanya mengira bahwa (kekikiran) itu baik bagi mereka. Sebaliknya, (kekikiran) itu buruk bagi mereka. Pada hari Kiamat, mereka akan dikalungi dengan sesuatu yang dengannya mereka berbuat kikir. Milik Allahlah warisan (yang ada di) langit dan di bumi. Allah Maha Teliti terhadap apa yang kamu kerjakan."
  },
  {
    "ayat": 181,
    "arabic": "لَقَدْ سَمِعَ اللّٰهُ قَوْلَ الَّذِيْنَ قَالُوْٓا اِنَّ اللّٰهَ فَقِيْرٌ وَّنَحْنُ اَغْنِيَاۤءُ ۘ سَنَكْتُبُ مَا قَالُوْا وَقَتْلَهُمُ الْاَنْۢبِيَاۤءَ بِغَيْرِ حَقٍّۙ وَّنَقُوْلُ ذُوْقُوْا عَذَابَ الْحَرِيْقِ",
    "transliteration_en": "Laqad sami'al laahu qawlal lazeena qaalooo innal laaha faqeerunw wa nahnu aghniyaaa'; sanaktubu maa qaaloo wa qatlahumul Ambiyaa'a bighairi haqqinw wa naqoolu zooqoo 'azaaba Ihreeq",
    "transliteration_id": "Laqad sami‘allāhu qaulal-lażīna qālū innallāha faqīruw wa naḥnu agniyā'(u), sanaktubu mā qālū wa qatlahumul-ambiyā'a bigairi ḥaqq(in),  wa naqūlu żūqū ‘ażābal-ḥarīq(i).",
    "translation_en": "Allah has certainly heard the statement of those [Jews] who said, \"Indeed, Allah is poor, while we are rich.\" We will record what they said and their killing of the prophets without right and will say, \"Taste the punishment of the Burning Fire.",
    "translation_id": "Sungguh, Allah benar-benar telah mendengar perkataan orang-orang (Yahudi) yang mengatakan, “Sesungguhnya Allah itu miskin dan kami kaya.” Kami akan mencatat perkataan mereka dan pembunuhan terhadap nabi-nabi yang mereka lakukan tanpa hak (alasan yang benar). Kami akan mengatakan (kepada mereka pada hari Kiamat), “Rasakanlah azab yang membakar!”"
  },
  {
    "ayat": 182,
    "arabic": "ذٰلِكَ بِمَا قَدَّمَتْ اَيْدِيْكُمْ وَاَنَّ اللّٰهَ لَيْسَ بِظَلَّامٍ لِّلْعَبِيْدِۚ",
    "transliteration_en": "Zaalika bimaa qaddamat aideekum wa annal laaha laisa bizallaamil lil'abeed",
    "transliteration_id": "Żālika bimā qaddamat aidīkum wa annallāha laisa biẓallāmil lil-‘abīd(i).",
    "translation_en": "That is for what your hands have put forth and because Allah is not ever unjust to [His] servants.\"",
    "translation_id": "Yang demikian itu disebabkan oleh perbuatan tanganmu (sendiri) dan sesungguhnya Allah (sama sekali) tidak menzalimi hamba-hamba-Nya."
  },
  {
    "ayat": 183,
    "arabic": "اَلَّذِيْنَ قَالُوْٓا اِنَّ اللّٰهَ عَهِدَ اِلَيْنَآ اَلَّا نُؤْمِنَ لِرَسُوْلٍ حَتّٰى يَأْتِيَنَا بِقُرْبَانٍ تَأْكُلُهُ النَّارُ ۗ قُلْ قَدْ جَاۤءَكُمْ رُسُلٌ مِّنْ قَبْلِيْ بِالْبَيِّنٰتِ وَبِالَّذِيْ قُلْتُمْ فَلِمَ قَتَلْتُمُوْهُمْ اِنْ كُنْتُمْ صٰدِقِيْنَ",
    "transliteration_en": "Allazeena qaalooo innal laaha 'ahida ilainaaa allaa nu'mina liRasoolin hatta yaa tiyanaa biqurbaanin taa kuluhun naar; qul qad jaaa'akum Rusulum min qablee bilbaiyinaati wa billazee qultum falima qataltumoohum in kuntum saadiqeen",
    "transliteration_id": "Al-lażīna qālū innallāha ‘ahida ilainā allā nu'mina lirasūlin ḥattā ya'tiyanā biqurbānin ta'kuluhun-nār(u), qul qad jā'akum rusulum min qablī bil-bayyināti wa bil-lażī qultum falima qataltumūhum in kuntum ṣādiqīn(a).",
    "translation_en": "[They are] those who said, \"Indeed, Allah has taken our promise not to believe any messenger until he brings us an offering which fire [from heaven] will consume.\" Say, \"There have already come to you messengers before me with clear proofs and [even] that of which you speak. So why did you kill them, if you should be truthful?\"",
    "translation_id": "(Mereka adalah) orang-orang (Yahudi) yang mengatakan, “Sesungguhnya Allah telah memerintahkan kepada kami agar kami tidak beriman kepada seorang rasul sebelum dia mendatangkan kepada kami kurban yang dimakan api (yang datang dari langit).” Katakanlah (Nabi Muhammad), “Sungguh, beberapa rasul sebelumku telah datang kepadamu dengan (membawa) bukti-bukti yang nyata dan membawa apa yang kamu sebutkan. Akan tetapi, mengapa kamu membunuh mereka jika kamu orang-orang yang benar?”"
  },
  {
    "ayat": 184,
    "arabic": "فَاِنْ كَذَّبُوْكَ فَقَدْ كُذِّبَ رُسُلٌ مِّنْ قَبْلِكَ جَاۤءُوْ بِالْبَيِّنٰتِ وَالزُّبُرِ وَالْكِتٰبِ الْمُنِيْرِ",
    "transliteration_en": "Fa in kaz zabooka faqad kuz ziba Rusulum min qablika jaaa'oo bilbaiyinaati waz Zuburi wal Kitaabil Muneer",
    "transliteration_id": "Fa in każżabūka faqad kużżiba rusulum min qablika jā'ū bil-bayyināti waz-zuburi wal-kitābil-munīr(i).",
    "translation_en": "Then if they deny you, [O Muhammad] - so were messengers denied before you, who brought clear proofs and written ordinances and the enlightening Scripture.",
    "translation_id": "Maka, jika mereka mendustakanmu (Nabi Muhammad), sungguh rasul-rasul sebelummu pun telah didustakan. Mereka datang dengan (membawa) mukjizat-mukjizat yang nyata, zubur, dan Alkitab yang memberi penjelasan yang sempurna."
  },
  {
    "ayat": 185,
    "arabic": "كُلُّ نَفْسٍ ذَاۤىِٕقَةُ الْمَوْتِۗ وَاِنَّمَا تُوَفَّوْنَ اُجُوْرَكُمْ يَوْمَ الْقِيٰمَةِ ۗ فَمَنْ زُحْزِحَ عَنِ النَّارِ وَاُدْخِلَ الْجَنَّةَ فَقَدْ فَازَ ۗ وَمَا الْحَيٰوةُ الدُّنْيَآ اِلَّا مَتَاعُ الْغُرُوْرِ",
    "transliteration_en": "Kulu nafsin zaaa'iqatul mawt; wa innamaa tuwaffawna ujoorakum Yawmal Qiyaamati faman zuhziha 'anin Naari waudkhilal Jannata faqad faaz; wa mal hayaatud dunyaaa illaa mataa'ul ghuroor",
    "transliteration_id": "Kullu nafsin żā'iqatul-maut(i), wa innamā tuwaffauna ujūrakum yaumal-qiyāmah(ti),  faman zuḥziḥa  ‘anin-nāri wa udkhilal-jannata faqad fāz(a), wa mal-ḥayātud-dun-yā illā matā‘ul-gurūr(i).",
    "translation_en": "Every soul will taste death, and you will only be given your [full] compensation on the Day of Resurrection. So he who is drawn away from the Fire and admitted to Paradise has attained [his desire]. And what is the life of this world except the enjoyment of delusion.",
    "translation_id": "Setiap yang bernyawa akan merasakan mati. Hanya pada hari Kiamat sajalah diberikan dengan sempurna balasanmu. Siapa yang dijauhkan dari neraka dan dimasukkan ke dalam surga, sungguh dia memperoleh kemenangan. Kehidupan dunia hanyalah kesenangan yang memperdaya."
  },
  {
    "ayat": 186,
    "arabic": "۞ لَتُبْلَوُنَّ فِيْٓ اَمْوَالِكُمْ وَاَنْفُسِكُمْۗ وَلَتَسْمَعُنَّ مِنَ الَّذِيْنَ اُوْتُوا الْكِتٰبَ مِنْ قَبْلِكُمْ وَمِنَ الَّذِيْنَ اَشْرَكُوْٓا اَذًى كَثِيْرًا ۗ وَاِنْ تَصْبِرُوْا وَتَتَّقُوْا فَاِنَّ ذٰلِكَ مِنْ عَزْمِ الْاُمُوْرِ",
    "transliteration_en": "Latublawunna feee amwaalikum wa anfusikum wa latasma'unna minal lazeena ootul Kitaaba min qablikum wa minal lazeena ashrakooo azan kaseeraa; wa in tasbiroo wa tattaqoo fa inna zaalika min 'azmil umoor",
    "transliteration_id": "Latublawunna fī amwālikum wa anfusikum, wa latasma‘unna minal-lażīna ūtul-kitāba min qablikum wa minal-lażīna  asyrakū ażan kaṡīrā(n), wa in taṣbirū wa tattaqū fa inna żālika min ‘azmil-umūr(i).",
    "translation_en": "You will surely be tested in your possessions and in yourselves. And you will surely hear from those who were given the Scripture before you and from those who associate others with Allah much abuse. But if you are patient and fear Allah - indeed, that is of the matters [worthy] of determination.",
    "translation_id": "Kamu pasti akan diuji dalam (urusan) hartamu dan dirimu. Kamu pun pasti akan mendengar banyak hal yang sangat menyakitkan hati dari orang-orang yang diberi Alkitab sebelum kamu dan dari orang-orang musyrik. Jika kamu bersabar dan bertakwa, sesungguhnya yang demikian itu termasuk urusan yang (patut) diutamakan."
  },
  {
    "ayat": 187,
    "arabic": "وَاِذْ اَخَذَ اللّٰهُ مِيْثَاقَ الَّذِيْنَ اُوْتُوا الْكِتٰبَ لَتُبَيِّنُنَّهٗ لِلنَّاسِ وَلَا تَكْتُمُوْنَهٗۖ فَنَبَذُوْهُ وَرَاۤءَ ظُهُوْرِهِمْ وَاشْتَرَوْا بِهٖ ثَمَنًا قَلِيْلًا ۗ فَبِئْسَ مَا يَشْتَرُوْنَ",
    "transliteration_en": "Wa iz akhazal laahu meesaaqal lazeena ootul Kitaaba latubaiyinunnahoo linnaasi wa laa taktumoona hoo fanabazoohu waraaa'a zuhoorihim washtaraw bihee samanan qaleelan fabi'sa maa yashtaroon",
    "transliteration_id": "Wa iż akhażallāhu mīṡāqal-lażīna ūtul-kitāba latubayyinunnahū lin-nāsi wa lā taktumūnah(ū),  fa nabażūhu warā'a ẓuhūrihim wasytarau bihī ṡamanan qalīlā(n), fa bi'sa mā yasytarūn(a).",
    "translation_en": "And [mention, O Muhammad], when Allah took a covenant from those who were given the Scripture, [saying], \"You must make it clear to the people and not conceal it.\" But they threw it away behind their backs and exchanged it for a small price. And wretched is that which they purchased.",
    "translation_id": "(Ingatlah) ketika Allah membuat perjanjian dengan orang-orang yang telah diberi Alkitab (dengan berfirman), “Hendaklah kamu benar-benar menerangkan (isi Alkitab itu) kepada manusia dan janganlah kamu menyembunyikannya.” Lalu, mereka melemparkannya (janji itu) ke belakang punggung mereka (mengabaikannya) dan menukarnya dengan harga yang murah. Maka, itulah seburuk-buruk jual beli yang mereka lakukan."
  },
  {
    "ayat": 188,
    "arabic": "لَا تَحْسَبَنَّ الَّذِيْنَ يَفْرَحُوْنَ بِمَآ اَتَوْا وَّيُحِبُّوْنَ اَنْ يُّحْمَدُوْا بِمَا لَمْ يَفْعَلُوْا فَلَا تَحْسَبَنَّهُمْ بِمَفَازَةٍ مِّنَ الْعَذَابِۚ وَلَهُمْ عَذَابٌ اَلِيْمٌ",
    "transliteration_en": "Laa tahsabannal lazeena yafrahoona bimaaa ataw wa yuhibbona ai yuhmadoo bimaa lam yaf'aloo falaa tahsabunnahum bimafaazatim minal 'azaabi wa lahum 'azaabun aleem",
    "transliteration_id": "Lā taḥsabannal-lażīna yafraḥūna bimā atau  wa yuḥibbūna ay yuḥmadū bimā lam yaf‘alū falā taḥsabannahum bimafāzatim minal-‘ażāb(i), wa lahum ‘ażābun alīm(un).",
    "translation_en": "And never think that those who rejoice in what they have perpetrated and like to be praised for what they did not do - never think them [to be] in safety from the punishment, and for them is a painful punishment.",
    "translation_id": "Jangan sekali-kali kamu mengira bahwa orang yang gembira dengan apa (perbuatan buruk) yang telah mereka kerjakan dan suka dipuji atas perbuatan (yang mereka anggap baik) yang tidak mereka lakukan, kamu jangan sekali-kali mengira bahwa mereka akan lolos dari azab. Mereka akan mendapat azab yang sangat pedih."
  },
  {
    "ayat": 189,
    "arabic": "وَلِلّٰهِ مُلْكُ السَّمٰوٰتِ وَالْاَرْضِۗ وَاللّٰهُ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ ࣖ",
    "transliteration_en": "Wa lillaahi mulkus samaawaati wal ard; wallaahu 'alaa kulli shai'in Qadeer",
    "transliteration_id": "Wa lillāhi mulkus-samāwāti wal-arḍ(i), wallāhu ‘alā kulli syai'in qadīr(un).",
    "translation_en": "And to Allah belongs the dominion of the heavens and the earth, and Allah is over all things competent.",
    "translation_id": "Milik Allahlah kerajaan langit dan bumi. Allah Maha Kuasa atas segala sesuatu."
  },
  {
    "ayat": 190,
    "arabic": "اِنَّ فِيْ خَلْقِ السَّمٰوٰتِ وَالْاَرْضِ وَاخْتِلَافِ الَّيْلِ وَالنَّهَارِ لَاٰيٰتٍ لِّاُولِى الْاَلْبَابِۙ",
    "transliteration_en": "Inna fee khalqis samaawati wal ardi wakhtilaafil laili wannahaari la Aayaatil liulil albaab",
    "transliteration_id": "Inna fī khalqis-samāwāti wal-arḍi wakhtilāfil-laili wan-nahāri la'āyātil li'ulil-albāb(i).",
    "translation_en": "Indeed, in the creation of the heavens and the earth and the alternation of the night and the day are signs for those of understanding.",
    "translation_id": "Sesungguhnya dalam penciptaan langit dan bumi serta pergantian malam dan siang terdapat tanda-tanda (kebesaran Allah) bagi orang yang berakal,"
  },
  {
    "ayat": 191,
    "arabic": "الَّذِيْنَ يَذْكُرُوْنَ اللّٰهَ قِيَامًا وَّقُعُوْدًا وَّعَلٰى جُنُوْبِهِمْ وَيَتَفَكَّرُوْنَ فِيْ خَلْقِ السَّمٰوٰتِ وَالْاَرْضِۚ رَبَّنَا مَا خَلَقْتَ هٰذَا بَاطِلًاۚ سُبْحٰنَكَ فَقِنَا عَذَابَ النَّارِ",
    "transliteration_en": "Allazeena yazkuroonal laaha qiyaamaiw-wa qu'oodanw-wa 'alaa juno obihim wa yatafakkaroona fee khalqis samaawaati wal ardi Rabbanaa maa khalaqta haaza baatilan Subhaanak faqinaa 'azaaban Naar",
    "transliteration_id": "Al-lażīna yażkurūnallāha qiyāmaw wa qu‘ūdaw wa ‘alā junūbihim wa yatafakkarūna fi khalqis-samāwāti wal-arḍ(i), rabbanā mā khalaqta hāżā bāṭilā(n), subḥānaka fa qinā ‘ażāban-nār(i).",
    "translation_en": "Who remember Allah while standing or sitting or [lying] on their sides and give thought to the creation of the heavens and the earth, [saying], \"Our Lord, You did not create this aimlessly; exalted are You [above such a thing]; then protect us from the punishment of the Fire.",
    "translation_id": "(yaitu) orang-orang yang mengingat Allah sambil berdiri, duduk, atau dalam keadaan berbaring, dan memikirkan tentang penciptaan langit dan bumi (seraya berkata), “Ya Tuhan kami, tidaklah Engkau menciptakan semua ini sia-sia. Maha Suci Engkau. Lindungilah kami dari azab neraka."
  },
  {
    "ayat": 192,
    "arabic": "رَبَّنَآ اِنَّكَ مَنْ تُدْخِلِ النَّارَ فَقَدْ اَخْزَيْتَهٗ ۗ وَمَا لِلظّٰلِمِيْنَ مِنْ اَنْصَارٍ",
    "transliteration_en": "Rabbanaaa innaka man tudkhilin Naara faqad akhzai tahoo wa maa lizzaalimeena min ansaar",
    "transliteration_id": "Rabbanā innaka man tudkhilin-nāra faqad akhzaitah(ū), wa mā liẓ-ẓālimīna min anṣār(in).",
    "translation_en": "Our Lord, indeed whoever You admit to the Fire - You have disgraced him, and for the wrongdoers there are no helpers.",
    "translation_id": "Ya Tuhan kami, sesungguhnya orang yang Engkau masukkan ke dalam neraka, maka Engkau benar-benar telah menghinakannya dan tidak ada seorang penolong pun bagi orang yang zalim."
  },
  {
    "ayat": 193,
    "arabic": "رَبَّنَآ اِنَّنَا سَمِعْنَا مُنَادِيًا يُّنَادِيْ لِلْاِيْمَانِ اَنْ اٰمِنُوْا بِرَبِّكُمْ فَاٰمَنَّا ۖرَبَّنَا فَاغْفِرْ لَنَا ذُنُوْبَنَا وَكَفِّرْ عَنَّا سَيِّاٰتِنَا وَتَوَفَّنَا مَعَ الْاَبْرَارِۚ",
    "transliteration_en": "Rabbanaaa innanaa sami'naa munaadiyai yunaadee lil eemaani an aaminoo bi Rabbikum fa aamannaa; Rabbanaa faghfir lanaa zunoobanaa wa kaffir 'annaa saiyi aatina wa tawaffanaa ma'al abraar",
    "transliteration_id": "Rabbanā innanā sami‘nā munādiyay yunādī lil-īmāni an āminū birabbikum fa āmannā, rabbanā fagfir lanā żunūbanā wa kaffir ‘annā sayyi'ātinā wa tawaffanā ma‘al-abrār(i).",
    "translation_en": "Our Lord, indeed we have heard a caller calling to faith, [saying], 'Believe in your Lord,' and we have believed. Our Lord, so forgive us our sins and remove from us our misdeeds and cause us to die with the righteous.",
    "translation_id": "Ya Tuhan kami, sesungguhnya kami mendengar orang yang menyeru pada keimanan, yaitu ‘Berimanlah kamu kepada Tuhanmu,’ maka kami pun beriman. Ya Tuhan kami, ampunilah dosa-dosa kami, hapuskanlah kesalahan-kesalahan kami, dan wafatkanlah kami beserta orang-orang yang selalu berbuat kebaikan."
  },
  {
    "ayat": 194,
    "arabic": "رَبَّنَا وَاٰتِنَا مَا وَعَدْتَّنَا عَلٰى رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ الْقِيٰمَةِ ۗ اِنَّكَ لَا تُخْلِفُ الْمِيْعَادَ",
    "transliteration_en": "Rabbanaa wa aatinaa maa wa'attanaa 'alaa Rusulika wa laa tukhzinaa Yawmal Qiyaamah; innaka laa tukhliful mee'aad",
    "transliteration_id": "Rabbanā wa ātinā mā wa‘attanā ‘alā rusulika  wa lā tukhzinā  yaumal-qiyāmah(ti), innaka lā tukhliful-mī‘ād(a).",
    "translation_en": "Our Lord, and grant us what You promised us through Your messengers and do not disgrace us on the Day of Resurrection. Indeed, You do not fail in [Your] promise.\"",
    "translation_id": "Ya Tuhan kami, anugerahilah kami apa yang telah Engkau janjikan kepada kami melalui rasul-rasul-Mu dan janganlah Engkau hinakan kami pada hari Kiamat. Sesungguhnya Engkau tidak pernah mengingkari janji.”"
  },
  {
    "ayat": 195,
    "arabic": "فَاسْتَجَابَ لَهُمْ رَبُّهُمْ اَنِّيْ لَآ اُضِيْعُ عَمَلَ عَامِلٍ مِّنْكُمْ مِّنْ ذَكَرٍ اَوْ اُنْثٰى ۚ بَعْضُكُمْ مِّنْۢ بَعْضٍ ۚ فَالَّذِيْنَ هَاجَرُوْا وَاُخْرِجُوْا مِنْ دِيَارِهِمْ وَاُوْذُوْا فِيْ سَبِيْلِيْ وَقٰتَلُوْا وَقُتِلُوْا لَاُكَفِّرَنَّ عَنْهُمْ سَيِّاٰتِهِمْ وَلَاُدْخِلَنَّهُمْ جَنّٰتٍ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُۚ ثَوَابًا مِّنْ عِنْدِ اللّٰهِ ۗ وَاللّٰهُ عِنْدَهٗ حُسْنُ الثَّوَابِ",
    "transliteration_en": "Fastajaaba lahum Rabbuhum annee laaa Udee'u 'amala 'aamilim minkum min zakarin aw unsaa ba'dukum mim ba'din fal lazeena haajaroo wa ukhrijoo min diyaarihim wa oozoo fee sabeelee wa qaataloo wa qutiloo la ukaffiranna 'anhum saiyi aatihim wa la udkhilanna hum Jannnatin tajree min tahtihal anhaaru sawaabam min 'indil laah; wallaahu 'indahoo husnus sawaab",
    "transliteration_id": "Fastajāba lahum rabbuhum annī lā uḍī‘u ‘amala ‘āmilim minkum min żakarin au unṡā, ba‘ḍukum mim ba‘ḍ(in), fal-lażīna hājarū wa ukhrijū min diyārihim wa ūżū fī sabīlī wa qātalū wa qutilū la'ukaffiranna ‘anhum sayyi'ātihim wa la udkhilannahum jannātin tajrī min taḥtihal-anhār(u), ṡawābam min ‘indillāh(i), wallāhu ‘indahū ḥusnuṡ-ṡawāb(i).",
    "translation_en": "And their Lord responded to them, \"Never will I allow to be lost the work of [any] worker among you, whether male or female; you are of one another. So those who emigrated or were evicted from their homes or were harmed in My cause or fought or were killed - I will surely remove from them their misdeeds, and I will surely admit them to gardens beneath which rivers flow as reward from Allah, and Allah has with Him the best reward.\"",
    "translation_id": "Maka, Tuhan mereka memperkenankan permohonannya (dengan berfirman), “Sesungguhnya Aku tidak menyia-nyiakan perbuatan orang yang beramal di antara kamu, baik laki-laki maupun perempuan, (karena) sebagian kamu adalah (keturunan) dari sebagian yang lain. Maka, orang-orang yang berhijrah, diusir dari kampung halamannya, disakiti pada jalan-Ku, berperang, dan terbunuh, pasti akan Aku hapus kesalahan mereka dan pasti Aku masukkan mereka ke dalam surga-surga yang mengalir di bawahnya sungai-sungai sebagai pahala dari Allah. Di sisi Allahlah ada pahala yang baik.”"
  },
  {
    "ayat": 196,
    "arabic": "لَا يَغُرَّنَّكَ تَقَلُّبُ الَّذِيْنَ كَفَرُوْا فِى الْبِلَادِۗ",
    "transliteration_en": "Laa yaghurrannaka taqal lubul lazeena kafaroo fil bilaad",
    "transliteration_id": "Lā yagurrannaka taqallubul-lażīna kafarū fil-bilād(i).",
    "translation_en": "Be not deceived by the [uninhibited] movement of the disbelievers throughout the land.",
    "translation_id": "Jangan sekali-kali kamu teperdaya oleh bolak-balik perjalanan orang-orang yang kufur di seluruh negeri."
  },
  {
    "ayat": 197,
    "arabic": "مَتَاعٌ قَلِيْلٌ  ۗ ثُمَّ مَأْوٰىهُمْ جَهَنَّمُ ۗوَبِئْسَ الْمِهَادُ",
    "transliteration_en": "Mataa'un qaleelun summa maawaahum Jahannam; wa bi'sal mihaad",
    "transliteration_id": "Matā‘un qalīl(un), ṡumma ma'wāhum jahannam(u), wa bi'sal-mihād(u).",
    "translation_en": "[It is but] a small enjoyment; then their [final] refuge is Hell, and wretched is the resting place.",
    "translation_id": "(Semua itu hanyalah) kesenangan sementara, kemudian tempat kembali mereka ialah (neraka) Jahanam. Itulah seburuk-buruk tempat tinggal."
  },
  {
    "ayat": 198,
    "arabic": "لٰكِنِ الَّذِيْنَ اتَّقَوْا رَبَّهُمْ لَهُمْ جَنّٰتٌ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُ خٰلِدِيْنَ فِيْهَا نُزُلًا مِّنْ عِنْدِ اللّٰهِ ۗ وَمَا عِنْدَ اللّٰهِ خَيْرٌ لِّلْاَبْرَارِ",
    "transliteration_en": "Laakinil lazeenat taqaw Rabbahum lahum Jannnaatun tajree min tahtihal anhaaru khaalideena feehaa nuzulammin 'indil laah; wa maa 'indal laahi khairul lil abraar",
    "transliteration_id": "Lākinil-lażīnattaqau rabbahum lahum jannātun tajrī min taḥtihal-anhāru khālidīna fīhā nuzulam min ‘indillāh(i), wa mā ‘indallāhi khairul lil-abrār(i).",
    "translation_en": "But those who feared their Lord will have gardens beneath which rivers flow, abiding eternally therein, as accommodation from Allah. And that which is with Allah is best for the righteous.",
    "translation_id": "Akan tetapi, orang-orang yang bertakwa kepada Tuhannya, mereka akan mendapat surga-surga yang mengalir di bawahnya sungai-sungai dan mereka kekal di dalamnya sebagai karunia dari Allah. Apa yang di sisi Allah itu lebih baik bagi orang-orang yang selalu berbuat baik."
  },
  {
    "ayat": 199,
    "arabic": "وَاِنَّ مِنْ اَهْلِ الْكِتٰبِ لَمَنْ يُّؤْمِنُ بِاللّٰهِ وَمَآ اُنْزِلَ اِلَيْكُمْ وَمَآ اُنْزِلَ اِلَيْهِمْ خٰشِعِيْنَ لِلّٰهِ ۙ لَا يَشْتَرُوْنَ بِاٰيٰتِ اللّٰهِ ثَمَنًا قَلِيْلًا ۗ اُولٰۤىِٕكَ لَهُمْ اَجْرُهُمْ عِنْدَ رَبِّهِمْ ۗ اِنَّ اللّٰهَ سَرِيْعُ الْحِسَابِ",
    "transliteration_en": "Wa inna min Ahlil Kitaabi lamai yu minu billaahi wa maaa unzila ilaikum wa maaa unzila ilaihim khaashi 'eena lillaahi laa yashtaroona bi Aayaatil laahi samanan qaleelaa; ulaaa'ika lahum ajruhum 'inda Rabbihim; innal laaha saree'ul hisaab",
    "transliteration_id": "Wa inna min ahlil-kitābi lamay yu'minu billāhi wa mā unzila ilaikum wa mā unzila ilaihim khāsyi‘īna lillāh(i), lā yasytarūna bi'āyātillāhi ṡamanan qalīlā(n), ulā'ika lahum ajruhum ‘inda rabbihim, innallāha sarī‘ul-ḥisāb(i).",
    "translation_en": "And indeed, among the People of the Scripture are those who believe in Allah and what was revealed to you and what was revealed to them, [being] humbly submissive to Allah. They do not exchange the verses of Allah for a small price. Those will have their reward with their Lord. Indeed, Allah is swift in account.",
    "translation_id": "Sesungguhnya di antara Ahlulkitab ada yang beriman kepada Allah dan pada apa yang diturunkan kepada kamu dan yang diturunkan kepada mereka. Mereka berendah hati kepada Allah dan tidak menukarkan ayat-ayat Allah dengan harga murah. Mereka itu memperoleh pahala di sisi Tuhannya. Sesungguhnya Allah Maha Cepat perhitungan-Nya."
  },
  {
    "ayat": 200,
    "arabic": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوا اصْبِرُوْا وَصَابِرُوْا وَرَابِطُوْاۗ وَاتَّقُوا اللّٰهَ لَعَلَّكُمْ تُفْلِحُوْنَ ࣖ",
    "transliteration_en": "Yaaa aiyuhal lazeena aamanus biroo wa saabiroo wa raabitoo wattaqul laaha la'allakum tuflihoon",
    "transliteration_id": "Yā ayyuhal-lażīna āmanuṣbirū wa ṣābirū wa rabiṭū, wattaqullāha la‘allakum tufliḥūn(a).",
    "translation_en": "O you who have believed, persevere and endure and remain stationed and fear Allah that you may be successful.",
    "translation_id": "Wahai orang-orang yang beriman, bersabarlah kamu, kuatkanlah kesabaranmu, tetaplah bersiap siaga di perbatasan (negerimu), dan bertakwalah kepada Allah agar kamu beruntung."
  }
]