[
  {
    "ayat": 101,
    "arabic": "وَكَيْفَ تَكْفُرُوْنَ وَاَنْتُمْ تُتْلٰى عَلَيْكُمْ اٰيٰتُ اللّٰهِ وَفِيْكُمْ رَسُوْلُهٗ ۗ وَمَنْ يَّعْتَصِمْ بِاللّٰهِ فَقَدْ هُدِيَ اِلٰى صِرَاطٍ مُّسْتَقِيْمٍ ࣖ",
    "transliteration_en": "Wa kaifa takfuroona wa antum tutlaa 'alaikum Aayaatul laahi wa feekum Rasooluh; wa mai ya'tasim baillaahi faqad hudiya ilaa Siraatim Mustaqeem",
    "transliteration_id": "Wa kaifa takfurūna wa antum tutlā ‘alaikum āyātullāhi wa fīkum rasūluh(ū), wa may ya‘taṣim billāhi faqad hudiya ilā ṣirāṭim mustaqīm(in).",
    "translation_en": "And how could you disbelieve while to you are being recited the verses of Allah and among you is His Messenger? And whoever holds firmly to Allah has [indeed] been guided to a straight path.",
    "translation_id": "Bagaimana kamu (sampai) menjadi kafir, padahal ayat-ayat Allah dibacakan kepada kamu dan Rasul-Nya (Nabi Muhammad) pun berada di tengah-tengah kamu? Siapa yang berpegang teguh pada (agama) Allah, sungguh dia telah diberi petunjuk ke jalan yang lurus."
  },
  {
    "ayat": 102,
    "arabic": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوا اتَّقُوا اللّٰهَ حَقَّ تُقٰىتِهٖ وَلَا تَمُوْتُنَّ اِلَّا وَاَنْتُمْ مُّسْلِمُوْنَ",
    "transliteration_en": "Yaaa ayyuhal lazeena aamanut taqul laaha haqqa tuqaatihee wa laa tamoontunna illaa wa antum muslimoon",
    "transliteration_id": "Yā ayyuhal-lażīna āmanuttaqullāha ḥaqqa tuqātihī wa lā tamūtunna illā wa antum muslimūn(a).",
    "translation_en": "O you who have believed, fear Allah as He should be feared and do not die except as Muslims [in submission to Him].",
    "translation_id": "Wahai orang-orang yang beriman, bertakwalah kepada Allah dengan sebenar-benar takwa kepada-Nya dan janganlah kamu mati kecuali dalam keadaan muslim."
  },
  {
    "ayat": 103,
    "arabic": "وَاعْتَصِمُوْا بِحَبْلِ اللّٰهِ جَمِيْعًا وَّلَا تَفَرَّقُوْا ۖوَاذْكُرُوْا نِعْمَتَ اللّٰهِ عَلَيْكُمْ اِذْ كُنْتُمْ اَعْدَاۤءً فَاَلَّفَ بَيْنَ قُلُوْبِكُمْ فَاَصْبَحْتُمْ بِنِعْمَتِهٖٓ اِخْوَانًاۚ وَكُنْتُمْ عَلٰى شَفَا حُفْرَةٍ مِّنَ النَّارِ فَاَنْقَذَكُمْ مِّنْهَا ۗ كَذٰلِكَ يُبَيِّنُ اللّٰهُ لَكُمْ اٰيٰتِهٖ لَعَلَّكُمْ تَهْتَدُوْنَ",
    "transliteration_en": "Wa'tasimoo bi Hablil laahi jamee'anw wa laa tafarraqoo; wazkuroo ni'matal laahi alaikum iz kuntum a'daaa'an fa allafa baina quloobikum fa asbah tum bini'matiheee ikhwaananw wa kuntum 'alaa shafaa hufratim minan Naari fa anqazakum minhaa; kazaalika yubaiyinul laahu lakum aayaatihee la'allakum tahtadoon",
    "transliteration_id": "Wa‘taṣimū biḥablillāhi jamī‘aw wa lā tafarraqū, ważkurū ni‘matallāhi ‘alaikum iż kuntum a‘dā'an fa allafa baina qulūbikum fa aṣbaḥtum bi ni‘matihī ikhwānā(n), wa kuntum ‘alā syafā ḥufratim minan-nāri fa anqażakum minhā, każālika yubayyinullāhu lakum āyātihī la‘allakum tahtadūn(a).",
    "translation_en": "And hold firmly to the rope of Allah all together and do not become divided. And remember the favor of Allah upon you - when you were enemies and He brought your hearts together and you became, by His favor, brothers. And you were on the edge of a pit of the Fire, and He saved you from it. Thus does Allah make clear to you His verses that you may be guided.",
    "translation_id": "Berpegangteguhlah kamu semuanya pada tali (agama) Allah, janganlah bercerai berai, dan ingatlah nikmat Allah kepadamu ketika kamu dahulu bermusuhan, lalu Allah mempersatukan hatimu sehingga dengan karunia-Nya kamu menjadi bersaudara. (Ingatlah pula ketika itu) kamu berada di tepi jurang neraka, lalu Allah menyelamatkan kamu dari sana. Demikianlah Allah menerangkan ayat-ayat-Nya kepadamu agar kamu mendapat petunjuk."
  },
  {
    "ayat": 104,
    "arabic": "وَلْتَكُنْ مِّنْكُمْ اُمَّةٌ يَّدْعُوْنَ اِلَى الْخَيْرِ وَيَأْمُرُوْنَ بِالْمَعْرُوْفِ وَيَنْهَوْنَ عَنِ الْمُنْكَرِ ۗ وَاُولٰۤىِٕكَ هُمُ الْمُفْلِحُوْنَ",
    "transliteration_en": "Waltakum minkum ummatuny yad'oona ilal khairi wa yaamuroona bilma 'roofi wa yanhawna 'anil munkar; wa ulaaa'ika humul muflihoon",
    "transliteration_id": "Waltakum minkum ummatuy yad‘ūna ilal-khairi wa ya'murūna bil-ma‘rūfi wa yanhauna ‘anil-munkar(i), wa ulā'ika humul-mufliḥūn(a).",
    "translation_en": "And let there be [arising] from you a nation inviting to [all that is] good, enjoining what is right and forbidding what is wrong, and those will be the successful.",
    "translation_id": "Hendaklah ada di antara kamu segolongan orang yang menyeru kepada kebajikan, menyuruh (berbuat) yang makruf, dan mencegah dari yang mungkar. Mereka itulah orang-orang yang beruntung."
  },
  {
    "ayat": 105,
    "arabic": "وَلَا تَكُوْنُوْا كَالَّذِيْنَ تَفَرَّقُوْا وَاخْتَلَفُوْا مِنْۢ بَعْدِ مَا جَاۤءَهُمُ الْبَيِّنٰتُ ۗ وَاُولٰۤىِٕكَ لَهُمْ عَذَابٌ عَظِيْمٌ ۙ",
    "transliteration_en": "Wa laa takoonoo kallazeena tafarraqoo wakhtalafoo mim ba'di maa jaaa'ahumul baiyinaat; wa ulaaa'ika lahum 'azaabun 'azeem",
    "transliteration_id": "Wa lā takūnū kal-lażīna tafarraqū wakhtalafū mim ba‘di mā jā'ahumul-bayyināt(u), wa ulā'ika lahum ‘ażābun ‘aẓīm(un).",
    "translation_en": "And do not be like the ones who became divided and differed after the clear proofs had come to them. And those will have a great punishment.",
    "translation_id": "Janganlah kamu menjadi seperti orang-orang yang bercerai-berai dan berselisih setelah sampai kepada mereka keterangan yang jelas. Mereka itulah orang-orang yang mendapat azab yang sangat berat."
  },
  {
    "ayat": 106,
    "arabic": "يَّوْمَ تَبْيَضُّ وُجُوْهٌ وَّتَسْوَدُّ وُجُوْهٌ ۚ فَاَمَّا الَّذِيْنَ اسْوَدَّتْ وُجُوْهُهُمْۗ  اَ كَفَرْتُمْ بَعْدَ اِيْمَانِكُمْ فَذُوْقُوا الْعَذَابَ بِمَا كُنْتُمْ تَكْفُرُوْنَ",
    "transliteration_en": "Yawma tabyaddu wujoohunw wa taswaddu wujooh; faammal lazeenas waddat wujoohum akafartum ba'da eemaanikum fazooqul 'azaaba bimaa kuntum takfuroon",
    "transliteration_id": "Yauma tabyaḍḍu wujūhuw wa taswaddu wujūh(un), fa ammal-lażīnaswaddat wujūhuhum, akafartum ba‘da īmānikum fa żūqul-‘ażāba bimā kuntum takfurūn(a).",
    "translation_en": "On the Day [some] faces will turn white and [some] faces will turn black. As for those whose faces turn black, [to them it will be said], \"Did you disbelieve after your belief? Then taste the punishment for what you used to reject.\"",
    "translation_id": "(Azab itu terjadi) pada hari ketika ada wajah yang putih berseri dan ada pula wajah yang hitam kusam. Adapun orang-orang yang berwajah hitam kusam (kepada mereka dikatakan), “Mengapa kamu kafir setelah beriman? Oleh karena itu, rasakanlah azab yang disebabkan kekafiranmu.”"
  },
  {
    "ayat": 107,
    "arabic": "وَاَمَّا الَّذِيْنَ ابْيَضَّتْ وُجُوْهُهُمْ فَفِيْ رَحْمَةِ اللّٰهِ ۗ هُمْ فِيْهَا خٰلِدُوْنَ",
    "transliteration_en": "Wa ammal lazeenabyadd at wujoohuhum fafee rahmatil laahi hum feehaa khaalidoon",
    "transliteration_id": "Wa ammal lażīnabyaḍḍat wujūhuhum fafī raḥmatillāh(i), hum fīhā khālidūn(a).",
    "translation_en": "But as for those whose faces will turn white, [they will be] within the mercy of Allah. They will abide therein eternally.",
    "translation_id": "Adapun orang-orang yang berwajah putih berseri, mereka berada dalam rahmat Allah (surga). Mereka kekal di dalamnya."
  },
  {
    "ayat": 108,
    "arabic": "تِلْكَ اٰيٰتُ اللّٰهِ نَتْلُوْهَا عَلَيْكَ بِالْحَقِّ ۗ وَمَا اللّٰهُ يُرِيْدُ ظُلْمًا لِّلْعٰلَمِيْنَ",
    "transliteration_en": "Tilka Aayaatul laahi natloohaa 'alaika bilhaqq; wa mal laahu yureedu zulmallil 'aalameen",
    "transliteration_id": "Tilka āyātullāhi natlūhā ‘alaika bil-ḥaqq(i), wa mallāhu yurīdu ẓulmal lil-‘ālamīn(a).",
    "translation_en": "These are the verses of Allah. We recite them to you, [O Muhammad], in truth; and Allah wants no injustice to the worlds.",
    "translation_id": "Itulah ayat-ayat Allah yang Kami bacakan kepadamu dengan benar dan tidaklah Allah berkehendak melakukan kezaliman pada semesta alam."
  },
  {
    "ayat": 109,
    "arabic": "وَلِلّٰهِ مَا فِى السَّمٰوٰتِ وَمَا فِى الْاَرْضِ ۗوَاِلَى اللّٰهِ تُرْجَعُ الْاُمُوْرُ ࣖ",
    "transliteration_en": "Wa lillaahi maa fissamaawaati wa maa fil ard; wa ilal laahi turja;ul umoor",
    "transliteration_id": "Wa lillāhi mā fis-samāwāti wa mā fil-arḍ(i), wa ilallāhi turja‘ul-umūr(u).",
    "translation_en": "To Allah belongs whatever is in the heavens and whatever is on the earth. And to Allah will [all] matters be returned.",
    "translation_id": "Milik Allahlah apa yang ada di langit dan apa yang ada di bumi dan hanya kepada Allah segala urusan dikembalikan."
  },
  {
    "ayat": 110,
    "arabic": "كُنْتُمْ خَيْرَ اُمَّةٍ اُخْرِجَتْ لِلنَّاسِ تَأْمُرُوْنَ بِالْمَعْرُوْفِ وَتَنْهَوْنَ عَنِ الْمُنْكَرِ وَتُؤْمِنُوْنَ بِاللّٰهِ ۗ وَلَوْ اٰمَنَ اَهْلُ الْكِتٰبِ لَكَانَ خَيْرًا لَّهُمْ ۗ مِنْهُمُ الْمُؤْمِنُوْنَ وَاَكْثَرُهُمُ الْفٰسِقُوْنَ",
    "transliteration_en": "Kuntum khaira ummatin ukhrijat linnaasi taamuroona bilma'roofi wa tanhawna 'anil munkari wa tu'minoona billaah; wa law aamana Ahlul Kitaabi lakaana khairal lahum minhumul mu'minoona wa aksaruhumul faasiqoon",
    "transliteration_id": "Kuntum khaira ummatin ukhrijat lin-nāsi ta'murūna bil-ma‘rūfi wa tanhauna ‘anil-munkari wa tu'minūna billāh(i), wa lau āmana ahlul-kitābi lakāna khairal lahum, minhumul-mu'minūna wa akṡaruhumul-fāsiqūn(a).",
    "translation_en": "You are the best nation produced [as an example] for mankind. You enjoin what is right and forbid what is wrong and believe in Allah. If only the People of the Scripture had believed, it would have been better for them. Among them are believers, but most of them are defiantly disobedient.",
    "translation_id": "Kamu (umat Islam) adalah umat terbaik yang dilahirkan untuk manusia (selama) kamu menyuruh (berbuat) yang makruf, mencegah dari yang mungkar, dan beriman kepada Allah. Seandainya Ahlulkitab beriman, tentulah itu lebih baik bagi mereka. Di antara mereka ada yang beriman dan kebanyakan mereka adalah orang-orang fasik."
  },
  {
    "ayat": 111,
    "arabic": "لَنْ يَّضُرُّوْكُمْ اِلَّآ اَذًىۗ  وَاِنْ يُّقَاتِلُوْكُمْ يُوَلُّوْكُمُ الْاَدْبَارَۗ  ثُمَّ لَا يُنْصَرُوْنَ",
    "transliteration_en": "Lai yadurrookum 'illaaa azanw wa ai yuqaatilookum yuwallookumul adbaara summa laa yunsaroon",
    "transliteration_id": "Lay yaḍurrūkum illā ażā(n), wa iy yuqātilūkum yuwallūkumul-adbār(a), ṡumma lā yunṣarūn(a).",
    "translation_en": "They will not harm you except for [some] annoyance. And if they fight you, they will show you their backs; then they will not be aided.",
    "translation_id": "Mereka tidak akan membahayakanmu, kecuali gangguan-gangguan kecil saja. Jika mereka memerangi kamu, niscaya mereka berbalik ke belakang (kalah), kemudian mereka tidak mendapat pertolongan."
  },
  {
    "ayat": 112,
    "arabic": "ضُرِبَتْ عَلَيْهِمُ الذِّلَّةُ اَيْنَ مَا ثُقِفُوْٓا اِلَّا بِحَبْلٍ مِّنَ اللّٰهِ وَحَبْلٍ مِّنَ النَّاسِ وَبَاۤءُوْ بِغَضَبٍ مِّنَ اللّٰهِ وَضُرِبَتْ عَلَيْهِمُ الْمَسْكَنَةُ ۗ ذٰلِكَ بِاَنَّهُمْ كَانُوْا يَكْفُرُوْنَ بِاٰيٰتِ اللّٰهِ وَيَقْتُلُوْنَ الْاَنْبِۢيَاۤءَ بِغَيْرِ حَقٍّۗ  ذٰلِكَ بِمَا عَصَوْا وَّكَانُوْا يَعْتَدُوْنَ",
    "transliteration_en": "Duribat 'alaihimuz zillatu aina maa suqifooo illaa bihablim minal laahi wa hablim minan naasi wa baaa'oo bighadabim minallaahi wa duribat 'alaihimul maskanah; zaalika bi-annahum kaanoo yakfuroona bi Aayaatil laahi wa yaqtuloonal Ambiyaaa'a bighairi haqq; zaalika bimaa 'asaw wa kaanoo ya'tadoon",
    "transliteration_id": "Ḍuribat ‘alaihimuż-żillatu aina mā ṡuqifū illā biḥablim minallāhi wa ḥablim minan-nāsi wa bā'ū bigaḍabim minallāhi wa ḍuribat ‘alaihimul-maskanah(tu), żālika bi'annahum kānū yakfurūna bi'āyātillāhi wa yaqtulūnal-ambiyā'a bigairi ḥaqq(in), żālika bimā ‘aṣaw wa kānū ya‘tadūn(a).",
    "translation_en": "They have been put under humiliation [by Allah] wherever they are overtaken, except for a covenant from Allah and a rope from the Muslims. And they have drawn upon themselves anger from Allah and have been put under destitution. That is because they disbelieved in the verses of Allah and killed the prophets without right. That is because they disobeyed and [habitually] transgressed.",
    "translation_id": "Kehinaan ditimpakan kepada mereka di mana saja mereka berada, kecuali jika mereka (berpegang) pada tali (agama) Allah dan tali (perjanjian) dengan manusia. Mereka pasti mendapat murka dari Allah dan kesengsaraan ditimpakan kepada mereka. Yang demikian itu karena mereka mengingkari ayat-ayat Allah dan membunuh para nabi tanpa hak (alasan yang benar). Yang demikian itu karena mereka durhaka dan melampaui batas."
  },
  {
    "ayat": 113,
    "arabic": "۞ لَيْسُوْا سَوَاۤءً ۗ مِنْ اَهْلِ الْكِتٰبِ اُمَّةٌ قَاۤىِٕمَةٌ يَّتْلُوْنَ اٰيٰتِ اللّٰهِ اٰنَاۤءَ الَّيْلِ وَهُمْ يَسْجُدُوْنَ",
    "transliteration_en": "Laisoo sawaaa'a; min Ahlil Kitaabi ummatun qaaa'imatuny yatloona Aayaatil laahi aanaaa'al laili wa hum yasjudoon",
    "transliteration_id": "Laisū sawā'ā(n), min ahlil-kitābi ummatun qā'imatuy yatlūna āyātillāhi ānā'al-laili wa hum yasjudūn(a).",
    "translation_en": "They are not [all] the same; among the People of the Scripture is a community standing [in obedience], reciting the verses of Allah during periods of the night and prostrating [in prayer].",
    "translation_id": "Mereka tidak sama. Di antara Ahlulkitab ada golongan yang lurus. Mereka membaca ayat-ayat Allah pada malam hari dalam keadaan bersujud (salat)."
  },
  {
    "ayat": 114,
    "arabic": "يُؤْمِنُوْنَ بِاللّٰهِ وَالْيَوْمِ الْاٰخِرِ وَيَأْمُرُوْنَ بِالْمَعْرُوْفِ وَيَنْهَوْنَ عَنِ الْمُنْكَرِ وَيُسَارِعُوْنَ فِى الْخَيْرٰتِۗ وَاُولٰۤىِٕكَ مِنَ الصّٰلِحِيْنَ",
    "transliteration_en": "Yu'minoona billaahi wal Yawmil Aakhiri wa yaa muroona bilma'roofi wa yanhawna 'anil munkari wa yusaari'oona fil khairaati wa ulaa'ika minas saaliheen",
    "transliteration_id": "Yu'minūna billāhi wal-yaumil-ākhiri wa ya'murūna bil-ma‘rūfi wa yanhauna ‘anil-munkari wa yusāri‘ūna fil-khairāt(i), wa ulā'ika minaṣ-ṣāliḥīn(a).",
    "translation_en": "They believe in Allah and the Last Day, and they enjoin what is right and forbid what is wrong and hasten to good deeds. And those are among the righteous.",
    "translation_id": "Mereka beriman kepada Allah dan hari Akhir, menyuruh (berbuat) yang makruf, mencegah dari yang mungkar, dan bersegera (mengerjakan) berbagai kebajikan. Mereka itu termasuk orang-orang saleh."
  },
  {
    "ayat": 115,
    "arabic": "وَمَا يَفْعَلُوْا مِنْ خَيْرٍ فَلَنْ يُّكْفَرُوْهُ ۗ وَاللّٰهُ عَلِيْمٌ ۢبِالْمُتَّقِيْنَ",
    "transliteration_en": "Wa maa yaf'aloo min khairin falai yukfarooh; wallaahu 'aleemun bilmuttaqeen",
    "transliteration_id": "Wa mā yaf‘alūna min khairin falay yukfarūh(u), wallāhu ‘alīmum bil-muttaqīn(a).",
    "translation_en": "And whatever good they do - never will it be removed from them. And Allah is Knowing of the righteous.",
    "translation_id": "Kebaikan apa pun yang mereka kerjakan, mereka tidak akan dihalangi dari (pahala)-nya. Allah Maha Mengetahui orang-orang bertakwa."
  },
  {
    "ayat": 116,
    "arabic": "اِنَّ الَّذِيْنَ كَفَرُوْا لَنْ تُغْنِيَ عَنْهُمْ اَمْوَالُهُمْ وَلَآ اَوْلَادُهُمْ مِّنَ اللّٰهِ شَيْـًٔا ۗ وَاُولٰۤىِٕكَ اَصْحٰبُ النَّارِ ۚ هُمْ فِيْهَا خٰلِدُوْنَ",
    "transliteration_en": "Innal lazeena kafaroo lan tughniya 'anhum amwaalum wa laaa awlaaduhum minal laahi shai anw wa ulaaa'ika Ashaabun Naar; hum feehaa khaalidoon",
    "transliteration_id": "Innal-lażīna kafarū lan tugniya ‘anhum amwāluhum wa lā aulāduhum minallāhi syai'ā(n), wa ulā'ika aṣḥābun-nār(i), hum fīhā khālidūn(a).",
    "translation_en": "Indeed, those who disbelieve - never will their wealth or their children avail them against Allah at all, and those are the companions of the Fire; they will abide therein eternally.",
    "translation_id": "Sesungguhnya orang-orang yang kufur, baik harta maupun anak-anaknya, sedikit pun tidak dapat menolak (azab) Allah. Mereka itu penghuni neraka. Mereka kekal di dalamnya."
  },
  {
    "ayat": 117,
    "arabic": "مَثَلُ مَا يُنْفِقُوْنَ فِيْ هٰذِهِ الْحَيٰوةِ الدُّنْيَا كَمَثَلِ رِيْحٍ فِيْهَا صِرٌّ اَصَابَتْ حَرْثَ قَوْمٍ ظَلَمُوْٓا اَنْفُسَهُمْ فَاَهْلَكَتْهُ ۗ وَمَا ظَلَمَهُمُ اللّٰهُ وَلٰكِنْ اَنْفُسَهُمْ يَظْلِمُوْنَ",
    "transliteration_en": "Masalu maa yunfiqoona fee haazihil hayaatid dunyaa kamasali reehin feehaa sirrun as aabat harsa qawmin zalamooo anfusahum fa ahlakath; wa maa zalamahumul laahu wa laakin anfusahum yazlimoon",
    "transliteration_id": "Maṡalu mā yunfiqūna fī hāżihil-ḥayātid-dun-yā kamaṡali rīḥin fihā ṣirrun aṣābat ḥarṡa qaumin ẓalamū anfusahum fa ahlakath(u), wa mā ẓalamahumullāhu wa lākin anfusahum yaẓlimūn(a).",
    "translation_en": "The example of what they spend in this worldly life is like that of a wind containing frost which strikes the harvest of a people who have wronged themselves and destroys it. And Allah has not wronged them, but they wrong themselves.",
    "translation_id": "Perumpamaan harta yang mereka infakkan di dalam kehidupan dunia ini adalah ibarat angin yang mengandung hawa sangat dingin yang menimpa tanaman (milik) suatu kaum yang menzalimi diri sendiri, lalu (angin itu) merusaknya. Allah tidak menzalimi mereka, tetapi mereka yang menzalimi diri sendiri."
  },
  {
    "ayat": 118,
    "arabic": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا تَتَّخِذُوْا بِطَانَةً مِّنْ دُوْنِكُمْ لَا يَأْلُوْنَكُمْ خَبَالًاۗ وَدُّوْا مَا عَنِتُّمْۚ قَدْ بَدَتِ الْبَغْضَاۤءُ مِنْ اَفْوَاهِهِمْۖ وَمَا تُخْفِيْ صُدُوْرُهُمْ اَكْبَرُ ۗ قَدْ بَيَّنَّا لَكُمُ الْاٰيٰتِ  اِنْ كُنْتُمْ تَعْقِلُوْنَ",
    "transliteration_en": "Yaaa ayyuhal lazeena aamanoo laa tattakhizoo bitaanatam min doonikum laa yaaloonakum khabaalanw waddoo maa 'anittum qad badatil baghdaaa'u min afwaahihim; wa maa tukhfee sudooruhum akbar; qad baiyannaa lakumul Aayaati in kuntum ta'qiloon",
    "transliteration_id": "Yā ayyuhal-lażīna āmanū lā tattakhiżū biṭānatam min dūnikum lā ya'lūnakum khabālā(n), waddū mā ‘anittum, qad badatil-bagḍā'u min afwāhihim, wa mā tukhfī ṣudūruhum akbar(u), qad bayyannā lakumul-āyāti in kuntum ta‘qilūn(a).",
    "translation_en": "O you who have believed, do not take as intimates those other than yourselves, for they will not spare you [any] ruin. They wish you would have hardship. Hatred has already appeared from their mouths, and what their breasts conceal is greater. We have certainly made clear to you the signs, if you will use reason.",
    "translation_id": "Wahai orang-orang yang beriman, janganlah kamu mengambil teman kepercayaan dari orang-orang di luar kalangan (agama)-mu (karena) mereka tidak henti-hentinya (mendatangkan) kemudaratan bagimu. Mereka menginginkan apa yang menyusahkanmu. Sungguh, telah nyata kebencian dari mulut mereka dan apa yang mereka sembunyikan dalam hati lebih besar. Sungguh, Kami telah menerangkan kepadamu ayat-ayat (Kami), jika kamu berpikir."
  },
  {
    "ayat": 119,
    "arabic": "هٰٓاَنْتُمْ اُولَاۤءِ تُحِبُّوْنَهُمْ وَلَا يُحِبُّوْنَكُمْ وَتُؤْمِنُوْنَ بِالْكِتٰبِ كُلِّهٖۚ وَاِذَا لَقُوْكُمْ قَالُوْٓا اٰمَنَّاۖ وَاِذَا خَلَوْا عَضُّوْا عَلَيْكُمُ الْاَنَامِلَ مِنَ الْغَيْظِ ۗ قُلْ مُوْتُوْا بِغَيْظِكُمْ ۗ اِنَّ اللّٰهَ عَلِيْمٌ ۢبِذَاتِ الصُّدُوْرِ",
    "transliteration_en": "Haaa antum ulaaa'i tuhibboonahum wa laa yuhibboonakum wa tu'minoona bil kitaabi kullihee wa izaa laqookum qaalooo aamannaa wa izaa khalaw 'addoo 'alaikumul anaamila minal ghaiz; qul mootoo bighai zikum; innal laaha 'aleemum bizaatis sudoor",
    "transliteration_id": "Hā antum ulā'i tuḥibbūnahum wa lā yuḥibbūnakum wa tu'minūna bil-kitābi kullih(ī), wa iżā laqūkum qālū āmannā, wa iżā khalau ‘aḍḍū ‘alaikumul-anāmila  minal-gaiẓ(i), qul mūtū bigaiẓikum, innallāha ‘alīmum biżātiṣ-ṣudūr(i).",
    "translation_en": "Here you are loving them but they are not loving you, while you believe in the Scripture - all of it. And when they meet you, they say, \"We believe.\" But when they are alone, they bite their fingertips at you in rage. Say, \"Die in your rage. Indeed, Allah is Knowing of that within the breasts.\"",
    "translation_id": "Begitulah kamu. Kamu menyukai mereka, padahal mereka tidak menyukaimu, dan kamu beriman pada semua kitab. Apabila mereka berjumpa denganmu, mereka berkata, “Kami beriman.” Apabila mereka menyendiri, mereka menggigit ujung jari karena murka kepadamu. Katakanlah, “Matilah kamu karena kemurkaanmu itu!” Sesungguhnya Allah Maha Mengetahui segala isi hati."
  },
  {
    "ayat": 120,
    "arabic": "اِنْ تَمْسَسْكُمْ حَسَنَةٌ تَسُؤْهُمْۖ وَاِنْ تُصِبْكُمْ سَيِّئَةٌ يَّفْرَحُوْا بِهَا ۗ وَاِنْ تَصْبِرُوْا وَتَتَّقُوْا لَا يَضُرُّكُمْ كَيْدُهُمْ شَيْـًٔا ۗ اِنَّ اللّٰهَ بِمَا يَعْمَلُوْنَ مُحِيْطٌ ࣖ",
    "transliteration_en": "In tamsaskum hasanatun tasu'hum wa in tusibkum saiyi'atuny yafrahoo bihaa wa in tasbiroo wa tattaqoo laa yad urrukum kaiduhum shai'aa; innal laaha bimaa ya'maloona muheet",
    "transliteration_id": "In tamsaskum ḥasanatun tasu'hum, wa in tuṣibkum sayyi'atuy yafraḥū bihā, wa in taṣbirū wa tattaqū lā yaḍurrukum kaiduhum syai'ā(n), innallāha bimā ya‘malūna muḥīṭ(un).",
    "translation_en": "If good touches you, it distresses them; but if harm strikes you, they rejoice at it. And if you are patient and fear Allah, their plot will not harm you at all. Indeed, Allah is encompassing of what they do.",
    "translation_id": "Jika kamu memperoleh kebaikan, (niscaya) mereka bersedih hati. Adapun jika kamu tertimpa bencana, mereka bergembira karenanya. Jika kamu bersabar dan bertakwa, tidaklah tipu daya mereka akan menyusahkan kamu sedikit pun. Sesungguhnya Allah Maha Meliputi segala yang mereka kerjakan."
  },
  {
    "ayat": 121,
    "arabic": "وَاِذْ غَدَوْتَ مِنْ اَهْلِكَ تُبَوِّئُ الْمُؤْمِنِيْنَ مَقَاعِدَ لِلْقِتَالِ ۗ وَاللّٰهُ سَمِيْعٌ عَلِيْمٌۙ",
    "transliteration_en": "Wa iz ghadawta min ahlika tubawwi'ul mu'mineena maqaa'ida lilqitaal; wallaahu samee'un 'aleem",
    "transliteration_id": "Wa iż gadauka min ahlika tubawwi'ul-mu'minīna maqā‘ida lil-qitāl(i), wallāhu samī‘un ‘alīm(un).",
    "translation_en": "And [remember] when you, [O Muhammad], left your family in the morning to post the believers at their stations for the battle [of Uhud] - and Allah is Hearing and Knowing -",
    "translation_id": "(Ingatlah) ketika engkau (Nabi Muhammad) berangkat pada pagi hari meninggalkan keluargamu untuk mengatur orang-orang mukmin pada pos-pos pertempuran. Allah Maha Mendengar lagi Maha Mengetahui."
  },
  {
    "ayat": 122,
    "arabic": "اِذْ هَمَّتْ طَّۤاىِٕفَتٰنِ مِنْكُمْ اَنْ تَفْشَلَاۙ وَاللّٰهُ وَلِيُّهُمَا ۗ وَعَلَى اللّٰهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُوْنَ",
    "transliteration_en": "Iz hammat taaa'ifataani minkum an tafshalaa wallaahu waliyyuhumaa; wa 'alal laahi falyatawakkalil mu'minoon",
    "transliteration_id": "Iż hammat-ṭā'ifatāni minkum an tafsyalā, wallāhu waliyyuhumā, wa ‘alallāhi falyatawakkalil-mu'minūn(a).",
    "translation_en": "When two parties among you were about to lose courage, but Allah was their ally; and upon Allah the believers should rely.",
    "translation_id": "(Ingatlah) ketika dua golongan dari pihak kamu ingin (mundur) karena takut, padahal Allah adalah penolong mereka. Oleh karena itu, hendaklah kepada Allah saja orang-orang mukmin bertawakal."
  },
  {
    "ayat": 123,
    "arabic": "وَلَقَدْ نَصَرَكُمُ اللّٰهُ بِبَدْرٍ وَّاَنْتُمْ اَذِلَّةٌ  ۚ فَاتَّقُوا اللّٰهَ لَعَلَّكُمْ تَشْكُرُوْنَ",
    "transliteration_en": "Wa laqad nasarakumul laahu bi-Badrinw wa antum azillatun fattaqul laaha la'allakum tashkuroon",
    "transliteration_id": "Wa laqad naṣarakumullāhu bibadriw wa antum ażillah(tun), fattaqullāha la‘allakum tasykurūn(a).",
    "translation_en": "And already had Allah given you victory at [the battle of] Badr while you were few in number. Then fear Allah; perhaps you will be grateful.",
    "translation_id": "Sungguh, Allah benar-benar telah menolong kamu dalam Perang Badar, padahal kamu (pada saat itu) adalah orang-orang lemah. Oleh karena itu, bertakwalah kepada Allah agar kamu bersyukur."
  },
  {
    "ayat": 124,
    "arabic": "اِذْ تَقُوْلُ لِلْمُؤْمِنِيْنَ اَلَنْ يَّكْفِيَكُمْ اَنْ يُّمِدَّكُمْ رَبُّكُمْ بِثَلٰثَةِ اٰلَافٍ مِّنَ الْمَلٰۤىِٕكَةِ مُنْزَلِيْنَۗ",
    "transliteration_en": "Iz taqoolu lilmu'mineena alai yakfiyakum ai-yumiddakum Rabbukum bisalaasati aalaafim minal malaaa'ikati munzaleen",
    "transliteration_id": "Iż taqūlu lil-mu'minīna alay yakfiyakum ay yumiddakum rabbukum biṡalāṡati ālāfim minal-malā'ikati munzalīn(a).",
    "translation_en": "[Remember] when you said to the believers, \"Is it not sufficient for you that your Lord should reinforce you with three thousand angels sent down?",
    "translation_id": "(Ingatlah) ketika engkau (Nabi Muhammad) mengatakan kepada orang-orang mukmin, “Apakah tidak cukup bagimu bahwa Tuhanmu membantumu dengan tiga ribu malaikat yang diturunkan (dari langit)?”"
  },
  {
    "ayat": 125,
    "arabic": "بَلٰٓى ۙاِنْ تَصْبِرُوْا وَتَتَّقُوْا وَيَأْتُوْكُمْ مِّنْ فَوْرِهِمْ هٰذَا يُمْدِدْكُمْ رَبُّكُمْ بِخَمْسَةِ اٰلَافٍ مِّنَ الْمَلٰۤىِٕكَةِ مُسَوِّمِيْنَ",
    "transliteration_en": "Balaaa; in tasbiroo wa tattaqoo wa yaatookum min fawrihim haazaa yumdidkum Rabbukum bikhamsati aalaafim minal malaaa'ikati musawwaimeen",
    "transliteration_id": "Balā, in taṣbirū wa tattaqū wa ya'tūkum min faurihim hāżā yumdidkum rabbukum bikhamsati ālāfim minal-malā'ikati musawwimīn(a).",
    "translation_en": "Yes, if you remain patient and conscious of Allah and the enemy come upon you [attacking] in rage, your Lord will reinforce you with five thousand angels having marks [of distinction]",
    "translation_id": "“Ya (cukup).” Jika kamu bersabar dan bertakwa, lalu mereka datang menyerang kamu dengan tiba-tiba, niscaya Allah menolongmu dengan lima ribu malaikat yang memakai tanda."
  },
  {
    "ayat": 126,
    "arabic": "وَمَا جَعَلَهُ اللّٰهُ اِلَّا بُشْرٰى لَكُمْ وَلِتَطْمَىِٕنَّ قُلُوْبُكُمْ بِهٖ ۗ وَمَا النَّصْرُ اِلَّا مِنْ عِنْدِ اللّٰهِ الْعَزِيْزِ الْحَكِيْمِۙ",
    "transliteration_en": "Wa maa ja'alahul laahu illaa bushraa lakum wa litatma'inna quloobukum bih' wa man-nasru illaa min 'indilllaahil 'Azeezil Hakeem",
    "transliteration_id": "Wa mā ja‘alahullāhu illā busyrā lakum wa litaṭma'inna qulūbukum bih(ī), wa man-naṣru illā min ‘indillāhil-‘azīzil-ḥakīm(i).",
    "translation_en": "And Allah made it not except as [a sign of] good tidings for you and to reassure your hearts thereby. And victory is not except from Allah, the Exalted in Might, the Wise -",
    "translation_id": "Allah tidak menjadikannya (pertolongan itu) kecuali hanya sebagai kabar gembira bagi (kemenangan)-mu dan agar hatimu tenang karenanya. Tidak ada kemenangan selain dari Allah Yang Maha Perkasa lagi Maha Bijaksana."
  },
  {
    "ayat": 127,
    "arabic": "لِيَقْطَعَ طَرَفًا مِّنَ الَّذِيْنَ كَفَرُوْٓا اَوْ يَكْبِتَهُمْ فَيَنْقَلِبُوْا خَاۤىِٕبِيْنَ",
    "transliteration_en": "Laiyaqta'a tarafam minal lazeena kafarooo aw yakbitahum fayanqaliboo khaaa'ibeen",
    "transliteration_id": "Liyaqṭa‘a ṭarafam minal-lażīna kafarū au yakbitahum fa yanqalibū khā'ibīn(a).",
    "translation_en": "That He might cut down a section of the disbelievers or suppress them so that they turn back disappointed.",
    "translation_id": "(Hal itu dilakukan) untuk membinasakan segolongan orang yang kufur atau untuk menjadikan mereka hina sehingga mereka kembali tanpa memperoleh apa pun."
  },
  {
    "ayat": 128,
    "arabic": "لَيْسَ لَكَ مِنَ الْاَمْرِ شَيْءٌ اَوْ يَتُوْبَ عَلَيْهِمْ اَوْ يُعَذِّبَهُمْ فَاِنَّهُمْ ظٰلِمُوْنَ",
    "transliteration_en": "Laisa laka minal amrishai'un aw yatooba 'alaihim aw yu'az zi bahum fa innahum zaalimoon",
    "transliteration_id": "Laisa laka minal-amri syai'un au yatūba ‘alaihim au yu‘ażżibahum fa innahum ẓālimūn(a).",
    "translation_en": "Not for you, [O Muhammad, but for Allah], is the decision whether He should [cut them down] or forgive them or punish them, for indeed, they are wrongdoers.",
    "translation_id": "Hal itu sama sekali bukan menjadi urusanmu (Nabi Muhammad), apakah Allah menerima tobat mereka atau mengazabnya karena sesungguhnya mereka orang-orang zalim."
  },
  {
    "ayat": 129,
    "arabic": "وَلِلّٰهِ مَا فِى السَّمٰوٰتِ وَمَا فِى الْاَرْضِۗ يَغْفِرُ لِمَنْ يَّشَاۤءُ وَيُعَذِّبُ مَنْ يَّشَاۤءُ ۗ وَاللّٰهُ غَفُوْرٌ رَّحِيْمٌ ࣖ",
    "transliteration_en": "Wa lilaahi maa fissamaawaati wa maa fil-ard; yaghfiru limai-yashaaa'u wa yu'azzibu mai-yashaaa'; wallaahu Ghafoorur Raheem",
    "transliteration_id": "Wa lillāhi mā fis-samāwāti wa mā fil-arḍ(i), yagfiru limay yasyā'u wa yu‘ażżibu may yasyā'(u), wallāhu gafūrur raḥīm(un).",
    "translation_en": "And to Allah belongs whatever is in the heavens and whatever is on the earth. He forgives whom He wills and punishes whom He wills. And Allah is Forgiving and Merciful.",
    "translation_id": "Milik Allahlah segala yang ada di langit dan segala yang ada di bumi. Dia mengampuni siapa yang Dia kehendaki dan mengazab siapa yang Dia kehendaki. Allah Maha Pengampun lagi Maha Penyayang."
  },
  {
    "ayat": 130,
    "arabic": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا تَأْكُلُوا الرِّبٰوٓا اَضْعَافًا مُّضٰعَفَةً ۖوَّاتَّقُوا اللّٰهَ لَعَلَّكُمْ تُفْلِحُوْنَۚ",
    "transliteration_en": "Yaaa ayyuhal lazeena aamanoo la taakuhur ribaaa ad'aafam mudaa'afatanw wattaqul laaha la'allakum tuflihoon",
    "transliteration_id": "Yā ayyuhal-lażīna āmanū lā ta'kulur-ribā aḍ‘āfam muḍā‘afah(tan), wattaqullāha la‘allakum tufliḥūn(a).",
    "translation_en": "O you who have believed, do not consume usury, doubled and multiplied, but fear Allah that you may be successful.",
    "translation_id": "Wahai orang-orang yang beriman, janganlah kamu memakan riba dengan berlipat ganda dan bertakwalah kepada Allah agar kamu beruntung."
  },
  {
    "ayat": 131,
    "arabic": "وَاتَّقُوا النَّارَ الَّتِيْٓ اُعِدَّتْ لِلْكٰفِرِيْنَ ۚ",
    "transliteration_en": "Wattaqun Naaral lateee u'iddat lilkaafireen",
    "transliteration_id": "Wattaqun-nāral latī u‘iddat lil-kāfirīn(a).",
    "translation_en": "And fear the Fire, which has been prepared for the disbelievers.",
    "translation_id": "Lindungilah dirimu dari api neraka yang disediakan bagi orang-orang kafir."
  },
  {
    "ayat": 132,
    "arabic": "وَاَطِيْعُوا اللّٰهَ وَالرَّسُوْلَ لَعَلَّكُمْ تُرْحَمُوْنَۚ",
    "transliteration_en": "Wa atee'ul laaha war Rasoola la'allakum turhamoon",
    "transliteration_id": "Wa aṭī‘ullāha war-rasūla la‘allakum turḥamūn(a).",
    "translation_en": "And obey Allah and the Messenger that you may obtain mercy.",
    "translation_id": "Taatilah Allah dan Rasul (Nabi Muhammad) agar kamu diberi rahmat."
  },
  {
    "ayat": 133,
    "arabic": "۞ وَسَارِعُوْٓا اِلٰى مَغْفِرَةٍ مِّنْ رَّبِّكُمْ وَجَنَّةٍ عَرْضُهَا السَّمٰوٰتُ وَالْاَرْضُۙ  اُعِدَّتْ لِلْمُتَّقِيْنَۙ",
    "transliteration_en": "Wa saari'ooo ilaa maghfiratim mir Rabbikum wa Jannatin arduhassamaawaatu wal ardu u'iddat lilmuttaqeen",
    "transliteration_id": "Wa sāri‘ū ilā magfiratim mir rabbikum wa jannatin ‘arḍuhas-samāwātu wal-arḍ(u), u‘iddat lil-muttaqīn(a).",
    "translation_en": "And hasten to forgiveness from your Lord and a garden as wide as the heavens and earth, prepared for the righteous",
    "translation_id": "Bersegeralah menuju ampunan dari Tuhanmu dan surga (yang) luasnya (seperti) langit dan bumi yang disediakan bagi orang-orang yang bertakwa,"
  },
  {
    "ayat": 134,
    "arabic": "الَّذِيْنَ يُنْفِقُوْنَ فِى السَّرَّۤاءِ وَالضَّرَّۤاءِ وَالْكٰظِمِيْنَ الْغَيْظَ وَالْعَافِيْنَ عَنِ النَّاسِۗ وَاللّٰهُ يُحِبُّ الْمُحْسِنِيْنَۚ",
    "transliteration_en": "Allazeena yunfiqoona fissarraaa'i waddarraaa'i wal kaazimeenal ghaiza wal aafeena 'anin-naas; wallaahu yuhibbul muhsineen",
    "transliteration_id": "Al-lażīna yunfiqūna fis-sarrā'i waḍ-ḍarrā'i wal-kāẓimīnal gaiẓa wal-‘āfīna ‘anin-nās(i), wallāhu yuḥibbul-muḥsinīn(a).",
    "translation_en": "Who spend [in the cause of Allah] during ease and hardship and who restrain anger and who pardon the people - and Allah loves the doers of good;",
    "translation_id": "(yaitu) orang-orang yang selalu berinfak, baik di waktu lapang maupun sempit, orang-orang yang mengendalikan kemurkaannya, dan orang-orang yang memaafkan (kesalahan) orang lain. Allah mencintai orang-orang yang berbuat kebaikan."
  },
  {
    "ayat": 135,
    "arabic": "وَالَّذِيْنَ اِذَا فَعَلُوْا فَاحِشَةً اَوْ ظَلَمُوْٓا اَنْفُسَهُمْ ذَكَرُوا اللّٰهَ فَاسْتَغْفَرُوْا لِذُنُوْبِهِمْۗ وَمَنْ يَّغْفِرُ الذُّنُوْبَ اِلَّا اللّٰهُ ۗ وَلَمْ يُصِرُّوْا عَلٰى مَا فَعَلُوْا وَهُمْ يَعْلَمُوْنَ",
    "transliteration_en": "Wallazeena izaa fa'aloo faahishatan aw zalamooo anfusahum zakarul laaha fastaghfaroo lizunoobihim; wa mai yaghfiruz zunooba illal laahu wa lam yusirroo 'alaa maa fa'aloo wa hum ya'lamooo",
    "transliteration_id": "Wal-lażīna iżā fa‘alū fāḥisyatan au ẓalamū anfusahum żakarullāha fastagfarū liżunūbihim, wa may yagfiruż-żunūba illallāh(u), wa lam yuṣirrū ‘alā mā fa‘alū wa hum ya‘lamūn(a).",
    "translation_en": "And those who, when they commit an immorality or wrong themselves [by transgression], remember Allah and seek forgiveness for their sins - and who can forgive sins except Allah? - and [who] do not persist in what they have done while they know.",
    "translation_id": "Demikian (juga) orang-orang yang apabila mengerjakan perbuatan keji atau menzalimi diri sendiri, mereka (segera) mengingat Allah lalu memohon ampunan atas dosa-dosanya. Siapa (lagi) yang dapat mengampuni dosa-dosa selain Allah? Mereka pun tidak meneruskan apa yang mereka kerjakan (perbuatan dosa itu) sedangkan mereka mengetahui(-nya)."
  },
  {
    "ayat": 136,
    "arabic": "اُولٰۤىِٕكَ جَزَاۤؤُهُمْ مَّغْفِرَةٌ مِّنْ رَّبِّهِمْ وَجَنّٰتٌ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُ خٰلِدِيْنَ فِيْهَا ۗ وَنِعْمَ اَجْرُ الْعٰمِلِيْنَۗ",
    "transliteration_en": "Ulaaa'ika jazaaa'uhum maghfiratum mir Rabbihim wa Jannaatun tajree min tahtihal anhaaru khaalideena feeha; wa ni'ma ajrul 'aamileen",
    "transliteration_id": "Ulā'ika jazā'uhum magfiratum mir rabbihim wa jannātun tajrī min taḥtihal-anhāru khālidīna fīhā, wa ni‘ma ajrul-‘āmilīn(a).",
    "translation_en": "Those - their reward is forgiveness from their Lord and gardens beneath which rivers flow [in Paradise], wherein they will abide eternally; and excellent is the reward of the [righteous] workers.",
    "translation_id": "Mereka itu balasannya adalah ampunan dari Tuhan mereka dan surga-surga yang mengalir di bawahnya sungai-sungai. Mereka kekal di dalamnya. (Itulah) sebaik-baik pahala bagi orang-orang yang mengerjakan (amal-amal saleh)."
  },
  {
    "ayat": 137,
    "arabic": "قَدْ خَلَتْ مِنْ قَبْلِكُمْ سُنَنٌۙ فَسِيْرُوْا فِى الْاَرْضِ فَانْظُرُوْا كَيْفَ كَانَ عَاقِبَةُ الْمُكَذِّبِيْنَ",
    "transliteration_en": "Qad khalat min qablikum sunanum faseeroo fil ardi fanzuroo kaifa kaana 'aaqiba tul mukazzibeen",
    "transliteration_id": "Qad khalat min qablikum sunan(un), fa sīrū fil-arḍi fanẓurū kaifa kāna ‘āqibatul-mukażżibīn(a).",
    "translation_en": "Similar situations [as yours] have passed on before you, so proceed throughout the earth and observe how was the end of those who denied.",
    "translation_id": "Sungguh, telah berlalu sebelum kamu sunah-sunah (Allah). Oleh karena itu, berjalanlah di (segenap penjuru) bumi dan perhatikanlah bagaimana kesudahan para pendusta (rasul-rasul)."
  },
  {
    "ayat": 138,
    "arabic": "هٰذَا بَيَانٌ لِّلنَّاسِ وَهُدًى وَّمَوْعِظَةٌ لِّلْمُتَّقِيْنَ",
    "transliteration_en": "Haazaa bayaanul linnaasi wa hudanw wa maw'izatul lilmuttaqeen",
    "transliteration_id": "Hāżā bayānul lin-nāsi wa hudaw wa mau‘iẓatul lil-muttaqīn(a).",
    "translation_en": "This [Qur'an] is a clear statement to [all] the people and a guidance and instruction for those conscious of Allah.",
    "translation_id": "Inilah (Al-Qur’an) suatu keterangan yang jelas untuk semua manusia, petunjuk, dan pelajaran bagi orang-orang yang bertakwa."
  },
  {
    "ayat": 139,
    "arabic": "وَلَا تَهِنُوْا وَلَا تَحْزَنُوْا وَاَنْتُمُ الْاَعْلَوْنَ اِنْ كُنْتُمْ مُّؤْمِنِيْنَ",
    "transliteration_en": "Wa laa tahinoo wa laa tahzanoo wa antumul a'lawna in kuntum mu'mineen",
    "transliteration_id": "Wa lā tahinū wa lā taḥzanū wa antumul-a‘launa in kuntum mu'minīn(a).",
    "translation_en": "So do not weaken and do not grieve, and you will be superior if you are [true] believers.",
    "translation_id": "Janganlah kamu (merasa) lemah dan jangan (pula) bersedih hati, padahal kamu paling tinggi (derajatnya) jika kamu orang-orang mukmin."
  },
  {
    "ayat": 140,
    "arabic": "اِنْ يَّمْسَسْكُمْ قَرْحٌ فَقَدْ مَسَّ الْقَوْمَ قَرْحٌ مِّثْلُهٗ ۗوَتِلْكَ الْاَيَّامُ نُدَاوِلُهَا بَيْنَ النَّاسِۚ وَلِيَعْلَمَ اللّٰهُ الَّذِيْنَ اٰمَنُوْا وَيَتَّخِذَ مِنْكُمْ شُهَدَاۤءَ ۗوَاللّٰهُ لَا يُحِبُّ الظّٰلِمِيْنَۙ",
    "transliteration_en": "Iny-yamsaskum qarhum faqad massal qawma qarhum misluh; wa tilkal ayyaamu nudaawiluhaa bainan naasi wa liya'lamal laahul lazeena aamanoo wa yattakhiza minkum shuhadaaa'; wallaahu laa yuh ibbuz zaalimeen",
    "transliteration_id": "Iy yamsaskum qarḥun faqad massal-qauma qarḥum miṡluh(ū), wa tilkal-ayyāmu nudāwiluhā binan-nās(i), wa liya‘lamallāhul-lażīna āmanū wa yattakhiża minkum syuhadā'(u),  wallāhu lā yuḥibbuẓ-ẓālimīn(a).",
    "translation_en": "If a wound should touch you - there has already touched the [opposing] people a wound similar to it. And these days [of varying conditions] We alternate among the people so that Allah may make evident those who believe and [may] take to Himself from among you martyrs - and Allah does not like the wrongdoers -",
    "translation_id": "Jika kamu (pada Perang Uhud) mendapat luka, maka mereka pun (pada Perang Badar) mendapat luka yang serupa. Masa (kejayaan dan kehancuran) itu Kami pergilirkan di antara manusia (agar mereka mendapat pelajaran) dan Allah mengetahui orang-orang beriman (yang sejati) dan sebagian kamu dijadikan-Nya (gugur sebagai) syuhada. Allah tidak menyukai orang-orang zalim."
  },
  {
    "ayat": 141,
    "arabic": "وَلِيُمَحِّصَ اللّٰهُ الَّذِيْنَ اٰمَنُوْا وَيَمْحَقَ الْكٰفِرِيْنَ",
    "transliteration_en": "Wa liyumahhisal laahul lazeena aamanoo wa yamhaqal kaafireen",
    "transliteration_id": "Wa liyumaḥḥiṣallāhul-lażīna āmanū wa yamḥaqal-kāfirīn(a).",
    "translation_en": "And that Allah may purify the believers [through trials] and destroy the disbelievers.",
    "translation_id": "(Pergiliran tersebut juga) agar Allah membersihkan orang-orang yang beriman (dari dosa mereka) dan membinasakan orang-orang kafir."
  },
  {
    "ayat": 142,
    "arabic": "اَمْ حَسِبْتُمْ اَنْ تَدْخُلُوا الْجَنَّةَ وَلَمَّا يَعْلَمِ اللّٰهُ الَّذِيْنَ جَاهَدُوْا مِنْكُمْ وَيَعْلَمَ الصّٰبِرِيْنَ",
    "transliteration_en": "Am hasibtum an tadkhulul Jannnata wa lammaa ya'lamil laahul lazeena jaahadoo minkum wa ya'lamas saabireen",
    "transliteration_id": "Am ḥasibtum an tadkhulul-jannata wa lammā ya‘lamillāhul-lażīna jāhadū minkum wa ya‘lamaṣ-ṣābirīn(a).",
    "translation_en": "Or do you think that you will enter Paradise while Allah has not yet made evident those of you who fight in His cause and made evident those who are steadfast?",
    "translation_id": "Apakah kamu mengira akan masuk surga, padahal belum nyata bagi Allah orang-orang yang berjihad di antara kamu dan belum nyata pula orang-orang yang sabar."
  },
  {
    "ayat": 143,
    "arabic": "وَلَقَدْ كُنْتُمْ تَمَنَّوْنَ الْمَوْتَ مِنْ قَبْلِ اَنْ تَلْقَوْهُۖ فَقَدْ رَاَيْتُمُوْهُ وَاَنْتُمْ تَنْظُرُوْنَ ࣖ",
    "transliteration_en": "Wa laqad kuntum tamannnawnal mawta min qabli an talqawhu faqad ra aitumoohu wa antum tanzuroon",
    "transliteration_id": "Wa laqad kuntum tamannaunal-mauta min qabli an talqauh(u), faqad ra'aitumūhu wa antum tanẓurūn(a).",
    "translation_en": "And you had certainly wished for martyrdom before you encountered it, and you have [now] seen it [before you] while you were looking on.",
    "translation_id": "Sungguh, kamu benar-benar mengharapkan mati (syahid) sebelum kamu menghadapinya (peperangan). Maka, (sekarang) kamu sungguh telah melihat (peperangan itu) dan menyaksikan (kematian)."
  },
  {
    "ayat": 144,
    "arabic": "وَمَا مُحَمَّدٌ اِلَّا رَسُوْلٌۚ قَدْ خَلَتْ مِنْ قَبْلِهِ الرُّسُلُ ۗ اَفَا۟ىِٕنْ مَّاتَ اَوْ قُتِلَ انْقَلَبْتُمْ عَلٰٓى اَعْقَابِكُمْ ۗ وَمَنْ يَّنْقَلِبْ عَلٰى عَقِبَيْهِ فَلَنْ يَّضُرَّ اللّٰهَ شَيْـًٔا  ۗوَسَيَجْزِى اللّٰهُ الشّٰكِرِيْنَ",
    "transliteration_en": "Wa maa Muhammadun illaa Rasoolun qad khalat min qablihir Rusul; afa'im maata aw qutilan qalabtum 'alaaa a'qaabikum; wa mai yanqalib 'alaa aqibihi falai yadurral laaha shai'aa; wa sayajzil laahush shaakireen",
    "transliteration_id": "Wa mā muḥammadun illā rasūl(un), qad khalat min qablihir-rusul(u), afa'im māta au qutilanqalabtum ‘alā a‘qābikum, wa may yanqalib ‘alā ‘aqibaihi falay yaḍurrallāha syai'ā(n), wa sayajzillāhusy-syākirīn(a).",
    "translation_en": "Muhammad is not but a messenger. [Other] messengers have passed on before him. So if he was to die or be killed, would you turn back on your heels [to unbelief]? And he who turns back on his heels will never harm Allah at all; but Allah will reward the grateful.",
    "translation_id": "(Nabi) Muhammad hanyalah seorang rasul. Sebelumnya telah berlalu beberapa rasul. Apakah jika dia wafat atau dibunuh, kamu berbalik ke belakang (murtad)? Siapa yang berbalik ke belakang, maka ia tidak akan mendatangkan mudarat kepada Allah sedikit pun. Allah akan memberi balasan kepada orang-orang yang bersyukur."
  },
  {
    "ayat": 145,
    "arabic": "وَمَا كَانَ لِنَفْسٍ اَنْ تَمُوْتَ اِلَّا بِاِذْنِ اللّٰهِ كِتٰبًا مُّؤَجَّلًا ۗ وَمَنْ يُّرِدْ ثَوَابَ الدُّنْيَا نُؤْتِهٖ مِنْهَاۚ وَمَنْ يُّرِدْ ثَوَابَ الْاٰخِرَةِ نُؤْتِهٖ مِنْهَا ۗ وَسَنَجْزِى الشّٰكِرِيْنَ",
    "transliteration_en": "Wa maa kaana linafsin an tamoota illaa bi iznillaahi kitaabam mu'ajjalaa; wa mai yurid sawaabad dunyaa nu'tihee minhaa wa mai yurid sawaabal Aakhirati nu'tihee minhaa; wa sanajzish shaakireen",
    "transliteration_id": "Wa mā kāna linafsin an tamūta illā bi'iżnillāhi kitābam mu'ajjalā(n), wa may yurid ṡawābad-dun-yā nu'tihī minhā, wa may yurid ṡawābal-ākhirati nu'tihī minhā, wa sanajzisy-syākirīn(a).",
    "translation_en": "And it is not [possible] for one to die except by permission of Allah at a decree determined. And whoever desires the reward of this world - We will give him thereof; and whoever desires the reward of the Hereafter - We will give him thereof. And we will reward the grateful.",
    "translation_id": "Setiap yang bernyawa tidak akan mati, kecuali dengan izin Allah sebagai ketetapan yang telah ditentukan waktunya. Siapa yang menghendaki pahala dunia, niscaya Kami berikan kepadanya pahala (dunia) itu dan siapa yang menghendaki pahala akhirat, niscaya Kami berikan (pula) kepadanya pahala (akhirat) itu. Kami akan memberi balasan kepada orang-orang yang bersyukur."
  },
  {
    "ayat": 146,
    "arabic": "وَكَاَيِّنْ مِّنْ نَّبِيٍّ قٰتَلَۙ مَعَهٗ رِبِّيُّوْنَ كَثِيْرٌۚ فَمَا وَهَنُوْا لِمَآ اَصَابَهُمْ فِيْ سَبِيْلِ اللّٰهِ وَمَا ضَعُفُوْا وَمَا اسْتَكَانُوْا ۗ وَاللّٰهُ يُحِبُّ الصّٰبِرِيْنَ",
    "transliteration_en": "Wa ka aiyim min Nabiyyin qaatala ma'ahoo ribbiyyoona kaseerun famaa wahanoo limaaa Asaabahum fee sabeelil laahi wa maa da'ufoo wa mas takaanoo; wallaahu yuhibbus saabireen",
    "transliteration_id": "Wa ka'ayyim min nabiyyin qātal(a), ma‘ahū ribbiyyūna kaṡīr(un), famā wahanū limā aṣābahum fī sabīlillāhi wa mā ḍa‘ufū wa mastakānū, wallāhu yuḥibbuṣ-ṣābirīn(a).",
    "translation_en": "And how many a prophet [fought and] with him fought many religious scholars. But they never lost assurance due to what afflicted them in the cause of Allah, nor did they weaken or submit. And Allah loves the steadfast.",
    "translation_id": "Betapa banyak nabi yang berperang didampingi sejumlah besar dari pengikut(-nya) yang bertakwa. Mereka tidak (menjadi) lemah karena bencana yang menimpanya di jalan Allah, tidak patah semangat, dan tidak (pula) menyerah (kepada musuh). Allah mencintai orang-orang yang sabar."
  },
  {
    "ayat": 147,
    "arabic": "وَمَا كَانَ قَوْلَهُمْ اِلَّآ اَنْ قَالُوْا رَبَّنَا اغْفِرْ لَنَا ذُنُوْبَنَا وَاِسْرَافَنَا فِيْٓ اَمْرِنَا وَثَبِّتْ اَقْدَامَنَا وَانْصُرْنَا عَلَى الْقَوْمِ الْكٰفِرِيْنَ",
    "transliteration_en": "Wa maa kaana qawlahum illaa an qaaloo Rabbanagh fir lanaa zunoobanaa wa israafanaa feee amirnaa wa sabbit aqdaamanaa wansurnaa 'alal qawmil kaafireen",
    "transliteration_id": "Wa mā kāna qauluhum illā an qālū rabbanagfir lanā żunūbanā wa isrāfanā fī amrinā wa ṡabbit aqdāmanā wanṣurnā ‘alal-qaumil-kāfirīn(a).",
    "translation_en": "And their words were not but that they said, \"Our Lord, forgive us our sins and the excess [committed] in our affairs and plant firmly our feet and give us victory over the disbelieving people.\"",
    "translation_id": "Tidak lain ucapan mereka kecuali doa, “Ya Tuhan kami, ampunilah dosa-dosa kami dan tindakan-tindakan kami yang berlebihan dalam urusan kami, tetapkanlah pendirian kami, dan tolonglah kami terhadap kaum yang kafir.”"
  },
  {
    "ayat": 148,
    "arabic": "فَاٰتٰىهُمُ اللّٰهُ ثَوَابَ الدُّنْيَا وَحُسْنَ ثَوَابِ الْاٰخِرَةِ ۗ وَاللّٰهُ يُحِبُّ الْمُحْسِنِيْنَ ࣖ",
    "transliteration_en": "Fa aataahumul laahu sawaabad dunyaa wa husna sawaabil Aakhirah; wallaahu yuhibbul muhsineen",
    "transliteration_id": "Fa ātāhumullāhu ṡawābad-dun-yā wa ḥusna ṡawābil-ākhirah(ti), wallāhu yuḥibbul-muḥsinīn(a).",
    "translation_en": "So Allah gave them the reward of this world and the good reward of the Hereafter. And Allah loves the doers of good.",
    "translation_id": "Maka, Allah menganugerahi mereka balasan (di) dunia dan pahala yang baik (di) akhirat. Allah mencintai orang-orang yang berbuat kebaikan."
  },
  {
    "ayat": 149,
    "arabic": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْٓا اِنْ تُطِيْعُوا الَّذِيْنَ كَفَرُوْا يَرُدُّوْكُمْ عَلٰٓى اَعْقَابِكُمْ فَتَنْقَلِبُوْا خٰسِرِيْنَ",
    "transliteration_en": "Yaaa 'aiyuhal lazeena aamanoo in tutee'ullazeena kafaroo yaruddookum 'alaaa a'qaabkum fatanqaliboo khaasireen",
    "transliteration_id": "Yā ayyuhal-lażīna āmanū in tuṭī‘ul-lażīna kafarū yaruddūkum ‘alā a‘qābikum fa tanqalibū khāsirīn(a).",
    "translation_en": "O you who have believed, if you obey those who disbelieve, they will turn you back on your heels, and you will [then] become losers.",
    "translation_id": "Wahai orang-orang yang beriman, jika kamu menaati orang-orang yang kufur, niscaya mereka akan mengembalikan kamu ke belakang (murtad). Akibatnya, kamu akan kembali dalam keadaan merugi."
  },
  {
    "ayat": 150,
    "arabic": "بَلِ اللّٰهُ مَوْلٰىكُمْ ۚ وَهُوَ خَيْرُ النّٰصِرِيْنَ",
    "transliteration_en": "Balil laahu mawlaakum wa Huwa khairun naasireen",
    "transliteration_id": "Balillāhu maulākum, wa huwa khairun-nāṣirīn(a).",
    "translation_en": "But Allah is your protector, and He is the best of helpers.",
    "translation_id": "Namun, (hanya) Allahlah pelindungmu dan Dia penolong yang terbaik."
  }
]