[
  {
    "ayat": 1,
    "arabic": "حٰمۤ  ۚ",
    "transliteration_en": "Haa-Meeem",
    "transliteration_id": "Ḥā mīm.",
    "translation_en": "Ha, Meem.",
    "translation_id": "Ḥā Mīm."
  },
  {
    "ayat": 2,
    "arabic": "وَالْكِتٰبِ الْمُبِيْنِ ۙ",
    "transliteration_en": "Wal Kitaabil Mubeen",
    "transliteration_id": "Wal-kitābil-mubīn(i).",
    "translation_en": "By the clear Book,",
    "translation_id": "Demi Kitab (Al-Qur’an) yang jelas,"
  },
  {
    "ayat": 3,
    "arabic": "اِنَّا جَعَلْنٰهُ قُرْاٰنًا عَرَبِيًّا لَّعَلَّكُمْ تَعْقِلُوْنَۚ",
    "transliteration_en": "Innaa ja'alnaahu Quraanan 'Arabiyyal la'allakum ta'qiloon",
    "transliteration_id": "Innā ja‘alnāhu qur'ānan ‘arabiyyal la‘allakum ta‘qilūn(a).",
    "translation_en": "Indeed, We have made it an Arabic Qur'an that you might understand.",
    "translation_id": "sesungguhnya Kami menjadikannya sebagai Al-Qur’an yang berbahasa Arab agar kamu mengerti"
  },
  {
    "ayat": 4,
    "arabic": "وَاِنَّهٗ فِيْٓ اُمِّ الْكِتٰبِ لَدَيْنَا لَعَلِيٌّ حَكِيْمٌ ۗ",
    "transliteration_en": "Wa innahoo feee Ummil Kitaabi Ladainaa la'aliyyun hakeem",
    "transliteration_id": "Wa innahū fī ummil-kitābi ladainā la‘aliyyun ḥakīm(un).",
    "translation_en": "And indeed it is, in the Mother of the Book with Us, exalted and full of wisdom.",
    "translation_id": "dan sesungguhnya (Al-Qur’an) itu berada di dalam Ummul Kitāb (Lauhulmahfuz) di sisi Kami, benar-benar (bernilai) tinggi, dan penuh hikmah."
  },
  {
    "ayat": 5,
    "arabic": "اَفَنَضْرِبُ عَنْكُمُ الذِّكْرَ صَفْحًا اَنْ كُنْتُمْ قَوْمًا مُّسْرِفِيْنَ",
    "transliteration_en": "Afanadribu 'ankumuz Zikra safhan an kuntum qawmam musrifeen",
    "transliteration_id": "Afa naḍribu ‘ankumuż-żikra ṣafḥan an kuntum qaumam musrifīn(a).",
    "translation_en": "Then should We turn the message away, disregarding you, because you are a transgressing people?",
    "translation_id": "Apakah Kami akan menahan (turunnya) Al-Qur’an dan mengabaikanmu (hanya) karena kamu kaum yang melampaui batas?"
  },
  {
    "ayat": 6,
    "arabic": "وَكَمْ اَرْسَلْنَا مِنْ نَّبِيٍّ فِى الْاَوَّلِيْنَ",
    "transliteration_en": "Wa kam arsalnaa min Nabiyyin fil awwaleen",
    "transliteration_id": "Wa kam arsalnā min nabiyyin fil-awwalīn(a).",
    "translation_en": "And how many a prophet We sent among the former peoples,",
    "translation_id": "Betapa banyak nabi yang telah Kami utus kepada umat-umat yang terdahulu."
  },
  {
    "ayat": 7,
    "arabic": "وَمَا يَأْتِيْهِمْ مِّنْ نَّبِيٍّ اِلَّا كَانُوْا بِهٖ يَسْتَهْزِءُوْنَ",
    "transliteration_en": "Wa maa yaateehim min Nabiyyin illaa kaanoo bihee yasahzi'oon",
    "transliteration_id": "Wa mā ya'tīhim min nabiyyin illā kānū bihī yastahzi'ūn(a).",
    "translation_en": "But there would not come to them a prophet except that they used to ridicule him.",
    "translation_id": "Setiap kali seorang nabi datang kepada mereka, mereka selalu memperolok-olokkannya."
  },
  {
    "ayat": 8,
    "arabic": "فَاَهْلَكْنَآ اَشَدَّ مِنْهُمْ بَطْشًا وَّمَضٰى مَثَلُ الْاَوَّلِيْنَ",
    "transliteration_en": "Fa ahlaknaaa ashadda minhum batshanw wa madaa masalul lawwaleen",
    "transliteration_id": "Fa ahlaknā asyadda minhum baṭsyaw wa maḍā maṡalul-awwalīn(a).",
    "translation_en": "And We destroyed greater than them in [striking] power, and the example of the former peoples has preceded.",
    "translation_id": "Oleh karena itu, Kami membinasakan orang-orang yang lebih kuat dari mereka (kaum musyrik Quraisy) dan telah berlalu contoh (kehancuran) umat-umat terdahulu."
  },
  {
    "ayat": 9,
    "arabic": "وَلَىِٕنْ سَاَلْتَهُمْ مَّنْ خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ لَيَقُوْلُنَّ خَلَقَهُنَّ الْعَزِيْزُ الْعَلِيْمُۙ",
    "transliteration_en": "Wa la'in sa altahum man khalaqas samaawaati wal arda la yaqoolunna khalaqa hunnal 'Azeezul 'Aleem",
    "transliteration_id": "Wa la'in sa'altahum man khalaqas-samāwāti wal-arḍa layaqūlunna khalaqahunnal-‘azīzul-‘alīm(u).",
    "translation_en": "And if you should ask them, \"Who has created the heavens and the earth?\" they would surely say, \"They were created by the Exalted in Might, the Knowing.\"",
    "translation_id": "Jika kamu menanyakan kepada mereka, “Siapakah yang menciptakan langit dan bumi,” pastilah mereka akan menjawab, “Yang menciptakannya adalah Zat Yang Maha Perkasa lagi Maha Mengetahui."
  },
  {
    "ayat": 10,
    "arabic": "الَّذِيْ جَعَلَ لَكُمُ الْاَرْضَ مَهْدًا وَّجَعَلَ لَكُمْ فِيْهَا سُبُلًا لَّعَلَّكُمْ تَهْتَدُوْنَ ۚ",
    "transliteration_en": "Allazee ja'ala lakumul arda mahdanw wa ja'ala lakum feehaa subulal la'allakum tahtadoon",
    "transliteration_id": "Allażī ja‘ala lakumul-arḍa mahdaw wa ja‘ala lakum fīhā subulal la‘allakum tahtadūn(a).",
    "translation_en": "[The one] who has made for you the earth a bed and made for you upon it roads that you might be guided",
    "translation_id": "(Dialah) yang menjadikan bumi sebagai tempat menetap bagimu dan menjadikan jalan-jalan di atasnya untukmu agar kamu mendapat petunjuk."
  },
  {
    "ayat": 11,
    "arabic": "وَالَّذِيْ نَزَّلَ مِنَ السَّمَاۤءِ مَاۤءًۢ بِقَدَرٍۚ فَاَنْشَرْنَا بِهٖ بَلْدَةً مَّيْتًا ۚ كَذٰلِكَ تُخْرَجُوْنَ",
    "transliteration_en": "Wallazee nazzala minas samaaa'i maaa'am biqadarin fa anshamaa bihee baldatam maitaa' kazaalika tukhrajoon",
    "transliteration_id": "Wal-lażī nazzala minas-samā'i mā'am biqadar(in), fa'ansyarnā bihī baldatam maitā(n), każālika tukhrajūn(a).",
    "translation_en": "And who sends down rain from the sky in measured amounts, and We revive thereby a dead land - thus will you be brought forth -",
    "translation_id": "Yang menurunkan air dari langit dengan suatu ukuran, lalu dengan air itu Kami menghidupkan negeri yang mati (tandus). Seperti itulah kamu akan dikeluarkan (dari kubur)."
  },
  {
    "ayat": 12,
    "arabic": "وَالَّذِيْ خَلَقَ الْاَزْوَاجَ كُلَّهَا وَجَعَلَ لَكُمْ مِّنَ الْفُلْكِ وَالْاَنْعَامِ مَا تَرْكَبُوْنَۙ",
    "transliteration_en": "Wallazee khalaqal azwaaja kullahaa wa ja'ala lakum minal fulki wal-an'aami maa tarkaboon",
    "transliteration_id": "Wal-lażī khalaqal-azwāja kullahā wa ja‘ala lakum minal-fulki wal-an‘āmi mā tarkabūn(a).",
    "translation_en": "And who created the species, all of them, and has made for you of ships and animals those which you mount.",
    "translation_id": "(Dialah) yang menciptakan semua makhluk berpasang-pasangan dan menjadikan kapal laut untukmu serta hewan ternak untuk kamu tunggangi"
  },
  {
    "ayat": 13,
    "arabic": "لِتَسْتَوٗا عَلٰى ظُهُوْرِهٖ ثُمَّ تَذْكُرُوْا نِعْمَةَ رَبِّكُمْ اِذَا اسْتَوَيْتُمْ عَلَيْهِ وَتَقُوْلُوْا سُبْحٰنَ الَّذِيْ سَخَّرَ لَنَا هٰذَا وَمَا كُنَّا لَهٗ مُقْرِنِيْنَۙ",
    "transliteration_en": "Litastawoo 'alaa zuhoorihee summa tazkuroo ni'mata Rabbikum izastawaitum 'alaihi wa taqooloo Subhaanal lazee sakhkhara lana haaza wa maa kunnaa lahoo muqrineen",
    "transliteration_id": "Litastawū ‘alā ẓuhūrihī ṡumma tażkurū ni‘mata rabbikum iżastawaitum ‘alaihi wa taqūlū subḥānal-lażī sakhkhara lanā hāżā wa mā kunnā lahū muqrinīn(a).",
    "translation_en": "That you may settle yourselves upon their backs and then remember the favor of your Lord when you have settled upon them and say. \"Exalted is He who has subjected this to us, and we could not have [otherwise] subdued it.",
    "translation_id": "agar kamu dapat duduk di atas punggungnya. Kemudian jika kamu sudah duduk (di atas punggung)-nya, kamu akan mengingat nikmat Tuhanmu dan mengucapkan, “Maha Suci Zat yang telah menundukkan (semua) ini bagi kami, padahal kami sebelumnya tidak mampu menguasainya."
  },
  {
    "ayat": 14,
    "arabic": "وَاِنَّآ اِلٰى رَبِّنَا لَمُنْقَلِبُوْنَ",
    "transliteration_en": "Wa innaaa ilaa Rabbinaa lamunqaliboon",
    "transliteration_id": "Wa innā ilā rabbinā lamunqalibūn(a).",
    "translation_en": "And indeed we, to our Lord, will [surely] return.\"",
    "translation_id": "Sesungguhnya kami pasti akan kembali kepada Tuhan kami.”"
  },
  {
    "ayat": 15,
    "arabic": "وَجَعَلُوْا لَهٗ مِنْ عِبَادِهٖ جُزْءًا ۗاِنَّ الْاِنْسَانَ لَكَفُوْرٌ مُّبِيْنٌ ۗ ࣖ",
    "transliteration_en": "Wa ja'aloo lahoo min 'ibaadihee juz'aa; innal insaana lakafoorum mubeen",
    "transliteration_id": "Wa ja‘alū lahū min ‘ibādihī juz'ā(n), innal-insāna lakafūrum mubīn(un).",
    "translation_en": "But they have attributed to Him from His servants a portion. Indeed, man is clearly ungrateful.",
    "translation_id": "Mereka menjadikan sebagian dari hamba-hamba-Nya sebagai bagian dari-Nya. Sesungguhnya manusia itu benar-benar pengingkar (nikmat Tuhan) yang nyata."
  },
  {
    "ayat": 16,
    "arabic": "اَمِ اتَّخَذَ مِمَّا يَخْلُقُ بَنٰتٍ وَّاَصْفٰىكُمْ بِالْبَنِيْنَ ۗ",
    "transliteration_en": "Amit takhaza mimmaa yakhluqu banaatinw wa asfaakum bilbaneen",
    "transliteration_id": "Amittakhażū mimmā yakhluqu banātiw wa aṣfākum bil-banīn(a).",
    "translation_en": "Or has He taken, out of what He has created, daughters and chosen you for [having] sons?",
    "translation_id": "Patutkah Dia mengambil anak perempuan dari sebagian yang telah Dia ciptakan dan memilihkan anak laki-laki untukmu?"
  },
  {
    "ayat": 17,
    "arabic": "وَاِذَا بُشِّرَ اَحَدُهُمْ بِمَا ضَرَبَ لِلرَّحْمٰنِ مَثَلًا ظَلَّ وَجْهُهٗ مُسْوَدًّا وَّهُوَ كَظِيْمٌ",
    "transliteration_en": "Wa izaa bushshira ahaduhum bimaa daraba lir Rahmaani masalan zalla wajhuhoo muswaddanw wa hua kazeem",
    "transliteration_id": "Wa iżā busysyira aḥaduhum bimā ḍaraba lir-raḥmāni maṡalan ẓalla wajhuhū muswaddaw wa huwa kaẓīm(un).",
    "translation_en": "And when one of them is given good tidings of that which he attributes to the Most Merciful in comparison, his face becomes dark, and he suppresses grief.",
    "translation_id": "Apabila salah seorang di antara mereka diberi kabar gembira tentang sesuatu (kelahiran anak perempuan) yang dijadikan sebagai perumpamaan bagi (Allah) Yang Maha Pengasih, jadilah wajahnya merah padam karena menahan sedih (dan marah)."
  },
  {
    "ayat": 18,
    "arabic": "اَوَمَنْ يُّنَشَّؤُا فِى الْحِلْيَةِ وَهُوَ فِى الْخِصَامِ غَيْرُ مُبِيْنٍ",
    "transliteration_en": "Awa mai yunashsha'u fil hilyati wa huwa fil khisaami ghairu mubeen",
    "transliteration_id": "Awamay yunasysya'u fil-ḥilyati wa huwa fil-khiṣāmi gairu mubīn(in).",
    "translation_en": "So is one brought up in ornaments while being during conflict unevident [attributed to Allah]?",
    "translation_id": "Apakah patut (menjadi anak Allah) orang yang tumbuh dan berkembang (dengan tabiat) selalu berhias diri, sedangkan dia tidak mampu memberi alasan yang tegas dan jelas dalam pertengkaran."
  },
  {
    "ayat": 19,
    "arabic": "وَجَعَلُوا الْمَلٰۤىِٕكَةَ الَّذِيْنَ هُمْ عِبٰدُ الرَّحْمٰنِ اِنَاثًا ۗ اَشَهِدُوْا خَلْقَهُمْ ۗسَتُكْتَبُ شَهَادَتُهُمْ وَيُسْـَٔلُوْنَ",
    "transliteration_en": "Wa ja'alul malaaa'ikatal lazeena hum 'ibaadur Rahmaani inaasaa; a shahidoo khalaqhum; satuktabu shahaa datuhum wa yus'aloon",
    "transliteration_id": "Wa ja‘alul-malā'ikatal-lażīna hum ‘ibādur raḥmāni ināṡā(n), asyahidū khalqahum, satuktabu syahādatuhum wa yus'alūn(a).",
    "translation_en": "And they have made the angels, who are servants of the Most Merciful, females. Did they witness their creation? Their testimony will be recorded, and they will be questioned.",
    "translation_id": "Mereka menganggap para malaikat, hamba-hamba (Allah) Yang Maha Pengasih itu, berjenis perempuan. Apakah mereka menyaksikan penciptaannya? Kelak kesaksian (yang mereka karang sendiri itu) akan dituliskan dan akan dimintakan pertanggungjawaban."
  },
  {
    "ayat": 20,
    "arabic": "وَقَالُوْا لَوْ شَاۤءَ الرَّحْمٰنُ مَا عَبَدْنٰهُمْ ۗمَا لَهُمْ بِذٰلِكَ مِنْ عِلْمٍ اِنْ هُمْ اِلَّا يَخْرُصُوْنَۗ",
    "transliteration_en": "Wa qaaloo law shaaa'ar Rahmaanu maa 'abadnaahum; maa lahum bizaalika min 'ilmin in hum illaa yakhrusoon",
    "transliteration_id": "Wa qālū lau syā'ar-raḥmānu mā ‘abadnāhum, mā lahum biżālika min ‘ilm(in), in hum illā yakhruṣūn(a).",
    "translation_en": "And they said, \"If the Most Merciful had willed, we would not have worshipped them.\" They have of that no knowledge. They are not but falsifying.",
    "translation_id": "Mereka berkata, “Sekiranya (Allah) Yang Maha Pengasih menghendaki, tentulah kami tidak menyembah mereka (malaikat).” Mereka tidak mempunyai pengetahuan sedikit pun tentang itu. Mereka hanyalah menduga-duga belaka."
  },
  {
    "ayat": 21,
    "arabic": "اَمْ اٰتَيْنٰهُمْ كِتٰبًا مِّنْ قَبْلِهٖ فَهُمْ بِهٖ مُسْتَمْسِكُوْنَ",
    "transliteration_en": "Am aatainaahum Kitaabam min qablihee fahum bihee mustamsikoon",
    "transliteration_id": "Am ātaināhum kitābam min qablihī fahum bihī mustamsikūn(a).",
    "translation_en": "Or have We given them a book before the Qur'an to which they are adhering?",
    "translation_id": "Apakah kami pernah memberikan sebuah kitab kepada mereka sebelumnya (Al-Qur’an), lalu mereka berpegang teguh (pada kitab itu)?"
  },
  {
    "ayat": 22,
    "arabic": "بَلْ قَالُوْٓا اِنَّا وَجَدْنَآ اٰبَاۤءَنَا عَلٰٓى اُمَّةٍ وَّاِنَّا عَلٰٓى اٰثٰرِهِمْ مُّهْتَدُوْنَ",
    "transliteration_en": "Bal qaalooo innaa wajadnaaa aabaaa'anaa 'alaaa ummatinw wa innaa 'alaaa aasaarihim muhtadoon",
    "transliteration_id": "Bal qālū innā wajadnā ābā'anā ‘alā ummatiw wa innā ‘alā āṡārihim muhtadūn(a).",
    "translation_en": "Rather, they say, \"Indeed, we found our fathers upon a religion, and we are in their footsteps [rightly] guided.\"",
    "translation_id": "Bahkan, mereka berkata, “Sesungguhnya kami telah mendapati nenek moyang kami menganut suatu agama dan kami hanya mengikuti jejak mereka.”"
  },
  {
    "ayat": 23,
    "arabic": "وَكَذٰلِكَ مَآ اَرْسَلْنَا مِنْ قَبْلِكَ فِيْ قَرْيَةٍ مِّنْ نَّذِيْرٍۙ اِلَّا قَالَ مُتْرَفُوْهَآ  ۙاِنَّا وَجَدْنَآ اٰبَاۤءَنَا عَلٰٓى اُمَّةٍ وَّاِنَّا عَلٰٓى اٰثٰرِهِمْ مُّقْتَدُوْنَ",
    "transliteration_en": "Wa kazaalika maaa arsalnaa min qablika fee qaryatim min nazeerin illaa qaala mutrafoohaaa innaa wajadnaaa aabaaa'anaa 'alaaa ummatinw wa innaa 'alaaa aasaarihim muqtadoon",
    "transliteration_id": "Wa każālika mā arsalnā min qablika fī qaryatim min nażīr(in), illā qāla mutrafūhā, innā wajadnā ābā'anā ‘alā ummatiw wa innā ‘alā āṡārihim muqtadūn(a).",
    "translation_en": "And similarly, We did not send before you any warner into a city except that its affluent said, \"Indeed, we found our fathers upon a religion, and we are, in their footsteps, following.\"",
    "translation_id": "Demikian juga ketika Kami mengutus seorang pemberi peringatan sebelum engkau (Nabi Muhammad) ke suatu negeri. Orang-orang yang hidup mewah (di negeri itu) selalu berkata, “Sesungguhnya kami mendapati nenek moyang kami menganut suatu (agama) dan kami hanya mencontoh jejak mereka.”"
  },
  {
    "ayat": 24,
    "arabic": "۞ قٰلَ اَوَلَوْ جِئْتُكُمْ بِاَهْدٰى مِمَّا وَجَدْتُّمْ عَلَيْهِ اٰبَاۤءَكُمْۗ قَالُوْٓا اِنَّا بِمَآ اُرْسِلْتُمْ بِهٖ كٰفِرُوْنَ",
    "transliteration_en": "Qaala awa law ji'tukum bi ahdaa mimmaa wajattum 'alaihi aabaaa'akum qaalooo innaa bimaaa ursiltum bihee kaafiroon",
    "transliteration_id": "Qāla awalau ji'tukum bi'ahdā mimmā wajattum ‘alaihi ābā'akum, qālū innā bimā ursiltum bihī kāfirūn(a).",
    "translation_en": "[Each warner] said, \"Even if I brought you better guidance than that [religion] upon which you found your fathers?\" They said, \"Indeed we, in that with which you were sent, are disbelievers.\"",
    "translation_id": "Dia (pemberi peringatan) berkata, “Masihkah kamu (mengikuti jejak nenek moyangmu), sekalipun aku membawa (agama) yang lebih baik panduannya daripada apa yang kamu peroleh dari nenek moyangmu itu?” Mereka menjawab, “Sesungguhnya kami (tetap) mengingkari kerasulanmu.”"
  },
  {
    "ayat": 25,
    "arabic": "فَانْتَقَمْنَا مِنْهُمْ فَانْظُرْ كَيْفَ كَانَ عَاقِبَةُ الْمُكَذِّبِيْنَ ࣖ",
    "transliteration_en": "Fantaqamnaa minhum fanzur kaifa kaana 'aaqibatul mukazzibeen",
    "transliteration_id": "Fantaqamnā minhum fanẓur kaifa kāna ‘āqibatul-mukażżibīn(a).",
    "translation_en": "So we took retribution from them; then see how was the end of the deniers.",
    "translation_id": "Lalu kami membinasakan mereka. Maka, perhatikanlah bagaimana kesudahan orang-orang yang mendustakan (kebenaran)."
  },
  {
    "ayat": 26,
    "arabic": "وَاِذْ قَالَ اِبْرٰهِيْمُ لِاَبِيْهِ وَقَوْمِهٖٓ اِنَّنِيْ بَرَاۤءٌ مِّمَّا تَعْبُدُوْنَۙ",
    "transliteration_en": "Wa iz qaala Ibraaheemu liabeehi wa qawmiheee innane baraaa'um mimmaa ta'budo",
    "transliteration_id": "Wa iż qāla ibrāhīmu li'abīhi wa qaumihī innanī barā'um mimmā ta‘budūn(a).",
    "translation_en": "And [mention, O Muhammad], when Abraham said to his father and his people, \"Indeed, I am disassociated from that which you worship",
    "translation_id": "(Ingatlah) ketika Ibrahim berkata kepada ayahnya dan kaumnya, “Sesungguhnya aku berlepas diri dari apa yang kamu sembah,"
  },
  {
    "ayat": 27,
    "arabic": "اِلَّا الَّذِيْ فَطَرَنِيْ فَاِنَّهٗ سَيَهْدِيْنِ",
    "transliteration_en": "Illal lazee fataranee innahoo sa yahdeen",
    "transliteration_id": "Illāl-lażī faṭaranī fa'innahū sayahdīn(i).",
    "translation_en": "Except for He who created me; and indeed, He will guide me.\"",
    "translation_id": "kecuali (kamu menyembah) Allah yang menciptakanku. Sesungguhnya Dia akan memberi petunjuk kepadaku.”"
  },
  {
    "ayat": 28,
    "arabic": "وَجَعَلَهَا كَلِمَةً ۢ بَاقِيَةً فِيْ عَقِبِهٖ لَعَلَّهُمْ يَرْجِعُوْنَۗ",
    "transliteration_en": "Wa ja'alahaa Kalimatam baaqiyatan fee 'aqibihee la'al lahum yarji'oon",
    "transliteration_id": "Wa ja‘alahā kalimatam bāqiyatan fī ‘aqibihī la‘allahum yarji‘ūn(a).",
    "translation_en": "And he made it a word remaining among his descendants that they might return [to it].",
    "translation_id": "Dia (Ibrahim) menjadikannya (kalimat tauhid) perkataan yang kekal pada keturunannya agar mereka kembali (kepadanya)."
  },
  {
    "ayat": 29,
    "arabic": "بَلْ مَتَّعْتُ هٰٓؤُلَاۤءِ وَاٰبَاۤءَهُمْ حَتّٰى جَاۤءَهُمُ الْحَقُّ وَرَسُوْلٌ مُّبِيْنٌ",
    "transliteration_en": "Bal matta'tu haaa'ulaaa'i wa aabaaa'ahum hattaa jaaa'a humul haqqu wa Rasoolum mubeen",
    "transliteration_id": "Bal matta‘tu hā'ulā'i wa ābā'ahum ḥattā jā'ahumul-ḥaqqu wa rasūlum mubīn(un).",
    "translation_en": "However, I gave enjoyment to these [people of Makkah] and their fathers until there came to them the truth and a clear Messenger.",
    "translation_id": "Bahkan Aku telah memberikan kenikmatan hidup kepada mereka dan nenek moyang mereka sampai kebenaran (Al-Qur’an) datang kepada mereka beserta seorang Rasul yang memberi penjelasan."
  },
  {
    "ayat": 30,
    "arabic": "وَلَمَّا جَاۤءَهُمُ الْحَقُّ قَالُوْا هٰذَا سِحْرٌ وَّاِنَّا بِهٖ كٰفِرُوْنَ",
    "transliteration_en": "Wa lammaa jaaa'ahumul haqqu qaaloo haazaa sihrunw wa innaa bihee kaafiroon",
    "transliteration_id": "Wa lammā jā'ahumul-ḥaqqu qālū hāżā siḥruw wa innā bihī kāfirūn(a).",
    "translation_en": "But when the truth came to them, they said, \"This is magic, and indeed we are, concerning it, disbelievers.\"",
    "translation_id": "Ketika kebenaran (Al-Qur’an) itu datang kepada mereka, mereka berkata, “Ini adalah sihir dan sesungguhnya kami mengingkarinya.”"
  },
  {
    "ayat": 31,
    "arabic": "وَقَالُوْا لَوْلَا نُزِّلَ هٰذَا الْقُرْاٰنُ عَلٰى رَجُلٍ مِّنَ الْقَرْيَتَيْنِ عَظِيْمٍ",
    "transliteration_en": "Wa qaaloo law laa nuzzila haazal Quraanu 'alaa rajulim minal qaryataini 'azeem",
    "transliteration_id": "Wa qālū lau lā nuzzila hāżal-qur'ānu ‘alā rajulim minal-qaryataini ‘aẓīm(in).",
    "translation_en": "And they said, \"Why was this Qur'an not sent down upon a great man from [one of] the two cities?\"",
    "translation_id": "Mereka (juga) berkata, “Mengapa Al-Qur’an ini tidak diturunkan kepada (salah satu) pembesar dari dua negeri ini (Makkah dan Taif)?”"
  },
  {
    "ayat": 32,
    "arabic": "اَهُمْ يَقْسِمُوْنَ رَحْمَتَ رَبِّكَۗ نَحْنُ قَسَمْنَا بَيْنَهُمْ مَّعِيْشَتَهُمْ فِى الْحَيٰوةِ الدُّنْيَاۙ وَرَفَعْنَا بَعْضَهُمْ فَوْقَ بَعْضٍ دَرَجٰتٍ لِّيَتَّخِذَ بَعْضُهُمْ بَعْضًا سُخْرِيًّا ۗوَرَحْمَتُ رَبِّكَ خَيْرٌ مِّمَّا يَجْمَعُوْنَ",
    "transliteration_en": "Ahum yaqsimoona rahmata Rabbik; Nahnu qasamnaa bainahum ma'eeshatahum fil hayaatid dunyaa wa rafa'naa ba'dahum fawqa ba'din darajaatil liyattakhiza ba'duhum ba'dan sukhriyyaa; wa rahmatu Rabbika khairum mimmaa yajma'oon",
    "transliteration_id": "Ahum yaqsimūna raḥmata rabbik(a), naḥnu qasamnā bainahum ma‘īsyatahum fil-ḥayātid-dun-yā, wa rafa‘nā ba‘ḍahum fauqa ba‘ḍin darajātil liyattakhiża ba‘ḍuhum ba‘ḍan sukhriyyā(n), wa raḥmatu rabbika khairum mimmā yajma‘ūn(a).",
    "translation_en": "Do they distribute the mercy of your Lord? It is We who have apportioned among them their livelihood in the life of this world and have raised some of them above others in degrees [of rank] that they may make use of one another for service. But the mercy of your Lord is better than whatever they accumulate.",
    "translation_id": "Apakah mereka yang membagi-bagi rahmat Tuhanmu? Kamilah yang menentukan penghidupan mereka dalam kehidupan dunia dan Kami telah meninggikan sebagian mereka atas sebagian yang lain beberapa derajat, agar sebagian mereka dapat memanfaatkan sebagian yang lain. Rahmat Tuhanmu lebih baik dari apa yang mereka kumpulkan."
  },
  {
    "ayat": 33,
    "arabic": "وَلَوْلَآ اَنْ يَّكُوْنَ النَّاسُ اُمَّةً وَّاحِدَةً لَّجَعَلْنَا لِمَنْ يَّكْفُرُ بِالرَّحْمٰنِ لِبُيُوْتِهِمْ سُقُفًا مِّنْ فِضَّةٍ وَّمَعَارِجَ عَلَيْهَا يَظْهَرُوْنَۙ",
    "transliteration_en": "Wa law laaa any yakoonan naasu ummatanw waahidatal laja'alnaa limany yakfuru bir Rahmaani libu yootihim suqufam min fiddatinw wa ma'aarija 'alaihaa yazharoon",
    "transliteration_id": "Wa lau lā ay yakūnan-nāsu ummataw wāḥidatal laja‘alnā limay yakfuru bir-raḥmāni libuyūtihim suqufam min fiḍḍatiw wa ma‘ārija ‘alaihā yaẓharūn(a).",
    "translation_en": "And if it were not that the people would become one community [of disbelievers], We would have made for those who disbelieve in the Most Merciful - for their houses - ceilings and stairways of silver upon which to mount",
    "translation_id": "Seandainya bukan karena (Kami tidak menghendaki) manusia menjadi satu umat (yang kufur), pastilah sudah Kami buatkan bagi orang-orang yang ingkar kepada (Allah) Yang Maha Pengasih, loteng-loteng rumah mereka dan tangga-tangga yang mereka naiki dari perak."
  },
  {
    "ayat": 34,
    "arabic": "وَلِبُيُوْتِهِمْ اَبْوَابًا وَّسُرُرًا عَلَيْهَا يَتَّكِـُٔوْنَۙ",
    "transliteration_en": "Wa libu yootihim abwaabanw wa sururan 'alaihaa yattaki'oon",
    "transliteration_id": "Wa libuyūtihim abwābaw wa sururan ‘alaihā yattaki'ūn(a).",
    "translation_en": "And for their houses - doors and couches [of silver] upon which to recline",
    "translation_id": "Bagi rumah-rumah mereka (Kami buatkan) pintu-pintu (perak) dan dipan-dipan tempat mereka bersandar."
  },
  {
    "ayat": 35,
    "arabic": "وَزُخْرُفًاۗ وَاِنْ كُلُّ ذٰلِكَ لَمَّا مَتَاعُ الْحَيٰوةِ الدُّنْيَا ۗوَالْاٰخِرَةُ عِنْدَ رَبِّكَ لِلْمُتَّقِيْنَ ࣖ",
    "transliteration_en": "Wa zukhrufaa; wa in kullu zaalika lammaa mataa'ul hayaatid dunyaa; wal aakhiratu 'inda Rabbika lilmuttaqeen",
    "transliteration_id": "Wa zukhrufā(n), wa in kullu żālika lammā matā‘ul-ḥayātid-dun-yā, wal-ākhiratu ‘inda rabbika lil-muttaqīn(a).",
    "translation_en": "And gold ornament. But all that is not but the enjoyment of worldly life. And the Hereafter with your Lord is for the righteous.",
    "translation_id": "(Kami buatkan pula) perhiasan-perhiasan dari emas. Semuanya itu tidak lain hanyalah kesenangan hidup dunia, sedangkan (kenikmatan hidup) akhirat di sisi Tuhanmu (dikhususkan) bagi orang-orang bertakwa."
  },
  {
    "ayat": 36,
    "arabic": "وَمَنْ يَّعْشُ عَنْ ذِكْرِ الرَّحْمٰنِ نُقَيِّضْ لَهٗ شَيْطٰنًا فَهُوَ لَهٗ قَرِيْنٌ",
    "transliteration_en": "Wa mai ya'shu 'an zikrir Rahmaani nuqaiyid lahoo Shaitaanan fahuwa lahoo qareen",
    "transliteration_id": "Wa may ya‘syu ‘an żikrir-raḥmāni nuqayyiḍ lahū syaiṭānan fahuwa lahū qarīn(un).",
    "translation_en": "And whoever is blinded from remembrance of the Most Merciful - We appoint for him a devil, and he is to him a companion.",
    "translation_id": "Siapa yang berpaling dari pengajaran (Allah) Yang Maha Pengasih (Al-Qur’an), Kami biarkan setan (menyesatkannya). Maka, ia (setan) selalu menemaninya."
  },
  {
    "ayat": 37,
    "arabic": "وَاِنَّهُمْ لَيَصُدُّوْنَهُمْ عَنِ السَّبِيْلِ وَيَحْسَبُوْنَ اَنَّهُمْ مُّهْتَدُوْنَ",
    "transliteration_en": "Wa innahum la yasuddoo nahum 'anis sabeeli wa yahsaboona annahum muhtadoon",
    "transliteration_id": "Wa innahum layaṣuddūnahum ‘anis-sabīli wa yaḥsabūna annahum muhtadūn(a).",
    "translation_en": "And indeed, the devils avert them from the way [of guidance] while they think that they are [rightly] guided",
    "translation_id": "Sesungguhnya mereka (setan-setan itu) benar-benar menghalangi mereka (manusia) dari jalan (yang benar), sedangkan mereka (manusia yang sesat itu) mengira bahwa mereka adalah orang-orang yang mendapat petunjuk."
  },
  {
    "ayat": 38,
    "arabic": "حَتّٰىٓ اِذَا جَاۤءَنَا قَالَ يٰلَيْتَ بَيْنِيْ وَبَيْنَكَ بُعْدَ الْمَشْرِقَيْنِ فَبِئْسَ الْقَرِيْنُ",
    "transliteration_en": "Hattaaa izaa jaaa'anaa qaala yaa laita bainee wa bainaka bu'dal mashriqaini fabi'sal qareen",
    "transliteration_id": "Ḥattā iżā jā'anā qāla yā laita bainī wa bainaka bu‘dal-masyriqaini fa bi'sal-qarīn(u).",
    "translation_en": "Until, when he comes to Us [at Judgement], he says [to his companion], \"Oh, I wish there was between me and you the distance between the east and west - how wretched a companion.\"",
    "translation_id": "Sehingga, apabila dia (orang yang berpaling itu) datang kepada Kami (pada hari Kiamat) dia berkata, “Aduhai, sekiranya (jarak) antara aku dan kamu seperti jarak antara timur dan barat! Memang (setan itu) teman yang paling buruk (bagi manusia).”"
  },
  {
    "ayat": 39,
    "arabic": "وَلَنْ يَّنْفَعَكُمُ الْيَوْمَ اِذْ ظَّلَمْتُمْ اَنَّكُمْ فِى الْعَذَابِ مُشْتَرِكُوْنَ",
    "transliteration_en": "Wa lai yanfa'akumul Yawma iz zalamtum annakum fil 'azaabi mushtarikoon",
    "transliteration_id": "Wa lay yanfa‘akumul-yauma iẓ ẓalamtum annakum fil-‘ażābi musytarikūn(a).",
    "translation_en": "And never will it benefit you that Day, when you have wronged, that you are [all] sharing in the punishment.",
    "translation_id": "(Harapanmu itu) sekali-kali tidak akan memberi manfaat kepadamu pada hari itu karena kamu telah menzalimi (dirimu sendiri). Sesungguhnya kamu (orang yang berpaling dan setan) adalah bersekutu dalam azab itu."
  },
  {
    "ayat": 40,
    "arabic": "اَفَاَنْتَ تُسْمِعُ الصُّمَّ اَوْ تَهْدِى الْعُمْيَ وَمَنْ كَانَ فِيْ ضَلٰلٍ مُّبِيْنٍ",
    "transliteration_en": "Afa anta tusmi'us summa aw tahdil 'umya wa man kaana fee dalaalim mubeen",
    "transliteration_id": "Afa anta tusmi‘uṣ-ṣumma au tahdil-‘umya  wa man kāna fī ḍalālim mubīn(in).",
    "translation_en": "Then will you make the deaf hear, [O Muhammad], or guide the blind or he who is in clear error?",
    "translation_id": "Maka, apakah engkau (Nabi Muhammad) dapat menjadikan orang-orang yang tuli bisa mendengar (kebenaran) atau (dapatkah) engkau memberi petunjuk kepada orang-orang yang buta (hatinya) dan kepada orang yang tetap dalam kesesatan yang nyata?"
  },
  {
    "ayat": 41,
    "arabic": "فَاِمَّا نَذْهَبَنَّ بِكَ فَاِنَّا مِنْهُمْ مُّنْتَقِمُوْنَۙ",
    "transliteration_en": "Fa immaa nazhabanna bika fa innaa minhum muntaqimoon",
    "transliteration_id": "Fa immā nażhabanna bika fa innā minhum muntaqimūn(a).",
    "translation_en": "And whether [or not] We take you away [in death], indeed, We will take retribution upon them.",
    "translation_id": "Maka, sungguh jika Kami benar-benar mewafatkanmu (sebelum engkau mencapai kemenangan), sesungguhnya kepada mereka Kami akan (tetap) memberikan balasan."
  },
  {
    "ayat": 42,
    "arabic": "اَوْ نُرِيَنَّكَ الَّذِيْ وَعَدْنٰهُمْ فَاِنَّا عَلَيْهِمْ مُّقْتَدِرُوْنَ",
    "transliteration_en": "Aw nuriyannakal lazee wa'adnaahum fa innaa 'alaihim muqtadiroon",
    "transliteration_id": "Au nuriyannakal-lażī wa‘adnāhum fa'innā ‘alaihim muqtadirūn(a).",
    "translation_en": "Or whether [or not] We show you that which We have promised them, indeed, We are Perfect in Ability.",
    "translation_id": "Atau, benar-benar Kami perlihatkan kepadamu (azab) yang telah Kami ancamkan kepada mereka. Sesungguhnya Kami Maha Berkuasa atas mereka."
  },
  {
    "ayat": 43,
    "arabic": "فَاسْتَمْسِكْ بِالَّذِيْٓ اُوْحِيَ اِلَيْكَ ۚاِنَّكَ عَلٰى صِرَاطٍ مُّسْتَقِيْمٍ",
    "transliteration_en": "Fastamsik billazeee oohi ya ilaika innaka 'alaa Siraatim Mustaqeem",
    "transliteration_id": "Fastamsik bil-lażī ūḥiya ilaik(a), innaka ‘alā ṣirāṭim mustaqīm(in).",
    "translation_en": "So adhere to that which is revealed to you. Indeed, you are on a straight path.",
    "translation_id": "Maka, berpegang teguhlah pada (Al-Qur’an) yang telah diwahyukan kepadamu. Sesungguhnya engkau berada di jalan yang lurus."
  },
  {
    "ayat": 44,
    "arabic": "وَاِنَّهٗ لَذِكْرٌ لَّكَ وَلِقَوْمِكَ ۚوَسَوْفَ تُسْـَٔلُوْنَ",
    "transliteration_en": "Wa innahoo lazikrul laka wa liqawmika wa sawfa tus'aloon",
    "transliteration_id": "Wa innahū lażikrul laka wa liqaumik(a), wa saufa tus'alūn(a).",
    "translation_en": "And indeed, it is a remembrance for you and your people, and you [all] are going to be questioned.",
    "translation_id": "Sesungguhnya ia (Al-Qur’an) benar-benar merupakan kemuliaan bagimu dan bagi kaummu dan kelak kamu akan dimintai pertanggungjawaban."
  },
  {
    "ayat": 45,
    "arabic": "وَسْـَٔلْ مَنْ اَرْسَلْنَا مِنْ قَبْلِكَ مِنْ رُّسُلِنَآ  ۖ اَجَعَلْنَا مِنْ دُوْنِ الرَّحْمٰنِ اٰلِهَةً يُّعْبَدُوْنَ ࣖ",
    "transliteration_en": "Was'al man arsalnaa min qablika mir Rusulinaaa aja'alnaa min doonir Rahmaani aalihatany yu badoon",
    "transliteration_id": "Was'al man arsalnā min qablika mir rusulinā, aja‘alnā min dūnir-raḥmāni ālihatay yu‘badūn(a).",
    "translation_en": "And ask those We sent before you of Our messengers; have We made besides the Most Merciful deities to be worshipped?",
    "translation_id": "Tanyakanlah (Nabi Muhammad) kepada (pengikut) rasul-rasul Kami yang telah Kami utus sebelum engkau, “Apakah Kami menjadikan selain (Allah) yang Maha Pengasih sebagai tuhan-tuhan yang disembah?”"
  },
  {
    "ayat": 46,
    "arabic": "وَلَقَدْ اَرْسَلْنَا مُوْسٰى بِاٰيٰتِنَآ اِلٰى فِرْعَوْنَ وَمَلَا۟ىِٕهٖ فَقَالَ اِنِّيْ رَسُوْلُ رَبِّ الْعٰلَمِيْنَ",
    "transliteration_en": "Wa laqad arsalnaa Moosaa bi aayaatinaaa ilaa Fir'awna wa mala'ihee faqaala innee Rasoolu Rabbil 'aalameen",
    "transliteration_id": "Wa laqad arsalnā mūsā bi'āyātinā ilā fir‘auna wa mala'ihī fa qāla innī rasūlu rabbil-‘ālamīn(a).",
    "translation_en": "And certainly did We send Moses with Our signs to Pharaoh and his establishment, and he said, \"Indeed, I am the messenger of the Lord of the worlds.\"",
    "translation_id": "Sungguh, Kami benar-benar telah mengutus Musa dengan membawa ayat-ayat (mukjizat) Kami kepada Fir‘aun dan para pemuka (kaum)-nya. Dia (Musa) berkata, “Sesungguhnya aku adalah utusan dari Tuhan semesta alam.”"
  },
  {
    "ayat": 47,
    "arabic": "فَلَمَّا جَاۤءَهُمْ بِاٰيٰتِنَآ اِذَا هُمْ مِّنْهَا يَضْحَكُوْنَ",
    "transliteration_en": "Falammma jaaa'ahum bi aayaatinaaa izaa hum minhaa yadhakoon",
    "transliteration_id": "Falammā jā'ahum bi'āyātinā iżā hum minhā yaḍḥakūn(a).",
    "translation_en": "But when he brought them Our signs, at once they laughed at them.",
    "translation_id": "Ketika dia (Musa) datang kepada mereka dengan membawa ayat-ayat (mukjizat) Kami, seketika itu mereka mentertawakannya."
  },
  {
    "ayat": 48,
    "arabic": "وَمَا نُرِيْهِمْ مِّنْ اٰيَةٍ اِلَّا هِيَ اَكْبَرُ مِنْ اُخْتِهَاۗ وَاَخَذْنٰهُمْ بِالْعَذَابِ لَعَلَّهُمْ يَرْجِعُوْنَ",
    "transliteration_en": "Wa maa nureehim min aayatin illaa hiya akbaru min ukhtihaa wa akhaznaahum bil'azaabi la'allahum yarji'oon",
    "transliteration_id": "Wa mā nurīhim min āyatin illā hiya akbaru min ukhtihā, wa akhażnāhum bil-‘ażābi la‘allahum yarji‘ūn(a).",
    "translation_en": "And We showed them not a sign except that it was greater than its sister, and We seized them with affliction that perhaps they might return [to faith].",
    "translation_id": "Tidaklah Kami perlihatkan suatu mukjizat kepada mereka kecuali ia (mukjizat itu) lebih besar daripada mukjizat (sebelumnya) dan Kami timpakan kepada mereka azab agar mereka kembali (ke jalan yang benar)."
  },
  {
    "ayat": 49,
    "arabic": "وَقَالُوْا يٰٓاَيُّهَ السَّاحِرُ ادْعُ لَنَا رَبَّكَ بِمَا عَهِدَ عِنْدَكَۚ اِنَّنَا لَمُهْتَدُوْنَ",
    "transliteration_en": "Wa qaaloo yaaa ayyuhas saahirud'u lanaa Rabbaka bimaa 'ahida 'indaka innanaa lamuhtadoon",
    "transliteration_id": "Wa qālū yā ayyuhas-sāḥirud‘u lanā rabbaka bimā ‘ahida ‘indak(a), innanā lamuhtadūn(a).",
    "translation_en": "And they said [to Moses], \"O magician, invoke for us your Lord by what He has promised you. Indeed, we will be guided.\"",
    "translation_id": "Mereka berkata, “Wahai penyihir, berdoalah kepada Tuhanmu untuk (melepaskan) kami sesuai dengan apa yang telah dijanjikan-Nya kepadamu. Sesungguhnya kami benar-benar akan menjadi orang-orang yang mendapat petunjuk.”"
  },
  {
    "ayat": 50,
    "arabic": "فَلَمَّا كَشَفْنَا عَنْهُمُ الْعَذَابَ اِذَا هُمْ يَنْكُثُوْنَ",
    "transliteration_en": "Falammaa kashafnaa 'anhumul 'azaaba izaa hum yankusoon",
    "transliteration_id": "Falammā kasyafnā ‘anhumul-‘ażāba iżā hum yankuṡūn(a).",
    "translation_en": "But when We removed from them the affliction, at once they broke their word.",
    "translation_id": "Maka, ketika Kami hilangkan azab itu dari mereka, seketika itu (juga) mereka ingkar janji."
  }
]