[
  {
    "ayat": 1,
    "arabic": "الۤرٰ ۗ كِتٰبٌ اُحْكِمَتْ اٰيٰتُهٗ ثُمَّ فُصِّلَتْ مِنْ لَّدُنْ حَكِيْمٍ خَبِيْرٍۙ",
    "transliteration_en": "Alif-Laaam-Raa; Kitaabun uhkimat Aayaatuhoo summa fussilat mil ladun Hakeemin Khabeer",
    "transliteration_id": "Alif lām rā, kitābun uḥkimat āyātuhū ṡumma fuṣṣilat mil ladun ḥakīmin khabīr(in).",
    "translation_en": "Alif, Lam, Ra. [This is] a Book whose verses are perfected and then presented in detail from [one who is] Wise and Acquainted.",
    "translation_id": "Alif Lām Rā. (Inilah) Kitab yang ayat-ayatnya telah disusun dengan rapi kemudian dijelaskan secara terperinci (dan diturunkan) dari sisi (Allah) Yang Maha Bijaksana lagi Maha Teliti."
  },
  {
    "ayat": 2,
    "arabic": "اَلَّا تَعْبُدُوْٓا اِلَّا اللّٰهَ ۗاِنَّنِيْ لَكُمْ مِّنْهُ نَذِيْرٌ وَّبَشِيْرٌۙ",
    "transliteration_en": "Allaa ta'budooo illal laah; innanee lakum minhu nazeerunw wa basheer",
    "transliteration_id": "Allā ta‘budū illallāh(a), innanī lakum minhu nażīruw wa basyīr(un).",
    "translation_en": "[Through a messenger, saying], \"Do not worship except Allah. Indeed, I am to you from Him a warner and a bringer of good tidings,\"",
    "translation_id": "(Katakanlah Nabi Muhammad,) “Janganlah kamu menyembah (sesuatu), kecuali Allah. Sesungguhnya aku adalah pemberi peringatan dan pembawa berita gembira dari-Nya untukmu."
  },
  {
    "ayat": 3,
    "arabic": "وَّاَنِ اسْتَغْفِرُوْا رَبَّكُمْ ثُمَّ تُوْبُوْٓا اِلَيْهِ يُمَتِّعْكُمْ مَّتَاعًا حَسَنًا اِلٰٓى اَجَلٍ مُّسَمًّى وَّيُؤْتِ كُلَّ ذِيْ فَضْلٍ فَضْلَهٗ ۗوَاِنْ تَوَلَّوْا فَاِنِّيْٓ اَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ كَبِيْرٍ",
    "transliteration_en": "Wa anis taghfiroo Rabbakum summa toobooo ilaihi yumatti'kum mataa'an hasanan ilaaa ajalim musammanw wa yu'ti kulla zee fadlin fadlahoo wa in tawallaw fa inneee akhaafu 'alaikum 'azaaba Yawmin Kabeer",
    "transliteration_id": "Wa anistagfirū rabbakum ṡumma tūbū ilaihi yumatti‘kum matā‘an ḥasanan ilā ajalim musammaw wa yu'ti kulla żī faḍlin faḍlah(ū), wa in tawallau fa innī akhāfu ‘alaikum ‘ażāba yaumin kabīr(in).",
    "translation_en": "And [saying], \"Seek forgiveness of your Lord and repent to Him, [and] He will let you enjoy a good provision for a specified term and give every doer of favor his favor. But if you turn away, then indeed, I fear for you the punishment of a great Day.",
    "translation_id": "Mohonlah ampunan kepada Tuhanmu kemudian bertobatlah kepada-Nya, niscaya Dia akan memberi kesenangan yang baik kepadamu (di dunia) sampai waktu yang telah ditentukan (kematian) dan memberikan pahala-Nya (di akhirat) kepada setiap orang yang beramal saleh. Jika kamu berpaling, sesungguhnya aku takut kamu (akan) ditimpa azab pada hari yang besar (kiamat)."
  },
  {
    "ayat": 4,
    "arabic": "اِلَى اللّٰهِ مَرْجِعُكُمْ ۚوَهُوَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ",
    "transliteration_en": "Ilal laahi marji'ukum wa Huwa 'alaa kulli shai'in Qadeer",
    "transliteration_id": "Ilallāhi marji‘ukum, wa huwa ‘alā kulli syai'in qadīr(un).",
    "translation_en": "To Allah is your return, and He is over all things competent.\"",
    "translation_id": "Kepada Allahlah kembalimu. Dia Maha Kuasa atas segala sesuatu.”"
  },
  {
    "ayat": 5,
    "arabic": "اَلَآ اِنَّهُمْ يَثْنُوْنَ صُدُوْرَهُمْ لِيَسْتَخْفُوْا مِنْهُۗ  اَلَا حِيْنَ يَسْتَغْشُوْنَ ثِيَابَهُمْ ۙيَعْلَمُ مَا يُسِرُّوْنَ وَمَا يُعْلِنُوْنَۚ اِنَّهٗ عَلِيْمٌ ۢ بِذَاتِ الصُّدُوْرِ  ۔",
    "transliteration_en": "Alaa innahum yasnoona sudoorahum liyastakhfoo minh; alaa heena yastaghshoona siyaabahum ya'lamu maa yusiroona wa maa yu'linoon; innahoo 'aleemum bizaatis sudoor",
    "transliteration_id": "Alā innahum yaṡnūna ṣudūrahum liyastakhfū minh(u), alā ḥīna yastagsyūna ṡiyābahum, ya‘lamu mā yusirrūna wa mā yu‘linūn(a), innahū ‘alīmum biżātiṣ-ṣudūr(i).",
    "translation_en": "Unquestionably, they the disbelievers turn away their breasts to hide themselves from Him. Unquestionably, [even] when they cover themselves in their clothing, Allah knows what they conceal and what they declare. Indeed, He is Knowing of that within the breasts.",
    "translation_id": "Ketahuilah bahwa sesungguhnya mereka menutupi (apa yang ada dalam) dada mereka untuk menyembunyikan diri dari-Nya. Ketahuilah bahwa ketika mereka menyelimuti dirinya dengan kain, Dia mengetahui apa yang mereka sembunyikan dan apa yang mereka nyatakan. Sesungguhnya Dia Maha Mengetahui (segala) isi hati."
  },
  {
    "ayat": 6,
    "arabic": "۞ وَمَا مِنْ دَاۤبَّةٍ فِى الْاَرْضِ اِلَّا عَلَى اللّٰهِ رِزْقُهَا وَيَعْلَمُ مُسْتَقَرَّهَا وَمُسْتَوْدَعَهَا ۗ كُلٌّ فِيْ كِتٰبٍ مُّبِيْنٍ",
    "transliteration_en": "Wa maa min daaabbatin fil ardi illaa 'alal laahi rizquhaa wa ya'lamu mustaqarrahaa wa mustawda'ahaa; kullun fee Kitaabim Mubeen",
    "transliteration_id": "Wa mā min dābbatin fil-arḍi illā ‘alallāhi  rizquhā wa ya‘lamu mustaqarrahā wa mustauda‘ahā, kullun fī kitābim mubīn(in).",
    "translation_en": "And there is no creature on earth but that upon Allah is its provision, and He knows its place of dwelling and place of storage. All is in a clear register.",
    "translation_id": "Tidak satu pun hewan yang bergerak di atas bumi melainkan dijamin rezekinya oleh Allah. Dia mengetahui tempat kediamannya dan tempat penyimpanannya. Semua (tertulis) dalam Kitab yang nyata (Lauhulmahfuz)."
  },
  {
    "ayat": 7,
    "arabic": "وَهُوَ الَّذِيْ خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ فِيْ سِتَّةِ اَيَّامٍ وَّكَانَ عَرْشُهٗ عَلَى الْمَاۤءِ لِيَبْلُوَكُمْ اَيُّكُمْ اَحْسَنُ عَمَلًا ۗوَلَىِٕنْ قُلْتَ اِنَّكُمْ مَّبْعُوْثُوْنَ مِنْۢ بَعْدِ الْمَوْتِ لَيَقُوْلَنَّ الَّذِيْنَ كَفَرُوْٓا اِنْ هٰذَٓا اِلَّا سِحْرٌ مُّبِيْنٌ",
    "transliteration_en": "Wa Huwal lazee khalaqas samaawaati wal alrda fee sittati aiyaaminw wa kaana 'Arshuhoo alal maaa'i liyablu wakum aiyukum ahsanu 'amalaa; wa la'in qulta innakum mab'oosoona mim ba'dil mawti la yaqoolanal lazeena kafaroo in haazaaa illaa sihrum mubeen",
    "transliteration_id": "Wa huwal-lażī khalaqas-samāwāti wal-arḍa fī sittati ayyāmiw wa kāna ‘arsyuhū ‘alal-mā'i liyabluwakum ayyukum aḥsanu ‘amalā(n), wa la'in qulta innakum mab‘ūṡūna mim ba‘dil-mauti layaqūlannal-lażīna kafarū in hāżā illā siḥrum mubīn(un).",
    "translation_en": "And it is He who created the heavens and the earth in six days - and His Throne had been upon water - that He might test you as to which of you is best in deed. But if you say, \"Indeed, you are resurrected after death,\" those who disbelieve will surely say, \"This is not but obvious magic.\"",
    "translation_id": "Dialah yang telah menciptakan langit dan bumi dalam enam masa serta (sebelum itu) ʻArasy-Nya di atas air. (Penciptaan itu dilakukan) untuk menguji kamu, siapakah di antara kamu yang lebih baik amalnya. Sungguh, jika engkau (Nabi Muhammad) berkata, “Sesungguhnya kamu akan dibangkitkan setelah mati,” niscaya orang-orang kafir akan berkata, “Ini (Al-Qur’an) tidak lain kecuali sihir yang nyata.”"
  },
  {
    "ayat": 8,
    "arabic": "وَلَىِٕنْ اَخَّرْنَا عَنْهُمُ الْعَذَابَ اِلٰٓى اُمَّةٍ مَّعْدُوْدَةٍ لَّيَقُوْلُنَّ مَا يَحْبِسُهٗ ۗ اَلَا يَوْمَ يَأْتِيْهِمْ لَيْسَ مَصْرُوْفًا عَنْهُمْ وَحَاقَ بِهِمْ مَّا كَانُوْا بِهٖ يَسْتَهْزِءُوْنَ ࣖ",
    "transliteration_en": "Wala'in akhkharnaa 'anhumul 'azaaba ilaaa ummatim ma'doodatil la yaqoolunna maa yahbisuh; alaa yawma yaateehim laisa masroofan 'anhum wa haaqa bihim maa kaanoo bihee yastahzi'oon",
    "transliteration_id": "Wa la'in akhkharnā ‘anhumul-‘ażāba ilā ummatim ma‘dūdatil layaqūlunna mā yaḥbisuh(ū), alā yauma ya'tīhim laisa maṣrūfan ‘anhum wa ḥāqa bihim mā kānū bihī yastahzi'ūn(a).",
    "translation_en": "And if We hold back from them the punishment for a limited time, they will surely say, \"What detains it?\" Unquestionably, on the Day it comes to them, it will not be averted from them, and they will be enveloped by what they used to ridicule.",
    "translation_id": "Sungguh, jika Kami tangguhkan azab dari mereka sampai waktu tertentu, niscaya mereka akan berkata, “Apakah yang menghalanginya?” Ketahuilah, ketika datang kepada mereka, azab itu tidaklah dapat dipalingkan dari mereka. Mereka dikepung oleh (azab) yang dahulu mereka selalu memperolok-olokkannya."
  },
  {
    "ayat": 9,
    "arabic": "وَلَىِٕنْ اَذَقْنَا الْاِنْسَانَ مِنَّا رَحْمَةً ثُمَّ نَزَعْنٰهَا مِنْهُۚ اِنَّهٗ لَيَـُٔوْسٌ كَفُوْرٌ",
    "transliteration_en": "Wa la'in azaqnal insaana minnaa rahmatan summa naza'naahaa minhu, innahoo laya'oosun kafoor",
    "transliteration_id": "Wa la'in ażaqnal-insāna minnā raḥmatan ṡumma naza‘nāhā ‘anh(u), innahū laya'ūsun kafūr(un).",
    "translation_en": "And if We give man a taste of mercy from Us and then We withdraw it from him, indeed, he is despairing and ungrateful.",
    "translation_id": "Sungguh, jika Kami cicipkan kepada manusia suatu rahmat dari Kami kemudian Kami cabut kembali darinya, sesungguhnya dia menjadi sangat berputus asa lagi sangat kufur (terhadap nikmat Allah)."
  },
  {
    "ayat": 10,
    "arabic": "وَلَىِٕنْ اَذَقْنٰهُ نَعْمَاۤءَ بَعْدَ ضَرَّاۤءَ مَسَّتْهُ لَيَقُوْلَنَّ ذَهَبَ السَّيِّاٰتُ عَنِّيْ ۗاِنَّهٗ لَفَرِحٌ فَخُوْرٌۙ",
    "transliteration_en": "Wala'in azaqnaahu na'maaa'a ba'da darraaa'a massat hu la yaqoolanna zahabas saiyiaatu 'anneee; innahoo lafarihun fakhoor",
    "transliteration_id": "Wa la'in ażaqnāhu na‘mā'a ba‘da ḍarrā'a massathu layaqūlanna żahabas-sayyi'ātu ‘annī, innahū lafariḥun fakhūr(un).",
    "translation_en": "But if We give him a taste of favor after hardship has touched him, he will surely say, \"Bad times have left me.\" Indeed, he is exultant and boastful -",
    "translation_id": "Sungguh, jika Kami cicipkan kepadanya (manusia) suatu nikmat setelah bencana yang menimpanya, niscaya dia akan berkata, “Telah hilang keburukan itu dariku.” Sesungguhnya dia sangat gembira lagi sangat membanggakan diri."
  },
  {
    "ayat": 11,
    "arabic": "اِلَّا الَّذِيْنَ صَبَرُوْا وَعَمِلُوا الصّٰلِحٰتِۗ اُولٰۤىِٕكَ لَهُمْ مَّغْفِرَةٌ وَّاَجْرٌ كَبِيْرٌ",
    "transliteration_en": "Illal lazeena sabaroo wa 'amilus saalihaati ulaaa'ika lahum maghfiratunw wa ajrun kabeer",
    "transliteration_id": "Illal-lażīna ṣabarū wa ‘amiluṣ-ṣāliḥāt(i), ulā'ika lahum magfiratuw wa ajrun kabīr(un).",
    "translation_en": "Except for those who are patient and do righteous deeds; those will have forgiveness and great reward.",
    "translation_id": "Kecuali, orang-orang yang sabar dan beramal saleh, bagi mereka ampunan dan pahala yang besar."
  },
  {
    "ayat": 12,
    "arabic": "فَلَعَلَّكَ تَارِكٌۢ بَعْضَ مَا يُوْحٰىٓ اِلَيْكَ وَضَاۤىِٕقٌۢ بِهٖ صَدْرُكَ اَنْ يَّقُوْلُوْا لَوْلَآ اُنْزِلَ عَلَيْهِ كَنْزٌ اَوْ جَاۤءَ مَعَهٗ مَلَكٌ  ۗاِنَّمَآ اَنْتَ نَذِيْرٌ ۗ وَاللّٰهُ عَلٰى كُلِّ شَيْءٍ وَّكِيْلٌ  ۗ",
    "transliteration_en": "Fala'allaka taarikum ba'da maa yoohaaa ilaika wa daaa'iqum bihee sadruka ai yaqooloo law laaa unzila 'alaihi kanzun aw jaaa'a ma'ahoo malak; innamaa anta nazeer; wallaahu 'alaa kulli shai'inw wakeel",
    "transliteration_id": "Fa la‘allaka tārikum ba‘ḍa mā yūḥā ilaika wa ḍā'ikum bihī ṣadruka ay yaqūlū lau lā unzila ‘alaihi kanzun au jā'a ma‘ahū malak(un), innamā anta nażīr(un), wallāhu ‘alā kulli syai'in wakīl(un).",
    "translation_en": "Then would you possibly leave [out] some of what is revealed to you, or is your breast constrained by it because they say, \"Why has there not been sent down to him a treasure or come with him an angel?\" But you are only a warner. And Allah is Disposer of all things.",
    "translation_id": "Boleh jadi engkau (Nabi Muhammad) hendak meninggalkan sebagian dari apa yang diwahyukan kepadamu dan dadamu menjadi sempit karena (takut) mereka mengatakan, “Mengapa tidak diturunkan kepadanya harta (kekayaan) atau datang malaikat bersamanya?” Sesungguhnya engkau hanyalah seorang pemberi peringatan dan Allah adalah pemelihara segala sesuatu."
  },
  {
    "ayat": 13,
    "arabic": "اَمْ يَقُوْلُوْنَ افْتَرٰىهُ ۗقُلْ فَأْتُوْا بِعَشْرِ سُوَرٍ مِّثْلِهٖ مُفْتَرَيٰتٍ وَّادْعُوْا مَنِ اسْتَطَعْتُمْ مِّنْ دُوْنِ اللّٰهِ اِنْ كُنْتُمْ صٰدِقِيْنَ",
    "transliteration_en": "Am yaqooloonaf taraahu qul faatoo bi'ashri Suwarim mislihee muftarayaatinw wad'oo manis tata'tum min doonil laahi in kuntum saadiqeen",
    "transliteration_id": "Am yaqūlūnaftarāh(u), qul fa'tū bi‘asyri suwarim miṡlihī muftarayātiw wad‘ū manistaṭa‘tum min dūnillāhi in kuntum ṣādiqīn(a).",
    "translation_en": "Or do they say, \"He invented it\"? Say, \"Then bring ten surahs like it that have been invented and call upon [for assistance] whomever you can besides Allah, if you should be truthful.\"",
    "translation_id": "Bahkan, apakah mereka mengatakan, “Dia (Nabi Muhammad) telah membuat-buat (Al-Qur’an) itu.” Katakanlah, “(Kalau demikian,) datangkanlah sepuluh surah semisal dengannya (Al-Qur’an) yang dibuat-buat dan ajaklah siapa saja yang kamu sanggup (mengundangnya) selain Allah, jika kamu orang-orang yang benar.”"
  },
  {
    "ayat": 14,
    "arabic": "فَاِلَّمْ يَسْتَجِيْبُوْا لَكُمْ فَاعْلَمُوْٓا اَنَّمَآ اُنْزِلَ بِعِلْمِ اللّٰهِ وَاَنْ لَّآ اِلٰهَ اِلَّا هُوَ ۚفَهَلْ اَنْتُمْ مُّسْلِمُوْنَ",
    "transliteration_en": "Fa il lam yastajeeboo lakum fa'lamooo annamaaa unzilla bi'ilmil laahi wa al laaa ilaaha illaa Huwa fahal antum muslimoon",
    "transliteration_id": "Fa illam yastajībū lakum fa‘lamū annamā unzila bi‘ilmillāhi wa allā ilāha illā huw(a), fahal antum muslimūn(a).",
    "translation_en": "And if they do not respond to you - then know that the Qur'an was revealed with the knowledge of Allah and that there is no deity except Him. Then, would you [not] be Muslims?",
    "translation_id": "Jika mereka tidak memenuhi ajakanmu, (katakanlah,) “Ketahuilah sesungguhnya ia (Al-Qur’an) itu diturunkan dengan ilmu Allah dan (ketahui pula) bahwa tidak ada tuhan kecuali Dia. Apakah kamu mau berserah diri (masuk Islam)?”"
  },
  {
    "ayat": 15,
    "arabic": "مَنْ كَانَ يُرِيْدُ الْحَيٰوةَ الدُّنْيَا وَزِيْنَتَهَا نُوَفِّ اِلَيْهِمْ اَعْمَالَهُمْ فِيْهَا وَهُمْ فِيْهَا لَا يُبْخَسُوْنَ",
    "transliteration_en": "Man kaana yureedul hayaatad dunyaa zeenatahaa nuwaffi ilaihim a'maa lahum feehaa wa hum feehaa laa yubkhasoon",
    "transliteration_id": "Man kāna yurīdul-ḥayātad-dun-yā wa zīnatahā nuwaffi ilaihim a‘mālahum fīhā wa hum fīhā lā yubkhasūn(a).",
    "translation_en": "Whoever desires the life of this world and its adornments - We fully repay them for their deeds therein, and they therein will not be deprived.",
    "translation_id": "Siapa yang menghendaki kehidupan dunia dan perhiasannya, pasti Kami berikan kepada mereka (balasan) perbuatan mereka di dalamnya dengan sempurna dan mereka di dunia tidak akan dirugikan."
  },
  {
    "ayat": 16,
    "arabic": "اُولٰۤىِٕكَ الَّذِيْنَ لَيْسَ لَهُمْ فِى الْاٰخِرَةِ اِلَّا النَّارُ ۖوَحَبِطَ مَا صَنَعُوْا فِيْهَا وَبٰطِلٌ مَّا كَانُوْا يَعْمَلُوْنَ",
    "transliteration_en": "Ulaaa'ikal lazeena laisa lahum fil Aakhirati illan Naaru wa habita maa sana'oo feehaa wa baatilum maa kaanoo ya'maloon",
    "transliteration_id": "Ulā'ikal-lażīna laisa lahum fil-ākhirati illan-nār(u), wa ḥabiṭa mā ṣana‘ū fīhā wa bāṭilum mā kānū ya‘malūn(a).",
    "translation_en": "Those are the ones for whom there is not in the Hereafter but the Fire. And lost is what they did therein, and worthless is what they used to do.",
    "translation_id": "Mereka itulah orang-orang yang tidak memperoleh (sesuatu) di akhirat kecuali neraka, sia-sialah apa yang telah mereka usahakan (di dunia), dan batallah apa yang dahulu selalu mereka kerjakan."
  },
  {
    "ayat": 17,
    "arabic": "اَفَمَنْ كَانَ عَلٰى بَيِّنَةٍ مِّنْ رَّبِّهٖ وَيَتْلُوْهُ شَاهِدٌ مِّنْهُ وَمِنْ قَبْلِهٖ كِتٰبُ مُوْسٰىٓ اِمَامًا وَّرَحْمَةًۗ  اُولٰۤىِٕكَ يُؤْمِنُوْنَ بِهٖ ۗوَمَنْ يَّكْفُرْ بِهٖ مِنَ الْاَحْزَابِ فَالنَّارُ مَوْعِدُهٗ فَلَا تَكُ فِيْ مِرْيَةٍ مِّنْهُ اِنَّهُ الْحَقُّ مِنْ رَّبِّكَ وَلٰكِنَّ اَكْثَرَ النَّاسِ لَا يُؤْمِنُوْنَ",
    "transliteration_en": "Afaman kaana 'alas baiyinatim mir Rabbihee wa yatloohu shaahidum minhu wa min qablihee Kitaabu Moosaaa imaamanw wa rahmah; ulaaa 'ika yu'minoona bih; wa mai yakfur bihee minal Ahzaabi fan Naaru maw'iduh; falaa taku fee miryatim minh; innahul haqqu mir Rabbika wa laakinna aksaran naasi laa yu'minoon",
    "transliteration_id": "Afaman kāna ‘alā bayyinatim mir rabbihī wa yatlūhu syāhidum minhu wa min qablihī kitābu mūsā imāmaw wa raḥmah(tan), ulā'ika yu'minūna bih(ī), wa may yakfur bihī minal-aḥzābi fan-nāru mau‘iduhū falā taku fī miryatim minhu innahul-ḥaqqu mir rabbika wa lākinna akṡaran-nāsi lā yu'minūn(a).",
    "translation_en": "So is one who [stands] upon a clear evidence from his Lord [like the aforementioned]? And a witness from Him follows it, and before it was the Scripture of Moses to lead and as mercy. Those [believers in the former revelations] believe in the Qur'an. But whoever disbelieves in it from the [various] factions - the Fire is his promised destination. So be not in doubt about it. Indeed, it is the truth from your Lord, but most of the people do not believe.",
    "translation_id": "Apakah orang yang sudah mempunyai bukti yang nyata (Al-Qur’an) dari Tuhannya, diikuti oleh saksi dari-Nya, dan sebelumnya sudah ada pula Kitab Musa yang menjadi pedoman dan rahmat; mereka beriman kepadanya (sama dengan orang kafir yang hanya menginginkan kehidupan dunia)? Siapa yang mengingkarinya (Al-Qur’an) dari golongan-golongan (penentang Rasulullah), nerakalah tempat kembalinya. Oleh karena itu, janganlah engkau ragu terhadap Al-Qur’an. Sesungguhnya ia (Al-Qur’an) itu kebenaran dari Tuhanmu, tetapi kebanyakan manusia tidak beriman."
  },
  {
    "ayat": 18,
    "arabic": "وَمَنْ اَظْلَمُ مِمَّنِ افْتَرٰى عَلَى اللّٰهِ كَذِبًاۗ اُولٰۤىِٕكَ يُعْرَضُوْنَ عَلٰى رَبِّهِمْ وَيَقُوْلُ الْاَشْهَادُ هٰٓؤُلَاۤءِ الَّذِيْنَ كَذَبُوْا عَلٰى رَبِّهِمْۚ  اَلَا لَعْنَةُ اللّٰهِ عَلَى الظّٰلِمِيْنَ ۙ",
    "transliteration_en": "Wa man azlamu mimmanif taraa 'alal laahi kazibaa; ulaaa'ika yu'radoona 'alaa Rabbihim wa yaqoolul ashhaa duhaaa'ulaaa'il lazeena kazaboo 'alaa Rabbihim; alaa la'natul laahi alaz zaalimeen",
    "transliteration_id": "Wa man aẓlamu mimmaniftarā ‘alallāhi każibā(n), ulā'ika yu‘raḍūna ‘alā rabbihim wa yaqūlul-asyhādu hā'ulā'il-lażīna każabū ‘alā rabbihim, alā la‘natullāhi ‘alaẓ-ẓālimīn(a).",
    "translation_en": "And who is more unjust than he who invents a lie about Allah? Those will be presented before their Lord, and the witnesses will say, \"These are the ones who lied against their Lord.\" Unquestionably, the curse of Allah is upon the wrongdoers.",
    "translation_id": "Siapakah yang lebih zalim daripada orang yang mengada-adakan suatu kebohongan terhadap Allah? Mereka itu akan dihadapkan kepada tuhan mereka dan para saksi akan berkata, “Orang-orang inilah yang telah berbohong terhadap tuhan mereka.” Ketahuilah, laknat Allah (ditimpakan) kepada orang-orang zalim."
  },
  {
    "ayat": 19,
    "arabic": "الَّذِيْنَ يَصُدُّوْنَ عَنْ سَبِيْلِ اللّٰهِ وَيَبْغُوْنَهَا عِوَجًاۗ وَهُمْ بِالْاٰخِرَةِ هُمْ كفِٰرُوْنَ",
    "transliteration_en": "Allazeena yasuddoona 'an sabeelil laahi wa yabghoonahaa 'iwajanw wa hum bil Aakhiratihum kaafiroon",
    "transliteration_id": "Al-lażīna yaṣuddūna ‘an sabīlillāhi wa yabgūnahā ‘iwajā(n), wa hum bil-ākhirati hum kāfirūn(a).",
    "translation_en": "Who averted [people] from the way of Allah and sought to make it [seem] deviant while they, concerning the Hereafter, were disbelievers.",
    "translation_id": "(Yaitu) mereka yang menghalang-halangi dari jalan Allah dan menghendaki agar jalan itu bengkok. Mereka itulah orang-orang yang kufur terhadap hari akhir."
  },
  {
    "ayat": 20,
    "arabic": "اُولٰۤىِٕكَ لَمْ يَكُوْنُوْا مُعْجِزِيْنَ فِى الْاَرْضِ وَمَا كَانَ لَهُمْ مِّنْ دُوْنِ اللّٰهِ مِنْ اَوْلِيَاۤءَ ۘ يُضٰعَفُ لَهُمُ الْعَذَابُ ۗمَا كَانُوْا يَسْتَطِيْعُوْنَ السَّمْعَ وَمَا كَانُوْا يُبْصِرُوْنَ",
    "transliteration_en": "Ulaaa'ika lam yakoonoo mu'jizeena fil ardi wa maa kaana lahum min doonil laahi min awliyaaa'; yudaa'afu lahumul 'azaab; maa kaanoo yastatee'oonas sam'a wa maa kaanoo yubsiroon",
    "transliteration_id": "Ulā'ika lam yakūnū mu‘jizīna fil-arḍi wa mā kāna lahum min dūnillāhi min auliyā'(a), yuḍā‘afu lahumul-‘ażāb(u), mā kānū yastaṭī‘ūnas-sam‘a wa mā kānū yubṣirūn(a).",
    "translation_en": "Those were not causing failure [to Allah] on earth, nor did they have besides Allah any protectors. For them the punishment will be multiplied. They were not able to hear, nor did they see.",
    "translation_id": "Mereka tidak mampu menghalangi (siksaan Allah) di bumi dan tidak akan ada bagi mereka penolong selain Allah. Azab itu akan dilipatgandakan kepada mereka (di akhirat kelak). Mereka tidak mampu mendengar (kebenaran) dan tidak dapat melihat (kekuasaan Allah)."
  },
  {
    "ayat": 21,
    "arabic": "اُولٰۤىِٕكَ الَّذِيْنَ خَسِرُوْٓا اَنْفُسَهُمْ وَضَلَّ عَنْهُمْ مَّا كَانُوْا يَفْتَرُوْنَ",
    "transliteration_en": "Ulaaa'ikal lazeena khasirooo anfusahum wa dalla 'anhum maa kaanoo yaftaroon",
    "transliteration_id": "Ulā'ikal-lażīna khasirū anfusahum wa ḍalla ‘anhum mā kānū yaftarūn(a).",
    "translation_en": "Those are the ones who will have lost themselves, and lost from them is what they used to invent.",
    "translation_id": "Mereka itulah orang-orang yang merugikan dirinya sendiri dan lenyaplah dari mereka sesuatu (sesembahan) yang selalu mereka ada-adakan."
  },
  {
    "ayat": 22,
    "arabic": "لَاجَرَمَ اَنَّهُمْ فِى الْاٰخِرَةِ هُمُ الْاَخْسَرُوْنَ",
    "transliteration_en": "Laa jarama annahum fil Aakhirati humul akhsaroon",
    "transliteration_id": "Lā jarama annahum fil-ākhirati humul-akhsarūn(a).",
    "translation_en": "Assuredly, it is they in the Hereafter who will be the greatest losers.",
    "translation_id": "Tidak diragukan bahwa sesungguhnya mereka (kelak) di akhirat adalah orang-orang yang paling merugi."
  },
  {
    "ayat": 23,
    "arabic": "اِنَّ الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ وَاَخْبَتُوْٓا اِلٰى رَبِّهِمْۙ اُولٰۤىِٕكَ اَصْحٰبُ الْجَنَّةِۚ هُمْ فِيْهَا خٰلِدُوْنَ",
    "transliteration_en": "Innal lazeena aamanoo wa 'amilus saalihaati wa akhbatooo ilaa Rabbihim ulaaa'ika Ashaabul Jannati hum feehaa khaalidoon",
    "transliteration_id": "Innal-lażīna āmanū wa ‘amiluṣ-ṣāliḥāti wa akhbatū ilā rabbihim, ulā'ika aṣḥābul-jannati hum fīhā khālidūn(a).",
    "translation_en": "Indeed, they who have believed and done righteous deeds and humbled themselves to their Lord - those are the companions of Paradise; they will abide eternally therein.",
    "translation_id": "Sesungguhnya orang-orang yang beriman dan beramal saleh serta merendahkan diri kepada Tuhan, mereka itulah para penghuni surga. Mereka kekal di dalamnya."
  },
  {
    "ayat": 24,
    "arabic": "۞ مَثَلُ الْفَرِيْقَيْنِ كَالْاَعْمٰى وَالْاَصَمِّ وَالْبَصِيْرِ وَالسَّمِيْعِۗ هَلْ يَسْتَوِيٰنِ مَثَلًا ۗ اَفَلَا تَذَكَّرُوْنَ ࣖ",
    "transliteration_en": "Masalul fareeqini kal a'maa wal asammi walbaseeri wassamee'; hal yastawiyaani masalaa; afalaa tazakkaroon",
    "transliteration_id": "Maṡalul-farīqaini kal-a‘mā wal-aṣammi wal-baṣīri was-samī‘(i), hal yastawiyāni maṡalā(n), afalā tażakkarūn(a).",
    "translation_en": "The example of the two parties is like the blind and deaf, and the seeing and hearing. Are they equal in comparison? Then, will you not remember?",
    "translation_id": "Perumpamaan kedua golongan (kafir dan mukmin) seperti orang buta dan orang tuli dengan orang yang dapat melihat dan yang dapat mendengar. Samakah kedua golongan itu? Apakah kamu tidak mengambil pelajaran?"
  },
  {
    "ayat": 25,
    "arabic": "وَلَقَدْ اَرْسَلْنَا نُوْحًا اِلٰى قَوْمِهٖٓ اِنِّيْ لَكُمْ نَذِيْرٌ مُّبِيْنٌ ۙ",
    "transliteration_en": "Wa laqad arsalnaa Noohan ilaa qawmihee innee lakum nazeerum mubeen",
    "transliteration_id": "Wa laqad arsalnā nūḥan ilā qaumihī innī lakum nażīrum mubīn(un).",
    "translation_en": "And We had certainly sent Noah to his people, [saying], \"Indeed, I am to you a clear warner",
    "translation_id": "Sungguh, Kami benar-benar telah mengutus Nuh kepada kaumnya. (Dia berkata,) “Sesungguhnya aku adalah pemberi peringatan yang nyata bagi kamu"
  },
  {
    "ayat": 26,
    "arabic": "اَنْ لَّا تَعْبُدُوْٓا اِلَّا اللّٰهَ ۖاِنِّيْٓ اَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ اَلِيْمٍ",
    "transliteration_en": "Al laa ta'budooo illal laaha inneee akhaafu 'alaikum 'azaaba Yawmin aleem",
    "transliteration_id": "Allā ta‘budū illallāh(a), innī akhāfu ‘alaikum ‘ażāba yaumin alīm(in).",
    "translation_en": "That you not worship except Allah. Indeed, I fear for you the punishment of a painful day.\"",
    "translation_id": "agar kamu tidak menyembah (sesuatu) kecuali Allah. Sesungguhnya aku khawatir bahwa kamu akan ditimpa azab (pada) hari yang (siksanya) sangat pedih.”"
  },
  {
    "ayat": 27,
    "arabic": "فَقَالَ الْمَلَاُ الَّذِيْنَ كَفَرُوْا مِنْ قَوْمِهٖ مَا نَرٰىكَ اِلَّا بَشَرًا مِّثْلَنَا وَمَا نَرٰىكَ اتَّبَعَكَ اِلَّا الَّذِيْنَ هُمْ اَرَاذِلُنَا بَادِيَ الرَّأْيِۚ وَمَا نَرٰى لَكُمْ عَلَيْنَا مِنْ فَضْلٍۢ بَلْ نَظُنُّكُمْ كٰذِبِيْنَ",
    "transliteration_en": "Faqaalal mala ul lazeena kafaroo min qawmihee ma naraaka illaa basharam mislanaa wa maa naraakat taba'aka illal lazeena hum araazilunaa baadiyar raayi wa maa naraa lakum 'alainaa min fadlim bal nazunnukum kaazibeen",
    "transliteration_id": "Fa qālal-mala'ul-lażīna kafarū min qaumihī mā narāka illā basyaram miṡlanā wa mā narākattaba‘aka illal-lażīna hum arāżilunā bādiyar-ra'y(i), wa mā narā lakum ‘alainā min faḍlim bal naẓunnukum kāżibīn(a).",
    "translation_en": "So the eminent among those who disbelieved from his people said, \"We do not see you but as a man like ourselves, and we do not see you followed except by those who are the lowest of us [and] at first suggestion. And we do not see in you over us any merit; rather, we think you are liars.\"",
    "translation_id": "Maka, berkatalah para pemuka yang kufur dari kaumnya, “Kami tidak melihat engkau, melainkan hanyalah seorang manusia (biasa) seperti kami. Kami tidak melihat orang yang mengikuti engkau, melainkan orang-orang yang hina dina di antara kami yang lekas percaya begitu saja. Kami tidak melihat kamu memiliki suatu kelebihan apa pun atas kami, bahkan kami menganggap kamu adalah para pembohong.”"
  },
  {
    "ayat": 28,
    "arabic": "قَالَ يٰقَوْمِ اَرَءَيْتُمْ اِنْ كُنْتُ عَلٰى بَيِّنَةٍ مِّنْ رَّبِّيْ وَاٰتٰىنِيْ رَحْمَةً مِّنْ عِنْدِهٖ فَعُمِّيَتْ عَلَيْكُمْۗ اَنُلْزِمُكُمُوْهَا وَاَنْتُمْ لَهَا كٰرِهُوْنَ",
    "transliteration_en": "Qaala yaa qawmi ara'aitum in kuntu 'alaa baiyinatim mir Rabbee wa aataanee rahmatam min 'indihee fa'um miyat 'alaikum anulzimuku moohaa wa antum lahaa kaarihoon",
    "transliteration_id": "Qāla yā qaumi ara'aitum in kuntu ‘alā bayyinatim mir rabbī wa ātānī raḥmatam min ‘indihī fa ‘ummiyat ‘alaikum, anulzimukumūhā wa antum lahā kārihūn(a).",
    "translation_en": "He said, \"O my people have you considered: if I should be upon clear evidence from my Lord while He has given me mercy from Himself but it has been made unapparent to you, should we force it upon you while you are averse to it?",
    "translation_id": "Dia (Nuh) berkata, “Wahai kaumku, apa pendapatmu jika aku mempunyai bukti yang nyata dari Tuhanku dan Dia menganugerahiku rahmat dari sisi-Nya, tetapi (rahmat itu) disamarkan bagimu? Apakah kami akan memaksamu untuk menerimanya, padahal kamu tidak menyukainya?"
  },
  {
    "ayat": 29,
    "arabic": "وَيٰقَوْمِ لَآ اَسْـَٔلُكُمْ عَلَيْهِ مَالًاۗ اِنْ اَجْرِيَ اِلَّا عَلَى اللّٰهِ وَمَآ اَنَا۠ بِطَارِدِ الَّذِيْنَ اٰمَنُوْاۗ اِنَّهُمْ مُّلٰقُوْا رَبِّهِمْ وَلٰكِنِّيْٓ اَرٰىكُمْ قَوْمًا تَجْهَلُوْنَ",
    "transliteration_en": "Wa yaa qawmi laaa as'alukum 'alaihi maalan in ajriya illaa 'alal laah; wa maaa ana bitaaridil lazeena aamanoo; innahum mulaaqoo Rabbihim wa laakinneee araakum qawman tajhaloon",
    "transliteration_id": "Wa yā qaumi lā as'alukum ‘alaihi mālā(n), in ajriya illā ‘alallāhi wa mā ana biṭāridil-lażīna āmanū, innahum mulāqū rabbihim  wa lākinnī arākum qauman tajhalūn(a).",
    "translation_en": "And O my people, I ask not of you for it any wealth. My reward is not but from Allah. And I am not one to drive away those who have believed. Indeed, they will meet their Lord, but I see that you are a people behaving ignorantly.",
    "translation_id": "Wahai kaumku, aku tidak meminta kepadamu harta (sedikit pun sebagai imbalan) atas seruanku. Imbalanku hanyalah dari Allah dan aku sekali-kali tidak akan mengusir orang-orang yang beriman. Sesungguhnya mereka akan bertemu dengan Tuhannya (di akhirat), tetapi aku memandangmu sebagai kaum yang bodoh."
  },
  {
    "ayat": 30,
    "arabic": "وَيٰقَوْمِ مَنْ يَّنْصُرُنِيْ مِنَ اللّٰهِ اِنْ طَرَدْتُّهُمْ ۗ اَفَلَا تَذَكَّرُوْنَ",
    "transliteration_en": "Wa yaa qawmi mai yansurunee minal laahi in tarattuhum; afalaa tazak karoon",
    "transliteration_id": "Wa yā qaumi may yanṣurunī minallāhi in ṭarattuhum, afalā tażakkarūn(a).",
    "translation_en": "And O my people, who would protect me from Allah if I drove them away? Then will you not be reminded?",
    "translation_id": "Wahai kaumku, siapakah yang akan menolongku dari (azab) Allah jika aku mengusir mereka (orang-orang yang beriman itu)? Apakah kamu tidak mengambil pelajaran?"
  },
  {
    "ayat": 31,
    "arabic": "وَلَآ اَقُوْلُ لَكُمْ عِنْدِيْ خَزَاۤىِٕنُ اللّٰهِ وَلَآ اَعْلَمُ الْغَيْبَ وَلَآ اَقُوْلُ اِنِّيْ مَلَكٌ وَّلَآ اَقُوْلُ لِلَّذِيْنَ تَزْدَرِيْٓ اَعْيُنُكُمْ لَنْ يُّؤْتِيَهُمُ اللّٰهُ خَيْرًا ۗ اَللّٰهُ اَعْلَمُ بِمَا فِيْٓ اَنْفُسِهِمْ ۚاِنِّيْٓ اِذًا لَّمِنَ الظّٰلِمِيْنَ",
    "transliteration_en": "Wa laa aqoolu lakum 'indee khazaa'inul laahi wa laaa a'lamul ghaiba wa laa aqoolu inee malakunw wa laaa aqoolu lillazeena tazdareee a'yunukum lai yu'tiyahumul laahu khairan Allaahu a'lamu bimaa feee anfusihim innee izal laminaz zaalimeen",
    "transliteration_id": "Wa lā aqūlu lakum ‘indī khazā'inullāhi wa lā a‘lamul-gaiba  wa lā aqūlu innī malakuw wa lā aqūlu lil-lażīna tazdarī a‘yunukum lay yu'tiyahumullāhu khairā(n), allāhu a‘lamu bimā fī anfusihim, innī iżal laminaẓ-ẓālimīn(a).",
    "translation_en": "And I do not tell you that I have the depositories [containing the provision] of Allah or that I know the unseen, nor do I tell you that I am an angel, nor do I say of those upon whom your eyes look down that Allah will never grant them any good. Allah is most knowing of what is within their souls. Indeed, I would then be among the wrongdoers.\"",
    "translation_id": "Aku tidak mengatakan kepadamu bahwa aku mempunyai perbendaharaan (rezeki) Allah. Aku tidak mengetahui yang gaib dan tidak (pula) mengatakan bahwa sesungguhnya aku adalah malaikat. Aku tidak (juga) mengatakan kepada orang-orang yang dipandang hina oleh penglihatanmu bahwa Allah tidak akan memberikan kebaikan kepada mereka. Allah lebih mengetahui apa yang ada pada diri mereka. Jika demikian, sesungguhnya aku benar-benar termasuk orang-orang yang zalim.”"
  },
  {
    "ayat": 32,
    "arabic": "قَالُوْا يٰنُوْحُ قَدْ جَادَلْتَنَا فَاَ كْثَرْتَ جِدَالَنَا فَأْتِنَا بِمَا تَعِدُنَآ اِنْ كُنْتَ مِنَ الصّٰدِقِيْنَ",
    "transliteration_en": "Qaaloo yaa Noohu qad jaadaltanaa fa aksarta jidaalanaa faatinaa bimaa ta'idunaaa in kunta minas saadiqeen",
    "transliteration_id": "Qālū yā nūḥu qad jādaltanā fa akṡarta jidālanā fa'tinā bimā ta‘idunā in kunta minaṣ-ṣādiqīn(a).",
    "translation_en": "They said, \"O Noah, you have disputed us and been frequent in dispute of us. So bring us what you threaten us, if you should be of the truthful.\"",
    "translation_id": "Mereka berkata, “Wahai Nuh, sungguh engkau telah berbantah dengan kami dan engkau telah memperpanjang bantahanmu terhadap kami. Maka, datangkanlah kepada kami azab yang engkau ancamkan jika kamu termasuk orang-orang yang benar.”"
  },
  {
    "ayat": 33,
    "arabic": "قَالَ اِنَّمَا يَأْتِيْكُمْ بِهِ اللّٰهُ اِنْ شَاۤءَ وَمَآ اَنْتُمْ بِمُعْجِزِيْنَ",
    "transliteration_en": "Qaala innamaa yaateekum bihil laahu in shaaa'a wa maaa antum bimu'jizeen",
    "transliteration_id": "Qāla innamā ya'tīkum bihillāhu in syā'a wa mā antum bimu‘jizīn(a).",
    "translation_en": "He said, \"Allah will only bring it to you if He wills, and you will not cause [Him] failure.",
    "translation_id": "Dia (Nuh) menjawab, “Sesungguhnya hanya Allah yang akan mendatangkannya (azab) kepadamu jika Dia menghendaki dan sekali-kali kamu tidak akan dapat melepaskan diri (darinya)."
  },
  {
    "ayat": 34,
    "arabic": "وَلَا يَنْفَعُكُمْ نُصْحِيْٓ اِنْ اَرَدْتُّ اَنْ اَنْصَحَ لَكُمْ اِنْ كَانَ اللّٰهُ يُرِيْدُ اَنْ يُّغْوِيَكُمْ ۗهُوَ رَبُّكُمْ ۗوَاِلَيْهِ تُرْجَعُوْنَۗ",
    "transliteration_en": "Wa laa yanfa'ukum nusheee in arattu an ansaha lakum in kaanal laahu yureedu ai yughwi yakum; Huwa Rabbukum wa ilaihi turja'oon",
    "transliteration_id": "Wa lā yanfa‘ukum nuṣḥī in arattu an anṣaḥa lakum in kānallāhu yurīdu ay yugwiyakum, huwa rabbukum, wa ilaihi turja‘ūn(a).",
    "translation_en": "And my advice will not benefit you - although I wished to advise you - If Allah should intend to put you in error. He is your Lord, and to Him you will be returned.\"",
    "translation_id": "Nasihatku tidak akan bermanfaat bagimu sekalipun aku ingin menasihatimu, sekiranya Allah hendak menyesatkan kamu. Dia adalah Tuhanmu dan hanya kepada-Nyalah kamu dikembalikan.”"
  },
  {
    "ayat": 35,
    "arabic": "اَمْ يَقُوْلُوْنَ افْتَرٰىهُۗ قُلْ اِنِ افْتَرَيْتُهٗ فَعَلَيَّ اِجْرَامِيْ وَاَنَا۠ بَرِيْۤءٌ مِّمَّا تُجْرِمُوْنَ ࣖ",
    "transliteration_en": "Am yaqooloonaf taraahu qul inif taraituhoo fa'alaiya ijraamee wa ana bareee'um mimmaa tujrimoon",
    "transliteration_id": "Am yaqūlūnaftarāh(u), qul iniftaraituhū fa ‘alayya ijrāmī wa ana barī'um mimmā tujrimūn(a).",
    "translation_en": "Or do they say [about Prophet Muhammad], \"He invented it\"? Say, \"If I have invented it, then upon me is [the consequence of] my crime; but I am innocent of what [crimes] you commit.\"",
    "translation_id": "Bahkan, mereka (orang kafir Makkah) berkata, “Dia cuma mengada-adakannya (Al-Qur’an).” Katakanlah (Nabi Muhammad), “Jika aku mengada-adakannya, akulah yang akan memikul dosanya dan aku berlepas diri dari dosa yang kamu perbuat.”"
  },
  {
    "ayat": 36,
    "arabic": "وَاُوْحِيَ اِلٰى نُوْحٍ اَنَّهٗ لَنْ يُّؤْمِنَ مِنْ قَوْمِكَ اِلَّا مَنْ قَدْ اٰمَنَ فَلَا تَبْتَىِٕسْ بِمَا كَانُوْا يَفْعَلُوْنَۖ",
    "transliteration_en": "Wa oohiya ilaa Noohin annahoo lany-yu'mina min qawmika illaa man qad aamana falaa tabta'is bimaa kaanoo yaf'aloon",
    "transliteration_id": "Wa ūḥiya ilā nūḥin annahū lay yu'mina min qaumika illā man qad āmana falā tabta'is bimā kānū yaf‘alūn(a).",
    "translation_en": "And it was revealed to Noah that, \"No one will believe from your people except those who have already believed, so do not be distressed by what they have been doing.",
    "translation_id": "Diwahyukan (oleh Allah) kepada Nuh, “(Ketahuilah) bahwa tidak akan beriman di antara kaummu, kecuali orang yang benar-benar telah beriman. Maka, janganlah engkau bersedih atas apa yang selalu mereka perbuat."
  },
  {
    "ayat": 37,
    "arabic": "وَاصْنَعِ الْفُلْكَ بِاَعْيُنِنَا وَوَحْيِنَا وَلَا تُخَاطِبْنِيْ فِى الَّذِيْنَ ظَلَمُوْا ۚاِنَّهُمْ مُّغْرَقُوْنَ",
    "transliteration_en": "Wasna'il fulka bi-a'yuninaa wa wahyinaa wa laa tukhaa tibnee fil lazeena zalamoo; innahum mughraqoon",
    "transliteration_id": "Waṣna‘il-fulka bi'a‘yuninā wa waḥyinā wa lā tukhāṭibnī fil-lażīna ẓalamū, innahum mugraqūn(a).",
    "translation_en": "And construct the ship under Our observation and Our inspiration and do not address Me concerning those who have wronged; indeed, they are [to be] drowned.\"",
    "translation_id": "Buatlah bahtera dengan pengawasan dan petunjuk wahyu Kami dan janganlah engkau bicarakan (lagi) dengan-Ku tentang (nasib) orang-orang yang zalim. Sesungguhnya mereka itu akan ditenggelamkan.”"
  },
  {
    "ayat": 38,
    "arabic": "وَيَصْنَعُ الْفُلْكَۗ وَكُلَّمَا مَرَّ عَلَيْهِ مَلَاٌ مِّنْ قَوْمِهٖ سَخِرُوْا مِنْهُ ۗقَالَ اِنْ تَسْخَرُوْا مِنَّا فَاِنَّا نَسْخَرُ مِنْكُمْ كَمَا تَسْخَرُوْنَۗ",
    "transliteration_en": "Wa yasn'ul fulka wa kullamaa marra 'alaihi malaum min qawmihee sakhiroo minh; qaala in taskharoo minnaa fa innaa naskharu minkum kamaa taskharoon",
    "transliteration_id": "Wa yaṣna‘ul-fulk(a), wa kullamā marra ‘alaihi mala'um min qaumihī sakhirū minh(u), qāla in taskharū minnā fa innā naskharu minkum kamā taskharūn(a).",
    "translation_en": "And he constructed the ship, and whenever an assembly of the eminent of his people passed by him, they ridiculed him. He said, \"If you ridicule us, then we will ridicule you just as you ridicule.",
    "translation_id": "Mulailah dia (Nuh) membuat bahtera itu. Setiap kali para pemuka kaumnya berjalan melewatinya, mereka mengejeknya. Dia (Nuh) berkata, “Jika kamu mengejek kami, sesungguhnya kami pun akan mengejekmu sebagaimana kamu mengejek (kami)."
  },
  {
    "ayat": 39,
    "arabic": "فَسَوْفَ تَعْلَمُوْنَۙ مَنْ يَّأْتِيْهِ عَذَابٌ يُّخْزِيْهِ وَيَحِلُّ عَلَيْهِ عَذَابٌ مُّقِيْمٌ",
    "transliteration_en": "Fasawfa ta'lamoona mai yaateehi 'azaabuny yaukhzeehi wa yahillu 'alaihi 'azaabum muqeem",
    "transliteration_id": "Fa saufa ta‘lamūn(a), may ya'tīhi ‘ażābuy yukhzīhi wa yaḥillu ‘alaihi ‘ażābum muqīm(un).",
    "translation_en": "And you are going to know who will get a punishment that will disgrace him [on earth] and upon whom will descend an enduring punishment [in the Hereafter].\"",
    "translation_id": "Maka, kelak kamu mengetahui siapa (di antara kita) yang akan ditimpa azab yang menghinakan dan (siapa pula) yang akan ditimpa azab yang kekal.”"
  },
  {
    "ayat": 40,
    "arabic": "حَتّٰىٓ اِذَا جَاۤءَ اَمْرُنَا وَفَارَ التَّنُّوْرُۙ قُلْنَا احْمِلْ فِيْهَا مِنْ كُلٍّ زَوْجَيْنِ اثْنَيْنِ وَاَهْلَكَ اِلَّا مَنْ سَبَقَ عَلَيْهِ الْقَوْلُ وَمَنْ اٰمَنَ ۗوَمَآ اٰمَنَ مَعَهٗٓ اِلَّا قَلِيْلٌ",
    "transliteration_en": "Hattaaa izaa jaaa'a amrunaa wa faarat tannooru qulnah mil feehaa min kullin zawjainis naini wa ahlaka illaa man sabaqa 'alaihil qawlu wa man aaman; wa maaa aamana ma'ahooo illaa qaleel",
    "transliteration_id": "Ḥattā iżā jā'a amrunā wafārat-tannūr(u), qulnaḥmil fīhā min kullin zaujainiṡnaini wa ahlaka illā man sabaqa ‘alaihil-qaulu wa man āman(a), wa mā āmana ma‘ahū illā qalīl(un).",
    "translation_en": "[So it was], until when Our command came and the oven overflowed, We said, \"Load upon the ship of each [creature] two mates and your family, except those about whom the word has preceded, and [include] whoever has believed.\" But none had believed with him, except a few.",
    "translation_id": "(Demikianlah,) hingga apabila perintah Kami datang (untuk membinasakan mereka) dan tanur (tungku) telah memancarkan air, Kami berfirman, “Muatkanlah ke dalamnya (bahtera itu) dari masing-masing (jenis hewan) sepasang-sepasang (jantan dan betina), keluargamu kecuali orang yang telah terkena ketetapan terdahulu (akan ditenggelamkan), dan (muatkan pula) orang yang beriman.” Ternyata tidak beriman bersamanya (Nuh), kecuali hanya sedikit."
  },
  {
    "ayat": 41,
    "arabic": "۞ وَقَالَ ارْكَبُوْا فِيْهَا بِسْمِ اللّٰهِ مَجْرٰ۪ىهَا وَمُرْسٰىهَا ۗاِنَّ رَبِّيْ لَغَفُوْرٌ رَّحِيْمٌ",
    "transliteration_en": "Wa qaalar kaboo feehaa bismil laahi majraihaa wa mursaahaa; inna Rabbee la Ghafoorur Raheem",
    "transliteration_id": "Wa qālarkabū fīhā bismillāhi majrêhā wa mursāhā, inna rabbī lagafūrur raḥīm(un).",
    "translation_en": "And [Noah] said, \"Embark therein; in the name of Allah is its course and its anchorage. Indeed, my Lord is Forgiving and Merciful.\"",
    "translation_id": "Dia (Nuh) berkata, “Naiklah kamu semua ke dalamnya (bahtera) dengan (menyebut) nama Allah pada waktu berlayar dan berlabuhnya! Sesungguhnya Tuhanku benar-benar Maha Pengampun lagi Maha Penyayang.”"
  },
  {
    "ayat": 42,
    "arabic": "وَهِيَ تَجْرِيْ بِهِمْ فِيْ مَوْجٍ كَالْجِبَالِۗ وَنَادٰى نُوْحُ ِۨابْنَهٗ وَكَانَ فِيْ مَعْزِلٍ يّٰبُنَيَّ ارْكَبْ مَّعَنَا وَلَا تَكُنْ مَّعَ الْكٰفِرِيْنَ",
    "transliteration_en": "Wa hiya tajree bihim fee mawjin kaljibaali wa naadaa Noohunib nahoo wa kaana fee ma'ziliny yaa bunai yarkam ma'anaa wa laa takum ma'al kaafireen",
    "transliteration_id": "Wa hiya tajrī bihim fī maujin kal-jibāl(i), wa nādā nūḥunibnahū wa kāna fī ma‘ziliy yā bunayyarkam ma‘anā wa lā takum ma‘al-kāfirīn(a).",
    "translation_en": "And it sailed with them through waves like mountains, and Noah called to his son who was apart [from them], \"O my son, come aboard with us and be not with the disbelievers.\"",
    "translation_id": "Bahtera itu berlayar membawa mereka dalam gelombang laksana gunung-gunung. Nuh memanggil anaknya, sedang dia (anak itu) berada di tempat (yang jauh) terpencil, “Wahai anakku, naiklah (ke bahtera) bersama kami dan janganlah engkau bersama orang-orang kafir.”"
  },
  {
    "ayat": 43,
    "arabic": "قَالَ سَاٰوِيْٓ اِلٰى جَبَلٍ يَّعْصِمُنِيْ مِنَ الْمَاۤءِ ۗقَالَ لَا عَاصِمَ الْيَوْمَ مِنْ اَمْرِ اللّٰهِ اِلَّا مَنْ رَّحِمَ ۚوَحَالَ بَيْنَهُمَا الْمَوْجُ فَكَانَ مِنَ الْمُغْرَقِيْنَ",
    "transliteration_en": "Qaala sa aaweee ilaa jabaliny ya'simunee minal maaa'; qaala laa 'aasimal yawma min amril laahi illaa mar rahim; wa haala bainahumal mawju fakaana minal mughraqeen",
    "transliteration_id": "Qāla sa'āwī ilā jabaliy ya‘ṣimunī minal-mā'(i), qāla lā ‘āṣimal-yauma min amrillāhi illā ma raḥim(a), wa ḥāla bainahumal-mauju fa kāna minal-mugraqīn(a).",
    "translation_en": "[But] he said, \"I will take refuge on a mountain to protect me from the water.\" [Noah] said, \"There is no protector today from the decree of Allah, except for whom He gives mercy.\" And the waves came between them, and he was among the drowned.",
    "translation_id": "Dia (anaknya) menjawab, “Aku akan berlindung ke gunung yang dapat menyelamatkanku dari air (bah).” (Nuh) berkata, “Tidak ada penyelamat pada hari ini dari ketetapan Allah kecuali siapa yang dirahmati oleh-Nya.” Gelombang menjadi penghalang antara keduanya, maka jadilah dia (anak itu) termasuk orang-orang yang ditenggelamkan."
  },
  {
    "ayat": 44,
    "arabic": "وَقِيْلَ يٰٓاَرْضُ ابْلَعِيْ مَاۤءَكِ وَيٰسَمَاۤءُ اَقْلِعِيْ وَغِيْضَ الْمَاۤءُ وَقُضِيَ الْاَمْرُ وَاسْتَوَتْ عَلَى الْجُوْدِيِّ وَقِيْلَ بُعْدًا لِّلْقَوْمِ الظّٰلِمِيْنَ",
    "transliteration_en": "Wa qeela yaaa ardubla'ee maaa'aki wa yaa samaaa'u aqi'ee wa gheedal maaa'u wa qudiyal amru wastawat 'alal joodiyyi wa qeela bu'dal lilqawmiz zaalimeen",
    "transliteration_id": "Wa qīla yā arḍubla‘ī mā'aki wa yā samā'u aqli‘ī wa gīḍal-mā'u wa quḍiyal-amru wastawat ‘alal-jūdiyyi wa qīla bu‘dal lil-qaumiẓ-ẓālimīn(a).",
    "translation_en": "And it was said, \"O earth, swallow your water, and O sky, withhold [your rain].\" And the water subsided, and the matter was accomplished, and the ship came to rest on the [mountain of] Judiyy. And it was said, \"Away with the wrongdoing people.\"",
    "translation_id": "Difirmankan (oleh Allah), “Wahai bumi, telanlah airmu dan wahai langit, berhentilah (mencurahkan hujan).” Air pun disurutkan dan urusan (pembinasaan para pendurhaka) pun diselesaikan dan (kapal itu pun) berlabuh di atas gunung Judiy, dan dikatakan, “Kebinasaanlah bagi kaum yang zalim.”"
  },
  {
    "ayat": 45,
    "arabic": "وَنَادٰى نُوْحٌ رَّبَّهٗ فَقَالَ رَبِّ اِنَّ ابْنِيْ مِنْ اَهْلِيْۚ وَاِنَّ وَعْدَكَ الْحَقُّ وَاَنْتَ اَحْكَمُ الْحٰكِمِيْنَ",
    "transliteration_en": "Wa naadaa noohur Rabbahoo faqaala Rabbi innabnee min ahlee wa inna wa'dakal haqqu wa Anta ahkamul haakimeen",
    "transliteration_id": "Wa nādā nūḥur rabbahū fa qāla rabbi innabnī min ahlī, wa inna wa‘dakal-ḥaqqu wa anta aḥkamul-ḥākimīn(a).",
    "translation_en": "And Noah called to his Lord and said, \"My Lord, indeed my son is of my family; and indeed, Your promise is true; and You are the most just of judges!\"",
    "translation_id": "Nuh memohon kepada Tuhannya seraya berkata, “Ya Tuhanku, sesungguhnya anakku adalah termasuk keluargaku dan sesungguhnya janji-Mu itu pasti benar. Engkau adalah hakim yang paling adil.”"
  },
  {
    "ayat": 46,
    "arabic": "قَالَ يٰنُوْحُ اِنَّهٗ لَيْسَ مِنْ اَهْلِكَ ۚاِنَّهٗ عَمَلٌ غَيْرُ صَالِحٍ فَلَا تَسْـَٔلْنِ مَا لَيْسَ لَكَ بِهٖ عِلْمٌ ۗاِنِّيْٓ اَعِظُكَ اَنْ تَكُوْنَ مِنَ الْجٰهِلِيْنَ",
    "transliteration_en": "Qaala yaa Noohu innahoo laisa min ahlika innahoo 'amalun ghairu saalihin falaa tas'alni mmaa laisa laka bihee 'ilmun inneee a'izuka an takoona minal jaahileen",
    "transliteration_id": "Qāla yā nūḥu innahū laisa min ahlik(a), innahū ‘amalun gairu ṣāliḥ(in), falā tas'alnī mā laisa laka bihī ‘ilm(un), innī a‘iẓuka an takūna minal-jāhilīn(a).",
    "translation_en": "He said, \"O Noah, indeed he is not of your family; indeed, he is [one whose] work was other than righteous, so ask Me not for that about which you have no knowledge. Indeed, I advise you, lest you be among the ignorant.\"",
    "translation_id": "Dia (Allah) berfirman, “Wahai Nuh, sesungguhnya dia bukanlah termasuk keluargamu karena perbuatannya sungguh tidak baik. Oleh karena itu, janganlah engkau memohon kepada-Ku sesuatu yang tidak engkau ketahui (hakikatnya). Sesungguhnya Aku menasihatimu agar engkau tidak termasuk orang-orang bodoh.”"
  },
  {
    "ayat": 47,
    "arabic": "قَالَ رَبِّ اِنِّيْٓ اَعُوْذُ بِكَ اَنْ اَسْـَٔلَكَ مَا لَيْسَ لِيْ بِهٖ عِلْمٌ ۗوَاِلَّا تَغْفِرْ لِيْ وَتَرْحَمْنِيْٓ اَكُنْ مِّنَ الْخٰسِرِيْنَ",
    "transliteration_en": "Qaala rabbi inneee a'oozu bika an as'alaka maa laisa lee bihee 'ilmunw wa illaa taghfir lee wa tarhamneee akum minal khaasireen",
    "transliteration_id": "Qāla rabbi innī a‘ūżu bika an as'alaka mā laisa lī bihī ‘ilm(un), wa illā tagfir lī wa tarḥamnī akum minal-khāsirīn(a).",
    "translation_en": "[Noah] said, \"My Lord, I seek refuge in You from asking that of which I have no knowledge. And unless You forgive me and have mercy upon me, I will be among the losers.\"",
    "translation_id": "(Nuh) berkata, “Ya Tuhanku, sesungguhnya aku berlindung kepada-Mu untuk memohon sesuatu yang aku tidak mengetahui (hakikatnya). Kalau Engkau tidak mengampuniku dan (tidak) menaruh belas kasihan kepadaku, niscaya aku termasuk orang-orang yang merugi.”"
  },
  {
    "ayat": 48,
    "arabic": "قِيْلَ يٰنُوْحُ اهْبِطْ بِسَلٰمٍ مِّنَّا وَبَرَكٰتٍ عَلَيْكَ وَعَلٰٓى اُمَمٍ مِّمَّنْ مَّعَكَ ۗوَاُمَمٌ سَنُمَتِّعُهُمْ ثُمَّ يَمَسُّهُمْ مِّنَّا عَذَابٌ اَلِيْمٌ",
    "transliteration_en": "Qeela yaa Noohuh bit bisalaamim minnaa wa barakaatin 'alaika wa 'alaaa umamim mimmam ma'ak; wa umamun sanumatti'uhum summa yamassuhum minaa 'azaabun aleem",
    "transliteration_id": "Qīla yā nūḥuhbiṭ bisalāmim minnā wa barakātin ‘alaika wa ‘alā umamim mimmam ma‘ak(a), wa umamun sanumatti‘uhum ṡumma yamassuhum minnā ‘ażābun alīm(un).",
    "translation_en": "It was said, \"O Noah, disembark in security from Us and blessings upon you and upon nations [descending] from those with you. But other nations [of them] We will grant enjoyment; then there will touch them from Us a painful punishment.\"",
    "translation_id": "Dikatakan (melalui wahyu), “Wahai Nuh, turunlah (dari bahteramu) dengan penuh keselamatan dari Kami dan penuh keberkahan atasmu serta umat-umat (mukmin) yang bersamamu. Ada pula umat-umat (kafir) yang Kami beri kesenangan (dalam kehidupan dunia), kemudian mereka akan ditimpa azab dari Kami yang sangat pedih.”"
  },
  {
    "ayat": 49,
    "arabic": "تِلْكَ مِنْ اَنْۢبَاۤءِ الْغَيْبِ نُوْحِيْهَآ اِلَيْكَ ۚمَا كُنْتَ تَعْلَمُهَآ اَنْتَ وَلَا قَوْمُكَ مِنْ قَبْلِ هٰذَاۚ فَاصْبِرْۚ اِنَّ الْعَاقِبَةَ لِلْمُتَّقِيْنَ ࣖ",
    "transliteration_en": "Tilka min ambaaa'il ghaibi nooheehaaa ilaika maa kunta ta'lamuhaaaa anta wa laa qawmuka min qabli haazaa fasbir innal 'aaqibata lilmuttaqeen",
    "transliteration_id": "Tilka min ambā'il-gaibi nūḥīhā ilaik(a), mā kunta ta‘lamuhā anta wa lā qaumuka min qabli hāżā, faṣbir, innal-‘āqibata lil-muttaqīn(a).",
    "translation_en": "That is from the news of the unseen which We reveal to you, [O Muhammad]. You knew it not, neither you nor your people, before this. So be patient; indeed, the [best] outcome is for the righteous.",
    "translation_id": "Itu adalah sebagian dari berita-berita gaib yang Kami wahyukan kepadamu (Nabi Muhammad). Tidak pernah engkau mengetahuinya dan tidak (pula) kaummu sebelum ini. Maka, bersabarlah. Sesungguhnya kesudahan (yang baik) adalah bagi orang-orang yang bertakwa."
  },
  {
    "ayat": 50,
    "arabic": "وَاِلٰى عَادٍ اَخَاهُمْ هُوْدًا ۗقَالَ يٰقَوْمِ اعْبُدُوا اللّٰهَ مَا لَكُمْ مِّنْ اِلٰهٍ غَيْرُهٗ ۗاِنْ اَنْتُمْ اِلَّا مُفْتَرُوْنَ",
    "transliteration_en": "Wa ilaa 'aadin akhaahum Hoodaa; qaala yaa qawmi' budul laaha maa lakum min ilaahin ghairuhooo in antum illaa muftaroon",
    "transliteration_id": "Wa ilā ‘ādin akhāhum hūdā(n), qāla yā qaumi‘budullāha mā lakum min ilāhin gairuh(ū), in antum illā muftarūn(a).",
    "translation_en": "And to 'Aad [We sent] their brother Hud. He said, \"O my people, worship Allah; you have no deity other than Him. You are not but inventors [of falsehood].",
    "translation_id": "Kepada (kaum) ‘Ad (Kami utus) saudara mereka, Hud. Dia berkata, “Wahai kaumku, sembahlah Allah! Sekali-kali tidak ada tuhan bagimu selain Dia. (Selama ini) kamu hanyalah mengada-ada (dengan mempersekutukan Allah)."
  }
]