[
  {
    "ayat": 1,
    "arabic": "حٰمۤ  ۚ",
    "transliteration_en": "Haa Meeem",
    "transliteration_id": "Ḥā mīm.",
    "translation_en": "Ha, Meem.",
    "translation_id": "Ḥa Mīm."
  },
  {
    "ayat": 2,
    "arabic": "تَنْزِيْلٌ مِّنَ الرَّحْمٰنِ الرَّحِيْمِ ۚ",
    "transliteration_en": "Tanzeelum Minar-Rahmaanir-Raheem",
    "transliteration_id": "Tanzīlum minar-raḥmānir-raḥīm(i).",
    "translation_en": "[This is] a revelation from the Entirely Merciful, the Especially Merciful -",
    "translation_id": "(Al-Qur’an ini) diturunkan dari Tuhan Yang Maha Pengasih lagi Maha Penyayang."
  },
  {
    "ayat": 3,
    "arabic": "كِتٰبٌ فُصِّلَتْ اٰيٰتُهٗ قُرْاٰنًا عَرَبِيًّا لِّقَوْمٍ يَّعْلَمُوْنَۙ",
    "transliteration_en": "Kitaabun fussilat Aayaatuhoo Qur-aanan 'Arabiyyal liqawminy ya'lamoon",
    "transliteration_id": "Kitābun fuṣṣilat āyātuhū qur'ānan ‘arabiyyal liqaumiy ya‘lamūn(a).",
    "translation_en": "A Book whose verses have been detailed, an Arabic Qur'an for a people who know,",
    "translation_id": "Kitab yang ayat-ayatnya dijelaskan sebagai bacaan dalam bahasa Arab untuk kaum yang mengetahui,"
  },
  {
    "ayat": 4,
    "arabic": "بَشِيْرًا وَّنَذِيْرًاۚ فَاَعْرَضَ اَكْثَرُهُمْ فَهُمْ لَا يَسْمَعُوْنَ",
    "transliteration_en": "Basheeranw wa nazeeran fa-a'rada aksaruhum fahum laa yasma'oon",
    "transliteration_id": "Basyīraw wa nażīrā(n), fa'a‘raḍa akṡaruhum fahum lā yasma‘ūn(a).",
    "translation_en": "As a giver of good tidings and a warner; but most of them turn away, so they do not hear.",
    "translation_id": "yang membawa berita gembira dan peringatan. Akan tetapi, kebanyakan mereka berpaling (darinya) serta tidak mendengarkan."
  },
  {
    "ayat": 5,
    "arabic": "وَقَالُوْا قُلُوْبُنَا فِيْٓ اَكِنَّةٍ مِّمَّا تَدْعُوْنَآ اِلَيْهِ وَفِيْٓ اٰذَانِنَا وَقْرٌ وَّمِنْۢ بَيْنِنَا وَبَيْنِكَ حِجَابٌ فَاعْمَلْ اِنَّنَا عٰمِلُوْنَ",
    "transliteration_en": "Wa qaaloo quloobunaa feee akinnatim mimmaa tad'oonaaa ilaihi wa feee aazaaninaa waqrunw wa mim baininaa wa bainika bijaabun fa'mal innanaa 'aamiloon",
    "transliteration_id": "Wa qālū qulūbunā fī akinnatim mimmā tad‘ūnā ilaihi wa fī āżāninā waqruw wa mim baininā wa bainika ḥijābun fa‘mal  innanā ‘āmilūn(a).",
    "translation_en": "And they say, \"Our hearts are within coverings from that to which you invite us, and in our ears is deafness, and between us and you is a partition, so work; indeed, we are working.\"",
    "translation_id": "Mereka berkata, “Hati kami sudah tertutup dari apa yang engkau serukan kepada kami. Dalam telinga kami ada penyumbat dan di antara kami dan engkau ada tabir. Oleh sebab itu, lakukanlah (apa yang kamu sukai). Sesungguhnya kami akan melakukan (apa yang kami sukai).”"
  },
  {
    "ayat": 6,
    "arabic": "قُلْ اِنَّمَآ اَنَا۟ بَشَرٌ مِّثْلُكُمْ يُوْحٰىٓ اِلَيَّ اَنَّمَآ اِلٰهُكُمْ اِلٰهٌ وَّاحِدٌ فَاسْتَقِيْمُوْٓا اِلَيْهِ وَاسْتَغْفِرُوْهُ ۗوَوَيْلٌ لِّلْمُشْرِكِيْنَۙ",
    "transliteration_en": "Qul innamaaa ana basharum mislukum yoohaaa ilaiya annamaaa ilaahukum Ilaahunw Waahidun fastaqeemooo ilaihi wastagfirooh; wa wailul lil mushrikeen",
    "transliteration_id": "Qul innamā ana basyarum miṡlukum yūḥā ilayya annamā ilāhukum ilāhuw wāḥidun fastaqīmū ilaihi wastagfirūh(u), wa wailul lil-musyrikīn(a).",
    "translation_en": "Say, O [Muhammad], \"I am only a man like you to whom it has been revealed that your god is but one God; so take a straight course to Him and seek His forgiveness.\" And woe to those who associate others with Allah -",
    "translation_id": "Katakanlah (Nabi Muhammad), “Sesungguhnya aku hanyalah seorang manusia seperti kamu yang diwahyukan kepadaku bahwa Tuhan kamu adalah Tuhan Yang Maha Esa. Oleh sebab itu, tetaplah (dalam beribadah) dan mohonlah ampunan kepada-Nya. Celakalah orang-orang yang mempersekutukan(-Nya),"
  },
  {
    "ayat": 7,
    "arabic": "الَّذِيْنَ لَا يُؤْتُوْنَ الزَّكٰوةَ وَهُمْ بِالْاٰخِرَةِ هُمْ كٰفِرُوْنَ",
    "transliteration_en": "Allazeena laa yu'toonaz Zakaata wa hum bil-Aakhiratihum kaafiroon",
    "transliteration_id": "Allażīna lā yu'tūnaz-zakāta wa hum bil-ākhirati hum kāfirūn(a).",
    "translation_en": "Those who do not give zakah, and in the Hereafter they are disbelievers.",
    "translation_id": "(yaitu) orang-orang yang tidak menunaikan zakat dan mereka ingkar terhadap kehidupan akhirat."
  },
  {
    "ayat": 8,
    "arabic": "اِنَّ الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ لَهُمْ اَجْرٌ غَيْرُ مَمْنُوْنٍ ࣖ",
    "transliteration_en": "Innal lazeena aamanoo wa 'amilus saalihaati lahum ajrun ghairu mamnoon",
    "transliteration_id": "Innal-lażīna āmanū wa ‘amiluṣ-ṣāliḥāti lahum ajrun gairu mamnūn(in).",
    "translation_en": "Indeed, those who believe and do righteous deeds - for them is a reward uninterrupted.",
    "translation_id": "Sesungguhnya orang-orang yang beriman dan mengerjakan kebajikan, mereka akan mendapat pahala yang tidak ada putus-putusnya.”"
  },
  {
    "ayat": 9,
    "arabic": "۞ قُلْ اَىِٕنَّكُمْ لَتَكْفُرُوْنَ بِالَّذِيْ خَلَقَ الْاَرْضَ فِيْ يَوْمَيْنِ وَتَجْعَلُوْنَ لَهٗٓ اَنْدَادًا ۗذٰلِكَ رَبُّ الْعٰلَمِيْنَ ۚ",
    "transliteration_en": "Qul a'innakum latakfuroona billazee khalaqal arda fee yawmaini wa taj'aloona lahooo andaadaa; zaalika Rabbul 'aalameen",
    "transliteration_id": "Qul a'innakum latakfurūna bil-lażī khalaqal-arḍa fī yaumaini wa taj‘alūna lahū andādā(n), żālika rabbul-‘ālamīn(a).",
    "translation_en": "Say, \"Do you indeed disbelieve in He who created the earth in two days and attribute to Him equals? That is the Lord of the worlds.\"",
    "translation_id": "Katakanlah, “Pantaskah kamu mengingkari Tuhan yang menciptakan bumi dalam dua masa dan kamu adakan pula sekutu-sekutu bagi-Nya? Itulah Tuhan semesta alam.”"
  },
  {
    "ayat": 10,
    "arabic": "وَجَعَلَ فِيْهَا رَوَاسِيَ مِنْ فَوْقِهَا وَبٰرَكَ فِيْهَا وَقَدَّرَ فِيْهَآ اَقْوَاتَهَا فِيْٓ اَرْبَعَةِ اَيَّامٍۗ سَوَاۤءً لِّلسَّاۤىِٕلِيْنَ",
    "transliteration_en": "Wa ja'ala feehaa rawaa siya min fawqihaa wa baaraka feehaa wa qaddara feehaaaa aqwaatahaa feee arba'ati ayyaamin sawaaa'al lissaaa'ileen",
    "transliteration_id": "Wa ja‘ala fīhā rawāsiya min fauqihā wa bāraka fīhā wa qaddara fīhā aqwātahā fī arba‘ati ayyām(in), sawā'al lis-sā'ilīn(a).",
    "translation_en": "And He placed on the earth firmly set mountains over its surface, and He blessed it and determined therein its [creatures'] sustenance in four days without distinction - for [the information] of those who ask.",
    "translation_id": "Dia ciptakan pada (bumi) itu gunung-gunung yang kokoh di atasnya, lalu Dia memberkahi dan menentukan makanan-makanan (bagi penghuni)-nya dalam empat masa yang cukup untuk (kebutuhan) mereka yang memerlukannya."
  },
  {
    "ayat": 11,
    "arabic": "ثُمَّ اسْتَوٰىٓ اِلَى السَّمَاۤءِ وَهِيَ دُخَانٌ فَقَالَ لَهَا وَلِلْاَرْضِ ائْتِيَا طَوْعًا اَوْ كَرْهًاۗ قَالَتَآ اَتَيْنَا طَاۤىِٕعِيْنَ",
    "transliteration_en": "Summas tawaaa ilas-samaaa'i wa hiya dukhaanun faqaala lahaa wa lil ardi'tiyaaa taw'an aw karhan qaalataaa atainaa taaa'i'een",
    "transliteration_id": "Ṡummastawā ilas-samā'i wa hiya dukhānun faqāla lahā wa lil-arḍi'tiyā ṭau‘an au karhā(n), qālatā atainā ṭā'i‘īn(a).",
    "translation_en": "Then He directed Himself to the heaven while it was smoke and said to it and to the earth, \"Come [into being], willingly or by compulsion.\" They said, \"We have come willingly.\"",
    "translation_id": "Dia kemudian menuju ke langit dan (langit) itu masih berupa asap. Dia berfirman kepadanya dan kepada bumi, “Tunduklah kepada-Ku dengan patuh atau terpaksa.” Keduanya menjawab, “Kami tunduk dengan patuh.”"
  },
  {
    "ayat": 12,
    "arabic": "فَقَضٰىهُنَّ سَبْعَ سَمٰوَاتٍ فِيْ يَوْمَيْنِ وَاَوْحٰى فِيْ كُلِّ سَمَاۤءٍ اَمْرَهَا ۗوَزَيَّنَّا السَّمَاۤءَ الدُّنْيَا بِمَصَابِيْحَۖ وَحِفْظًا ۗذٰلِكَ تَقْدِيْرُ الْعَزِيْزِ الْعَلِيْمِ",
    "transliteration_en": "Faqadaahunna sab'a samaawaatin fee yawmaini wa awhaa fee kulli samaaa'in amarahaa; wa zaiyannassa maaa'ad dunyaa bimasaabeeha wa hifzaa; zaalika taqdeerul 'Azeezil 'Aleem",
    "transliteration_id": "Fa qaḍāhunna sab‘a samāwātin fī yaumaini wa auḥā fī kulli samā'in amrahā, wa zayyannas-samā'ad-dun-yā bimaṣābīḥa wa ḥifẓā(n), żālika taqdīrul-‘azīzil-‘alīm(i).",
    "translation_en": "And He completed them as seven heavens within two days and inspired in each heaven its command. And We adorned the nearest heaven with lamps and as protection. That is the determination of the Exalted in Might, the Knowing.",
    "translation_id": "Lalu, Dia menjadikannya tujuh langit dalam dua masa dan pada setiap langit Dia mewahyukan urusan masing-masing. Kemudian langit yang paling dekat (dengan bumi), Kami hiasi dengan bintang-bintang sebagai penjagaan (dari setan). Demikianlah ketetapan (Allah) Yang Maha Perkasa lagi Maha Mengetahui."
  },
  {
    "ayat": 13,
    "arabic": "فَاِنْ اَعْرَضُوْا فَقُلْ اَنْذَرْتُكُمْ صٰعِقَةً مِّثْلَ صٰعِقَةِ عَادٍ وَّثَمُوْدَ ۗ",
    "transliteration_en": "Fa-in a'radoo faqul anzartukum saa'iqatam misla saa'iqati 'Aadinw wa Samood",
    "transliteration_id": "Fa in a‘raḍū faqul anżartukum ṣā‘iqatam miṡla ṣā‘iqati ‘ādiw wa ṡamūd(a).",
    "translation_en": "But if they turn away, then say, \"I have warned you of a thunderbolt like the thunderbolt [that struck] 'Aad and Thamud.",
    "translation_id": "Jika mereka berpaling, katakanlah, “Aku telah memperingatkan kamu (azab berupa) petir seperti petir yang menimpa (kaum) ‘Ad dan (kaum) Samud.”"
  },
  {
    "ayat": 14,
    "arabic": "اِذْ جَاۤءَتْهُمُ الرُّسُلُ مِنْۢ بَيْنِ اَيْدِيْهِمْ وَمِنْ خَلْفِهِمْ اَلَّا تَعْبُدُوْٓا اِلَّا اللّٰهَ ۗقَالُوْا لَوْ شَاۤءَ رَبُّنَا لَاَنْزَلَ مَلٰۤىِٕكَةً فَاِنَّا بِمَآ اُرْسِلْتُمْ بِهٖ كٰفِرُوْنَ",
    "transliteration_en": "Iz jaaa'at humur Rusulu mim baini aydeehim wa min khalfihim allaa ta'budooo illal laaha qaaloo law shaaa'a Rabunaa la anzala malaaa 'ikatan fa innaa bimaaa ursiltum bihee kaafiroon",
    "transliteration_id": "Iż jā'athumur-rusulu mim baini aidīhim wa min khalfihim allā ta‘budū illallāh(a), qālū lau syā'a rabbunā la'anzala malā'ikatan fa'innā bimā ursiltum bihī kāfirūn(a).",
    "translation_en": "[That occurred] when the messengers had come to them before them and after them, [saying], \"Worship not except Allah.\" They said, \"If our Lord had willed, He would have sent down the angels, so indeed we, in that with which you have been sent, are disbelievers.\"",
    "translation_id": "Ketika para rasul datang kepada mereka dari depan dan dari belakang mereka (dengan menyerukan,) “Janganlah kamu menyembah selain Allah,” mereka menjawab, “Kalau Tuhan kami menghendaki, tentu Dia menurunkan malaikat-malaikat-Nya. Sesungguhnya kami ingkar pada kerasulanmu.”"
  },
  {
    "ayat": 15,
    "arabic": "فَاَمَّا عَادٌ فَاسْتَكْبَرُوْا فِى الْاَرْضِ بِغَيْرِ الْحَقِّ وَقَالُوْا مَنْ اَشَدُّ مِنَّا قُوَّةً ۗ اَوَلَمْ يَرَوْا اَنَّ اللّٰهَ الَّذِيْ خَلَقَهُمْ هُوَ اَشَدُّ مِنْهُمْ قُوَّةً ۗ وَكَانُوْا بِاٰيٰتِنَا يَجْحَدُوْنَ",
    "transliteration_en": "Fa ammaa 'Aadun fastak baroo fil ardi bighairul haqqi wa qaaloo man ashaddu minnaa quwwatan awalam yaraw annal laahal lazee khalaqahum Huwa ashaddu minhum quwwatanw wa kaanoo bi Aayaatinaa yajhadoon",
    "transliteration_id": "Fa ammā ‘ādun fastakbarū fil-arḍi bigairil-ḥaqqi wa qālū man asyaddu minnā quwwah(tan), awalam yarau annallāhal-lażī khalaqahum huwa asyaddu minhum quwwah(tan), wa kānū bi'āyātinā yajḥadūn(a).",
    "translation_en": "As for 'Aad, they were arrogant upon the earth without right and said, \"Who is greater than us in strength?\" Did they not consider that Allah who created them was greater than them in strength? But they were rejecting Our signs.",
    "translation_id": "Adapun (kaum) ‘Ad, mereka menyombongkan diri di bumi tanpa alasan yang benar. Mereka berkata, “Siapakah yang lebih hebat kekuatannya daripada kami?” Tidakkah mereka memperhatikan bahwa sesungguhnya Allah yang menciptakan mereka itu lebih hebat kekuatan-Nya daripada mereka? Mereka telah mengingkari tanda-tanda (kebesaran) Kami."
  },
  {
    "ayat": 16,
    "arabic": "فَاَرْسَلْنَا عَلَيْهِمْ رِيْحًا صَرْصَرًا فِيْٓ اَيَّامٍ نَّحِسَاتٍ لِّنُذِيْقَهُمْ عَذَابَ الْخِزْيِ فِى الْحَيٰوةِ الدُّنْيَا ۗوَلَعَذَابُ الْاٰخِرَةِ اَخْزٰى وَهُمْ لَا يُنْصَرُوْنَ",
    "transliteration_en": "Fa arsalnaa 'alaihim reehan sarsaran feee ayyaamin nahisaatil linuzeeqahum 'azaabal khizyi fil hayaatid dunyaa wa la'azaabul Aakhirati akhzaa wa hum laa yunsaroon",
    "transliteration_id": "Fa arsalnā ‘alaihim rīḥan ṣarṣaran fī ayyāmin naḥisātil linużīqahum-‘ażābal khizyi fil-ḥayātid-dun-yā, wa la‘ażābul-ākhirati akhzā wa hum lā yunṣarūn(a).",
    "translation_en": "So We sent upon them a screaming wind during days of misfortune to make them taste the punishment of disgrace in the worldly life; but the punishment of the Hereafter is more disgracing, and they will not be helped.",
    "translation_id": "Maka, Kami mengembuskan angin yang sangat dingin dan bergemuruh kepada mereka selama beberapa hari yang nahas karena Kami ingin agar mereka merasakan siksaan yang menghinakan dalam kehidupan di dunia. Sungguh, azab akhirat lebih menghinakan dan mereka tidak diberi pertolongan."
  },
  {
    "ayat": 17,
    "arabic": "وَاَمَّا ثَمُوْدُ فَهَدَيْنٰهُمْ فَاسْتَحَبُّوا الْعَمٰى عَلَى الْهُدٰى فَاَخَذَتْهُمْ صٰعِقَةُ الْعَذَابِ الْهُوْنِ بِمَا كَانُوْا يَكْسِبُوْنَ ۚ",
    "transliteration_en": "Wa ammaa Samoodu fahadinaahum fastahabbul 'ama 'alal huda fa akhazathum saa'iqatul 'azaabil hooni bimaa kaanoo yaksiboon",
    "transliteration_id": "Wa ammā ṡamūdu fa hadaināhum fastaḥabbul-‘amā ‘alal-hudā fa akhażathum ṣā‘iqatul-‘ażābil-hūni bimā kānū yaksibūn(a).",
    "translation_en": "And as for Thamud, We guided them, but they preferred blindness over guidance, so the thunderbolt of humiliating punishment seized them for what they used to earn.",
    "translation_id": "Adapun (kaum) Samud, mereka telah Kami beri petunjuk, tetapi mereka lebih menyukai kebutaan (kesesatan) daripada petunjuk itu. Maka, mereka disambar petir sebagai azab yang menghinakan karena apa yang telah mereka kerjakan."
  },
  {
    "ayat": 18,
    "arabic": "وَنَجَّيْنَا الَّذِيْنَ اٰمَنُوْا وَكَانُوْا يَتَّقُوْنَ ࣖ",
    "transliteration_en": "Wa najjainal lazeena aamanoo wa kaanoo yattaqoon",
    "transliteration_id": "Wa najjainal-lażīna āmanū wa kānū yattaqūn(a).",
    "translation_en": "And We saved those who believed and used to fear Allah.",
    "translation_id": "Kami menyelamatkan orang-orang yang beriman dan selalu bertakwa."
  },
  {
    "ayat": 19,
    "arabic": "وَيَوْمَ يُحْشَرُ اَعْدَاۤءُ اللّٰهِ اِلَى النَّارِ فَهُمْ يُوْزَعُوْنَ",
    "transliteration_en": "Wa yawma yuhsharu a'daaa'ul laahi ilan Naari fahum yooza'oon",
    "transliteration_id": "Wa yauma yuḥsyaru a‘dā'ullāhi ilan-nāri fahum yūza‘ūn(a).",
    "translation_en": "And [mention, O Muhammad], the Day when the enemies of Allah will be gathered to the Fire while they are [driven] assembled in rows,",
    "translation_id": "(Ingatlah) hari (ketika) musuh-musuh Allah digiring ke neraka, lalu mereka dipisah-pisahkan."
  },
  {
    "ayat": 20,
    "arabic": "حَتّٰىٓ اِذَا مَا جَاۤءُوْهَا شَهِدَ عَلَيْهِمْ سَمْعُهُمْ وَاَبْصَارُهُمْ وَجُلُوْدُهُمْ بِمَا كَانُوْا يَعْمَلُوْنَ",
    "transliteration_en": "Hattaaa izaa maa jaaa'oohaa shahida 'alaihim samu'uhum wa absaaruhum wa julooduhum bimaa kaanoo ya'maloon",
    "transliteration_id": "Ḥattā iżā mā jā'ūhā syahida ‘alaihim sam‘uhum wa abṣāruhum wa julūduhum bimā kānū ya‘malūn(a).",
    "translation_en": "Until, when they reach it, their hearing and their eyes and their skins will testify against them of what they used to do.",
    "translation_id": "Ketika mereka sampai ke neraka, pendengaran, penglihatan, dan kulit mereka menjadi saksi terhadap apa yang telah mereka lakukan."
  },
  {
    "ayat": 21,
    "arabic": "وَقَالُوْا لِجُلُوْدِهِمْ لِمَ شَهِدْتُّمْ عَلَيْنَا ۗقَالُوْٓا اَنْطَقَنَا اللّٰهُ الَّذِيْٓ اَنْطَقَ كُلَّ شَيْءٍ وَّهُوَ خَلَقَكُمْ اَوَّلَ مَرَّةٍۙ وَّاِلَيْهِ تُرْجَعُوْنَ",
    "transliteration_en": "Wa qaaloo lijuloodihim lima shahittum 'alainaa qaaloo antaqanal laahul lazeee antaqa kulla shai'inw wa Huwa khalaqakum awwala marratinw wa ilaihi turja'oon",
    "transliteration_id": "Wa qālū lijulūdihim lima syahittum ‘alainā, qālū anṭaqanallāhul-lażī anṭaqa kulla syai'iw wa huwa khalaqakum awwala marrah(tin), wa ilaihi turja‘ūn(a).",
    "translation_en": "And they will say to their skins, \"Why have you testified against us?\" They will say, \"We were made to speak by Allah, who has made everything speak; and He created you the first time, and to Him you are returned.",
    "translation_id": "Mereka berkata kepada kulit mereka, “Mengapa kamu menjadi saksi terhadap kami?” (Kulit) mereka menjawab, “Allah yang menjadikan segala sesuatu dapat berbicara telah menjadikan kami dapat berbicara. Dialah yang menciptakan kamu pertama kali dan hanya kepada-Nya kamu dikembalikan.”"
  },
  {
    "ayat": 22,
    "arabic": "وَمَا كُنْتُمْ تَسْتَتِرُوْنَ اَنْ يَّشْهَدَ عَلَيْكُمْ سَمْعُكُمْ وَلَآ اَبْصَارُكُمْ وَلَا جُلُوْدُكُمْ وَلٰكِنْ ظَنَنْتُمْ اَنَّ اللّٰهَ لَا يَعْلَمُ كَثِيْرًا مِّمَّا تَعْمَلُوْنَ",
    "transliteration_en": "Wa maa kuntum tastatiroona ai-yashhada 'alaikum sam'ukum wa laaa absaarukum wa laa juloodukum wa laakin zanantum annal laaha laa ya'lamu kaseeram mimmaa ta'maloon",
    "transliteration_id": "Wa mā kuntum tastatirūna ay yasyhada ‘alaikum sam‘ukum wa lā abṣārukum wa lā julūdukum wa lākin ẓanantum  annallāha lā ya‘lamu kaṡīram mimmā ta‘malūn(a).",
    "translation_en": "And you were not covering yourselves, lest your hearing testify against you or your sight or your skins, but you assumed that Allah does not know much of what you do.",
    "translation_id": "Kamu tidak dapat bersembunyi dari kesaksian pendengaran, penglihatan, dan kulitmu terhadapmu, bahkan kamu mengira Allah tidak mengetahui banyak tentang apa yang kamu lakukan."
  },
  {
    "ayat": 23,
    "arabic": "وَذٰلِكُمْ ظَنُّكُمُ الَّذِيْ ظَنَنْتُمْ بِرَبِّكُمْ اَرْدٰىكُمْ فَاَصْبَحْتُمْ مِّنَ الْخٰسِرِيْنَ",
    "transliteration_en": "Wa zaalikum zannukumul lazee zanantum bi-Rabbikum ardaakum fa asbahtum minal khaasireen",
    "transliteration_id": "Wa żālikum ẓannukumul-lażī ẓanantum birabbikum ardākum fa aṣbaḥtum minal-khāsirīn(a).",
    "translation_en": "And that was your assumption which you assumed about your Lord. It has brought you to ruin, and you have become among the losers.\"",
    "translation_id": "Itulah dugaanmu yang telah kamu sangkakan terhadap Tuhanmu. (Dugaan) itu telah membinasakan kamu sehingga jadilah kamu termasuk orang-orang yang rugi."
  },
  {
    "ayat": 24,
    "arabic": "فَاِنْ يَّصْبِرُوْا فَالنَّارُ مَثْوًى لَّهُمْ ۚوَاِنْ يَّسْتَعْتِبُوْا فَمَا هُمْ مِّنَ الْمُعْتَبِيْنَ",
    "transliteration_en": "Fa-iny yasbiroo fan Naaru maswal lahum wa iny-yasta'tiboo famaa hum minal mu'tabeen",
    "transliteration_id": "Fa iy yaṣbirū fan-nāru maṡwal lahum, wa iy yasta‘tibū famā hum minal-mu‘tabīn(a).",
    "translation_en": "So [even] if they are patient, the Fire is a residence for them; and if they ask to appease [Allah], they will not be of those who are allowed to appease.",
    "translation_id": "Jika mereka bersabar (atas azab neraka), nerakalah tempat tinggal mereka dan jika mereka meminta belas kasihan, maka mereka bukanlah orang yang pantas dikasihani."
  },
  {
    "ayat": 25,
    "arabic": "۞ وَقَيَّضْنَا لَهُمْ قُرَنَاۤءَ فَزَيَّنُوْا لَهُمْ مَّا بَيْنَ اَيْدِيْهِمْ وَمَا خَلْفَهُمْ وَحَقَّ عَلَيْهِمُ الْقَوْلُ فِيْٓ اُمَمٍ قَدْ خَلَتْ مِنْ قَبْلِهِمْ مِّنَ الْجِنِّ وَالْاِنْسِۚ اِنَّهُمْ كَانُوْا خٰسِرِيْنَ ࣖ",
    "transliteration_en": "Wa qaiyadnaa lahum quranaaa'a fazaiyanoo lahum maa baina aideehim wa maa khalfahum wa haqqa 'alaihimul qawlu feee umamin qad khalat min qablihim minal jinni wal insi innahum kaanoo khaasireen",
    "transliteration_id": "Wa qayyaḍnā lahum quranā'a fa zayyanū lahum mā baina aidīhim wa mā khalfahum wa ḥaqqa ‘alaihimul-qaulu fī umamin qad khalat min qablihim minal-jinni wal-ins(i), innahum kānū khāsirīn(a).",
    "translation_en": "And We appointed for them companions who made attractive to them what was before them and what was behind them [of sin], and the word has come into effect upon them among nations which had passed on before them of jinn and men. Indeed, they [all] were losers.",
    "translation_id": "Kami menetapkan bagi mereka teman-teman (dari setan) yang memuji-muji apa saja yang ada di hadapan (nafsu dan kelezatan dunia) dan di belakang (angan-angan) mereka. Tetaplah atas mereka putusan (azab) bersama umat-umat yang terdahulu sebelum mereka dari (golongan) jin dan manusia. Sesungguhnya mereka adalah orang-orang yang rugi."
  },
  {
    "ayat": 26,
    "arabic": "وَقَالَ الَّذِيْنَ كَفَرُوْا لَا تَسْمَعُوْا لِهٰذَا الْقُرْاٰنِ وَالْغَوْا فِيْهِ لَعَلَّكُمْ تَغْلِبُوْنَ",
    "transliteration_en": "Wa qaalal lazeena kafaroo laa tasma'oo lihaazal Quraani walghaw feehi la'allakum taghlihoon",
    "transliteration_id": "Wa qālal-lażīna kafarū lā tasma‘ū lihāżal-qur'āni walgau fīhi la‘allakum taglibūn(a).",
    "translation_en": "And those who disbelieve say, \"Do not listen to this Qur'an and speak noisily during [the recitation of] it that perhaps you will overcome.\"",
    "translation_id": "Orang-orang yang kufur berkata, “Janganlah kamu mendengarkan (bacaan) Al-Qur’an ini dan buatlah kegaduhan terhadapnya agar kamu dapat mengalahkan (mereka).\""
  },
  {
    "ayat": 27,
    "arabic": "فَلَنُذِيْقَنَّ الَّذِيْنَ كَفَرُوْا عَذَابًا شَدِيْدًاۙ وَّلَنَجْزِيَنَّهُمْ اَسْوَاَ الَّذِيْ كَانُوْا يَعْمَلُوْنَ",
    "transliteration_en": "Falanuzeeqannal lazeena kafaroo 'azaaban shadeedanw wa lanajziyannahum aswallazee kaanoo ya'maloon",
    "transliteration_id": "Fa lanużīqannal-lażīna kafarū ‘ażāban syadīdā(n), wa lanajziyannahum aswa'al-lażī  kānū ya‘malūn(a).",
    "translation_en": "But We will surely cause those who disbelieve to taste a severe punishment, and We will surely recompense them for the worst of what they had been doing.",
    "translation_id": "Sungguh, Kami pasti akan menimpakan azab yang keras kepada orang-orang yang kufur itu dan sungguh, Kami pasti akan membalas mereka dengan seburuk-buruk balasan (atas) apa yang telah mereka kerjakan."
  },
  {
    "ayat": 28,
    "arabic": "ذٰلِكَ جَزَاۤءُ اَعْدَاۤءِ اللّٰهِ النَّارُ لَهُمْ فِيْهَا دَارُ الْخُلْدِ ۗجَزَاۤءً ۢبِمَا كَانُوْا بِاٰيٰتِنَا يَجْحَدُوْنَ",
    "transliteration_en": "Zaalika jazaaa'u a'daaa'il laahin Naaru lahum feehaa daarul khuld, jazaaa'am bimaa kaanoo bi aayaatinaa yajhdoon",
    "transliteration_id": "Żālika jazā'u a‘dā'illāhin-nāru lahum fīhā dārul-khuld(i), jazā'am bimā kānū bi'āyātinā yajḥadūn(a).",
    "translation_en": "That is the recompense of the enemies of Allah - the Fire. For them therein is the home of eternity as recompense for what they, of Our verses, were rejecting.",
    "translation_id": "Itulah neraka, balasan (bagi) musuh-musuh Allah. Mereka mendapat tempat tinggal yang kekal di dalamnya sebagai balasan atas keingkaran mereka terhadap ayat-ayat Kami."
  },
  {
    "ayat": 29,
    "arabic": "وَقَالَ الَّذِيْنَ كَفَرُوْا رَبَّنَآ اَرِنَا الَّذَيْنِ اَضَلّٰنَا مِنَ الْجِنِّ وَالْاِنْسِ نَجْعَلْهُمَا تَحْتَ اَقْدَامِنَا لِيَكُوْنَا مِنَ الْاَسْفَلِيْنَ",
    "transliteration_en": "Wa qaalal lazeena kafaroo Rabbanaaa arinal lazaini adal laanaa minal jinni wal insi naj'alhumaa tahta aqdaaminaa liyakoonaa minal asfaleen",
    "transliteration_id": "Wa qālal-lażīna kafarū rabbanā arinal-lażaini aḍallānā minal-jinni wal-insi naj‘alhumā taḥta aqdāminā liyakūnā minal-asfalīn(a).",
    "translation_en": "And those who disbelieved will [then] say, \"Our Lord, show us those who misled us of the jinn and men [so] we may put them under our feet that they will be among the lowest.\"",
    "translation_id": "Orang-orang yang kufur berkata, “Ya Tuhan kami, perlihatkanlah kepada kami dua golongan yang telah menyesatkan kami, yaitu (golongan) jin dan manusia, agar kami meletakkan keduanya di bawah telapak kaki kami supaya keduanya menjadi golongan yang paling bawah (hina).”"
  },
  {
    "ayat": 30,
    "arabic": "اِنَّ الَّذِيْنَ قَالُوْا رَبُّنَا اللّٰهُ ثُمَّ اسْتَقَامُوْا تَتَنَزَّلُ عَلَيْهِمُ الْمَلٰۤىِٕكَةُ اَلَّا تَخَافُوْا وَلَا تَحْزَنُوْا وَاَبْشِرُوْا بِالْجَنَّةِ الَّتِيْ كُنْتُمْ تُوْعَدُوْنَ",
    "transliteration_en": "Innal lazeena qaaloo Rabbunal laahu summas taqaamoo tatanazzalu 'alaihimul malaaa 'ikatu allaa takhaafoo wa laa tahzanoo wa abshiroo bil Jannnatil latee kuntum too'adoon",
    "transliteration_id": "Innal-lażīna qālū rabbunallāhu ṡummastaqāmū tatanazzalu ‘alaihimul-malā'ikatu allā takhāfū wa lā taḥzanū wa absyirū bil-jannatil-latī kuntum tū‘adūn(a).",
    "translation_en": "Indeed, those who have said, \"Our Lord is Allah \" and then remained on a right course - the angels will descend upon them, [saying], \"Do not fear and do not grieve but receive good tidings of Paradise, which you were promised.",
    "translation_id": "Sesungguhnya orang-orang yang berkata, “Tuhan kami adalah Allah,” kemudian tetap (dalam pendiriannya), akan turun malaikat-malaikat kepada mereka (seraya berkata), “Janganlah kamu takut dan bersedih hati serta bergembiralah dengan (memperoleh) surga yang telah dijanjikan kepadamu.”"
  },
  {
    "ayat": 31,
    "arabic": "نَحْنُ اَوْلِيَاۤؤُكُمْ فِى الْحَيٰوةِ الدُّنْيَا وَفِى الْاٰخِرَةِ ۚوَلَكُمْ فِيْهَا مَا تَشْتَهِيْٓ اَنْفُسُكُمْ وَلَكُمْ فِيْهَا مَا تَدَّعُوْنَ ۗ",
    "transliteration_en": "Nahnu awliyaaa'ukum fil hayaatid dunyaa wa fil Aakhirati wa lakum feehaa maa tashtaheee anfusukum wa lakum feehaa ma tadda'oon",
    "transliteration_id": "Naḥnu auliyā'ukum fil-ḥayātid-dun-yā wa fil-ākhirah(ti), wa lakum fīhā mā tasytahī anfusukum wa lakum fīhā mā tadda‘ūn(a).",
    "translation_en": "We [angels] were your allies in worldly life and [are so] in the Hereafter. And you will have therein whatever your souls desire, and you will have therein whatever you request [or wish]",
    "translation_id": "Kamilah pelindung-pelindungmu dalam kehidupan dunia dan akhirat. Di dalamnya (surga) kamu akan memperoleh apa yang kamu sukai dan apa yang kamu minta."
  },
  {
    "ayat": 32,
    "arabic": "نُزُلًا مِّنْ غَفُوْرٍ رَّحِيْمٍ ࣖ",
    "transliteration_en": "Nuzulam min Ghafoorir Raheem",
    "transliteration_id": "Nuzulam min gafūrir raḥīm(in).",
    "translation_en": "As accommodation from a [Lord who is] Forgiving and Merciful.\"",
    "translation_id": "(Semua itu) sebagai karunia (penghormatan bagimu) dari (Allah) Yang Maha Pengampun lagi Maha Penyayang.”"
  },
  {
    "ayat": 33,
    "arabic": "وَمَنْ اَحْسَنُ قَوْلًا مِّمَّنْ دَعَآ اِلَى اللّٰهِ وَعَمِلَ صَالِحًا وَّقَالَ اِنَّنِيْ مِنَ الْمُسْلِمِيْنَ",
    "transliteration_en": "Wa man ahsanu qawlam mimman da'aaa ilal laahi wa 'amila saalihanw wa qaala innanee minal muslimeen",
    "transliteration_id": "Wa man aḥsanu qaulam mimman da‘ā ilallāhi wa ‘amila ṣāliḥaw wa qāla innanī minal-muslimīn(a).",
    "translation_en": "And who is better in speech than one who invites to Allah and does righteousness and says, \"Indeed, I am of the Muslims.\"",
    "translation_id": "Siapakah yang lebih baik perkataannya daripada orang yang menyeru kepada Allah, mengerjakan kebajikan, dan berkata, “Sesungguhnya aku termasuk orang-orang muslim (yang berserah diri)?”"
  },
  {
    "ayat": 34,
    "arabic": "وَلَا تَسْتَوِى الْحَسَنَةُ وَلَا السَّيِّئَةُ ۗاِدْفَعْ بِالَّتِيْ هِيَ اَحْسَنُ فَاِذَا الَّذِيْ بَيْنَكَ وَبَيْنَهٗ عَدَاوَةٌ كَاَنَّهٗ وَلِيٌّ حَمِيْمٌ",
    "transliteration_en": "Wa laa tastawil hasanatu wa las saiyi'ah; idfa' billatee hiya ahsanu fa'izal lazee bainaka wa bainahoo 'adaawatun ka'annahoo waliyun hameem",
    "transliteration_id": "Wa lā tastawil-ḥasanatu wa las-sayyi'ah(tu), idfa‘ bil-latī hiya aḥsanu fa'iżal-lażī bainaka wa bainahū ‘adāwatun ka'annahū waliyyun ḥamīm(un).",
    "translation_en": "And not equal are the good deed and the bad. Repel [evil] by that [deed] which is better; and thereupon the one whom between you and him is enmity [will become] as though he was a devoted friend.",
    "translation_id": "Tidaklah sama kebaikan dengan kejahatan. Tolaklah (kejahatan) dengan perilaku yang lebih baik sehingga orang yang ada permusuhan denganmu serta-merta menjadi seperti teman yang sangat setia."
  },
  {
    "ayat": 35,
    "arabic": "وَمَا يُلَقّٰىهَآ اِلَّا الَّذِيْنَ صَبَرُوْاۚ وَمَا يُلَقّٰىهَآ اِلَّا ذُوْ حَظٍّ عَظِيْمٍ",
    "transliteration_en": "Wa maa yulaqqaahaaa illal lazeena sabaroo wa maa yulaqqaahaaa illaa zoo hazzin 'azeem",
    "transliteration_id": "Wa mā yulaqqāhā illal-lażīna ṣabarū, wa mā yulaqqāhā illā żū ḥaẓẓin ‘aẓīm(in).",
    "translation_en": "But none is granted it except those who are patient, and none is granted it except one having a great portion [of good].",
    "translation_id": "(Sifat-sifat yang baik itu) tidak akan dianugerahkan kecuali kepada orang-orang yang sabar dan tidak (pula) dianugerahkan kecuali kepada orang-orang yang mempunyai keberuntungan yang besar."
  },
  {
    "ayat": 36,
    "arabic": "وَاِمَّا يَنْزَغَنَّكَ مِنَ الشَّيْطٰنِ نَزْغٌ فَاسْتَعِذْ بِاللّٰهِ ۗاِنَّهٗ هُوَ السَّمِيْعُ الْعَلِيْمُ",
    "transliteration_en": "Wa immaa yanzaghannaka minash Shaitaani nazghun fasta'iz billaahi innahoo Huwas Samee'ul 'Aleem",
    "transliteration_id": "Wa immā yanzagannaka minasy-syaiṭāni nazgun fasta‘iż billāh(i), innahū huwas-samī‘ul-‘alīm(u).",
    "translation_en": "And if there comes to you from Satan an evil suggestion, then seek refuge in Allah. Indeed, He is the Hearing, the Knowing.",
    "translation_id": "Jika setan sungguh-sungguh menggodamu dengan halus (untuk meninggalkan perilaku baik itu), maka berlindunglah kepada Allah! Sesungguhnya Dialah Yang Maha Mendengar lagi Maha Mengetahui."
  },
  {
    "ayat": 37,
    "arabic": "وَمِنْ اٰيٰتِهِ الَّيْلُ وَالنَّهَارُ وَالشَّمْسُ وَالْقَمَرُۗ  لَا تَسْجُدُوْا لِلشَّمْسِ وَلَا لِلْقَمَرِ وَاسْجُدُوْا لِلّٰهِ الَّذِيْ خَلَقَهُنَّ اِنْ كُنْتُمْ اِيَّاهُ تَعْبُدُوْنَ",
    "transliteration_en": "Wa min Aayaatihil lailu wannahaaru washshamsu walqamar; laa tasjudoo lishshamsi wa laa lilqamari wasjudoo lillaahil lazee khala qahunna in kuntum iyyaahu ta'budoon",
    "transliteration_id": "Wa min āyātihil-lailu wan-nahāru wasy-syamsu wal-qamar(u), lā tasjudū lisy-syamsi wa lā lil-qamari wasjudū lillāhil-lażī khalaqahunna in kuntum iyyāhu ta‘budūn(a).",
    "translation_en": "And of His signs are the night and day and the sun and moon. Do not prostrate to the sun or to the moon, but prostate to Allah, who created them, if it should be Him that you worship.",
    "translation_id": "Sebagian dari tanda-tanda (kebesaran)-Nya adalah malam, siang, matahari, dan bulan. Janganlah bersujud pada matahari dan jangan (pula) pada bulan. Bersujudlah kepada Allah yang menciptakannya jika kamu hanya menyembah kepada-Nya."
  },
  {
    "ayat": 38,
    "arabic": "فَاِنِ اسْتَكْبَرُوْا فَالَّذِيْنَ عِنْدَ رَبِّكَ يُسَبِّحُوْنَ لَهٗ بِالَّيْلِ وَالنَّهَارِ وَهُمْ لَا يَسْـَٔمُوْنَ ۩",
    "transliteration_en": "Fa inis-takbaroo fallazee na 'inda Rabbika yusabbihoona lahoo billaili wannnahaari wa hum laa yas'amoon",
    "transliteration_id": "Fa inistakbarū fal-lażīna ‘inda rabbika yusabbiḥūna lahū bil-laili wan-nahāri wa hum lā yas'amūn(a).",
    "translation_en": "But if they are arrogant - then those who are near your Lord exalt Him by night and by day, and they do not become weary.",
    "translation_id": "Jika mereka (orang-orang musyrik) menyombongkan diri (enggan bersujud kepada-Nya), mereka (malaikat) yang (berada) di sisi Tuhanmu selalu bertasbih kepada-Nya pada malam dan siang hari tanpa pernah jemu."
  },
  {
    "ayat": 39,
    "arabic": "وَمِنْ اٰيٰتِهٖٓ اَنَّكَ تَرَى الْاَرْضَ خَاشِعَةً فَاِذَآ اَنْزَلْنَا عَلَيْهَا الْمَاۤءَ اهْتَزَّتْ وَرَبَتْۗ اِنَّ الَّذِيْٓ اَحْيَاهَا لَمُحْيِ الْمَوْتٰى ۗاِنَّهٗ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ",
    "transliteration_en": "Wa min Aayaatiheee annaka taral arda khaashi'atan fa izaaa anzalna 'alaihal maaa'ah tazzat wa rabat; innal lazeee ahyaahaa lamuhiyil mawtaa; innahoo 'alaa kulli shai-in Qadeer",
    "transliteration_id": "Wa min āyātihī annaka taral-arḍa khāsyi‘atan fa iżā anzalnā ‘alaihal-mā'ahtazzat wa rabat, innal-lażī aḥyāhā lamuḥyil-mautā, innahū ‘alā kulli syai'in qadīr(un).",
    "translation_en": "And of His signs is that you see the earth stilled, but when We send down upon it rain, it quivers and grows. Indeed, He who has given it life is the Giver of Life to the dead. Indeed, He is over all things competent.",
    "translation_id": "Sebagian dari tanda-tanda (kebesaran)-Nya adalah bahwa engkau melihat bumi kering dan tandus, kemudian apabila Kami menurunkan air (hujan) padanya, ia pun hidup dan menjadi subur. Sesungguhnya Zat yang menghidupkannya pasti dapat menghidupkan yang mati. Sesungguhnya Dia Maha Kuasa atas segala sesuatu."
  },
  {
    "ayat": 40,
    "arabic": "اِنَّ الَّذِيْنَ يُلْحِدُوْنَ فِيْٓ اٰيٰتِنَا لَا يَخْفَوْنَ عَلَيْنَاۗ اَفَمَنْ يُّلْقٰى فِى النَّارِ خَيْرٌ اَمْ مَّنْ يَّأْتِيْٓ اٰمِنًا يَّوْمَ الْقِيٰمَةِ ۗاِعْمَلُوْا مَا شِئْتُمْ ۙاِنَّهٗ بِمَا تَعْمَلُوْنَ بَصِيْرٌ",
    "transliteration_en": "Innal lazeena yulhidoona feee Aayaatina laa yakhfawna 'alainaa' afamai yulqaa fin Naari khayrun am mai yaateee aaminai Yawmal Qiyaamah; i'maloo ma shi'tum innahoo bimaa ta'maloona Baseer",
    "transliteration_id": "Innal-lażīna yulḥidūna fī āyātinā lā yakhfauna ‘alainā, afamay yulqā fin-nāri khairun am may ya'tī āminay yaumal-qiyāmah(ti), i‘malū mā syi'tum, innahū bimā ta‘malūna  baṣīr(un).",
    "translation_en": "Indeed, those who inject deviation into Our verses are not concealed from Us. So, is he who is cast into the Fire better or he who comes secure on the Day of Resurrection? Do whatever you will; indeed, He is Seeing of what you do.",
    "translation_id": "Sesungguhnya orang-orang yang mengingkari tanda-tanda (kebesaran) Kami, (mereka) tidak tersembunyi dari Kami. Apakah orang-orang yang dilemparkan ke dalam neraka itu lebih baik ataukah yang datang pada hari Kiamat dengan aman sentosa? Lakukanlah apa yang kamu kehendaki! Sesungguhnya Dia Maha Melihat apa yang kamu kerjakan."
  },
  {
    "ayat": 41,
    "arabic": "اِنَّ الَّذِيْنَ كَفَرُوْا بِالذِّكْرِ لَمَّا جَاۤءَهُمْ ۗوَاِنَّهٗ لَكِتٰبٌ عَزِيْزٌ ۙ",
    "transliteration_en": "Inna Lazeena kafaroo biz Zikri lammaa jaa'ahum wa innahoo la Kitaabun 'Azeez",
    "transliteration_id": "Innal-lażīna kafarū biż-żikri lammā jā'ahum, wa innahū lakitābun ‘azīz(un).",
    "translation_en": "Indeed, those who disbelieve in the message after it has come to them... And indeed, it is a mighty Book.",
    "translation_id": "Sesungguhnya orang-orang yang mengingkari Al-Qur’an ketika (Al-Qur’an) itu disampaikan kepada mereka, (pasti mereka akan celaka). Sesungguhnya (Al-Qur’an) itu adalah kitab yang mulia."
  },
  {
    "ayat": 42,
    "arabic": "لَّا يَأْتِيْهِ الْبَاطِلُ مِنْۢ بَيْنِ يَدَيْهِ وَلَا مِنْ خَلْفِهٖ ۗتَنْزِيْلٌ مِّنْ حَكِيْمٍ حَمِيْدٍ",
    "transliteration_en": "Laa yaateehil baatilu mim baini yadaihi wa laa min khalfihee tanzeelum min Hakeemin Hameed",
    "transliteration_id": "Lā ya'tīhil-bāṭilu mim baini yadaihi wa lā min khalfih(ī), tanzīlum min ḥakīmin ḥamīd(in).",
    "translation_en": "Falsehood cannot approach it from before it or from behind it; [it is] a revelation from a [Lord who is] Wise and Praiseworthy.",
    "translation_id": "Tidak ada kebatilan yang mendatanginya, baik dari depan maupun dari belakang. (Al-Qur’an itu adalah) kitab yang diturunkan dari Tuhan Yang Maha Bijaksana lagi Maha Terpuji."
  },
  {
    "ayat": 43,
    "arabic": "مَا يُقَالُ لَكَ اِلَّا مَا قَدْ قِيْلَ لِلرُّسُلِ مِنْ قَبْلِكَ ۗاِنَّ رَبَّكَ لَذُوْ مَغْفِرَةٍ وَّذُوْ عِقَابٍ اَلِيْمٍ",
    "transliteration_en": "Maa yuqaalu laka illaa maa qad qeela lir Rusuli min qablik; inna Rabbaka lazoo maghfiratinw wa zoo 'iqaabin aleem",
    "transliteration_id": "Mā yuqālu laka illā mā qad qīla lir-rusuli min qablik(a), inna rabbaka lażū magfiratiw wa żū ‘iqābin alīm(in).",
    "translation_en": "Nothing is said to you, [O Muhammad], except what was already said to the messengers before you. Indeed, your Lord is a possessor of forgiveness and a possessor of painful penalty.",
    "translation_id": "Apa yang dikatakan (oleh orang-orang kafir) kepadamu tidak lain adalah apa yang telah dikatakan kepada rasul-rasul sebelummu. Sesungguhnya Tuhanmu pasti mempunyai ampunan dan azab yang pedih."
  },
  {
    "ayat": 44,
    "arabic": "وَلَوْ جَعَلْنٰهُ قُرْاٰنًا اَعْجَمِيًّا لَّقَالُوْا لَوْلَا فُصِّلَتْ اٰيٰتُهٗ ۗ ءَاَ۬عْجَمِيٌّ وَّعَرَبِيٌّ ۗ قُلْ هُوَ لِلَّذِيْنَ اٰمَنُوْا هُدًى وَّشِفَاۤءٌ ۗوَالَّذِيْنَ لَا يُؤْمِنُوْنَ فِيْٓ اٰذَانِهِمْ وَقْرٌ وَّهُوَ عَلَيْهِمْ عَمًىۗ اُولٰۤىِٕكَ يُنَادَوْنَ مِنْ مَّكَانٍۢ بَعِيْدٍ ࣖ",
    "transliteration_en": "Wa law ja'alnaahu Qur-aanan A'jamiyyal laqaaloo law laa fussilat Aayaatuhoo 'a A'jamiyyunw wa 'Arabiyy; qul huwa lillazeena aamanoo hudanw wa shifaaa'unw wallazeena la yu'minoona feee aazaanihim waqrunw wa huwa 'alaihim 'amaa; ulaaa'ika yunaadawna mim maakaanim ba'eed",
    "transliteration_id": "Wa lau ja‘alnāhu qur'ānan a‘jamiyyal laqālū lau lā fuṣṣilat āyātuh(ū), a'a‘jamiyyuw wa ‘arabiyy(un), qul huwa lil-lażīna āmanū hudaw wa syifā'(un), wal-lażīna lā yu'minūna fī āżānihim waqruw wa huwa ‘alaihim ‘amā(n), ulā'ika yunādauna mim makānim ba‘īd(in).",
    "translation_en": "And if We had made it a non-Arabic Qur'an, they would have said, \"Why are its verses not explained in detail [in our language]? Is it a foreign [recitation] and an Arab [messenger]?\" Say, \"It is, for those who believe, a guidance and cure.\" And those who do not believe - in their ears is deafness, and it is upon them blindness. Those are being called from a distant place.",
    "translation_id": "Seandainya Kami menjadikannya (Al-Qur’an) bacaan dalam bahasa selain Arab, niscaya mereka akan mengatakan, “Mengapa ayat-ayatnya tidak dijelaskan (dengan bahasa yang kami pahami)?” Apakah patut (Al-Qur’an) dalam bahasa selain bahasa Arab, sedangkan (rasul adalah) orang Arab? Katakanlah (Nabi Muhammad), “Al-Qur’an adalah petunjuk dan penyembuh bagi orang-orang yang beriman, sedangkan orang-orang yang tidak beriman, pada telinga mereka ada penyumbat dan mereka buta terhadapnya (Al-Qur’an). Mereka itu (seperti) orang-orang yang dipanggil dari tempat yang jauh.”"
  },
  {
    "ayat": 45,
    "arabic": "وَلَقَدْ اٰتَيْنَا مُوْسَى الْكِتٰبَ فَاخْتُلِفَ فِيْهِ ۗوَلَوْلَا كَلِمَةٌ سَبَقَتْ مِنْ رَّبِّكَ لَقُضِيَ بَيْنَهُمْ ۗوَاِنَّهُمْ لَفِيْ شَكٍّ مِّنْهُ مُرِيْبٍ",
    "transliteration_en": "Wa laqad aatainaa Moosal Kitaaba fakhtulifa fee; wa lawlaa Kalimatun sabaqat mir Rabbika laqudiya bainahum; wa innahum lafee shakkim minhu mureeb",
    "transliteration_id": "Wa laqad ātainā mūsal-kitāba fakhtulifa fīh(i), wa lau lā kalimatun sabaqat mir rabbika laquḍiya bainahum, wa innahum lafī syakkim minhu murīb(in).",
    "translation_en": "And We had already given Moses the Scripture, but it came under disagreement. And if not for a word that preceded from your Lord, it would have been concluded between them. And indeed they are, concerning the Qur'an, in disquieting doubt.",
    "translation_id": "Sungguh, Kami benar-benar telah menganugerahkan Kitab (Taurat) kepada Musa, lalu ia (kitab itu) diperselisihkan. Seandainya tidak ada ketetapan yang terdahulu dari Tuhanmu (bahwa orang-orang yang mendustakan Al-Qur’an akan ditunda penyiksaannya), niscaya telah dilaksanakan hukuman di antara mereka. Sesungguhnya mereka benar-benar dalam kebimbangan dan keraguan terhadapnya."
  },
  {
    "ayat": 46,
    "arabic": "مَنْ عَمِلَ صَالِحًا فَلِنَفْسِهٖ ۙوَمَنْ اَسَاۤءَ فَعَلَيْهَا ۗوَمَا رَبُّكَ بِظَلَّامٍ لِّلْعَبِيْدِ  ۔",
    "transliteration_en": "Man 'amila salihan falinafshihee wa man asaaa'a fa'alaihaa; wamaa rabbuka bizallaamil lil 'abeed",
    "transliteration_id": "Man ‘amila ṣāliḥan fa linafsih(ī), wa man asā'a fa ‘alaihā, wa mā rabbuka biẓallāmil lil-‘abīd(i).",
    "translation_en": "Whoever does righteousness - it is for his [own] soul; and whoever does evil [does so] against it. And your Lord is not ever unjust to [His] servants.",
    "translation_id": "Siapa yang mengerjakan kebajikan, maka (pahalanya) untuk dirinya sendiri dan siapa yang berbuat jahat, maka (akibatnya) menjadi tanggungan dirinya sendiri. Tuhanmu sama sekali tidak menzalimi hamba-hamba(-Nya)."
  },
  {
    "ayat": 47,
    "arabic": "۞ اِلَيْهِ يُرَدُّ عِلْمُ السَّاعَةِ ۗوَمَا تَخْرُجُ مِنْ ثَمَرٰتٍ مِّنْ اَكْمَامِهَا وَمَا تَحْمِلُ مِنْ اُنْثٰى وَلَا تَضَعُ اِلَّا بِعِلْمِهٖ ۗوَيَوْمَ يُنَادِيْهِمْ اَيْنَ شُرَكَاۤءِيْۙ قَالُوْٓا اٰذَنّٰكَ مَا مِنَّا مِنْ شَهِيْدٍ ۚ",
    "transliteration_en": "Ilaihi yuraddu 'ilmus Saaa'ah; wa maa takhruju min samaraatim min akmaamihaa wa maa tahmilu min unsaa wa laa tada'u illaa bi'ilmih; wa Yawma yunaadeehim aina shurakaaa'ee qaalooo aazannaaka maa minnaa min shaheed",
    "transliteration_id": "Ilaihi yuraddu ‘ilmus-sā‘ah(ti), wa mā takhruju min ṡamarātim min akmāmihā wa mā taḥmilu min unṡā wa lā taḍa‘u illā bi‘ilmih(ī), wa yauma yunādīhim aina syurakā'ī, qālū āżannāka mā minnā min syahīd(in).",
    "translation_en": "To him [alone] is attributed knowledge of the Hour. And fruits emerge not from their coverings nor does a female conceive or give birth except with His knowledge. And the Day He will call to them, \"Where are My 'partners'?\" they will say, \"We announce to You that there is [no longer] among us any witness [to that].\"",
    "translation_id": "Hanya kepada-Nya pengetahuan tentang hari Kiamat itu dikembalikan. Tidak ada sama sekali buah-buahan yang keluar dari kelopaknya dan tidak seorang perempuan pun yang mengandung dan melahirkan, melainkan semuanya dengan sepengetahuan-Nya. Pada hari ketika Dia (Allah) menyeru mereka, “Di manakah sekutu-sekutu-Ku itu?” Mereka menjawab, “Kami menyatakan kepada-Mu bahwa tidak ada seorang pun di antara kami yang dapat memberi kesaksian (bahwa Engkau mempunyai sekutu).”"
  },
  {
    "ayat": 48,
    "arabic": "وَضَلَّ عَنْهُمْ مَّا كَانُوْا يَدْعُوْنَ مِنْ قَبْلُ وَظَنُّوْا مَا لَهُمْ مِّنْ مَّحِيْصٍ",
    "transliteration_en": "Wa dalla 'anhum maa kaanoo yad'oona min qablu wa zannoo maa lahum mim mahees",
    "transliteration_id": "Wa ḍalla ‘anhum mā kānū yad‘ūna min qablu wa ẓannū mā lahum mim maḥīṣ(in).",
    "translation_en": "And lost from them will be those they were invoking before, and they will be certain that they have no place of escape.",
    "translation_id": "Lenyaplah dari mereka apa yang dahulu selalu mereka sembah dan mereka pun mengetahui bahwa tidak ada tempat untuk menghindar (dari azab Allah) bagi mereka."
  },
  {
    "ayat": 49,
    "arabic": "لَا يَسْـَٔمُ الْاِنْسَانُ مِنْ دُعَاۤءِ الْخَيْرِۖ وَاِنْ مَّسَّهُ الشَّرُّ فَيَـُٔوْسٌ قَنُوْطٌ",
    "transliteration_en": "Laa yas'amul insaanu min du'aaa'il khairi wa im massa hush sharru fa ya'oosun qanoot",
    "transliteration_id": "Lā yas'amul-insānu min du‘ā'il-khair(i), wa im massahusy-syarru fa ya'ūsun qanūṭ(un).",
    "translation_en": "Man is not weary of supplication for good [things], but if evil touches him, he is hopeless and despairing.",
    "translation_id": "Manusia tidak pernah jemu memohon kebaikan dan jika ditimpa malapetaka, mereka berputus asa dan hilang harapan."
  },
  {
    "ayat": 50,
    "arabic": "وَلَىِٕنْ اَذَقْنٰهُ رَحْمَةً مِّنَّا مِنْۢ بَعْدِ ضَرَّاۤءَ مَسَّتْهُ لَيَقُوْلَنَّ هٰذَا لِيْۙ وَمَآ اَظُنُّ السَّاعَةَ قَاۤىِٕمَةًۙ وَّلَىِٕنْ رُّجِعْتُ اِلٰى رَبِّيْٓ اِنَّ لِيْ عِنْدَهٗ لَلْحُسْنٰىۚ فَلَنُنَبِّئَنَّ الَّذِيْنَ كَفَرُوْا بِمَا عَمِلُوْاۖ وَلَنُذِيْقَنَّهُمْ مِّنْ عَذَابٍ غَلِيْظٍ",
    "transliteration_en": "Wa la in azaqnaahu rahmatam minnaa mim ba'di dar raaa'a massat hu la yaqoolanna haazaa lee wa maaa azunnus Saa'ata qaaa'imatanw wa la'in ruji'tu ilaa Rabbeee inna lee 'indahoo lalhusnaa; falanu nabbi'annal lazeena kafaroo bimaa 'amiloo wa lanuzeeqan nahum min 'azaabin ghaleez",
    "transliteration_id": "Wa la'in ażaqnāhu raḥmatam minnā mim ba‘di ḍarrā'a massathu layaqūlunna hāżā lī, wa mā aẓunnus-sā‘ata qā'imah(tan), wa la'ir ruji‘tu ilā rabbī inna lī ‘indahū lal-ḥusnā, fa lanunabbi'annal-lażīna kafarū bimā ‘amilū, wa lanużīqannahum min ‘ażābin galīẓ(in).",
    "translation_en": "And if We let him taste mercy from Us after an adversity which has touched him, he will surely say, \"This is [due] to me, and I do not think the Hour will occur; and [even] if I should be returned to my Lord, indeed, for me there will be with Him the best.\" But We will surely inform those who disbelieved about what they did, and We will surely make them taste a massive punishment.",
    "translation_id": "Jika Kami menganugerahkan kepadanya suatu rahmat dari Kami setelah ditimpa kesusahan, pastilah dia akan berkata, “Ini adalah hakku dan aku tidak yakin bahwa hari Kiamat itu akan terjadi. Jika (ternyata) aku dikembalikan kepada Tuhanku, sesungguhnya aku akan memperoleh kebaikan di sisi-Nya.” Maka, sungguh, Kami akan memberitahukan kepada orang-orang yang kufur tentang apa yang telah mereka kerjakan dan sungguh Kami benar-benar akan menimpakan kepada mereka azab yang sangat berat."
  }
]