[
  {
    "ayat": 51,
    "arabic": "۞ يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا تَتَّخِذُوا الْيَهُوْدَ وَالنَّصٰرٰٓى اَوْلِيَاۤءَ ۘ بَعْضُهُمْ اَوْلِيَاۤءُ بَعْضٍۗ وَمَنْ يَّتَوَلَّهُمْ مِّنْكُمْ فَاِنَّهٗ مِنْهُمْ ۗ اِنَّ اللّٰهَ لَا يَهْدِى الْقَوْمَ الظّٰلِمِيْنَ",
    "transliteration_en": "Yaaa aiyuhal lazeena aamanoo laa tattakhizul Yahooda wan nasaaraaa awliyaaa'; ba'duhum awliyaaa'u ba'd; wa mai yatawallahum minkum fa innahoo minhum; innal laaha laa yahdil qawmaz zaalimeen",
    "transliteration_id": "Yā ayyuhal-lażīna āmanū lā tattakhiżul-yahūda wan-naṣārā auliyā'(a), ba‘ḍuhum auliyā'u ba‘ḍ(in), wa may yatawallahum minkum fa innahū minhum, innallāha lā yahdil-qaumaẓ-ẓālimīn(a).",
    "translation_en": "O you who have believed, do not take the Jews and the Christians as allies. They are [in fact] allies of one another. And whoever is an ally to them among you - then indeed, he is [one] of them. Indeed, Allah guides not the wrongdoing people.",
    "translation_id": "Wahai orang-orang yang beriman, janganlah kamu menjadikan orang Yahudi dan Nasrani sebagai teman setia(-mu). Sebagian mereka menjadi teman setia bagi sebagian yang lain. Siapa di antara kamu yang menjadikan mereka teman setia, maka sesungguhnya dia termasuk golongan mereka. Sesungguhnya Allah tidak memberi petunjuk kepada kaum yang zalim."
  },
  {
    "ayat": 52,
    "arabic": "فَتَرَى الَّذِيْنَ فِيْ قُلُوْبِهِمْ مَّرَضٌ يُّسَارِعُوْنَ فِيْهِمْ يَقُوْلُوْنَ نَخْشٰٓى اَنْ تُصِيْبَنَا دَاۤىِٕرَةٌ  ۗفَعَسَى اللّٰهُ اَنْ يَّأْتِيَ بِالْفَتْحِ اَوْ اَمْرٍ مِّنْ عِنْدِهٖ فَيُصْبِحُوْا عَلٰى مَآ اَسَرُّوْا فِيْٓ اَنْفُسِهِمْ نٰدِمِيْنَۗ",
    "transliteration_en": "Fataral lazeena fee quloobihim maraduny yusaari'oona feehim yaqooloona nakhshaaa an tuseebanaa daaa'irah; fa'asallaahu ai yaatiya bilfathi aw amrim min 'indihee fa yusbihoo 'alaa maaa asarroo feee anfusihim naadimeen",
    "transliteration_id": "Fa taral-lażīna fī qulūbihim maraḍuy yusāri‘ūna fīhim yaqūlūna nakhsyā an tuṣībanā dā'irah(tun), fa ‘asallāhu ay ya'tiya bil-fatḥi au amrim min ‘indihī fa yuṣbiḥū ‘alā mā asarrū fī anfusihim nādimīn(a).",
    "translation_en": "So you see those in whose hearts is disease hastening into [association with] them, saying, \"We are afraid a misfortune may strike us.\" But perhaps Allah will bring conquest or a decision from Him, and they will become, over what they have been concealing within themselves, regretful.",
    "translation_id": "Maka, kamu akan melihat orang-orang yang hatinya berpenyakit segera mendekati mereka (Yahudi dan Nasrani) seraya berkata, “Kami takut akan tertimpa mara bahaya.” Mudah-mudahan Allah akan mendatangkan kemenangan (kepada Rasul-Nya) atau suatu keputusan dari sisi-Nya sehingga mereka menyesali apa yang mereka rahasiakan dalam diri mereka."
  },
  {
    "ayat": 53,
    "arabic": "وَيَقُوْلُ الَّذِيْنَ اٰمَنُوْٓا اَهٰٓؤُلَاۤءِ الَّذِيْنَ اَقْسَمُوْا بِاللّٰهِ جَهْدَ اَيْمَانِهِمْۙ اِنَّهُمْ لَمَعَكُمْۗ حَبِطَتْ اَعْمَالُهُمْ فَاَصْبَحُوْا خٰسِرِيْنَ",
    "transliteration_en": "Wa yaqoolul lazeena aamanooo ahaaa'ulaaa'il lazeena aqsamoo billaahi jahda aimaanihim innahum lama'akum; habitat a'maaluhum fa asbahoo khaasireen",
    "transliteration_id": "Wa yaqūlul-lażīna āmanū ahā'ulā'il-lażīna aqsamū billāhi jahda aimānihim, innahum lama‘akum, ḥabiṭat a‘māluhum fa aṣbaḥū khāsirīn(a).",
    "translation_en": "And those who believe will say, \"Are these the ones who swore by Allah their strongest oaths that indeed they were with you?\" Their deeds have become worthless, and they have become losers.",
    "translation_id": "Orang-orang yang beriman akan berkata, “Inikah orang yang bersumpah dengan (nama) Allah secara sungguh-sungguh bahwa mereka benar-benar beserta kamu?” Segala amal mereka menjadi sia-sia sehingga mereka menjadi orang-orang yang rugi."
  },
  {
    "ayat": 54,
    "arabic": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْا مَنْ يَّرْتَدَّ مِنْكُمْ عَنْ دِيْنِهٖ فَسَوْفَ يَأْتِى اللّٰهُ بِقَوْمٍ يُّحِبُّهُمْ وَيُحِبُّوْنَهٗٓ  ۙاَذِلَّةٍ عَلَى الْمُؤْمِنِيْنَ اَعِزَّةٍ عَلَى الْكٰفِرِيْنَۖ  يُجَاهِدُوْنَ فِيْ سَبِيْلِ اللّٰهِ وَلَا يَخَافُوْنَ لَوْمَةَ لَاۤىِٕمٍ ۗذٰلِكَ فَضْلُ اللّٰهِ يُؤْتِيْهِ مَنْ يَّشَاۤءُۗ وَاللّٰهُ وَاسِعٌ عَلِيْمٌ",
    "transliteration_en": "Yaa aiyuhal lazeena aamanoo mai yartadda minkum 'an deenihee fasawfa yaatil laahu biqawminy yuhibbuhum wa yuhibboonahoo azillatin 'alal mu'mineena a'izzatin 'alal kaafireena yujaahidoona fee sabeelil laahi wa laa yakhaafoona lawmata laaa'im; zaalika fadlul laahi yu'teehi mai yashaaa'; wallaahu Waasi'un 'Aleem",
    "transliteration_id": "Yā ayyuhal-lażīna āmanū may yartadda minkum ‘an dīnihī fa saufa ya'tillāhu biqaumiy yuḥibbuhum wa yuḥibbūnah(ū), ażillatin ‘alal-mu'minīna a‘izzatin ‘alal-kāfirīn(a), yujāhidūna fī sabīlillāhi wa lā yakhāfūna laumata lā'im(in), żālika faḍlullāhi yu'tīhi may yasyā'(u), wallāhu wāsi‘un ‘alīm(un).",
    "translation_en": "O you who have believed, whoever of you should revert from his religion - Allah will bring forth [in place of them] a people He will love and who will love Him [who are] humble toward the believers, powerful against the disbelievers; they strive in the cause of Allah and do not fear the blame of a critic. That is the favor of Allah; He bestows it upon whom He wills. And Allah is all-Encompassing and Knowing.",
    "translation_id": "Wahai orang-orang yang beriman, siapa di antara kamu yang murtad dari agamanya, maka Allah akan mendatangkan suatu kaum yang Dia mencintai mereka dan mereka pun mencintai-Nya, yang bersikap lemah lembut terhadap orang-orang mukmin dan bersikap tegas terhadap orang-orang kafir. Mereka berjihad di jalan Allah dan tidak takut pada celaan orang yang mencela. Itulah karunia Allah yang diberikan-Nya kepada siapa yang Dia kehendaki. Allah Maha Luas (pemberian-Nya) lagi Maha Mengetahui."
  },
  {
    "ayat": 55,
    "arabic": "اِنَّمَا وَلِيُّكُمُ اللّٰهُ وَرَسُوْلُهٗ وَالَّذِيْنَ اٰمَنُوا الَّذِيْنَ يُقِيْمُوْنَ الصَّلٰوةَ وَيُؤْتُوْنَ الزَّكٰوةَ وَهُمْ رٰكِعُوْنَ",
    "transliteration_en": "Innamaa waliyyukumul laahu wa Rasooluhoo wal lazeena aamanul lazeena yuqeemoonas Salaata wa yu'toonaz Zakaata wa hum raaki'oon",
    "transliteration_id": "Innamā waliyyukumullāhu wa rasūluhū wal-lażīna āmanul-lażīna yuqīmūnaṣ-ṣalāta wa yu'tūnaz-zakāta wa hum rāki‘ūn(a).",
    "translation_en": "Your ally is none but Allah and [therefore] His Messenger and those who have believed - those who establish prayer and give zakah, and they bow [in worship].",
    "translation_id": "Sesungguhnya penolongmu hanyalah Allah, Rasul-Nya, dan orang-orang yang beriman yang menegakkan salat dan menunaikan zakat seraya tunduk (kepada Allah)."
  },
  {
    "ayat": 56,
    "arabic": "وَمَنْ يَّتَوَلَّ اللّٰهَ وَرَسُوْلَهٗ وَالَّذِيْنَ اٰمَنُوْا فَاِنَّ حِزْبَ اللّٰهِ هُمُ الْغٰلِبُوْنَ ࣖ",
    "transliteration_en": "Wa mai yatawallal laaha wa Rasoolahoo wallazeena aamanoo fa inna hizbal laahi humul ghaaliboon",
    "transliteration_id": "Wa may yatawallallāha wa rasūlahū wal-lażīna āmanū fa inna ḥizballāhi humul-gālibūn(a).",
    "translation_en": "And whoever is an ally of Allah and His Messenger and those who have believed - indeed, the party of Allah - they will be the predominant.",
    "translation_id": "Siapa yang menjadikan Allah, Rasul-Nya, dan orang-orang yang beriman sebagai penolongnya, sesungguhnya para pengikut Allah itulah yang akan menjadi pemenang."
  },
  {
    "ayat": 57,
    "arabic": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا تَتَّخِذُوا الَّذِيْنَ اتَّخَذُوْا دِيْنَكُمْ هُزُوًا وَّلَعِبًا مِّنَ الَّذِيْنَ اُوْتُوا الْكِتٰبَ مِنْ قَبْلِكُمْ وَالْكُفَّارَ اَوْلِيَاۤءَۚ وَاتَّقُوا اللّٰهَ اِنْ كُنْتُمْ مُّؤْمِنِيْنَ",
    "transliteration_en": "Yaaa aiyuhal lazeena aamanoo laa tattakhizul lazeenat takhazoo deenakum huzuwanw wa la'ibam minal lazeena ootul Kitaaba min qablikum walkuffaara awliyaaa'; wattaqul laaha in kuntum muu'mineen",
    "transliteration_id": "Yā ayyuhal-lażīna āmanū lā tattakhiżul-lażīnattakhażū dīnakum huzuwaw wa la‘ibam minal-lażīna ūtul-kitāba min qablikum wal-kuffāra auliyā'(a), wattaqullāha in kuntum mu'minīn(a).",
    "translation_en": "O you who have believed, take not those who have taken your religion in ridicule and amusement among the ones who were given the Scripture before you nor the disbelievers as allies. And fear Allah, if you should [truly] be believers.",
    "translation_id": "Wahai orang-orang yang beriman, janganlah kamu menjadikan orang-orang yang menjadikan agamamu bahan ejekan dan permainan, (yaitu) di antara orang-orang yang telah diberi kitab suci sebelummu dan orang-orang kafir, sebagai teman setia(-mu). Bertakwalah kepada Allah jika kamu orang-orang mukmin."
  },
  {
    "ayat": 58,
    "arabic": "وَاِذَا نَادَيْتُمْ اِلَى الصَّلٰوةِ اتَّخَذُوْهَا هُزُوًا وَّلَعِبًا ۗذٰلِكَ بِاَ نَّهُمْ قَوْمٌ لَّا يَعْقِلُوْنَ",
    "transliteration_en": "Wa izaa naadaitum ilas Salaatit takhazoohaa huzu wan'w wa la'ibaa; zaalika biannnahum qawmul laa ya'qiloon",
    "transliteration_id": "Wa iżā nādaitum ilaṣ-ṣalātittakhażūhā huzuwaw wa la‘ibā(n), żālika bi'annahum qaumul lā ya‘qilūn(a).",
    "translation_en": "And when you call to prayer, they take it in ridicule and amusement. That is because they are a people who do not use reason.",
    "translation_id": "Apabila kamu menyeru untuk (melaksanakan) salat, mereka menjadikannya bahan ejekan dan permainan. Yang demikian itu adalah karena sesungguhnya mereka orang-orang yang tidak mengerti."
  },
  {
    "ayat": 59,
    "arabic": "قُلْ يٰٓاَهْلَ الْكِتٰبِ هَلْ تَنْقِمُوْنَ مِنَّآ اِلَّآ اَنْ اٰمَنَّا بِاللّٰهِ وَمَآ اُنْزِلَ اِلَيْنَا وَمَآ اُنْزِلَ مِنْ قَبْلُۙ وَاَنَّ اَكْثَرَكُمْ فٰسِقُوْنَ",
    "transliteration_en": "Qul yaaa Ahlal Kitaabi hal tanqimoona minnaaa illaaa an aamannaa billaahi wa maaa unzila ilainaa wa maa unzila min qablu wa annna aksarakum faasiqoon",
    "transliteration_id": "Qul yā ahlal-kitābi hal tanqimūna minnā illā an āmannā billāhi wa mā unzila ilainā wa mā unzila min qabl(u), wa anna akṡarakum fāsiqūn(a).",
    "translation_en": "Say, \"O People of the Scripture, do you resent us except [for the fact] that we have believed in Allah and what was revealed to us and what was revealed before and because most of you are defiantly disobedient?\"",
    "translation_id": "Katakanlah, “Wahai Ahlulkitab, apakah kamu memandang kami salah hanya karena kami beriman kepada Allah, pada apa yang diturunkan kepada kami (Al-Qur’an), pada apa yang diturunkan sebelumnya, dan (kami yakin bahwa) sesungguhnya kebanyakan kamu adalah orang-orang fasik?”"
  },
  {
    "ayat": 60,
    "arabic": "قُلْ هَلْ اُنَبِّئُكُمْ بِشَرٍّ مِّنْ ذٰلِكَ مَثُوْبَةً عِنْدَ اللّٰهِ ۗمَنْ لَّعَنَهُ اللّٰهُ وَغَضِبَ عَلَيْهِ وَجَعَلَ مِنْهُمُ الْقِرَدَةَ وَالْخَنَازِيْرَ وَعَبَدَ الطَّاغُوْتَۗ اُولٰۤىِٕكَ شَرٌّ مَّكَانًا وَّاَضَلُّ عَنْ سَوَاۤءِ السَّبِيْلِ",
    "transliteration_en": "Qul hal unabbi'ukum bisharrim min zaalika masoobatan 'indal laah; malla'ana hul laahu wa ghadiba 'alaihi wa ja'ala minhumul qiradata wal khanaazeera wa 'abadat Taaghoot; ulaaa'ika sharrum makaananw wa adallu 'an Sawaaa'is Sabeel",
    "transliteration_id": "Qul hal unabbi'ukum bisyarrim min żālika maṡūbatan ‘indallāh(i), mal la‘anahullāhu wa gaḍiba ‘alaihi wa ja‘ala minhumul-qiradata wal-khanāzīra wa ‘abadaṭ-ṭāgūt(a), ulā'ika syarrum makānaw wa aḍallu ‘an sawā'is-sabīl(i).",
    "translation_en": "Say, \"Shall I inform you of [what is] worse than that as penalty from Allah? [It is that of] those whom Allah has cursed and with whom He became angry and made of them apes and pigs and slaves of Taghut. Those are worse in position and further astray from the sound way.\"",
    "translation_id": "Katakanlah (Nabi Muhammad), “Apakah akan aku beritakan kepadamu tentang sesuatu yang lebih buruk pembalasannya daripada itu di sisi Allah? (Yaitu balasan) orang yang dilaknat dan dimurkai Allah (yang) di antara mereka Dia jadikan kera dan babi. (Di antara mereka ada pula yang) menyembah Tagut.” Mereka itu lebih buruk tempatnya dan lebih tersesat dari jalan yang lurus."
  },
  {
    "ayat": 61,
    "arabic": "وَاِذَا جَاۤءُوْكُمْ قَالُوْٓا اٰمَنَّا وَقَدْ دَّخَلُوْا بِالْكُفْرِ وَهُمْ قَدْ خَرَجُوْا بِهٖ ۗوَاللّٰهُ اَعْلَمُ بِمَا كَانُوْا يَكْتُمُوْنَ",
    "transliteration_en": "Wa izaa jaaa'ookum qaalooo aamannaa wa qad dakhaloo bilkufri wa hum qad kharajoo bih; wallaahu a'lamu bimaa kaanoo yaktumoon",
    "transliteration_id": "Wa iżā jā'ūkum qālū āmannā wa qad dakhalū bil-kufri wa hum qad kharajū bih(ī), wallāhu a‘lamu bimā kānū yaktumūn(a).",
    "translation_en": "And when they come to you, they say, \"We believe.\" But they have entered with disbelief [in their hearts], and they have certainly left with it. And Allah is most knowing of what they were concealing.",
    "translation_id": "Apabila (Ahlulkitab yang munafik) datang kepadamu, mereka berkata, “Kami telah beriman,” padahal mereka datang dengan kekufuran dan mereka pergi (juga) dengannya (kekufuran). Allah lebih mengetahui apa yang selalu mereka sembunyikan."
  },
  {
    "ayat": 62,
    "arabic": "وَتَرٰى كَثِيْرًا مِّنْهُمْ يُسَارِعُوْنَ فِى الْاِثْمِ وَالْعُدْوَانِ وَاَكْلِهِمُ السُّحْتَۗ  لَبِئْسَ مَا كَانُوْا يَعْمَلُوْنَ",
    "transliteration_en": "Wa taraa kaseeram minhum yusaari'oona fil ismi wal'udwaani wa aklihimus suht; labi'sa maa kaanoo ya'maloon",
    "transliteration_id": "Wa tarā kaṡīram minhum yusāri‘ūna fil-iṡmi wal-‘udwāni wa aklihimus-suḥt(a), labi'sa mā kānū ya‘malūn(a).",
    "translation_en": "And you see many of them hastening into sin and aggression and the devouring of [what is] unlawful. How wretched is what they have been doing.",
    "translation_id": "Kamu akan melihat banyak di antara mereka (Ahlulkitab) berlomba-lomba dalam perbuatan dosa, permusuhan, dan memakan (makanan) yang haram. Sungguh, itulah seburuk-buruk apa yang selalu mereka kerjakan."
  },
  {
    "ayat": 63,
    "arabic": "لَوْلَا يَنْهٰىهُمُ الرَّبّٰنِيُّوْنَ وَالْاَحْبَارُ عَنْ قَوْلِهِمُ الْاِثْمَ وَاَكْلِهِمُ السُّحْتَۗ  لَبِئْسَ مَا كَانُوْا يَصْنَعُوْنَ",
    "transliteration_en": "Law laa yanhaahumur rabbaaniyyoona wal ahbaaru 'an qawlihimul ismaa wa aklihimus suht; labi'sa maa kaanoo yasna'oon",
    "transliteration_id": "Lau lā yanhāhumur-rabbāniyyūna wal-aḥbāru ‘an qaulihimul-iṡma wa aklihimus-suḥt(a), labi'sa mā kānū yaṣna‘ūn(a).",
    "translation_en": "Why do the rabbis and religious scholars not forbid them from saying what is sinful and devouring what is unlawful? How wretched is what they have been practicing.",
    "translation_id": "Mengapa para ulama dan pendeta tidak melarang mereka mengucapkan perkataan bohong dan memakan (makanan) yang haram? Sungguh, itulah seburuk- buruk apa yang selalu mereka perbuat."
  },
  {
    "ayat": 64,
    "arabic": "وَقَالَتِ الْيَهُوْدُ يَدُ اللّٰهِ مَغْلُوْلَةٌ  ۗغُلَّتْ اَيْدِيْهِمْ وَلُعِنُوْا بِمَا قَالُوْا ۘ بَلْ يَدٰهُ مَبْسُوْطَتٰنِۙ يُنْفِقُ كَيْفَ يَشَاۤءُۗ وَلَيَزِيْدَنَّ كَثِيْرًا مِّنْهُمْ مَّآ اُنْزِلَ اِلَيْكَ مِنْ رَّبِّكَ طُغْيَانًا وَّكُفْرًاۗ وَاَلْقَيْنَا بَيْنَهُمُ الْعَدَاوَةَ وَالْبَغْضَاۤءَ اِلٰى يَوْمِ الْقِيٰمَةِۗ  كُلَّمَآ اَوْقَدُوْا نَارًا لِّلْحَرْبِ اَطْفَاَهَا اللّٰهُ ۙوَيَسْعَوْنَ فِى الْاَرْضِ فَسَادًاۗ وَاللّٰهُ لَا يُحِبُّ الْمُفْسِدِيْنَ",
    "transliteration_en": "Wa qaalatil Yahoodu Yadullaahi maghloolah; ghulla aideehim wa lu'inoo bimaa qaaloo; bal yadaahu mabsoo tataani yunfiqu kaifa yashaaa'; wa la yazeedanna kaseeramm minhum maaa unzila ilaika mir Rabbika tughyaananw wa kufraa; wa alqainaa bainahumul 'adaawata wal baghdaaa a' ilaa Yawmil Qiyaamah; kullamaaa awqadoo naaral lilharbi at fa-ahal laah; wa yas'awna fil ardi fasaadaa; wal laahu laa yuhibbul mufsideen",
    "transliteration_id": "Wa qālatil-yahūdu yadullāhi maglūlah(tun), gullat aidīhim wa lu‘inū bimā qālū, bal yadāhu mabsūṭatān(i), yunfiqu kaifa yasyā'(u), wa layazīdanna kaṡīram minhum mā unzila ilaika mir rabbika ṭugyānaw wa kufrā(n), wa alqainā bainahumul-‘adāwata wal-bagḍā'a ilā yaumil-qiyāmah(ti), kullamā auqadū nāral lil-ḥarbi aṭfa'ahallāh(u), wa yas‘auna fil-arḍi fasādā(n), wallāhu lā yuḥibbul-mufsidīn(a).",
    "translation_en": "And the Jews say, \"The hand of Allah is chained.\" Chained are their hands, and cursed are they for what they say. Rather, both His hands are extended; He spends however He wills. And that which has been revealed to you from your Lord will surely increase many of them in transgression and disbelief. And We have cast among them animosity and hatred until the Day of Resurrection. Every time they kindled the fire of war [against you], Allah extinguished it. And they strive throughout the land [causing] corruption, and Allah does not like corrupters.",
    "translation_id": "Orang-orang Yahudi berkata, “Tangan Allah terbelenggu (kikir).” Sebenarnya tangan merekalah yang dibelenggu. Mereka dilaknat disebabkan apa yang telah mereka katakan. Sebaliknya, kedua tangan-Nya terbuka (Maha Pemurah). Dia memberi rezeki sebagaimana Dia kehendaki. (Al-Qur’an) yang diturunkan kepadamu dari Tuhanmu itu pasti akan menambah kedurhakaan dan kekufuran bagi kebanyakan mereka. Kami timbulkan permusuhan dan kebencian di antara mereka sampai hari Kiamat. Setiap kali mereka menyalakan api peperangan, Allah memadamkannya. Mereka berusaha (menimbulkan) kerusakan di bumi. Allah tidak menyukai orang-orang yang berbuat kerusakan."
  },
  {
    "ayat": 65,
    "arabic": "وَلَوْ اَنَّ اَهْلَ الْكِتٰبِ اٰمَنُوْا وَاتَّقَوْا لَكَفَّرْنَا عَنْهُمْ سَيِّاٰتِهِمْ وَلَاَدْخَلْنٰهُمْ جَنّٰتِ النَّعِيْمِ",
    "transliteration_en": "Wa law anna Ahlal Kitaabi aamanoo wattaqaw lakaffarnaa 'anhum saiyiaatihim wa la adkhalnaahu Jannaatin Na'eem",
    "transliteration_id": "Wa lau anna ahlal-kitābi āmanū wattaqau lakaffarnā ‘anhum sayyi'ātihim wa la'adkhalnāhum jannātin-na‘īm(i).",
    "translation_en": "And if only the People of the Scripture had believed and feared Allah, We would have removed from them their misdeeds and admitted them to Gardens of Pleasure.",
    "translation_id": "Seandainya Ahlulkitab itu beriman dan bertakwa, niscaya Kami hapus kesalahan-kesalahan mereka dan tentu Kami masukkan mereka ke dalam surga-surga yang penuh kenikmatan."
  },
  {
    "ayat": 66,
    "arabic": "وَلَوْ اَنَّهُمْ اَقَامُوا التَّوْرٰىةَ وَالْاِنْجِيْلَ وَمَآ اُنْزِلَ اِلَيْهِمْ مِّنْ رَّبِّهِمْ لَاَكَلُوْا مِنْ فَوْقِهِمْ وَمِنْ تَحْتِ اَرْجُلِهِمْۗ مِنْهُمْ اُمَّةٌ مُّقْتَصِدَةٌ  ۗ وَكَثِيْرٌ مِّنْهُمْ سَاۤءَ مَا يَعْمَلُوْنَ ࣖ",
    "transliteration_en": "Wa law annahum aqaamut Tawraata wal Injeela wa maaa unzila ilaihim mir Rabbihim la akaloo min fawqihim wa min tahti arjulihim; minhum ummatum muqta sidatunw wa kaseerum minhum saaa'a maa ya'maloon",
    "transliteration_id": "Wa lau annahum aqāmut-taurāta wal-injīla wa mā unzila ilaihim mir rabbihim la'akalū min fauqihim wa min taḥti arjulihim, minhum ummatum muqtaṣidah(tun), wa kaṡīrum minhum sā'a mā ya‘malūn(a).",
    "translation_en": "And if only they upheld [the law of] the Torah, the Gospel, and what has been revealed to them from their Lord, they would have consumed [provision] from above them and from beneath their feet. Among them are a moderate community, but many of them - evil is that which they do.",
    "translation_id": "Seandainya mereka menegakkan (hukum) Taurat, Injil, dan (Al-Qur’an) yang diturunkan kepada mereka dari Tuhan mereka, niscaya mereka akan mendapat makanan dari atas mereka dan dari bawah kaki mereka. Di antara mereka ada umat yang menempuh jalan yang lurus. Sementara itu, banyak di antara mereka sangat buruk apa yang mereka kerjakan."
  },
  {
    "ayat": 67,
    "arabic": "۞ يٰٓاَيُّهَا الرَّسُوْلُ بَلِّغْ مَآ اُنْزِلَ اِلَيْكَ مِنْ رَّبِّكَ ۗوَاِنْ لَّمْ تَفْعَلْ فَمَا بَلَّغْتَ رِسٰلَتَهٗ ۗوَاللّٰهُ يَعْصِمُكَ مِنَ النَّاسِۗ اِنَّ اللّٰهَ لَا يَهْدِى الْقَوْمَ الْكٰفِرِيْنَ",
    "transliteration_en": "Yaaa aiyuhar Rasoolu balligh maaa unzila ilaika mir Rabbika wa il lam taf'al famaaa ballaghta Risaalatah; wallaahu ya'simuka minan naas; innal laaha laa yahdil qawmal kaafireen",
    "transliteration_id": "Yā ayyuhar-rasūlu ballig mā unzila ilaika mir rabbik(a), wa illam taf‘al famā ballagta risālatah(ū), wallāhu ya‘ṣimuka minan-nās(i), innallāha lā yahdil-qaumal-kāfirīn(a).",
    "translation_en": "O Messenger, announce that which has been revealed to you from your Lord, and if you do not, then you have not conveyed His message. And Allah will protect you from the people. Indeed, Allah does not guide the disbelieving people.",
    "translation_id": "Wahai Rasul, sampaikanlah apa yang diturunkan Tuhanmu kepadamu. Jika engkau tidak melakukan (apa yang diperintahkan itu), berarti engkau tidak menyampaikan risalah-Nya. Allah menjaga engkau dari (gangguan) manusia. Sesungguhnya Allah tidak memberi petunjuk kepada kaum yang kafir."
  },
  {
    "ayat": 68,
    "arabic": "قُلْ يٰٓاَهْلَ الْكِتٰبِ لَسْتُمْ عَلٰى شَيْءٍ حَتّٰى تُقِيْمُوا التَّوْرٰىةَ وَالْاِنْجِيْلَ وَمَآ اُنْزِلَ اِلَيْكُمْ مِّنْ رَّبِّكُمْ ۗوَلَيَزِيْدَنَّ كَثِيْرًا مِّنْهُمْ مَّآ اُنْزِلَ اِلَيْكَ مِنْ رَّبِّكَ طُغْيَانًا وَّكُفْرًاۚ فَلَا تَأْسَ عَلَى الْقَوْمِ الْكٰفِرِيْنَ",
    "transliteration_en": "Qul yaaa Ahlal Kitaabi lastum 'alaa shai'in hattaa tuqeemut Tawraata wal Injeela wa maaa unzila ilaikum mir Rabbikum; wa layazeedanna kaseeram minhum maa unzila ilaika mir Rabbika tugh yaananw wa kufran falaa taasa 'alal qawmil kaafireen",
    "transliteration_id": "Qul yā ahlal-kitābi lastum ‘alā syai'in ḥattā tuqīmut-taurāta wal-injīla wa mā unzila ilaikum mir rabbikum, wa layazīdanna kaṡīram minhum mā unzila ilaika mir rabbika ṭugyānaw wa kufrā(n), falā ta'sa ‘alal-qaumil-kāfirīn(a).",
    "translation_en": "Say, \"O People of the Scripture, you are [standing] on nothing until you uphold [the law of] the Torah, the Gospel, and what has been revealed to you from your Lord.\" And that which has been revealed to you from your Lord will surely increase many of them in transgression and disbelief. So do not grieve over the disbelieving people.",
    "translation_id": "Katakanlah (Nabi Muhammad), “Wahai Ahlulkitab, kamu tidak menganut sesuatu pun (agama yang benar) hingga kamu menegakkan ajaran-ajaran Taurat, Injil, dan (Al-Qur’an) yang diturunkan Tuhanmu kepadamu.” Apa yang diturunkan Tuhanmu kepadamu pasti akan membuat banyak di antara mereka lebih durhaka dan ingkar. Maka, janganlah engkau bersedih terhadap kaum yang kafir itu."
  },
  {
    "ayat": 69,
    "arabic": "اِنَّ الَّذِيْنَ اٰمَنُوْا وَالَّذِيْنَ هَادُوْا وَالصَّابِـُٔوْنَ وَالنَّصٰرٰى مَنْ اٰمَنَ بِاللّٰهِ وَالْيَوْمِ الْاٰخِرِ وَعَمِلَ صَالِحًا فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُوْنَ",
    "transliteration_en": "Innal lazeena aamanoo wallazeena haadoo was saabi'oona wan Nasaaraa man aamana billaahi wal yawmil Aakhiri wa 'amila saalihan falaa khawfun 'alaihim wa laa hum yahzanoon",
    "transliteration_id": "Innal-lażīna āmanū wal-lażīna hādū waṣ-ṣābi'ūna wan-naṣārā man āmana billāhi wal-yaumil-ākhiri wa ‘amila ṣāliḥan falā khaufun ‘alaihim wa lā hum yaḥzanūn(a).",
    "translation_en": "Indeed, those who have believed [in Prophet Muhammad] and those [before Him] who were Jews or Sabeans or Christians - those [among them] who believed in Allah and the Last Day and did righteousness - no fear will there be concerning them, nor will they grieve.",
    "translation_id": "Sesungguhnya orang-orang yang beriman, orang-orang Yahudi, Sabiin, dan Nasrani, siapa yang beriman kepada Allah, hari Akhir, dan beramal saleh, tidak ada rasa takut yang menimpa mereka dan mereka pun tidak bersedih."
  },
  {
    "ayat": 70,
    "arabic": "لَقَدْ اَخَذْنَا مِيْثَاقَ بَنِيْٓ اِسْرَاۤءِيْلَ وَاَرْسَلْنَآ اِلَيْهِمْ رُسُلًا ۗ كُلَّمَا جَاۤءَهُمْ رَسُوْلٌۢ بِمَا لَا تَهْوٰٓى اَنْفُسُهُمْۙ فَرِيْقًا كَذَّبُوْا وَفَرِيْقًا يَّقْتُلُوْنَ",
    "transliteration_en": "Laqad akhaznaa meesaaqa Banee Israaa'eela wa arsalnaaa ilaihim Rusulan kullamaa jaaa'ahum Rasoolum bimaa laa tahwaaa anfusuhum fareeqan kazzaboo wa fareeqany yaqtuloon",
    "transliteration_id": "Laqad akhażnā mīṡāqa banī isrā'īla wa arsalnā ilaihim rusulā(n), kullamā jā'ahum rasūlum bimā lā tahwā anfusuhum, farīqan każżabū wa farīqay yaqtulūn(a).",
    "translation_en": "We had already taken the covenant of the Children of Israel and had sent to them messengers. Whenever there came to them a messenger with what their souls did not desire, a party [of messengers] they denied, and another party they killed.",
    "translation_id": "Sungguh, Kami benar-benar telah mengambil perjanjian dari Bani Israil dan telah mengutus rasul-rasul kepada mereka. Setiap kali rasul datang kepada mereka dengan membawa apa yang tidak sesuai dengan hawa nafsu mereka, sebagian (dari rasul itu) mereka dustakan dan sebagian yang lain mereka bunuh."
  },
  {
    "ayat": 71,
    "arabic": "وَحَسِبُوْٓا اَلَّا تَكُوْنَ فِتْنَةٌ فَعَمُوْا وَصَمُّوْا ثُمَّ تَابَ اللّٰهُ عَلَيْهِمْ ثُمَّ عَمُوْا وَصَمُّوْا كَثِيْرٌ مِّنْهُمْۗ وَاللّٰهُ بَصِيْرٌۢ بِمَا يَعْمَلُوْنَ",
    "transliteration_en": "Wa hasibooo allaa takoona fitnaun fa'amoo wa sammoo summa taabal laahu 'alaihim summa 'amoo wa sammoo kaseerum minhum; wallaahu baseerum bimaa ya'maloon",
    "transliteration_id": "Wa ḥasibū allā takūna fitnatun fa ‘amū wa ṣammū ṡumma tāballāhu ‘alaihim ṡumma ‘amū wa ṣammū kaṡīrum minhum, wallāhu baṣīrum bimā ya‘malūn(a).",
    "translation_en": "And they thought there would be no [resulting] punishment, so they became blind and deaf. Then Allah turned to them in forgiveness; then [again] many of them became blind and deaf. And Allah is Seeing of what they do.",
    "translation_id": "Mereka mengira bahwa tidak akan terjadi fitnah (azab akibat dosa-dosa mereka). Oleh karena itu, mereka menjadi buta dan tuli. Setelah itu Allah menerima tobat mereka, kemudian banyak di antara mereka buta dan tuli (lagi). Allah Maha Melihat apa yang mereka kerjakan."
  },
  {
    "ayat": 72,
    "arabic": "لَقَدْ كَفَرَ الَّذِيْنَ قَالُوْٓا اِنَّ اللّٰهَ هُوَ الْمَسِيْحُ ابْنُ مَرْيَمَ ۗوَقَالَ الْمَسِيْحُ يٰبَنِيْٓ اِسْرَاۤءِيْلَ اعْبُدُوا اللّٰهَ رَبِّيْ وَرَبَّكُمْ ۗاِنَّهٗ مَنْ يُّشْرِكْ بِاللّٰهِ فَقَدْ حَرَّمَ اللّٰهُ عَلَيْهِ الْجَنَّةَ وَمَأْوٰىهُ النَّارُ ۗوَمَا لِلظّٰلِمِيْنَ مِنْ اَنْصَارٍ",
    "transliteration_en": "Laqad kafaral lazeena qaalooo innal laaha Huwal maseehub nu Maryama wa qaalal Maseehu yaa Baneee Israaa'eela budul laaha Rabbee wa Rabbakum innnahoo many-yushrik ballaahi faqad harramal laahu 'alaihil jannata wa maa waahun Naaru wa maa lizzaalimeena min ansaar",
    "transliteration_id": "Laqad kafaral-lażīna qālū innallāha huwal-masīḥubnu maryam(a), wa qālal-masīḥu yā banī isrā'īla‘budullāha rabbī wa rabbakum, innahū may yusyrik billāhi faqad ḥarramallāhu ‘alaihil-jannata wa ma'wāhun nār(u), wa mā liẓ-ẓālimīna min anṣār(in).",
    "translation_en": "They have certainly disbelieved who say, \"Allah is the Messiah, the son of Mary\" while the Messiah has said, \"O Children of Israel, worship Allah, my Lord and your Lord.\" Indeed, he who associates others with Allah - Allah has forbidden him Paradise, and his refuge is the Fire. And there are not for the wrongdoers any helpers.",
    "translation_id": "Sungguh, telah kufur orang-orang yang berkata, “Sesungguhnya Allah itulah Almasih putra Maryam.” Almasih (sendiri) berkata, “Wahai Bani Israil, sembahlah Allah, Tuhanku dan Tuhanmu!” Sesungguhnya siapa yang mempersekutukan (sesuatu dengan) Allah, maka sungguh, Allah mengharamkan surga baginya dan tempatnya ialah neraka. Tidak ada seorang penolong pun bagi orang-orang zalim itu."
  },
  {
    "ayat": 73,
    "arabic": "لَقَدْ كَفَرَ الَّذِيْنَ قَالُوْٓا اِنَّ اللّٰهَ ثَالِثُ ثَلٰثَةٍ ۘ وَمَا مِنْ اِلٰهٍ اِلَّآ اِلٰهٌ وَّاحِدٌ  ۗوَاِنْ لَّمْ يَنْتَهُوْا عَمَّا يَقُوْلُوْنَ لَيَمَسَّنَّ الَّذِيْنَ كَفَرُوْا مِنْهُمْ عَذَابٌ اَلِيْمٌ",
    "transliteration_en": "laqad kafaral lazeena qaalooo innal laaha saalisu salaasah; wa maa min ilaahin illaaa Ilaahunw Waahid; wa illam yantahoo 'ammaa yaqooloona layamas sannal lazeena kafaroo minhum 'azaabun aleem",
    "transliteration_id": "Laqad kafaral-lażīna qālū innallāha ṡāliṡu ṡalāsah(tin), wa mā min ilāhin illā ilāhuw wāḥid(un), wa illam yantahū ‘ammā yaqūlūna layamassannal-lażīna kafarū minhum ‘ażābun alīm(un).",
    "translation_en": "They have certainly disbelieved who say, \"Allah is the third of three.\" And there is no god except one God. And if they do not desist from what they are saying, there will surely afflict the disbelievers among them a painful punishment.",
    "translation_id": "Sungguh, telah kufur orang-orang yang mengatakan bahwa Allah adalah salah satu dari yang tiga, padahal tidak ada tuhan selain Tuhan Yang Maha Esa. Jika mereka tidak berhenti dari apa yang mereka katakan, pasti orang-orang yang kufur di antara mereka akan ditimpa azab yang sangat pedih."
  },
  {
    "ayat": 74,
    "arabic": "اَفَلَا يَتُوْبُوْنَ اِلَى اللّٰهِ وَيَسْتَغْفِرُوْنَهٗۗ وَاللّٰهُ غَفُوْرٌ رَّحِيْمٌ",
    "transliteration_en": "Afalaa yatooboona ilal laahi wa yastaghfiroonah; wallaahu Ghafoorur Raheem",
    "transliteration_id": "Afalā yatūbūna ilallāhi wa yastagfirūnah(ū), wallāhu gafūrur raḥīm(un).",
    "translation_en": "So will they not repent to Allah and seek His forgiveness? And Allah is Forgiving and Merciful.",
    "translation_id": "Tidakkah mereka bertobat kepada Allah dan memohon ampunan kepada-Nya, padahal Allah Maha Pengampun lagi Maha Penyayang?"
  },
  {
    "ayat": 75,
    "arabic": "مَا الْمَسِيْحُ ابْنُ مَرْيَمَ اِلَّا رَسُوْلٌۚ قَدْ خَلَتْ مِنْ قَبْلِهِ الرُّسُلُۗ وَاُمُّهٗ صِدِّيْقَةٌ  ۗ كَانَا يَأْكُلَانِ الطَّعَامَ ۗ اُنْظُرْ كَيْفَ نُبَيِّنُ لَهُمُ الْاٰيٰتِ ثُمَّ انْظُرْ اَنّٰى يُؤْفَكُوْنَ",
    "transliteration_en": "Mal Maseehub nu Maryama illaa Rasoolun qad khalat min qablihir Rusulu wa ummuhoo siddeeqatun kaanaa yaa kulaanit ta'aam; unzur kaifa nubaiyinu lahumul Aayaati suman zur annaa yu'fakoon",
    "transliteration_id": "Mal-masīḥubnu maryama illā rasūl(un), qad khalat min qablihir rusul(u), wa ummuhū ṣiddīqah(tun), kānā ya'kulāniṭ-ṭa‘ām(a), unẓur kaifa nubayyinu lahumul-āyāti ṡummanẓur annā yu'fakūn(a).",
    "translation_en": "The Messiah, son of Mary, was not but a messenger; [other] messengers have passed on before him. And his mother was a supporter of truth. They both used to eat food. Look how We make clear to them the signs; then look how they are deluded.",
    "translation_id": "Almasih putra Maryam hanyalah seorang rasul. Sebelumnya pun sudah berlalu beberapa rasul. Ibunya adalah seorang yang berpegang teguh pada kebenaran. Keduanya makan (seperti halnya manusia biasa). Perhatikanlah bagaimana Kami menjelaskan ayat-ayat (tanda-tanda kekuasaan) kepada mereka (Ahlulkitab), kemudian perhatikanlah bagaimana mereka dipalingkan (dari kebenaran)."
  },
  {
    "ayat": 76,
    "arabic": "قُلْ اَتَعْبُدُوْنَ مِنْ دُوْنِ اللّٰهِ مَا لَا يَمْلِكُ لَكُمْ ضَرًّا وَّلَا نَفْعًا ۗوَاللّٰهُ هُوَ السَّمِيْعُ الْعَلِيْمُ",
    "transliteration_en": "Qul ata'budoona min doonil laahi maa laa yamliku lakum darranw wa laa naf'aa; wallaahu Huwas Samee'ul 'Aleem",
    "transliteration_id": "Qul ata‘budūna min dūnillāhi mā lā yamliku lakum ḍarraw wa lā naf‘ā(n), wallāhu huwas-samī‘ul-‘alīm(u).",
    "translation_en": "Say, \"Do you worship besides Allah that which holds for you no [power of] harm or benefit while it is Allah who is the Hearing, the Knowing?\"",
    "translation_id": "Katakanlah (Nabi Muhammad), “Mengapa kamu menyembah selain Allah sesuatu yang tidak dapat mendatangkan kepadamu mudarat dan tidak (pula) manfaat?” Allah Maha Mendengar lagi Maha Mengetahui."
  },
  {
    "ayat": 77,
    "arabic": "قُلْ يٰٓاَهْلَ الْكِتٰبِ لَا تَغْلُوْا فِيْ دِيْنِكُمْ غَيْرَ الْحَقِّ وَلَا تَتَّبِعُوْٓا اَهْوَاۤءَ قَوْمٍ قَدْ ضَلُّوْا مِنْ قَبْلُ وَاَضَلُّوْا كَثِيْرًا وَّضَلُّوْا عَنْ سَوَاۤءِ السَّبِيْلِ ࣖ",
    "transliteration_en": "Qul yaaa Ahlal Kitaabi laa taghloo fee deenikum ghairal haqqi wa laa tattabi'ooo ahwaaa'a qawmin qad dalloo min qablu wa adalloo kaseeranw wa dalloo 'an Sawaaa'is Sabeel",
    "transliteration_id": "Qul yā ahlal-kitābi lā taglū fī dīnikum gairal-ḥaqqi wa lā tattabi‘ū ahwā'a qaumin qad ḍallū min qablu wa aḍallū kaṡīraw wa ḍallū ‘an sawā'is-sabīl(i).",
    "translation_en": "Say, \"O People of the Scripture, do not exceed limits in your religion beyond the truth and do not follow the inclinations of a people who had gone astray before and misled many and have strayed from the soundness of the way.\"",
    "translation_id": "Katakanlah (Nabi Muhammad), “Wahai Ahlulkitab, janganlah kamu berlebih-lebihan dalam (urusan) agamamu tanpa hak. Janganlah kamu mengikuti hawa nafsu kaum yang benar-benar tersesat sebelum kamu dan telah menyesatkan banyak (manusia) serta mereka sendiri pun tersesat dari jalan yang lurus.”"
  },
  {
    "ayat": 78,
    "arabic": "لُعِنَ الَّذِيْنَ كَفَرُوْا مِنْۢ بَنِيْٓ اِسْرَاۤءِيْلَ عَلٰى لِسَانِ دَاوٗدَ وَعِيْسَى ابْنِ مَرْيَمَ ۗذٰلِكَ بِمَا عَصَوْا وَّكَانُوْا يَعْتَدُوْنَ",
    "transliteration_en": "Lu'inal lazeena kafaroo mim Baneee israaa'eela 'alaa lisaani Daawooda wa 'Eesab ni Maryam; zaalika bimaa 'asaw wa kaanoo ya tadoon",
    "transliteration_id": "Lu‘inal-lażīna kafarū mim banī isrā'īla ‘alā lisāni dāwūda wa ‘īsabni maryam(a), żālika bimā ‘aṣaw wa kānū ya‘tadūn(a).",
    "translation_en": "Cursed were those who disbelieved among the Children of Israel by the tongue of David and of Jesus, the son of Mary. That was because they disobeyed and [habitually] transgressed.",
    "translation_id": "Orang-orang yang kufur dari Bani Israil telah dilaknat (oleh Allah) melalui lisan (ucapan) Daud dan Isa putra Maryam. Hal itu karena mereka durhaka dan selalu melampaui batas."
  },
  {
    "ayat": 79,
    "arabic": "كَانُوْا لَا يَتَنَاهَوْنَ عَنْ مُّنْكَرٍ فَعَلُوْهُۗ  لَبِئْسَ مَا كَانُوْا يَفْعَلُوْنَ",
    "transliteration_en": "Kaanoo laa yatanaahawna 'am munkarin fa'aluhoo; labi'sa maa kaanoo yafa'loon",
    "transliteration_id": "Kānū lā yatanāhauna ‘am munkarin fa‘alūh(u), labi'sa mā kānū yaf‘alūn(a).",
    "translation_en": "They used not to prevent one another from wrongdoing that they did. How wretched was that which they were doing.",
    "translation_id": "Mereka tidak saling mencegah perbuatan mungkar yang mereka lakukan. Sungguh, itulah seburuk-buruk apa yang selalu mereka lakukan."
  },
  {
    "ayat": 80,
    "arabic": "تَرٰى كَثِيْرًا مِّنْهُمْ يَتَوَلَّوْنَ الَّذِيْنَ كَفَرُوْا ۗ لَبِئْسَ مَا قَدَّمَتْ لَهُمْ اَنْفُسُهُمْ اَنْ سَخِطَ اللّٰهُ عَلَيْهِمْ وَفِى الْعَذَابِ هُمْ خٰلِدُوْنَ",
    "transliteration_en": "Taraa kaseeram minhum yatawallawnal lazeena kafaroo; labi'sa maa qaddamat lahum anfusuhum an sakhital laahu 'alaihim wa fil 'azaabi hum khaalidoon",
    "transliteration_id": "Tarā kaṡīram minhum yatawallaunal-lażīna kafarū, labi'sa mā qaddamat lahum anfusuhum an sakhiṭallāhu ‘alaihim wa fil ‘ażābi hum khālidūn(a).",
    "translation_en": "You see many of them becoming allies of those who disbelieved. How wretched is that which they have put forth for themselves in that Allah has become angry with them, and in the punishment they will abide eternally.",
    "translation_id": "Engkau melihat banyak di antara mereka bersekutu dengan orang-orang yang kufur (musyrik). Sungguh, itulah seburuk-buruk apa yang mereka lakukan untuk diri mereka sendiri (sehingga mengakibatkan) Allah murka kepada mereka. Mereka akan kekal dalam azab."
  },
  {
    "ayat": 81,
    "arabic": "وَلَوْ كَانُوْا يُؤْمِنُوْنَ بِاللّٰهِ وَالنَّبِيِّ وَمَآ اُنْزِلَ اِلَيْهِ مَا اتَّخَذُوْهُمْ اَوْلِيَاۤءَ وَلٰكِنَّ كَثِيْرًا مِّنْهُمْ فٰسِقُوْنَ",
    "transliteration_en": "Wa law kaanoo yu'minoona billaahi wan nabiyyi wa maaa unzila ilaihi attakhazoohum awliyaaa'a wa laakinna kaseeram minhum faasiqoon",
    "transliteration_id": "Wa lau kānū yu'minūna billāhi wan-nabiyyi wa mā unzila ilaihi mattakhażūhum auliyā'a wa lākinna kaṡīram minhum fāsiqūn(a).",
    "translation_en": "And if they had believed in Allah and the Prophet and in what was revealed to him, they would not have taken them as allies; but many of them are defiantly disobedient.",
    "translation_id": "Seandainya mereka beriman kepada Allah, Nabi (Muhammad), dan apa yang diturunkan kepadanya, niscaya mereka tidak akan menjadikan orang musyrik itu sebagai sekutu. Akan tetapi, banyak di antara mereka adalah orang-orang fasik."
  },
  {
    "ayat": 82,
    "arabic": "۞ لَتَجِدَنَّ اَشَدَّ النَّاسِ عَدَاوَةً لِّلَّذِيْنَ اٰمَنُوا الْيَهُوْدَ وَالَّذِيْنَ اَشْرَكُوْاۚ وَلَتَجِدَنَّ اَقْرَبَهُمْ مَّوَدَّةً لِّلَّذِيْنَ اٰمَنُوا الَّذِيْنَ قَالُوْٓا اِنَّا نَصٰرٰىۗ ذٰلِكَ بِاَنَّ مِنْهُمْ قِسِّيْسِيْنَ وَرُهْبَانًا وَّاَنَّهُمْ لَا يَسْتَكْبِرُوْنَ  ۔",
    "transliteration_en": "Latajidanna ashad dan naasi 'adaawatal lillazeena aamanul Yahooda wallazeena ashrakoo wa latajidanna aqrabahum mawaddatal lil lazeena aamanul lazeena qaalooo innaa Nasaaraa; zaalika bi anna mminhum qiseeseena wa ruhbaananw wa annahum laa yastakbiroon",
    "transliteration_id": "Latajidanna asyaddan-nāsi ‘adāwatal lil-lażīna āmanul-yahūda wal-lażīna asyrakū, wa latajidanna aqrabahum  mawaddatal lil-lażīna āmanul-lażīna qālū innā naṣārā, żālika bi'anna minhum qissīsīna wa ruhbānaw wa annahum lā yastakbirūn(a).",
    "translation_en": "You will surely find the most intense of the people in animosity toward the believers [to be] the Jews and those who associate others with Allah; and you will find the nearest of them in affection to the believers those who say, \"We are Christians.\" That is because among them are priests and monks and because they are not arrogant.",
    "translation_id": "Pasti akan engkau dapati orang yang paling keras permusuhannya terhadap orang-orang yang beriman, yaitu orang-orang Yahudi dan orang-orang musyrik. Pasti akan engkau dapati pula orang yang paling dekat persahabatannya dengan orang-orang yang beriman, yaitu orang-orang yang berkata, “Sesungguhnya kami adalah orang Nasrani.” Hal itu karena di antara mereka terdapat para pendeta dan rahib, juga karena mereka tidak menyombongkan diri."
  },
  {
    "ayat": 83,
    "arabic": "وَاِذَا سَمِعُوْا مَآ اُنْزِلَ اِلَى الرَّسُوْلِ تَرٰٓى اَعْيُنَهُمْ تَفِيْضُ مِنَ الدَّمْعِ مِمَّا عَرَفُوْا مِنَ الْحَقِّۚ يَقُوْلُوْنَ رَبَّنَآ اٰمَنَّا فَاكْتُبْنَا مَعَ الشّٰهِدِيْنَ",
    "transliteration_en": "Wa izaa sami'oo maaa unzila ilar Rasooli taraaa a'yunahum tafeedu minad dam'i mimmmaa 'arafoo minalhaqq; yaqooloona Rabbanaaa aamannaa faktubnaa ma'ash shaahideen",
    "transliteration_id": "Wa iżā sami‘ū mā unzila ilar-rasūli tarā a‘yunahum tafīḍu minad-dam‘i mimmā ‘arafū minal-ḥaqq(i), yaqūlūna rabbanā āmannā faktubnā ma‘asy-syāhidīn(a).",
    "translation_en": "And when they hear what has been revealed to the Messenger, you see their eyes overflowing with tears because of what they have recognized of the truth. They say, \"Our Lord, we have believed, so register us among the witnesses.",
    "translation_id": "Apabila mereka mendengar sesuatu (Al-Qur’an) yang diturunkan kepada Rasul (Nabi Muhammad), engkau melihat mata mereka bercucuran air mata disebabkan kebenaran yang telah mereka ketahui (dari kitab-kitab mereka sendiri). Mereka berkata, “Ya Tuhan kami, kami telah beriman. Maka, catatlah kami bersama orang-orang yang menjadi saksi (atas kebenaran Al-Qur’an dan kenabian Muhammad)."
  },
  {
    "ayat": 84,
    "arabic": "وَمَا لَنَا لَا نُؤْمِنُ بِاللّٰهِ وَمَا جَاۤءَنَا مِنَ الْحَقِّۙ وَنَطْمَعُ اَنْ يُّدْخِلَنَا رَبُّنَا مَعَ الْقَوْمِ الصّٰلِحِيْنَ",
    "transliteration_en": "Wa maa lanaa laa nu'minu billaahi wa maa jaaa'anaa minal haqqi wa natma'u ai yudkhilanaa Rabbunaa ma'al qawmis saaliheen",
    "transliteration_id": "Wa mā lanā lā nu'minu billāhi wa mā jā'anā minal-ḥaqq(i), wa naṭma‘u ay yudkhilanā rabbunā ma‘al-qaumiṣ-ṣāliḥīn(a).",
    "translation_en": "And why should we not believe in Allah and what has come to us of the truth? And we aspire that our Lord will admit us [to Paradise] with the righteous people.\"",
    "translation_id": "Mengapa kami tidak beriman kepada Allah dan kebenaran yang telah datang kepada kami, padahal kami sangat ingin agar Tuhan kami memasukkan kami bersama kaum yang saleh?”"
  },
  {
    "ayat": 85,
    "arabic": "فَاَثَابَهُمُ اللّٰهُ بِمَا قَالُوْا جَنّٰتٍ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُ خٰلِدِيْنَ فِيْهَاۗ وَذٰلِكَ جَزَاۤءُ الْمُحْسِنِيْنَ",
    "transliteration_en": "Fa asaabahumul laahu bimaa qaaloo Jannnaatin tajree min tahtihal anhaaru khaalideena feehaa; wa zaalika jazaaa'ul muhsineen",
    "transliteration_id": "Fa aṡābahumullāhu bimā qālū jannātin tajrī min taḥtihal-anhāru khālidīna fīhā, wa żālika jazā'ul-muḥsinīn(a).",
    "translation_en": "So Allah rewarded them for what they said with gardens [in Paradise] beneath which rivers flow, wherein they abide eternally. And that is the reward of doers of good.",
    "translation_id": "Maka, Allah memberi pahala kepada mereka atas sesuatu yang telah mereka ucapkan, (yaitu) surga yang mengalir di bawahnya sungai-sungai, sedang mereka kekal di dalamnya. Itulah balasan (bagi) orang-orang yang berbuat kebaikan."
  },
  {
    "ayat": 86,
    "arabic": "وَالَّذِيْنَ كَفَرُوْا وَكَذَّبُوْا بِاٰيٰتِنَآ اُولٰۤىِٕكَ اَصْحٰبُ الْجَحِيْمِ ࣖ",
    "transliteration_en": "Wallazeena kafaroo wa kazzaboo bi Aayaatinaaa ulaaa'ika Ashaabul Jaheem",
    "transliteration_id": "Wal-lażīna kafarū wa każżabū bi'āyātinā ulā'ika aṣḥābul-jaḥīm(i).",
    "translation_en": "But those who disbelieved and denied Our signs - they are the companions of Hellfire.",
    "translation_id": "Adapun orang-orang yang kufur dan mendustakan ayat-ayat Kami, mereka itulah penghuni (neraka) Jahim."
  },
  {
    "ayat": 87,
    "arabic": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا تُحَرِّمُوْا طَيِّبٰتِ مَآ اَحَلَّ اللّٰهُ لَكُمْ وَلَا تَعْتَدُوْا ۗاِنَّ اللّٰهَ لَا يُحِبُّ الْمُعْتَدِيْنَ",
    "transliteration_en": "Yaaa aiyuhal lazeena aamanoo laa tuharrimoo taiyibaati maaa ahallal laahu lakum wa laa ta'tadooo; innal laaha laa yuhibbul mu'tadeen",
    "transliteration_id": "Yā ayyuhal-lażīna āmanū lā tuḥarrimū ṭayyibāti mā aḥallallāhu lakum wa lā ta‘tadū, innallāha lā yuḥibbul-mu‘tadīn(a).",
    "translation_en": "O you who have believed, do not prohibit the good things which Allah has made lawful to you and do not transgress. Indeed, Allah does not like transgressors.",
    "translation_id": "Wahai orang-orang yang beriman, janganlah kamu mengharamkan sesuatu yang baik yang telah Allah halalkan bagi kamu, dan janganlah kamu melampaui batas. Sesungguhnya Allah tidak menyukai orang-orang yang melampaui batas."
  },
  {
    "ayat": 88,
    "arabic": "وَكُلُوْا مِمَّا رَزَقَكُمُ اللّٰهُ حَلٰلًا طَيِّبًا ۖوَّاتَّقُوا اللّٰهَ الَّذِيْٓ اَنْتُمْ بِهٖ مُؤْمِنُوْنَ",
    "transliteration_en": "Wa kuloo mimmaa razaqakumul laahu halaalan taiyibaa; wattaqul laahallazeee antum bihee mu'minon",
    "transliteration_id": "Wa kulū mimmā razaqakumullāhu ḥalālan ṭayyibā(n), wattaqullāhal-lażī antum bihī mu'minūn(a).",
    "translation_en": "And eat of what Allah has provided for you [which is] lawful and good. And fear Allah, in whom you are believers.",
    "translation_id": "Makanlah apa yang telah Allah anugerahkan kepadamu sebagai rezeki yang halal lagi baik, dan bertakwalah kepada Allah yang hanya kepada-Nya kamu beriman."
  },
  {
    "ayat": 89,
    "arabic": "لَا يُؤَاخِذُكُمُ اللّٰهُ بِاللَّغْوِ  فِيْٓ اَيْمَانِكُمْ وَلٰكِنْ يُّؤَاخِذُكُمْ بِمَا عَقَّدْتُّمُ الْاَيْمَانَۚ فَكَفَّارَتُهٗٓ اِطْعَامُ عَشَرَةِ مَسٰكِيْنَ مِنْ اَوْسَطِ مَا تُطْعِمُوْنَ اَهْلِيْكُمْ اَوْ كِسْوَتُهُمْ اَوْ تَحْرِيْرُ رَقَبَةٍ ۗفَمَنْ لَّمْ يَجِدْ فَصِيَامُ ثَلٰثَةِ اَيَّامٍ ۗذٰلِكَ كَفَّارَةُ اَيْمَانِكُمْ اِذَا حَلَفْتُمْ ۗوَاحْفَظُوْٓا اَيْمَانَكُمْ ۗ كَذٰلِكَ يُبَيِّنُ اللّٰهُ لَكُمْ اٰيٰتِهٖ لَعَلَّكُمْ تَشْكُرُوْنَ",
    "transliteration_en": "Laa yu'aakhizukumul laahu billaghwi feee aimaanikum wa laakiny ya'aakhizukum bimaa 'aqqattumul aimaana fakaf faaratuhooo it'aamu 'asharati masaakeena min awsati maa tut'imoona ahleekum aw kiswatuhum aw tahreeru raqabatin famallam yajid fa Siyaamu salaasati aiyaam; zaalika kaffaaratu aimaanikum izaa halaftum; wahfazooo aimaanakum; kazaalika yubaiyinul laahu lakum Aayaatihee la'allakum tashkuroon",
    "transliteration_id": "Lā yu'ākhiżukumullāhu bil-lagwi fī aimānikum wa lākiy yu'ākhiżukum bimā ‘aqqattumul-aimān(a), fa kaffāratuhū iṭ‘āmu ‘asyarati masākīna min ausaṭi mā tuṭ‘imūna ahlīkum au kiswatuhum au taḥrīru raqabah(tin), famal lam yajid fa ṣiyāmu ṡalāṡati ayyām(in), żālika kaffāratu aimānikum iżā ḥalaftum, waḥfaẓū aimānakum, każālika yubayyinullāhu lakum āyātihī la‘allakum tasykurūn(a).",
    "translation_en": "Allah will not impose blame upon you for what is meaningless in your oaths, but He will impose blame upon you for [breaking] what you intended of oaths. So its expiation is the feeding of ten needy people from the average of that which you feed your [own] families or clothing them or the freeing of a slave. But whoever cannot find [or afford it] - then a fast of three days [is required]. That is the expiation for oaths when you have sworn. But guard your oaths. Thus does Allah make clear to you His verses that you may be grateful.",
    "translation_id": "Allah tidak menghukum kamu disebabkan sumpah-sumpahmu yang tidak disengaja (untuk bersumpah), tetapi Dia menghukum kamu disebabkan sumpah-sumpah yang kamu sengaja. Maka, kafaratnya (denda akibat melanggar sumpah) ialah memberi makan sepuluh orang miskin dari makanan yang (biasa) kamu berikan kepada keluargamu, memberi pakaian kepada mereka, atau memerdekakan seorang hamba sahaya. Siapa yang tidak mampu melakukannya, maka (kafaratnya) berpuasa tiga hari. Itulah kafarat sumpah-sumpahmu apabila kamu bersumpah (dan kamu melanggarnya). Jagalah sumpah-sumpahmu! Demikianlah Allah menjelaskan kepadamu hukum-hukum-Nya agar kamu bersyukur (kepada-Nya)."
  },
  {
    "ayat": 90,
    "arabic": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْٓا اِنَّمَا الْخَمْرُ وَالْمَيْسِرُ وَالْاَنْصَابُ وَالْاَزْلَامُ رِجْسٌ مِّنْ عَمَلِ الشَّيْطٰنِ فَاجْتَنِبُوْهُ لَعَلَّكُمْ تُفْلِحُوْنَ",
    "transliteration_en": "yaaa aiyuhal lazeena aamanooo innamal khamru walmaisiru wal ansaabu wal azlaamu rijsum min 'amalish shaitaani fajtaniboohu la'al lakum tuflihoon",
    "transliteration_id": "Yā ayyuhal-lażīna āmanū innamal-khamru wal-maisiru wal-anṣābu wal-azlāmu rijsum min ‘amalisy-syaiṭāni fajtanibūhu la‘allakum tufliḥūn(a).",
    "translation_en": "O you who have believed, indeed, intoxicants, gambling, [sacrificing on] stone alters [to other than Allah], and divining arrows are but defilement from the work of Satan, so avoid it that you may be successful.",
    "translation_id": "Wahai orang-orang yang beriman, sesungguhnya minuman keras, berjudi, (berkurban untuk) berhala, dan mengundi nasib dengan anak panah adalah perbuatan keji (dan) termasuk perbuatan setan. Maka, jauhilah (perbuatan-perbuatan) itu agar kamu beruntung."
  },
  {
    "ayat": 91,
    "arabic": "اِنَّمَا يُرِيْدُ الشَّيْطٰنُ اَنْ يُّوْقِعَ بَيْنَكُمُ الْعَدَاوَةَ وَالْبَغْضَاۤءَ فِى الْخَمْرِ وَالْمَيْسِرِ وَيَصُدَّكُمْ عَنْ ذِكْرِ اللّٰهِ وَعَنِ الصَّلٰوةِ فَهَلْ اَنْتُمْ مُّنْتَهُوْنَ",
    "transliteration_en": "Innamaa yureedush Shaitaanu ai yooqi'a bainakumul 'adaawata wal baghdaaa'a fil khamri wal maisiri wa yasuddakum 'an zikril laahi wa 'anis Salaati fahal antum muntahoon",
    "transliteration_id": "Innamā yurīdusy-syaiṭānu ay yūqi‘a bainakumul-‘adāwata wal-bagḍā'a fil-khamri wal-maisiri wa yaṣuddakum ‘an żikrillāhi wa ‘aniṣ-ṣalāti fahal antum muntahūn(a).",
    "translation_en": "Satan only wants to cause between you animosity and hatred through intoxicants and gambling and to avert you from the remembrance of Allah and from prayer. So will you not desist?",
    "translation_id": "Sesungguhnya setan hanya bermaksud menimbulkan permusuhan dan kebencian di antara kamu melalui minuman keras dan judi serta (bermaksud) menghalangi kamu dari mengingat Allah dan (melaksanakan) salat, maka tidakkah kamu mau berhenti?"
  },
  {
    "ayat": 92,
    "arabic": "وَاَطِيْعُوا اللّٰهَ وَاَطِيْعُوا الرَّسُوْلَ وَاحْذَرُوْا ۚفَاِنْ تَوَلَّيْتُمْ فَاعْلَمُوْٓا اَنَّمَا عَلٰى رَسُوْلِنَا الْبَلٰغُ الْمُبِيْنُ",
    "transliteration_en": "Wa atee'ul laaha wa atee'ur Rasoola wahzaroo; fa in tawal laitum fa'lamooo annamaa 'alaa Rasoolinal balaaghul mubeen",
    "transliteration_id": "Wa aṭī‘ullāha wa aṭī‘ur-rasūla waḥżarū, fa in tawallaitum fa‘lamū annamā ‘alā rasūlinal-balāgul-mubīn(u).",
    "translation_en": "And obey Allah and obey the Messenger and beware. And if you turn away - then know that upon Our Messenger is only [the responsibility for] clear notification.",
    "translation_id": "Taatlah kamu kepada Allah dan taatlah kamu kepada Rasul serta berhati-hatilah! Jika kamu berpaling, maka ketahuilah bahwa kewajiban Rasul Kami hanyalah menyampaikan (ajaran Allah) dengan jelas."
  },
  {
    "ayat": 93,
    "arabic": "لَيْسَ عَلَى الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ جُنَاحٌ فِيْمَا طَعِمُوْٓا اِذَا مَا اتَّقَوْا وَّاٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ ثُمَّ اتَّقَوْا وَّاٰمَنُوْا ثُمَّ اتَّقَوْا وَّاَحْسَنُوْا ۗوَاللّٰهُ يُحِبُّ الْمُحْسِنِيْنَ ࣖ",
    "transliteration_en": "Laisa 'alal lazeena aamanoo wa 'amilus saalihaati junaahun feemaa ta'imooo izaa mat taqaw wa aamanoo wa 'amilus saalihaati summat taqaw wa aamanoo summat taqaw wa ahsanoo; wallaahu yuhibbul muhsineen",
    "transliteration_id": "Laisa ‘alal-lażīna āmanū  wa ‘amiluṣ-ṣāliḥāti  ṡummattaqau wa āmanū ṡummattaqau wa aḥsanū, wallāhu yuḥibbul-muḥsinīn(a).",
    "translation_en": "There is not upon those who believe and do righteousness [any] blame concerning what they have eaten [in the past] if they [now] fear Allah and believe and do righteous deeds, and then fear Allah and believe, and then fear Allah and do good; and Allah loves the doers of good.",
    "translation_id": "Tidak ada dosa bagi orang-orang yang beriman dan mengerjakan amal-amal saleh menyangkut sesuatu yang telah mereka makan (dahulu sebelum turunnya aturan yang mengharamkan), apabila mereka bertakwa dan beriman, serta mengerjakan amal-amal saleh, kemudian mereka (tetap) bertakwa dan beriman, selanjutnya mereka (tetap juga) bertakwa dan berbuat kebajikan. Allah menyukai orang-orang yang berbuat kebajikan."
  },
  {
    "ayat": 94,
    "arabic": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَيَبْلُوَنَّكُمُ اللّٰهُ بِشَيْءٍ مِّنَ الصَّيْدِ تَنَالُهٗٓ اَيْدِيْكُمْ وَرِمَاحُكُمْ لِيَعْلَمَ اللّٰهُ مَنْ يَّخَافُهٗ بِالْغَيْبِۚ فَمَنِ اعْتَدٰى بَعْدَ ذٰلِكَ فَلَهٗ عَذَابٌ اَلِيْمٌ",
    "transliteration_en": "Yaaa aiyuhal lazeena aamanoo la yabluwannnakumul laahu bishai'im minas saidi tanaaluhooo aideekum wa rimaahukum liya'lamal laahu mai yakhaafuhoo bilghaib; famani' tadaa ba'da zaalika falahoo 'azaabun aleem",
    "transliteration_id": "Yā ayyuhal-lażīna āmanū layabluwannakumullāhu bisyai'im minaṣ-ṣaidi tanāluhū aidīkum wa rimāḥukum liya‘lamallāhu may yakhāfuhū bil-gaib(i), fa mani‘tadā ba‘da żālika fa lahū ‘ażābun alīm(un).",
    "translation_en": "O you who have believed, Allah will surely test you through something of the game that your hands and spears [can] reach, that Allah may make evident those who fear Him unseen. And whoever transgresses after that - for him is a painful punishment.",
    "translation_id": "Wahai orang-orang yang beriman, sungguh Allah pasti akan mengujimu dengan sesuatu dari hewan buruan yang (mudah) didapat oleh tangan dan tombakmu agar Allah mengetahui siapa yang takut kepada-Nya, meskipun Dia gaib. Siapa yang melanggar (batas) setelah itu, baginya azab yang pedih."
  },
  {
    "ayat": 95,
    "arabic": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا تَقْتُلُوا الصَّيْدَ وَاَنْتُمْ حُرُمٌ ۗوَمَنْ قَتَلَهٗ مِنْكُمْ مُّتَعَمِّدًا فَجَزَۤاءٌ مِّثْلُ مَا قَتَلَ مِنَ النَّعَمِ يَحْكُمُ بِهٖ ذَوَا عَدْلٍ مِّنْكُمْ هَدْيًاۢ بٰلِغَ الْكَعْبَةِ اَوْ كَفَّارَةٌ طَعَامُ مَسٰكِيْنَ اَوْ عَدْلُ ذٰلِكَ صِيَامًا لِّيَذُوْقَ وَبَالَ اَمْرِهٖ ۗعَفَا اللّٰهُ عَمَّا سَلَفَ ۗوَمَنْ عَادَ فَيَنْتَقِمُ اللّٰهُ مِنْهُ ۗوَاللّٰهُ عَزِيْزٌ ذُو انْتِقَامٍ",
    "transliteration_en": "Yaaa aiyuhal lazeena aamanoo laa taqtuslus saida wa antum hurum; wa man qatalahoo minkum mut'am midan fajazaaa'um mislu maa qatala minanna'ami yahkumu bihee zawaa 'adlim minkum hadyam baalighal Ka'bati aw kaffaaratun ta'aamu masaakeena aw 'adlu zaalika Siyaamal liyazooqa wabaala amrih; 'afal laahu 'ammaa salaf; wa man 'aada fayanta qimul laahu minh; wallaahu 'azeezun zuntiqaam",
    "transliteration_id": "Yā ayyuhal-lażīna āmanū lā taqtuluṣ-ṣaida wa antum ḥurum(un), wa man qatalahū minkum muta‘ammidan fa jazā'um miṡlu mā qatala minan-na‘ami yaḥkumu bihī żawā ‘adlim minkum hadyam bāligal-ka‘bati au kaffāratun ṭa‘āmu masākīna au ‘adlu żālika ṣiyāmal liyażūqa wabāla amrih(ī), ‘afallāhu ‘ammā salaf(a), wa man ‘āda fa yantaqimullāhu minh(u), wallāhu ‘azīzun żuntiqām(in).",
    "translation_en": "O you who have believed, do not kill game while you are in the state of ihram. And whoever of you kills it intentionally - the penalty is an equivalent from sacrificial animals to what he killed, as judged by two just men among you as an offering [to Allah] delivered to the Ka'bah, or an expiation: the feeding of needy people or the equivalent of that in fasting, that he may taste the consequence of his deed. Allah has pardoned what is past; but whoever returns [to violation], then Allah will take retribution from him. And Allah is Exalted in Might and Owner of Retribution.",
    "translation_id": "Wahai orang-orang yang beriman, janganlah kamu membunuh hewan buruan, ketika kamu sedang berihram (haji atau umrah). Siapa di antara kamu membunuhnya dengan sengaja, dendanya (ialah menggantinya) dengan hewan ternak yang sepadan dengan (hewan buruan) yang dibunuhnya menurut putusan dua orang yang adil di antara kamu sebagai hadyu (hewan kurban) yang (dibawa) sampai ke Ka‘bah atau (membayar) kafarat dengan memberi makan orang-orang miskin atau berpuasa, seimbang dengan makanan yang dikeluarkan itu, agar dia merasakan akibat buruk dari perbuatannya. Allah telah memaafkan perbuatan yang telah lalu. Siapa kembali mengerjakannya, pasti Allah akan menyiksanya. Allah Maha Perkasa lagi Maha Memiliki (kekuasaan) untuk membalas."
  },
  {
    "ayat": 96,
    "arabic": "اُحِلَّ لَكُمْ صَيْدُ الْبَحْرِ وَطَعَامُهٗ مَتَاعًا لَّكُمْ وَلِلسَّيَّارَةِ ۚوَحُرِّمَ عَلَيْكُمْ صَيْدُ الْبَرِّ مَا دُمْتُمْ حُرُمًا ۗوَاتَّقُوا اللّٰهَ الَّذِيْٓ اِلَيْهِ تُحْشَرُوْنَ",
    "transliteration_en": "Uhilla lakum saidul bahri wa ta'aamuhoo mataa'al lakum wa lissaiyaarati wa hurrima 'alaikum saidul barri maa dumtum hurumaa; wattaqul laahal lazeee ilaihi tuhsharoon",
    "transliteration_id": "Uḥilla lakum ṣaidul-baḥri wa ṭa‘āmuhū matā‘al lakum wa lis-sayyārah(ti), wa ḥurrima ‘alaikum ṣaidul-barri mā dumtum ḥurumā(n), wattaqullāhal-lażī ilaihi tuḥsyarūn(a).",
    "translation_en": "Lawful to you is game from the sea and its food as provision for you and the travelers, but forbidden to you is game from the land as long as you are in the state of ihram. And fear Allah to whom you will be gathered.",
    "translation_id": "Dihalalkan bagi kamu hewan buruan laut dan makanan (yang berasal dari) laut sebagai kesenangan bagimu, dan bagi orang-orang yang dalam perjalanan; dan diharamkan atasmu (menangkap) hewan buruan darat selama kamu dalam keadaan ihram. Bertakwalah kepada Allah yang hanya kepada-Nya kamu akan dikumpulkan."
  },
  {
    "ayat": 97,
    "arabic": "۞ جَعَلَ اللّٰهُ الْكَعْبَةَ الْبَيْتَ الْحَرَامَ قِيٰمًا لِّلنَّاسِ وَالشَّهْرَ الْحَرَامَ وَالْهَدْيَ وَالْقَلَاۤىِٕدَ ۗذٰلِكَ لِتَعْلَمُوْٓا اَنَّ اللّٰهَ يَعْلَمُ مَا فِى السَّمٰوٰتِ وَمَا فِى الْاَرْضِۙ وَاَنَّ اللّٰهَ بِكُلِّ شَيْءٍ عَلِيْمٌ",
    "transliteration_en": "Ja'alal laahul Ka'batal Baital Haraama qiyaamal linnaasi wash Shahral Haraama walhadya walqalaaa'id; zaalika lita'lamooo annal laaha ya'lamu maa fis samaawaati wa maa fil ardi wa annal laaha bikulli shai'in 'Aleem",
    "transliteration_id": "Ja‘alallāhul-ka‘batal-baital-ḥarāma qiyāmal lin-nāsi wasy-syahral-ḥarāma wal-hadya wal-qalā'id(a), żālika lita‘lamū annallāha ya‘lamu mā fis-samāwāti wa mā fil-arḍ(i), wa annallāha bikulli syai'in ‘alīm(un).",
    "translation_en": "Allah has made the Ka'bah, the Sacred House, standing for the people and [has sanctified] the sacred months and the sacrificial animals and the garlands [by which they are identified]. That is so you may know that Allah knows what is in the heavens and what is in the earth and that Allah is Knowing of all things.",
    "translation_id": "Allah telah menjadikan Ka‘bah, rumah suci itu sebagai pusat kegiatan (peribadatan dan urusan dunia) bagi manusia, dan (demikian pula) bulan haram, hadyu (hewan kurban) dan qalā’id (hewan kurban yang diberi kalung). Yang demikian itu agar kamu mengetahui bahwa sesungguhnya Allah mengetahui apa pun yang ada di langit dan apa pun yang ada di bumi dan bahwa Allah Maha Mengetahui segala sesuatu."
  },
  {
    "ayat": 98,
    "arabic": "اِعْلَمُوْٓا اَنَّ اللّٰهَ شَدِيْدُ الْعِقَابِۙ وَاَنَّ اللّٰهَ غَفُوْرٌ رَّحِيْمٌۗ",
    "transliteration_en": "I'lamooo annal laaha shadeedul 'iqaabi wa annal laaha Ghafoorur Raheem",
    "transliteration_id": "I‘lamū annallāha syadīdul-‘iqāb(i), wa annallāha gafūrur raḥīm(un).",
    "translation_en": "Know that Allah is severe in penalty and that Allah is Forgiving and Merciful.",
    "translation_id": "Ketahuilah bahwa Allah sangat keras hukuman-Nya dan bahwa Allah Maha Pengampun lagi Maha Penyayang."
  },
  {
    "ayat": 99,
    "arabic": "مَا عَلَى الرَّسُوْلِ اِلَّا الْبَلٰغُ ۗوَاللّٰهُ يَعْلَمُ مَا تُبْدُوْنَ وَمَا تَكْتُمُوْنَ",
    "transliteration_en": "Maa 'alar Rasooli illal balaagh; wallaahu ya'lamu maa tubdoona wa maa taktumoon",
    "transliteration_id": "Mā ‘alar-rasūli illal-balāg(u),wallāhu ya‘lamu mā tubdūna wa mā taktumūn(a).",
    "translation_en": "Not upon the Messenger is [responsibility] except [for] notification. And Allah knows whatever you reveal and whatever you conceal.",
    "translation_id": "Kewajiban Rasul tidak lain hanyalah menyampaikan (ajaran Allah). Allah mengetahui apa pun yang kamu tampakkan dan apa pun yang kamu sembunyikan."
  },
  {
    "ayat": 100,
    "arabic": "قُلْ لَّا يَسْتَوِى الْخَبِيْثُ وَالطَّيِّبُ وَلَوْ اَعْجَبَكَ كَثْرَةُ الْخَبِيْثِۚ فَاتَّقُوا اللّٰهَ يٰٓاُولِى الْاَلْبَابِ لَعَلَّكُمْ تُفْلِحُوْنَ ࣖ",
    "transliteration_en": "Qul laa yastawil khabeesu wattaiyibu wa law a'jabaka kasratul khabees; fattaqul laaha yaaa ulil albaabi la'allakum tuflihoon",
    "transliteration_id": "Qul lā yastawil-khabīṡu waṭ-ṭayyibu wa lau a‘jabaka kaṡratul-khabīṡ(i), fattaqullāha yā ulil-albābi la‘allakum tufliḥūn(a).",
    "translation_en": "Say, \"Not equal are the evil and the good, although the abundance of evil might impress you.\" So fear Allah, O you of understanding, that you may be successful.",
    "translation_id": "Katakanlah (Nabi Muhammad), “Tidaklah sama yang buruk dengan yang baik meskipun banyaknya yang buruk itu menarik hatimu. Maka, bertakwalah kepada Allah wahai orang-orang yang berakal sehat agar kamu beruntung.”"
  }
]