[
  {
    "ayat": 1,
    "arabic": "حٰمۤ  ۚ",
    "transliteration_en": "Haa-Meeem",
    "transliteration_id": "Ḥā mīm.",
    "translation_en": "Ha, Meem.",
    "translation_id": "Ḥā Mīm."
  },
  {
    "ayat": 2,
    "arabic": "تَنْزِيْلُ الْكِتٰبِ مِنَ اللّٰهِ الْعَزِيْزِ الْحَكِيْمِ",
    "transliteration_en": "Tanzeelul Kitaabi minal laahil 'Azeezil Hakeem",
    "transliteration_id": "Tanzīlul-kitābi minallāhil-‘azīzil-ḥakīm(i).",
    "translation_en": "The revelation of the Book is from Allah, the Exalted in Might, the Wise.",
    "translation_id": "Diturunkannya Kitab (Al-Qur’an) ini (berasal) dari Allah Yang Maha Perkasa lagi Maha Bijaksana."
  },
  {
    "ayat": 3,
    "arabic": "اِنَّ فِى السَّمٰوٰتِ وَالْاَرْضِ لَاٰيٰتٍ لِّلْمُؤْمِنِيْنَۗ",
    "transliteration_en": "Innaa fis samaawaati wal ardi la Aayaatil lilmu'mineen",
    "transliteration_id": "Inna fis-samāwāti wal-arḍi la'āyātil lil-mu'minīn(a).",
    "translation_en": "Indeed, within the heavens and earth are signs for the believers.",
    "translation_id": "Sesungguhnya di langit dan bumi benar-benar terdapat tanda-tanda (kebesaran Allah) bagi orang-orang mukmin."
  },
  {
    "ayat": 4,
    "arabic": "وَفِيْ خَلْقِكُمْ وَمَا يَبُثُّ مِنْ دَاۤبَّةٍ اٰيٰتٌ لِّقَوْمٍ يُّوْقِنُوْنَۙ",
    "transliteration_en": "Wa fee khalaqikum wa maa yabussu min daaabbatin Aayaatul liqawminy-yooqinoon",
    "transliteration_id": "Wa fī khalqikum wa mā yabuṡṡu min dābbatin āyātul liqaumiy yūqinūn(a).",
    "translation_en": "And in the creation of yourselves and what He disperses of moving creatures are signs for people who are certain [in faith].",
    "translation_id": "Pada penciptaan kamu dan makhluk bergerak yang ditebarkan-Nya terdapat tanda-tanda (kebesaran Allah) bagi kaum yang meyakini."
  },
  {
    "ayat": 5,
    "arabic": "وَاخْتِلَافِ الَّيْلِ وَالنَّهَارِ وَمَآ اَنْزَلَ اللّٰهُ مِنَ السَّمَاۤءِ مِنْ رِّزْقٍ فَاَحْيَا بِهِ الْاَرْضَ بَعْدَ مَوْتِهَا وَتَصْرِيْفِ الرِّيٰحِ اٰيٰتٌ لِّقَوْمٍ يَّعْقِلُوْنَ",
    "transliteration_en": "Wakhtilaafil laili wannahaari wa maaa anzalal laahu minas samaaa'i mir rizqin fa ahyaa bihil arda ba'da mawtihaa wa tasreefir riyaahi Aayaatul liqawminy ya'qiloon",
    "transliteration_id": "Wakhtilāfil-laili wan-nahāri wa mā anzalallāhu minas-samā'i mir rizqin fa aḥyā bihil-arḍa ba‘da mautihā wa taṣrīfir-riyāḥi āyātul liqaumiy ya‘qilūn(a).",
    "translation_en": "And [in] the alternation of night and day and [in] what Allah sends down from the sky of provision and gives life thereby to the earth after its lifelessness and [in His] directing of the winds are signs for a people who reason.",
    "translation_id": "(Pada) pergantian malam dan siang serta rezeki yang diturunkan Allah dari langit, lalu dihidupsuburkannya bumi (dengan air hujan) sesudah matinya, dan pada perkisaran angin terdapat (pula) tanda-tanda (kebesaran Allah) bagi kaum yang mengerti."
  },
  {
    "ayat": 6,
    "arabic": "تِلْكَ اٰيٰتُ اللّٰهِ نَتْلُوْهَا عَلَيْكَ بِالْحَقِّۚ فَبِاَيِّ حَدِيْثٍۢ بَعْدَ اللّٰهِ وَاٰيٰتِهٖ يُؤْمِنُوْنَ",
    "transliteration_en": "Tilka Aayatul laahi natloohaa 'alika bilhaqq, fabiayyi hadeesim ba'dal laahi wa Aayaatihee yu'minoon",
    "transliteration_id": "Tilka āyātullāhi natlūhā ‘alaika bil-ḥaqq(i), fa bi'ayyi ḥadīṡim ba‘dallāhi wa āyātihī yu'minūn(a).",
    "translation_en": "These are the verses of Allah which We recite to you in truth. Then in what statement after Allah and His verses will they believe?",
    "translation_id": "Itulah ayat-ayat Allah yang Kami bacakan kepadamu dengan benar. Maka, pada perkataan mana lagi mereka akan beriman setelah Allah dan ayat-ayat-Nya?"
  },
  {
    "ayat": 7,
    "arabic": "وَيْلٌ لِّكُلِّ اَفَّاكٍ اَثِيْمٍۙ",
    "transliteration_en": "Wailul likulli affaakin aseem",
    "transliteration_id": "Wailul likulli affākin aṡīm(in).",
    "translation_en": "Woe to every sinful liar",
    "translation_id": "Celakalah setiap pembohong lagi bergelimang dosa"
  },
  {
    "ayat": 8,
    "arabic": "يَّسْمَعُ اٰيٰتِ اللّٰهِ تُتْلٰى عَلَيْهِ ثُمَّ يُصِرُّ مُسْتَكْبِرًا كَاَنْ لَّمْ يَسْمَعْهَاۚ فَبَشِّرْهُ بِعَذَابٍ اَلِيْمٍ",
    "transliteration_en": "Yasma'u Aayaatil laahi tutlaa 'alaihi summa yusirru mustakbiran ka-al lam yasma'haa fabashshirhu bi'azaabin aleem",
    "transliteration_id": "Yasma‘u āyātillāhi tutlā ‘alaihi ṡumma yuṣirru mustakbiran ka'allam yasma‘hā, fa basysyirhu bi‘ażābin alīm(in).",
    "translation_en": "Who hears the verses of Allah recited to him, then persists arrogantly as if he had not heard them. So give him tidings of a painful punishment.",
    "translation_id": "yang mendengar ayat-ayat Allah dibacakan kepadanya, kemudian dia tetap menyombongkan diri seakan-akan tidak mendengarnya. Peringatkanlah dia (wahai Nabi Muhammad) dengan azab yang amat pedih."
  },
  {
    "ayat": 9,
    "arabic": "وَاِذَا عَلِمَ مِنْ اٰيٰتِنَا شَيْـًٔا ۨاتَّخَذَهَا هُزُوًاۗ اُولٰۤىِٕكَ لَهُمْ عَذَابٌ مُّهِيْنٌۗ",
    "transliteration_en": "Wa izaa 'alima min Aayaatinaa shai'anit takhazahaa huzuwaa; ulaaa'ika lahum 'azaabum muheen",
    "transliteration_id": "Wa iżā ‘alima min āyātinā syai'anittakhażahā huzuwā(n), ulā'ika lahum ‘ażābum muhīn(un).",
    "translation_en": "And when he knows anything of Our verses, he takes them in ridicule. Those will have a humiliating punishment.",
    "translation_id": "Apabila dia mengetahui sesuatu tentang ayat-ayat Kami, dia menjadikannya bahan olok-olok. Merekalah yang akan menerima azab yang menghinakan."
  },
  {
    "ayat": 10,
    "arabic": "مِنْ وَّرَاۤىِٕهِمْ جَهَنَّمُ ۚوَلَا يُغْنِيْ عَنْهُمْ مَّا كَسَبُوْا شَيْـًٔا وَّلَا مَا اتَّخَذُوْا مِنْ دُوْنِ اللّٰهِ اَوْلِيَاۤءَۚ وَلَهُمْ عَذَابٌ عَظِيْمٌۗ",
    "transliteration_en": "Minw waraaa'ihim Jahannamu wa laa yughnee 'anhum maa kasaboo shai'anw wa laa mat takhazoo min doonil laahi awliyaaa'a wa lahum 'azaabun 'azeem",
    "transliteration_id": "Miw warā'ihim jahannam(u), wa lā yugnī ‘anhum mā kasabū syai'aw wa lā mattakhażū min dūnillāhi auliyā'(a), wa lahum ‘ażābun ‘aẓīm(un).",
    "translation_en": "Before them is Hell, and what they had earned will not avail them at all nor what they had taken besides Allah as allies. And they will have a great punishment.",
    "translation_id": "Di hadapan mereka ada (neraka) Jahanam. Tidak akan berguna sedikit pun bagi mereka apa yang telah mereka kerjakan dan tidak (pula bermanfaat) apa yang mereka jadikan sebagai sesembahan selain Allah. Bagi mereka azab yang sangat berat."
  },
  {
    "ayat": 11,
    "arabic": "هٰذَا هُدًىۚ وَالَّذِيْنَ كَفَرُوْا بِاٰيٰتِ رَبِّهِمْ لَهُمْ عَذَابٌ مِّنْ رِّجْزٍ اَلِيْمٌ ࣖ",
    "transliteration_en": "Haazaa hudanw wal lazeena kafaroo bi aayaati Rabbihim lahum 'azaabum mir rijzin aleem",
    "transliteration_id": "Hāżā hudā(n), wal-lażīna kafarū bi'āyāti rabbihim lahum ‘ażābum mir rijzin alīm(un).",
    "translation_en": "This [Qur'an] is guidance. And those who have disbelieved in the verses of their Lord will have a painful punishment of foul nature.",
    "translation_id": "Ini (Al-Qur’an) adalah petunjuk (yang agung). Orang-orang yang mengingkari ayat-ayat Tuhannya akan mendapat azab berupa siksaan yang sangat pedih."
  },
  {
    "ayat": 12,
    "arabic": "۞ اَللّٰهُ الَّذِيْ سَخَّرَ لَكُمُ الْبَحْرَ لِتَجْرِيَ الْفُلْكُ فِيْهِ بِاَمْرِهٖ وَلِتَبْتَغُوْا مِنْ فَضْلِهٖ وَلَعَلَّكُمْ تَشْكُرُوْنَۚ",
    "transliteration_en": "Allaahul lazee sahkhara lakumul bahra litajriyal fulku feehi bi amrihee wa litabtaghoo min fadlihee wa la'allakum tashkuroon",
    "transliteration_id": "Allāhul-lażī sakhkhara  lakumul-baḥra litajriyal-fulku fīhi bi'amrihī wa litabtagū min faḍlihī wa la‘allakum tasykurūn(a).",
    "translation_en": "It is Allah who subjected to you the sea so that ships may sail upon it by His command and that you may seek of His bounty; and perhaps you will be grateful.",
    "translation_id": "Allahlah yang telah menundukkan laut untukmu agar kapal-kapal dapat berlayar di atasnya dengan perintah-Nya, agar kamu dapat mencari sebagian karunia-Nya, dan agar kamu bersyukur."
  },
  {
    "ayat": 13,
    "arabic": "وَسَخَّرَ لَكُمْ مَّا فِى السَّمٰوٰتِ وَمَا فِى الْاَرْضِ جَمِيْعًا مِّنْهُ ۗاِنَّ فِيْ ذٰلِكَ لَاٰيٰتٍ لِّقَوْمٍ يَّتَفَكَّرُوْنَ",
    "transliteration_en": "Wa sakhkhara lakum maa fis samaawaati wa maa fil ardi jamee'am minh; inna feezaalika la Aayaatil liqawminy yatafakkaroon",
    "transliteration_id": "Wa sakhkhara lakum mā fis-samāwāti wa mā fil-arḍi jamī‘am minh(u), inna fī żālika la'āyātil liqaumiy yatafakkarūn(a).",
    "translation_en": "And He has subjected to you whatever is in the heavens and whatever is on the earth - all from Him. Indeed in that are signs for a people who give thought.",
    "translation_id": "Dia telah menundukkan (pula) untukmu apa yang ada di langit dan apa yang ada di bumi semuanya (sebagai rahmat) dari-Nya. Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda (kebesaran Allah) bagi kaum yang berpikir."
  },
  {
    "ayat": 14,
    "arabic": "قُلْ لِّلَّذِيْنَ اٰمَنُوْا يَغْفِرُوْا لِلَّذِيْنَ لَا يَرْجُوْنَ اَيَّامَ اللّٰهِ لِيَجْزِيَ قَوْمًا ۢبِمَا كَانُوْا يَكْسِبُوْنَ",
    "transliteration_en": "Qul lillazeena aamanoo yaghfiroo lillazeena laa yarjoona ayyaamal laahi liyajziya qawmam bimaa kaanoo yaksiboon",
    "transliteration_id": "Qul lil-lażīna āmanū yagfirū lil-lażīna lā yarjūna ayyāmallāhi liyajziya qaumam bimā kānū yaksibūn(a).",
    "translation_en": "Say, [O Muhammad], to those who have believed that they [should] forgive those who expect not the days of Allah so that He may recompense a people for what they used to earn.",
    "translation_id": "Katakanlah (Nabi Muhammad) kepada orang-orang yang beriman, hendaklah mereka memaafkan orang-orang yang tidak mengharapkan akan hari-hari (pembalasan) Allah karena Dia akan memberi ganjaran kepada suatu kaum atas apa yang telah mereka usahakan."
  },
  {
    "ayat": 15,
    "arabic": "مَنْ عَمِلَ صَالِحًا فَلِنَفْسِهٖۚ وَمَنْ اَسَاۤءَ فَعَلَيْهَا ۖ ثُمَّ اِلٰى رَبِّكُمْ تُرْجَعُوْنَ",
    "transliteration_en": "Maa 'amila saalihan falinafsihee wa man asaaa'a fa'alaihaa summa ilaa Rabbikum turja'oon",
    "transliteration_id": "Man ‘amila ṣāliḥan fa linafsih(ī), wa man asā'a fa ‘alaihā, ṡumma ilā rabbikum turja‘ūn(a).",
    "translation_en": "Whoever does a good deed - it is for himself; and whoever does evil - it is against the self. Then to your Lord you will be returned.",
    "translation_id": "Siapa yang mengerjakan amal saleh, itu untuk dirinya sendiri dan siapa yang berbuat keburukan, itu akan menimpa dirinya sendiri. Kemudian, hanya kepada Tuhanmulah kamu dikembalikan."
  },
  {
    "ayat": 16,
    "arabic": "وَلَقَدْ اٰتَيْنَا بَنِيْٓ اِسْرَاۤءِيْلَ الْكِتٰبَ وَالْحُكْمَ وَالنُّبُوَّةَ وَرَزَقْنٰهُمْ مِّنَ الطَّيِّبٰتِ وَفَضَّلْنٰهُمْ عَلَى الْعٰلَمِيْنَ ۚ",
    "transliteration_en": "Wa laqad aatainaa Baneee Israaa'eelal Kitaaba walhukma wan Nubuwwata wa razaqnaahum minat taiyibaati wa faddalnaahum;alal 'aalameen",
    "transliteration_id": "Wa laqad ātainā banī isrā'īlal-kitāba wal-ḥukma wan-nubuwwata wa razaqnāhum minaṭ-ṭayyibāti wa faḍḍalnāhum ‘alal-‘ālamīn(a).",
    "translation_en": "And We did certainly give the Children of Israel the Scripture and judgement and prophethood, and We provided them with good things and preferred them over the worlds.",
    "translation_id": "Sungguh, Kami benar-benar telah menganugerahkan kepada Bani Israil kitab suci, hukum, dan kenabian. Kami pun telah menganugerahkan kepada mereka rezeki yang baik dan Kami lebihkan mereka atas semua umat yang lain di alam ini (pada masa itu)."
  },
  {
    "ayat": 17,
    "arabic": "وَاٰتَيْنٰهُمْ بَيِّنٰتٍ مِّنَ الْاَمْرِۚ فَمَا اخْتَلَفُوْٓا اِلَّا مِنْۢ بَعْدِ مَا جَاۤءَهُمُ الْعِلْمُ بَغْيًاۢ بَيْنَهُمْ ۗاِنَّ رَبَّكَ يَقْضِيْ بَيْنَهُمْ يَوْمَ الْقِيٰمَةِ فِيْمَا كَانُوْا فِيْهِ يَخْتَلِفُوْنَ",
    "transliteration_en": "Wa aatainaahum baiyinaatim minal amri famakh talafooo illaa mim ba'di maa jaaa'ahumul 'ilmu baghyam bainahum; inna Rabbaka yaqdee bainahum Yawmal Qiyaamati feemaa kaanoo feehi yakhtalifoon",
    "transliteration_id": "Wa ātaināhum bayyinātim minal-amr(i), fa makhtalafū illā mim ba‘di mā jā'ahumul-‘ilmu bagyam bainahum, inna rabbaka yaqḍī bainahum yaumal-qiyāmati fīmā kānū fīhi yakhtalifūn(a).",
    "translation_en": "And We gave them clear proofs of the matter [of religion]. And they did not differ except after knowledge had come to them - out of jealous animosity between themselves. Indeed, your Lord will judge between them on the Day of Resurrection concerning that over which they used to differ.",
    "translation_id": "Kami telah menganugerahkan pula kepada mereka keterangan-keterangan yang jelas tentang urusan (agama). Maka, mereka tidak berselisih, kecuali setelah datang ilmu kepada mereka karena kedengkian di antara mereka. Sesungguhnya Tuhanmu akan memutuskan di antara mereka pada hari Kiamat apa yang selalu mereka perselisihkan."
  },
  {
    "ayat": 18,
    "arabic": "ثُمَّ جَعَلْنٰكَ عَلٰى شَرِيْعَةٍ مِّنَ الْاَمْرِ فَاتَّبِعْهَا وَلَا تَتَّبِعْ اَهْوَاۤءَ الَّذِيْنَ لَا يَعْلَمُوْنَ",
    "transliteration_en": "Summa ja'alnaaka 'alaa sharee'atim minal amri fattabi'haa wa laa tattabi'ahwaaa'al-lazeena laa ya'lamoon",
    "transliteration_id": "Ṡumma ja‘alnāka ‘alā syarī‘atim minal-amri fattabi‘hā wa lā tattabi‘ ahwā'al-lażīna lā ya‘lamūn(a).",
    "translation_en": "Then We put you, [O Muhammad], on an ordained way concerning the matter [of religion]; so follow it and do not follow the inclinations of those who do not know.",
    "translation_id": "Kemudian, Kami jadikan engkau (Nabi Muhammad) mengikuti syariat dari urusan (agama) itu. Maka, ikutilah ia (syariat itu) dan janganlah engkau ikuti hawa nafsu orang-orang yang tidak mengetahui."
  },
  {
    "ayat": 19,
    "arabic": "اِنَّهُمْ لَنْ يُّغْنُوْا عَنْكَ مِنَ اللّٰهِ شَيْـًٔا  ۗوَاِنَّ الظّٰلِمِيْنَ بَعْضُهُمْ اَوْلِيَاۤءُ بَعْضٍۚ وَاللّٰهُ وَلِيُّ الْمُتَّقِيْنَ",
    "transliteration_en": "Innahum lany yughnoo 'anka minal laahi shai'aa; wa innaz zaalimeena ba'duhum awliyaaa'u ba'dinw wallaahu waliyyul muttaqeen",
    "transliteration_id": "Innahum lay yugnū ‘anka minallāhi syai'ā(n), wa innaẓ-ẓālimīna ba‘ḍuhum auliyā'u ba‘ḍ(in), wallāhu waliyyul-muttaqīn(a).",
    "translation_en": "Indeed, they will never avail you against Allah at all. And indeed, the wrongdoers are allies of one another; but Allah is the protector of the righteous.",
    "translation_id": "Sesungguhnya mereka sekali-kali tidak akan dapat menghindarkan engkau sedikit pun dari (azab) Allah. Sesungguhnya orang-orang zalim itu sebagian mereka menjadi pelindung bagi sebagian yang lain. Adapun Allah adalah pelindung orang-orang bertakwa."
  },
  {
    "ayat": 20,
    "arabic": "هٰذَا بَصَاۤىِٕرُ لِلنَّاسِ وَهُدًى وَّرَحْمَةٌ لِّقَوْمٍ يُّوْقِنُوْنَ",
    "transliteration_en": "Haazaa basaaa'iru linnaasi wa hudanw wa rahmatul liqawminy yooqinoon",
    "transliteration_id": "Hāżā baṣā'iru lin-nāsi wa hudaw wa raḥmatul liqaumiy yūqinūn(a).",
    "translation_en": "This [Qur'an] is enlightenment for mankind and guidance and mercy for a people who are certain [in faith].",
    "translation_id": "Ini (Al-Qur’an) adalah pedoman bagi manusia, petunjuk, dan rahmat bagi kaum yang meyakini(-nya)."
  },
  {
    "ayat": 21,
    "arabic": "اَمْ حَسِبَ الَّذِيْنَ اجْتَرَحُوا السَّيِّاٰتِ اَنْ نَّجْعَلَهُمْ كَالَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ سَوَاۤءً مَّحْيَاهُمْ وَمَمَاتُهُمْ ۗسَاۤءَ مَا يَحْكُمُوْنَ ࣖࣖ",
    "transliteration_en": "Am hasibal lazeenaj tarahus saiyiaati an naj'alahum kallazeena aamanoo wa 'amilu saalihaati sawaaa'am mahyaahum wa mamaatuhum; saaa'a maa yahkumoon",
    "transliteration_id": "Am ḥasibal-lażīnajtaraḥus -sayyi'āti an naj‘alahum kal-lażīna āmanū wa ‘amiluṣ-ṣāliḥāti sawā'am maḥyāhum wa mamātuhum, sā'a mā yaḥkumūn(a).",
    "translation_en": "Or do those who commit evils think We will make them like those who have believed and done righteous deeds - [make them] equal in their life and their death? Evil is that which they judge.",
    "translation_id": "Apakah orang-orang yang melakukan keburukan itu mengira bahwa Kami akan menjadikan mereka seperti orang-orang yang beriman dan mengerjakan amal saleh, yaitu sama kehidupan dan kematian mereka? Alangkah buruknya apa yang mereka tetapkan itu."
  },
  {
    "ayat": 22,
    "arabic": "وَخَلَقَ اللّٰهُ السَّمٰوٰتِ وَالْاَرْضَ بِالْحَقِّ وَلِتُجْزٰى كُلُّ نَفْسٍۢ بِمَا كَسَبَتْ وَهُمْ لَا يُظْلَمُوْنَ",
    "transliteration_en": "Wa khalaqal laahus samaawaati wal arda bilhaqqi wa litujzaa kullu nafsim bimaa kasabat wa hum laa yuzlamoon",
    "transliteration_id": "Wa khalaqallāhus-samāwāti wal-arḍa bil-ḥaqqi wa litujzā kullu nafsim bimā kasabat wa hum lā yuẓlamūn(a).",
    "translation_en": "And Allah created the heavens and earth in truth and so that every soul may be recompensed for what it has earned, and they will not be wronged.",
    "translation_id": "Allah menciptakan langit dan bumi dengan hak dan agar setiap jiwa diberi balasan (setimpal) dengan apa yang diusahakan serta mereka tidak akan dizalimi."
  },
  {
    "ayat": 23,
    "arabic": "اَفَرَءَيْتَ مَنِ اتَّخَذَ اِلٰهَهٗ هَوٰىهُ وَاَضَلَّهُ اللّٰهُ عَلٰى عِلْمٍ وَّخَتَمَ عَلٰى سَمْعِهٖ وَقَلْبِهٖ وَجَعَلَ عَلٰى بَصَرِهٖ غِشٰوَةًۗ فَمَنْ يَّهْدِيْهِ مِنْۢ بَعْدِ اللّٰهِ ۗ اَفَلَا تَذَكَّرُوْنَ",
    "transliteration_en": "Afara'ayta manit takhaza ilaahahoo hawaahu wa adal lahul laahu 'alaa 'ilminw wa khatama 'alaa sam'ihee wa qalbihee wa ja'ala 'alaa basarihee ghishaawatan famany yahdeehi mim ba'dil laah; afalaa tazakkaroon",
    "transliteration_id": "Afa ra'aita manittakhaża ilāhahū hawāhu wa aḍallahullāhu ‘alā ‘ilmiw wa khatama ‘alā sam‘ihī wa qalbihī wa ja‘ala ‘alā baṣarihī gisyāwah(tan), famay yahdīhi mim ba‘dillāh(i), afalā tażakkarūn(a).",
    "translation_en": "Have you seen he who has taken as his god his [own] desire, and Allah has sent him astray due to knowledge and has set a seal upon his hearing and his heart and put over his vision a veil? So who will guide him after Allah? Then will you not be reminded?",
    "translation_id": "Tahukah kamu (Nabi Muhammad), orang yang menjadikan hawa nafsunya sebagai Tuhannya dan dibiarkan sesat oleh Allah dengan pengetahuan-Nya, Allah telah mengunci pendengaran dan hatinya serta meletakkan tutup atas penglihatannya, siapakah yang mampu memberinya petunjuk setelah Allah (membiarkannya sesat)? Apakah kamu (wahai manusia) tidak mengambil pelajaran?"
  },
  {
    "ayat": 24,
    "arabic": "وَقَالُوْا مَا هِيَ اِلَّا حَيَاتُنَا الدُّنْيَا نَمُوْتُ وَنَحْيَا وَمَا يُهْلِكُنَآ اِلَّا الدَّهْرُۚ وَمَا لَهُمْ بِذٰلِكَ مِنْ عِلْمٍۚ اِنْ هُمْ اِلَّا يَظُنُّوْنَ",
    "transliteration_en": "Wa qaaloo maa hiya illaa hayaatunad dunyaa namootu wa nahyaa wa maa yuhlikunaaa illad dahr; wa maa lahum bizaalika min 'ilmin in hum illaayazunnoon",
    "transliteration_id": "Wa qālū mā hiya illā ḥayātunad-dun-yā namūtu wa naḥyā wa mā yuhlikunā illad-dahr(u), wa mā lahum biżālika min ‘ilmin in hum illā yaẓunnūn(a).",
    "translation_en": "And they say, \"There is not but our worldly life; we die and live, and nothing destroys us except time.\" And they have of that no knowledge; they are only assuming.",
    "translation_id": "Mereka berkata, “Kehidupan ini tidak lain hanyalah kehidupan di dunia saja, kita mati dan kita hidup, dan tidak ada yang membinasakan kita selain masa.” Padahal, mereka tidak mempunyai ilmu (sama sekali) tentang itu. Mereka hanyalah menduga-duga."
  },
  {
    "ayat": 25,
    "arabic": "وَاِذَا تُتْلٰى عَلَيْهِمْ اٰيٰتُنَا بَيِّنٰتٍ مَّا كَانَ حُجَّتَهُمْ اِلَّآ اَنْ قَالُوا ائْتُوْا بِاٰبَاۤىِٕنَآ اِنْ كُنْتُمْ صٰدِقِيْنَ",
    "transliteration_en": "Wa izaa tutlaa 'alaihim aayaatuna baiyinaatim maa kaana hujjatahum illaaa an qaalu'too bi aabaaa'inaaa in kuntum saadiqeen",
    "transliteration_id": "Wa iżā tutlā ‘alaihim āyātunā bayyinātim mā kāna ḥujjatahum illā an qālu'tū bi'ābā'inā in kuntum ṣādiqīn(a).",
    "translation_en": "And when Our verses are recited to them as clear evidences, their argument is only that they say, \"Bring [back] our forefathers, if you should be truthful.\"",
    "translation_id": "Apabila dibacakan kepada mereka ayat-ayat Kami yang jelas, tidak ada bantahan mereka, kecuali mengatakan, “Hidupkanlah kembali nenek moyang kami jika kamu adalah orang-orang benar.”"
  },
  {
    "ayat": 26,
    "arabic": "قُلِ اللّٰهُ يُحْيِيْكُمْ ثُمَّ يُمِيْتُكُمْ ثُمَّ يَجْمَعُكُمْ اِلٰى يَوْمِ الْقِيٰمَةِ لَارَيْبَ فِيْهِ وَلٰكِنَّ اَكْثَرَ النَّاسِ لَا يَعْلَمُوْنَ ࣖ",
    "transliteration_en": "Qulil laahu yuhyeekum summa yumeetukum summa yajma'ukum ilaa Yawmil Qiyaamati laa raiba feehi wa laakinna aksaran naasi laa ya'lamoon",
    "transliteration_id": "Qulillāhu yuḥyīkum ṡumma yumītukum ṡumma yajma‘ukum ilā yaumil-qiyāmati lā raiba fīhi wa lākinna akṡaran-nāsi lā ya‘lamūn(a).",
    "translation_en": "Say, \"Allah causes you to live, then causes you to die; then He will assemble you for the Day of Resurrection, about which there is no doubt, but most of the people do not know.\"",
    "translation_id": "Katakanlah, “Allah menghidupkan kamu lalu mematikan kamu kemudian mengumpulkan kamu pada hari Kiamat yang tidak ada keraguan tentangnya, tetapi kebanyakan manusia tidak mengetahui.”"
  },
  {
    "ayat": 27,
    "arabic": "وَلِلّٰهِ مُلْكُ السَّمٰوٰتِ وَالْاَرْضِۗ وَيَوْمَ تَقُوْمُ السَّاعَةُ يَوْمَىِٕذٍ يَّخْسَرُ الْمُبْطِلُوْنَ",
    "transliteration_en": "Wa lillaahi mulkus samaawaati wal ard; wa Yawma taqoomus Saa'atu Yawma 'iziny yakhsarul mubtiloon",
    "transliteration_id": "Wa lillāhi mulkus-samāwāti wal-arḍ(i), wa yauma taqūmus-sā‘atu yauma'iżiy yakhsarul-mubṭilūn(a).",
    "translation_en": "And to Allah belongs the dominion of the heavens and the earth. And the Day the Hour appears - that Day the falsifiers will lose.",
    "translation_id": "Milik Allahlah kerajaan langit dan bumi. Pada hari terjadinya kiamat rugilah pada hari itu orang-orang yang mengerjakan kebatilan."
  },
  {
    "ayat": 28,
    "arabic": "وَتَرٰى كُلَّ اُمَّةٍ جَاثِيَةً ۗ كُلُّ اُمَّةٍ تُدْعٰٓى اِلٰى كِتٰبِهَاۗ  اَلْيَوْمَ تُجْزَوْنَ مَا كُنْتُمْ تَعْمَلُوْنَ",
    "transliteration_en": "Wa taraa kulla ummatin jaasiyah; kullu ummatin tud'aaa ilaa kitaabihaa al Yawma tujzawna maa kuntum ta'maloon",
    "transliteration_id": "Wa tarā kulla ummatin jāṡiyah(tan), kullu ummatin tud‘ā ilā kitābihā, al-yauma tujzauna mā kuntum ta‘malūn(a).",
    "translation_en": "And you will see every nation kneeling [from fear]. Every nation will be called to its record [and told], \"Today you will be recompensed for what you used to do.",
    "translation_id": "(Pada hari itu) engkau akan melihat setiap umat berlutut. Setiap umat dipanggil untuk (melihat) buku (catatan amal)-nya. Pada hari itu kamu diberi balasan atas apa yang telah kamu kerjakan."
  },
  {
    "ayat": 29,
    "arabic": "هٰذَا كِتٰبُنَا يَنْطِقُ عَلَيْكُمْ بِالْحَقِّ ۗاِنَّا كُنَّا نَسْتَنْسِخُ مَا كُنْتُمْ تَعْمَلُوْنَ",
    "transliteration_en": "Haazaa kitaabunaa yantiqu 'alaikum bilhaqq; innaa kunnaa nastansikhu maa kuntum ta'maloon",
    "transliteration_id": "Hāżā kitābunā yanṭiqu ‘alaikum bil-ḥaqq(i), innā kunnā nastansikhu mā kuntum ta‘malūn(a).",
    "translation_en": "This, Our record, speaks about you in truth. Indeed, We were having transcribed whatever you used to do.\"",
    "translation_id": "(Allah berfirman,) “Inilah Kitab (catatan) Kami yang menuturkan kepadamu dengan hak. Sesungguhnya Kami telah menyuruh mencatat apa yang telah kamu kerjakan.”"
  },
  {
    "ayat": 30,
    "arabic": "فَاَمَّا الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ فَيُدْخِلُهُمْ رَبُّهُمْ  فِيْ رَحْمَتِهٖۗ ذٰلِكَ هُوَ الْفَوْزُ الْمُبِيْنُ",
    "transliteration_en": "Fa ammal lazeena aamaanoo wa 'amilus saalihaati fayudkhiluhum Rabbuhum fee rahmatih; zaalika huwal fawzul mubeen",
    "transliteration_id": "Fa'ammal-lażīna āmanū wa ‘amiluṣ-ṣāliḥāti fayudkhiluhum rabbuhum fī raḥmatih(ī), żālika huwal-fauzul-mubīn(u).",
    "translation_en": "So as for those who believed and did righteous deeds, their Lord will admit them into His mercy. That is what is the clear attainment.",
    "translation_id": "Adapun orang-orang yang beriman dan beramal saleh, Tuhan akan memasukkan mereka ke dalam rahmat-Nya (surga). Itulah kemenangan yang nyata."
  },
  {
    "ayat": 31,
    "arabic": "وَاَمَّا الَّذِيْنَ كَفَرُوْاۗ  اَفَلَمْ تَكُنْ اٰيٰتِيْ تُتْلٰى عَلَيْكُمْ فَاسْتَكْبَرْتُمْ وَكُنْتُمْ قَوْمًا مُّجْرِمِيْنَ",
    "transliteration_en": "Wa ammal lazeena kafarooo afalam takun Aayaatee tutlaa 'alaikum fastakbartum wa kuntum qawmam mujrimeen",
    "transliteration_id": "Wa ammal-lażīna kafarū, falam takun āyātī tutlā ‘alaikum fastakbartum wa kuntum qaumam mujrimīn(a).",
    "translation_en": "But as for those who disbelieved, [it will be said], \"Were not Our verses recited to you, but you were arrogant and became a people of criminals?",
    "translation_id": "Adapun orang-orang yang kufur (dikatakan kepada mereka,) “Bukankah ayat-ayat-Ku telah dibacakan kepadamu, lalu kamu menyombongkan diri dan menjadi kaum pendurhaka?”"
  },
  {
    "ayat": 32,
    "arabic": "وَاِذَا قِيْلَ اِنَّ وَعْدَ اللّٰهِ حَقٌّ وَّالسَّاعَةُ لَا رَيْبَ فِيْهَا قُلْتُمْ مَّا نَدْرِيْ مَا السَّاعَةُۙ اِنْ نَّظُنُّ اِلَّا ظَنًّا وَّمَا نَحْنُ بِمُسْتَيْقِنِيْنَ",
    "transliteration_en": "Wa izaa qeela inna wa'dallaahi haqqunw was Saa'atu laa raiba feehaa qultum maa nadree mas Saa'atu in nazunnu illaa zannanw wa maa nahnu bimustaiqineen",
    "transliteration_id": "Wa iżā qīla inna wa‘dallāhi ḥaqquw was-sā‘atu lā raiba fīhā qultum mā nadrī mas-sā‘ah(tu), in naẓunnu illā ẓannaw wa mā naḥnu bimustaiqinīn(a).",
    "translation_en": "And when it was said, 'Indeed, the promise of Allah is truth and the Hour [is coming] - no doubt about it,' you said, 'We know not what is the Hour. We assume only assumption, and we are not convinced.' \"",
    "translation_id": "Apabila dikatakan (kepadamu), “Sesungguhnya janji Allah itu hak dan hari Kiamat itu tidak ada keraguan tentangnya,” kamu menjawab, “Kami tidak tahu apakah hari Kiamat itu, kami hanyalah menduga-duga, dan kami tidak berupaya meyakininya.”"
  },
  {
    "ayat": 33,
    "arabic": "وَبَدَا لَهُمْ سَيِّاٰتُ مَا عَمِلُوْا وَحَاقَ بِهِمْ مَّا كَانُوْا بِهٖ يَسْتَهْزِءُوْنَ",
    "transliteration_en": "Wa badaa lahum saiyiaatu maa 'amiloo wa haaqa bihim maa kaanoo bihee yastahzi'oon",
    "transliteration_id": "Wa badā lahum sayyi'ātu mā ‘amilū wa ḥāqa bihim mā kānū bihī yastahzi'ūn(a).",
    "translation_en": "And the evil consequences of what they did will appear to them, and they will be enveloped by what they used to ridicule.",
    "translation_id": "Tampak nyatalah kepada mereka keburukan-keburukan apa yang mereka kerjakan dan berlakulah terhadap mereka apa (azab) yang dahulu selalu mereka perolok-olokkan."
  },
  {
    "ayat": 34,
    "arabic": "وَقِيْلَ الْيَوْمَ نَنْسٰىكُمْ كَمَا نَسِيْتُمْ لِقَاۤءَ يَوْمِكُمْ هٰذَاۙ وَمَأْوٰىكُمُ النَّارُ وَمَا لَكُمْ مِّنْ نّٰصِرِيْنَ",
    "transliteration_en": "Wa qeelal yawma nansaakum kamaa naseetum liqaaa'a yawmikum haazaa wa maawaakumun Naaru wa maa lakum min naasireen",
    "transliteration_id": "Wa qīlal-yauma nansākum kamā nasītum liqā'a yaumikum hāżā, wa ma'wākumun nāru wa mā lakum min nāṣirīn(a).",
    "translation_en": "And it will be said, \"Today We will forget you as you forgot the meeting of this Day of yours, and your refuge is the Fire, and for you there are no helpers.",
    "translation_id": "(Kepada mereka) dikatakan, “Pada hari ini Kami melupakan kamu sebagaimana kamu telah melupakan pertemuan (dengan) harimu ini. Tempat kembalimu hanyalah neraka dan sama sekali tidak ada penolong bagimu."
  },
  {
    "ayat": 35,
    "arabic": "ذٰلِكُمْ بِاَنَّكُمُ اتَّخَذْتُمْ اٰيٰتِ اللّٰهِ هُزُوًا وَّغَرَّتْكُمُ الْحَيٰوةُ الدُّنْيَا ۚفَالْيَوْمَ لَا يُخْرَجُوْنَ مِنْهَا وَلَا هُمْ يُسْتَعْتَبُوْنَ",
    "transliteration_en": "Zaalikum bi annakumut takhaztum aayaatil laahi huzuwanw wa gharratkumul hayaatud dunyaa; fal yawma laa yukhrajoona minhaa wa laahum yusta'taboon",
    "transliteration_id": "Żālikum bi'annakumuttakhażtum āyātillāhi huzuwaw wa garratkumul-ḥayātud-dun-yā, fal-yauma lā yukhrajūna minhā wa lā hum yusta‘tabūn(a).",
    "translation_en": "That is because you took the verses of Allah in ridicule, and worldly life deluded you.\" So that Day they will not be removed from it, nor will they be asked to appease [Allah].",
    "translation_id": "Yang demikian itu (terjadi) karena sesungguhnya kamu telah menjadikan ayat-ayat Allah sebagai (bahan) olok-olok dan kamu telah diperdaya oleh kehidupan dunia.” Maka, pada hari ini mereka tidak dikeluarkan darinya (neraka) dan tidak pula mereka diberi kesempatan untuk bertobat."
  },
  {
    "ayat": 36,
    "arabic": "فَلِلّٰهِ الْحَمْدُ رَبِّ السَّمٰوٰتِ وَرَبِّ الْاَرْضِ رَبِّ الْعٰلَمِيْنَ",
    "transliteration_en": "Falillaahil hamdu Rabbis samaawaati wa Rabbil ardi Rabbil-'aalameen",
    "transliteration_id": "Fa lillāhil-ḥamdu rabbis-samāwāti wa rabbil-arḍi rabbil-‘ālamīn(a).",
    "translation_en": "Then, to Allah belongs [all] praise - Lord of the heavens and Lord of the earth, Lord of the worlds.",
    "translation_id": "Maka, segala puji hanya bagi Allah, Tuhan langit dan Tuhan bumi, Tuhan semesta alam."
  },
  {
    "ayat": 37,
    "arabic": "وَلَهُ الْكِبْرِيَاۤءُ فِى السَّمٰوٰتِ وَالْاَرْضِ ۗوَهُوَ الْعَزِيْزُ الْحَكِيْمُ ࣖ   ۔",
    "transliteration_en": "Wa lahul kibriyaaa'u fissamaawaati wal ardi wa Huwal 'Azeezul Hakeem",
    "transliteration_id": "Wa lahul-kibriyā'u fis-samāwāti wal-arḍ(i), wa huwal-‘azīzul-ḥakīm(u).",
    "translation_en": "And to Him belongs [all] grandeur within the heavens and the earth, and He is the Exalted in Might, the Wise.",
    "translation_id": "Hanya bagi-Nya segala kebesaran di langit dan bumi. Dialah Yang Maha Perkasa lagi Maha Bijaksana."
  }
]