[
  {
    "ayat": 1,
    "arabic": "سُبْحٰنَ الَّذِيْٓ اَسْرٰى بِعَبْدِهٖ لَيْلًا مِّنَ الْمَسْجِدِ الْحَرَامِ اِلَى الْمَسْجِدِ الْاَقْصَا الَّذِيْ بٰرَكْنَا حَوْلَهٗ لِنُرِيَهٗ مِنْ اٰيٰتِنَاۗ اِنَّهٗ هُوَ السَّمِيْعُ الْبَصِيْرُ",
    "transliteration_en": "Subhaanal lazeee asraa bi'abdihee lailam minal Masjidil Haraami ilal Masjidil Aqsal-lazee baaraknaa haw lahoo linuriyahoo min aayaatinaa;innahoo Huwas Samee'ul-Baseer",
    "transliteration_id": "Subḥānal-lażī asrā bi‘abdihī lailam minal-masjidil ḥarāmi ilal-masjidil-aqṣal-lażī bāraknā ḥaulahū linuriyahū min āyātinā, innahū huwas-samī‘ul-baṣīr(u).",
    "translation_en": "Exalted is He who took His Servant by night from al-Masjid al-Haram to al-Masjid al-Aqsa, whose surroundings We have blessed, to show him of Our signs. Indeed, He is the Hearing, the Seeing.",
    "translation_id": "Maha Suci (Allah) yang telah memperjalankan hamba-Nya (Nabi Muhammad) pada malam hari dari Masjidilharam ke Masjidilaqsa yang telah Kami berkahi sekelilingnya agar Kami perlihatkan kepadanya sebagian tanda-tanda (kebesaran) Kami. Sesungguhnya Dia Maha Mendengar lagi Maha Melihat."
  },
  {
    "ayat": 2,
    "arabic": "وَاٰتَيْنَا مُوْسَى الْكِتٰبَ وَجَعَلْنٰهُ هُدًى لِّبَنِيْٓ اِسْرَاۤءِيْلَ اَلَّا تَتَّخِذُوْا مِنْ دُوْنِيْ وَكِيْلًاۗ",
    "transliteration_en": "Wa aatainaa Moosal-Kitaaba wa ja'alnaahu hudal-liBaneee Israaa'eel;",
    "transliteration_id": "Wa ātainā mūsal-kitāba wa ja‘alnāhu hudal libanī isrā'īla allā tattakhiżū min dūnī wakīlā(n).",
    "translation_en": "And We gave Moses the Scripture and made it a guidance for the Children of Israel that you not take other than Me as Disposer of affairs,",
    "translation_id": "Kami memberi Musa Kitab (Taurat) dan menjadikannya sebagai petunjuk bagi Bani Israil (dengan firman), “Janganlah kamu mengambil pelindung selain Aku."
  },
  {
    "ayat": 3,
    "arabic": "ذُرِّيَّةَ مَنْ حَمَلْنَا مَعَ نُوْحٍۗ اِنَّهٗ كَانَ عَبْدًا شَكُوْرًا",
    "transliteration_en": "Zurriyyata man hamalnaa ma'a Nooh innahoo kaana 'abdan shakooraa",
    "transliteration_id": "Żurriyyata man ḥamalnā ma‘a nūḥ(in), innahū kāna ‘abdan syakūrā(n).",
    "translation_en": "O descendants of those We carried [in the ship] with Noah. Indeed, he was a grateful servant.",
    "translation_id": "(Wahai) keturunan orang yang Kami bawa bersama Nuh, sesungguhnya dia (Nuh) adalah hamba (Allah) yang banyak bersyukur.”"
  },
  {
    "ayat": 4,
    "arabic": "وَقَضَيْنَآ اِلٰى بَنِيْٓ اِسْرَاۤءِيْلَ فِى الْكِتٰبِ لَتُفْسِدُنَّ فِى الْاَرْضِ مَرَّتَيْنِ وَلَتَعْلُنَّ عُلُوًّا كَبِيْرًا",
    "transliteration_en": "Wa qadainaaa ilaa Baneee Israaa'eela fil Kitaabi latufsidunna fil ardi marratain; wa lata'lunna'uluwwan kabeeraa",
    "transliteration_id": "Wa qaḍainā ilā banī isrā'īla fil-kitābi latufsidunna fil-arḍi marrataini wa lata‘lunna ‘uluwwan kabīrā(n).",
    "translation_en": "And We conveyed to the Children of Israel in the Scripture that, \"You will surely cause corruption on the earth twice, and you will surely reach [a degree of] great haughtiness.",
    "translation_id": "Kami wahyukan kepada Bani Israil di dalam Kitab (Taurat) itu, “Kamu benar-benar akan berbuat kerusakan di bumi ini dua kali dan benar-benar akan menyombongkan diri dengan kesombongan yang besar.”"
  },
  {
    "ayat": 5,
    "arabic": "فَاِذَا جَاۤءَ وَعْدُ اُوْلٰىهُمَا بَعَثْنَا عَلَيْكُمْ عِبَادًا لَّنَآ اُولِيْ بَأْسٍ شَدِيْدٍ فَجَاسُوْا خِلٰلَ الدِّيَارِۗ وَكَانَ وَعْدًا مَّفْعُوْلًا",
    "transliteration_en": "Fa-izaa jaaa'a wa'duoolaahumaa ba'asnaaa 'alykurr 'ibaadai-lanaaa ulee baasin shadeedin fajaasoo khilaalad diyaar; wa kaana wa'dam maf'oolaa",
    "transliteration_id": "Fa iżā jā'a wa‘du ūlāhumā ba‘aṡnā ‘alaikum ‘ibādal lanā ulī ba'sin syadīdin fa jāsū khilālad-diyār(i), wa kāna wa‘dam maf‘ūlā(n).",
    "translation_en": "So when the [time of] promise came for the first of them, We sent against you servants of Ours - those of great military might, and they probed [even] into the homes, and it was a promise fulfilled.",
    "translation_id": "Apabila datang saat (kerusakan) yang pertama dari keduanya, Kami datangkan kepadamu hamba-hamba Kami yang perkasa, lalu mereka merajalela di kampung-kampung. Itulah janji yang pasti terlaksana."
  },
  {
    "ayat": 6,
    "arabic": "ثُمَّ رَدَدْنَا لَكُمُ الْكَرَّةَ عَلَيْهِمْ وَاَمْدَدْنٰكُمْ بِاَمْوَالٍ وَّبَنِيْنَ وَجَعَلْنٰكُمْ اَكْثَرَ نَفِيْرًا",
    "transliteration_en": "Summa radadnaa lakumul karrata 'alaihim wa amdad-naakum-bi amwaalinuw wa baneen; wa ja'alnaakum aksara nafeeraa",
    "transliteration_id": "Ṡumma radadnā lakumul-karrata ‘alaihim wa amdadnākum bi'amwāliw wa banīna wa ja‘alnākum akṡara nafīrā(n).",
    "translation_en": "Then We gave back to you a return victory over them. And We reinforced you with wealth and sons and made you more numerous in manpower",
    "translation_id": "Kemudian, Kami memberikan kepadamu giliran untuk mengalahkan mereka, membantumu dengan harta kekayaan dan anak-anak, dan menjadikanmu kelompok yang lebih besar."
  },
  {
    "ayat": 7,
    "arabic": "اِنْ اَحْسَنْتُمْ اَحْسَنْتُمْ لِاَنْفُسِكُمْ ۗوَاِنْ اَسَأْتُمْ فَلَهَاۗ فَاِذَا جَاۤءَ وَعْدُ الْاٰخِرَةِ لِيَسٗۤـُٔوْا وُجُوْهَكُمْ وَلِيَدْخُلُوا الْمَسْجِدَ كَمَا دَخَلُوْهُ اَوَّلَ مَرَّةٍ وَّلِيُتَبِّرُوْا مَا عَلَوْا تَتْبِيْرًا",
    "transliteration_en": "In ahsantum ahsantum li anfusikum wa in asaatum falahaa; fa izaa jaaa'a wa'dul aakhirati liyasooo'oo wujoo hakum wa liyadkhulul masjida kamaa dakhaloohu awwala marratinw wa liyutabbiroo mass'alaw tatbeera",
    "transliteration_id": "In aḥsantum aḥsantum li'anfusikum, wa in asa'tum fa lahā, fa iżā jā'a wa‘dul-ākhirati liyasū'ū wujūhakum wa liyadkhulal-masjida kamā dakhalūhu awwala marratiw wa liyutabbirū mā ‘alau tatbīrā(n).",
    "translation_en": "[And said], \"If you do good, you do good for yourselves; and if you do evil, [you do it] to yourselves.\" Then when the final promise came, [We sent your enemies] to sadden your faces and to enter the temple in Jerusalem, as they entered it the first time, and to destroy what they had taken over with [total] destruction.",
    "translation_id": "Jika berbuat baik, (berarti) kamu telah berbuat baik untuk dirimu sendiri. Jika kamu berbuat jahat, (kerugian dari kejahatan) itu kembali kepada dirimu sendiri. Apabila datang saat (kerusakan) yang kedua, (Kami bangkitkan musuhmu) untuk menyuramkan wajahmu, untuk memasuki masjid (Baitulmaqdis) sebagaimana memasukinya ketika pertama kali, dan untuk membinasakan apa saja yang mereka kuasai."
  },
  {
    "ayat": 8,
    "arabic": "عَسٰى رَبُّكُمْ اَنْ يَّرْحَمَكُمْۚ وَاِنْ عُدْتُّمْ عُدْنَاۘ وَجَعَلْنَا جَهَنَّمَ لِلْكٰفِرِيْنَ حَصِيْرًا",
    "transliteration_en": "'Asaa rabbukum anyyarhamakum; wa in 'uttum 'udnaa; wa ja'alnaa jahannama lilkaafireena haseera",
    "transliteration_id": "‘Asā rabbukum ay yarḥamakum, wa in ‘uttum ‘udnā, wa ja‘alnā jahannama lil-kāfirīna ḥaṣīrā(n).",
    "translation_en": "[Then Allah said], \"It is expected, [if you repent], that your Lord will have mercy upon you. But if you return [to sin], We will return [to punishment]. And We have made Hell, for the disbelievers, a prison-bed.\"",
    "translation_id": "Mudah-mudahan Tuhanmu melimpahkan rahmat kepadamu. Akan tetapi, jika kamu kembali (melakukan kejahatan), niscaya Kami kembali (mengazabmu). Kami jadikan (neraka) Jahanam sebagai penjara bagi orang-orang kafir."
  },
  {
    "ayat": 9,
    "arabic": "اِنَّ هٰذَا الْقُرْاٰنَ يَهْدِيْ لِلَّتِيْ هِيَ اَقْوَمُ وَيُبَشِّرُ الْمُؤْمِنِيْنَ الَّذِيْنَ يَعْمَلُوْنَ الصّٰلِحٰتِ اَنَّ لَهُمْ اَجْرًا كَبِيْرًاۙ",
    "transliteration_en": "Inna haazal Quraana yahdee lillatee hiya aqwamu wa yubashshirul mu'mineenal lazeena ya'maloonas saalihaati anna lahum ajran kabeeraa",
    "transliteration_id": "Inna hāżal-qur'āna yahdī lil-latī hiya aqwamu wa yubasysyirul-mu'minīnal-lażīna ya‘malūnaṣ-ṣāliḥāti anna lahum ajran kabīrā(n).",
    "translation_en": "Indeed, this Qur'an guides to that which is most suitable and gives good tidings to the believers who do righteous deeds that they will have a great reward.",
    "translation_id": "Sesungguhnya Al-Qur’an ini memberi petunjuk ke (jalan) yang paling lurus dan memberi kabar gembira kepada orang-orang mukmin yang mengerjakan kebajikan bahwa bagi mereka ada pahala yang sangat besar"
  },
  {
    "ayat": 10,
    "arabic": "وَّاَنَّ الَّذِيْنَ لَا يُؤْمِنُوْنَ بِالْاٰخِرَةِ اَعْتَدْنَا لَهُمْ عَذَابًا اَلِيْمًا ࣖ",
    "transliteration_en": "Wa annal lazeena laa yu'minoona bil aakhirati a'tadnaa lahum 'azaaban aleemaa",
    "transliteration_id": "Wa annal-lażīna lā yu'minūna bil-ākhirati a‘tadnā lahum ‘ażāban alīmā(n).",
    "translation_en": "And that those who do not believe in the Hereafter - We have prepared for them a painful punishment.",
    "translation_id": "dan sesungguhnya bagi orang-orang yang tidak beriman pada akhirat telah Kami sediakan bagi mereka azab yang sangat pedih."
  },
  {
    "ayat": 11,
    "arabic": "وَيَدْعُ الْاِنْسَانُ بِالشَّرِّ دُعَاۤءَهٗ بِالْخَيْرِۗ وَكَانَ الْاِنْسَانُ عَجُوْلًا",
    "transliteration_en": "Wa yad'ul insaanu bishsharri du'aaa 'ahoo bilkhayr; wa kaanal insaanu 'ajoola",
    "transliteration_id": "Wa yad‘ul-insānu bisy-syarri du‘ā'ahū bil-khair(i), wa kānal-insānu ‘ajūlā(n).",
    "translation_en": "And man supplicates for evil as he supplicates for good, and man is ever hasty.",
    "translation_id": "Manusia (seringkali) berdoa untuk (mendapatkan) keburukan sebagaimana (biasanya) berdoa untuk (mendapatkan) kebaikan. Manusia itu (sifatnya) tergesa-gesa."
  },
  {
    "ayat": 12,
    "arabic": "وَجَعَلْنَا الَّيْلَ وَالنَّهَارَ اٰيَتَيْنِ فَمَحَوْنَآ اٰيَةَ الَّيْلِ وَجَعَلْنَآ اٰيَةَ النَّهَارِ مُبْصِرَةً لِّتَبْتَغُوْا فَضْلًا مِّنْ رَّبِّكُمْ وَلِتَعْلَمُوْا عَدَدَ السِّنِيْنَ وَالْحِسَابَۗ وَكُلَّ شَيْءٍ فَصَّلْنٰهُ تَفْصِيْلًا",
    "transliteration_en": "Wa ja'alnal laila wannahaara Aayatayni famahawnaaa Aayatal laili wa ja'alnaaa Aayatan nahaari mubsiratal litabtaghoo fadlam mir Rabbikum wa lita'lamoo 'adadas sineena walhisaab; wa kulla shai'in fassalnaahu tafseelaa",
    "transliteration_id": "Wa ja‘alnal-laila wan-nahāra āyataini fa maḥaunā āyatal-laili wa ja‘alnā āyatan-nahāri mubṣiratal litabtagū faḍlam mir rabbikum wa lita‘lamū ‘adadas-sinīna wal-ḥisāb(a), wa kulla syai'in faṣṣalnāhu tafṣīlā(n).",
    "translation_en": "And We have made the night and day two signs, and We erased the sign of the night and made the sign of the day visible that you may seek bounty from your Lord and may know the number of years and the account [of time]. And everything We have set out in detail.",
    "translation_id": "Kami jadikan malam dan siang sebagai dua tanda (kebesaran Kami). Kami hapuskan tanda malam dan Kami jadikan tanda siang itu terang benderang agar kamu (dapat) mencari karunia dari Tuhanmu dan mengetahui bilangan tahun serta perhitungan (waktu). Segala sesuatu telah Kami terangkan secara terperinci."
  },
  {
    "ayat": 13,
    "arabic": "وَكُلَّ اِنْسَانٍ اَلْزَمْنٰهُ طٰۤىِٕرَهٗ فِيْ عُنُقِهٖۗ وَنُخْرِجُ لَهٗ يَوْمَ الْقِيٰمَةِ كِتٰبًا يَّلْقٰىهُ مَنْشُوْرًا",
    "transliteration_en": "Wa kulla insaanin alzamnaahu taaa'irahoo fe 'unuqihee wa nukhriji lahoo Yawmal Qiyaamati kitaabany yalqaahu manshooraa",
    "transliteration_id": "Wa kulla insānin alzamnāhu ṭā'irahū fī ‘unuqih(ī), wa nukhriju lahū yaumal-qiyāmati kitābay yalqāhu mansyūrā(n).",
    "translation_en": "And [for] every person We have imposed his fate upon his neck, and We will produce for him on the Day of Resurrection a record which he will encounter spread open.",
    "translation_id": "Setiap manusia telah Kami kalungkan (catatan) amal perbuatannya di lehernya. Pada hari Kiamat Kami keluarkan baginya sebuah kitab yang dia terima dalam keadaan terbuka."
  },
  {
    "ayat": 14,
    "arabic": "اِقْرَأْ كِتٰبَكَۗ  كَفٰى بِنَفْسِكَ الْيَوْمَ عَلَيْكَ حَسِيْبًاۗ",
    "transliteration_en": "Iqra kitaabak kafaa binafsikal Yawma 'alaika haseebaa",
    "transliteration_id": "Iqra' kitābak(a), kafā binafsikal-yauma ‘alaika ḥasībā(n).",
    "translation_en": "[It will be said], \"Read your record. Sufficient is yourself against you this Day as accountant.\"",
    "translation_id": "(Dikatakan,) “Bacalah kitabmu. Cukuplah dirimu pada hari ini sebagai penghitung atas (amal) dirimu.”"
  },
  {
    "ayat": 15,
    "arabic": "مَنِ اهْتَدٰى فَاِنَّمَا يَهْتَدِيْ لِنَفْسِهٖۚ وَمَنْ ضَلَّ فَاِنَّمَا يَضِلُّ عَلَيْهَاۗ وَلَا تَزِرُ وَازِرَةٌ وِّزْرَ اُخْرٰىۗ وَمَا كُنَّا مُعَذِّبِيْنَ حَتّٰى نَبْعَثَ رَسُوْلًا",
    "transliteration_en": "Manihtadaa fa innamaa yahtadee linafsihee wa man dalla fa innamaa yadillu 'alaihaa; wa laa taziru waaziratunw wizra ukhraa; wa maa kunnaa mu'azzibeena hatta nab'asa Rasoola",
    "transliteration_id": "Manihtadā fa innamā yahtadī linafsih(ī), wa man ḍalla fa innamā yaḍillu ‘alaihā, wa lā taziru wāziratuw wizra ukhrā, wa mā kunnā mu‘ażżibīna ḥattā nab‘aṡa rasūlā(n).",
    "translation_en": "Whoever is guided is only guided for [the benefit of] his soul. And whoever errs only errs against it. And no bearer of burdens will bear the burden of another. And never would We punish until We sent a messenger.",
    "translation_id": "Siapa yang mendapat petunjuk, sesungguhnya ia mendapat petunjuk itu hanya untuk dirinya. Siapa yang tersesat, sesungguhnya (akibat) kesesatannya itu hanya akan menimpa dirinya. Seorang yang berdosa tidak akan memikul dosa orang lain. Kami tidak akan menyiksa (seseorang) hingga Kami mengutus seorang rasul."
  },
  {
    "ayat": 16,
    "arabic": "وَاِذَآ اَرَدْنَآ اَنْ نُّهْلِكَ قَرْيَةً اَمَرْنَا مُتْرَفِيْهَا فَفَسَقُوْا فِيْهَا فَحَقَّ عَلَيْهَا الْقَوْلُ فَدَمَّرْنٰهَا تَدْمِيْرًا",
    "transliteration_en": "Wa izaaa aradnaaa an nuhlika qaryatan amarnaa mutrafeehaa fafasaqoo feehaa fahaqqa 'alaihal qawlu fadammarnaahaa tadmeeraa",
    "transliteration_id": "Wa iżā aradnā an nuhlika qaryatan amarnā mutrafīhā fa fasaqū fīhā fa ḥaqqa ‘alaihal-qaulu fa dammarnāhā tadmīrā(n).",
    "translation_en": "And when We intend to destroy a city, We command its affluent but they defiantly disobey therein; so the word comes into effect upon it, and We destroy it with [complete] destruction.",
    "translation_id": "Jika Kami hendak membinasakan suatu negeri, Kami perintahkan orang-orang yang hidup mewah di negeri itu (agar menaati Allah). Lalu, mereka melakukan kedurhakaan di negeri itu sehingga pantaslah berlaku padanya perkataan (azab Kami). Maka, Kami hancurkan (negeri itu) sehancur-hancurnya."
  },
  {
    "ayat": 17,
    "arabic": "وَكَمْ اَهْلَكْنَا مِنَ الْقُرُوْنِ مِنْۢ بَعْدِ نُوْحٍۗ وَكَفٰى بِرَبِّكَ بِذُنُوْبِ عِبَادِهٖ خَبِيْرًاۢ بَصِيْرًا",
    "transliteration_en": "Wa kam ahlaknaa minal qurooni mim ba'di Nooh; wa kafaa bi Rabbika bizunoobi 'ibaadihee Khabeeram Baseeraa",
    "transliteration_id": "Wa kam ahlaknā minal-qurūni mim ba‘di nūḥ(in), wa kafā birabbika biżunūbi ‘ibādihī khabīram baṣīrā(n).",
    "translation_en": "And how many have We destroyed from the generations after Noah. And sufficient is your Lord, concerning the sins of His servants, as Acquainted and Seeing.",
    "translation_id": "Banyak generasi setelah Nuh yang telah Kami binasakan. Cukuplah Tuhanmu sebagai Zat Yang Maha Teliti lagi Maha Melihat dosa-dosa hamba-Nya."
  },
  {
    "ayat": 18,
    "arabic": "مَنْ كَانَ يُرِيْدُ الْعَاجِلَةَ عَجَّلْنَا لَهٗ فِيْهَا مَا نَشَاۤءُ لِمَنْ نُّرِيْدُ ثُمَّ جَعَلْنَا لَهٗ جَهَنَّمَۚ يَصْلٰىهَا مَذْمُوْمًا مَّدْحُوْرًا",
    "transliteration_en": "Man kaana yureedul 'aajilata 'ajjalnaa lahoo feehaa maa nashaaa'u liman nureedu summa ja'alnaa lahoo Jahannama yaslaahaa mazmoomammad hooraa",
    "transliteration_id": "Man kāna yurīdul-‘ājilata ‘ajjalnā lahū fīhā mā nasyā'u liman nurīdu ṡumma ja‘alnā lahū jahannam(a), yaṣlāhā mażmūmam madḥūrā(n).",
    "translation_en": "Whoever should desire the immediate - We hasten for him from it what We will to whom We intend. Then We have made for him Hell, which he will [enter to] burn, censured and banished.",
    "translation_id": "Siapa yang menghendaki kehidupan sekarang (duniawi) Kami segerakan baginya di (dunia) ini apa yang Kami kehendaki bagi siapa yang Kami kehendaki. Kemudian, Kami sediakan baginya (neraka) Jahanam. Dia akan memasukinya dalam keadaan tercela lagi terusir (dari rahmat Allah)."
  },
  {
    "ayat": 19,
    "arabic": "وَمَنْ اَرَادَ الْاٰخِرَةَ وَسَعٰى لَهَا سَعْيَهَا وَهُوَ مُؤْمِنٌ فَاُولٰۤىِٕكَ كَانَ سَعْيُهُمْ مَّشْكُوْرًا",
    "transliteration_en": "Wa man araadal Aakhirata wa sa'aa lahaa sa'yahaa wa huwa mu'minun fa ulaaa'ika kaana sa'yuhum mashkooraa",
    "transliteration_id": "Wa man arādal-ākhirata wa sa‘ā lahā sa‘yahā wa huwa mu'minun fa ulā'ika kāna sa‘yuhum masykūrā(n).",
    "translation_en": "But whoever desires the Hereafter and exerts the effort due to it while he is a believer - it is those whose effort is ever appreciated [by Allah].",
    "translation_id": "Siapa yang menghendaki kehidupan akhirat dan berusaha ke arah itu dengan sungguh-sungguh, dan dia adalah mukmin, mereka itulah orang yang usahanya dibalas dengan baik."
  },
  {
    "ayat": 20,
    "arabic": "كُلًّا نُّمِدُّ هٰٓؤُلَاۤءِ وَهٰٓؤُلَاۤءِ مِنْ عَطَاۤءِ رَبِّكَ ۗوَمَا كَانَ عَطَاۤءُ رَبِّكَ مَحْظُوْرًا",
    "transliteration_en": "Kullan numiddu haaa 'ulaaa'i wa haaa'ulaaa'i min 'ataaa'i rabbik; wa maa kaana 'ataaa'u rabbika mahzooraa",
    "transliteration_id": "Kullan numiddu hā'ulā'i wa hā'ulā'i min ‘aṭā'i rabbik(a), wa mā kāna ‘aṭā'u rabbika maḥẓūrā(n).",
    "translation_en": "To each [category] We extend - to these and to those - from the gift of your Lord. And never has the gift of your Lord been restricted.",
    "translation_id": "Tiap-tiap (golongan), baik (golongan) ini (yang menginginkan dunia) maupun (golongan) itu (yang menginginkan akhirat) Kami berikan anugerah dari kemurahan Tuhanmu dan kemurahan Tuhanmu tidak dapat dihalangi."
  },
  {
    "ayat": 21,
    "arabic": "اُنْظُرْ كَيْفَ فَضَّلْنَا بَعْضَهُمْ عَلٰى بَعْضٍۗ وَلَلْاٰخِرَةُ اَكْبَرُ دَرَجٰتٍ وَّاَكْبَرُ تَفْضِيْلًا",
    "transliteration_en": "Unzur kaifa faddalnaa ba'dahum 'alaa ba'd; wa lal Aakhiratu akbaru darajaatinw wa akbaru tafdeelaa",
    "transliteration_id": "Unẓur kaifa faḍḍalnā ba‘ḍahum ‘alā ba‘ḍ(in), wa lal-ākhiratu akbaru darajātiw wa akbaru tafḍīlā(n).",
    "translation_en": "Look how We have favored [in provision] some of them over others. But the Hereafter is greater in degrees [of difference] and greater in distinction.",
    "translation_id": "Perhatikanlah bagaimana Kami melebihkan sebagian mereka atas sebagian (yang lain). Sungguh kehidupan akhirat lebih tinggi derajatnya dan lebih besar keutamaannya."
  },
  {
    "ayat": 22,
    "arabic": "لَا تَجْعَلْ مَعَ اللّٰهِ اِلٰهًا اٰخَرَ فَتَقْعُدَ مَذْمُوْمًا مَّخْذُوْلًا ࣖ",
    "transliteration_en": "Laa taj'al ma'al laahi ilaahan aakhara fataq'uda mazoomam makhzoolaa",
    "transliteration_id": "Lā taj‘al ma‘allāhi ilāhan ākhara fa taq‘uda mażmūmam makhżūlā(n).",
    "translation_en": "Do not make [as equal] with Allah another deity and [thereby] become censured and forsaken.",
    "translation_id": "Janganlah engkau menjadikan tuhan yang lain bersama Allah (sebab) nanti engkau menjadi tercela lagi terhina."
  },
  {
    "ayat": 23,
    "arabic": "۞ وَقَضٰى رَبُّكَ اَلَّا تَعْبُدُوْٓا اِلَّآ اِيَّاهُ وَبِالْوَالِدَيْنِ اِحْسٰنًاۗ اِمَّا يَبْلُغَنَّ عِنْدَكَ الْكِبَرَ اَحَدُهُمَآ اَوْ كِلٰهُمَا فَلَا تَقُلْ لَّهُمَآ اُفٍّ وَّلَا تَنْهَرْهُمَا وَقُلْ لَّهُمَا قَوْلًا كَرِيْمًا",
    "transliteration_en": "Wa qadaa Rabbuka allaa ta'budooo illaaa iyyaahu wa bilwaalidaini ihsaanaa; immaa yablughanna 'indakal kibara ahaduhumaaa aw kilaahumaa falaa taqul lahumaaa uffinw wa laa tanharhumaa wa qullahumaa qawlan kareemaa",
    "transliteration_id": "Wa qaḍā rabbuka allā ta‘budū illā iyyāhu wa bil-wālidaini iḥsānā(n), immā yabluganna ‘indakal-kibara aḥaduhumā au kilāhumā falā taqul lahumā uffiw wa lā tanhar humā wa qul lahumā qaulan karīmā(n).",
    "translation_en": "And your Lord has decreed that you not worship except Him, and to parents, good treatment. Whether one or both of them reach old age [while] with you, say not to them [so much as], \"uff,\" and do not repel them but speak to them a noble word.",
    "translation_id": "Tuhanmu telah memerintahkan agar kamu jangan menyembah selain Dia dan hendaklah berbuat baik kepada ibu bapak. Jika salah seorang di antara keduanya atau kedua-duanya sampai berusia lanjut dalam pemeliharaanmu, sekali-kali janganlah engkau mengatakan kepada keduanya perkataan “ah” dan janganlah engkau membentak keduanya, serta ucapkanlah kepada keduanya perkataan yang baik."
  },
  {
    "ayat": 24,
    "arabic": "وَاخْفِضْ لَهُمَا جَنَاحَ الذُّلِّ مِنَ الرَّحْمَةِ وَقُلْ رَّبِّ ارْحَمْهُمَا كَمَا رَبَّيٰنِيْ صَغِيْرًاۗ",
    "transliteration_en": "Wakhfid lahumaa janaahaz zulli minar rahmati wa qur Rabbir hamhumaa kamaa rabbayaanee sagheera",
    "transliteration_id": "Wakhfiḍ lahumā janāḥaż-żulli minar-raḥmati wa qur rabbirḥamhumā kamā rabbayānī ṣagīrā(n).",
    "translation_en": "And lower to them the wing of humility out of mercy and say, \"My Lord, have mercy upon them as they brought me up [when I was] small.\"",
    "translation_id": "Rendahkanlah dirimu terhadap keduanya dengan penuh kasih sayang dan ucapkanlah, “Wahai Tuhanku, sayangilah keduanya sebagaimana mereka berdua (menyayangiku ketika) mendidik aku pada waktu kecil.”"
  },
  {
    "ayat": 25,
    "arabic": "رَبُّكُمْ اَعْلَمُ بِمَا فِيْ نُفُوْسِكُمْ ۗاِنْ تَكُوْنُوْا صٰلِحِيْنَ فَاِنَّهٗ كَانَ لِلْاَوَّابِيْنَ غَفُوْرًا",
    "transliteration_en": "Rabbukum a'lamu bimaa fee nufoosikum; in takoonoo saaliheena fa innahoo kaana lil awwaabeena Ghafoooraa",
    "transliteration_id": "Rabbukum a‘lamu bimā fī nufūsikum, in takūnū ṣāliḥīna fa innahū kāna lil-awwābīna gafūrā(n).",
    "translation_en": "Your Lord is most knowing of what is within yourselves. If you should be righteous [in intention] - then indeed He is ever, to the often returning [to Him], Forgiving.",
    "translation_id": "Tuhanmu lebih mengetahui apa yang ada dalam dirimu. Jika kamu adalah orang-orang yang saleh, sesungguhnya Dia adalah Maha Pengampun bagi orang-orang yang bertobat."
  },
  {
    "ayat": 26,
    "arabic": "وَاٰتِ ذَا الْقُرْبٰى حَقَّهٗ وَالْمِسْكِيْنَ وَابْنَ السَّبِيْلِ وَلَا تُبَذِّرْ تَبْذِيْرًا",
    "transliteration_en": "Wa aati zal qurbaa haqqahoo walmiskeena wabnas sabeeli wa laa tubazzir tabzeeraa",
    "transliteration_id": "Wa āti żal-qurbā ḥaqqahū wal-miskīna wabnas-sabīli wa lā tubażżir tabżīrā(n).",
    "translation_en": "And give the relative his right, and [also] the poor and the traveler, and do not spend wastefully.",
    "translation_id": "Berikanlah kepada kerabat dekat haknya, (juga kepada) orang miskin, dan orang yang dalam perjalanan. Janganlah kamu menghambur-hamburkan (hartamu) secara boros."
  },
  {
    "ayat": 27,
    "arabic": "اِنَّ الْمُبَذِّرِيْنَ كَانُوْٓا اِخْوَانَ الشَّيٰطِيْنِ ۗوَكَانَ الشَّيْطٰنُ لِرَبِّهٖ كَفُوْرًا",
    "transliteration_en": "Innal mubazzireena kaanoo ikhwaanash shayaateeni wa kaanash shaytaanu li Rabbihee kafooraa",
    "transliteration_id": "Innal-mubażżirīna kānū ikhwānasy-syayāṭīn(i), wa kānasy-syaiṭānu lirabbihī kafūrā(n).",
    "translation_en": "Indeed, the wasteful are brothers of the devils, and ever has Satan been to his Lord ungrateful.",
    "translation_id": "Sesungguhnya para pemboros itu adalah saudara-saudara setan dan setan itu sangat ingkar kepada Tuhannya."
  },
  {
    "ayat": 28,
    "arabic": "وَاِمَّا تُعْرِضَنَّ عَنْهُمُ ابْتِغَاۤءَ رَحْمَةٍ مِّنْ رَّبِّكَ تَرْجُوْهَا فَقُلْ لَّهُمْ قَوْلًا مَّيْسُوْرًا",
    "transliteration_en": "Wa immaa turidanna 'anhumub tighaaa'a rahmatim mir rabbika tarjoohaa faqul lahum qawlam maisooraa",
    "transliteration_id": "Wa immā tu‘riḍanna ‘anhumubtigā'a raḥmatim mir rabbika tarjūhā faqul lahum qaulam maisūrā(n).",
    "translation_en": "And if you [must] turn away from the needy awaiting mercy from your Lord which you expect, then speak to them a gentle word.",
    "translation_id": "Jika (tidak mampu membantu sehingga) engkau (terpaksa) berpaling dari mereka untuk memperoleh rahmat dari Tuhanmu yang engkau harapkan, ucapkanlah kepada mereka perkataan yang lemah lembut."
  },
  {
    "ayat": 29,
    "arabic": "وَلَا تَجْعَلْ يَدَكَ مَغْلُوْلَةً اِلٰى عُنُقِكَ وَلَا تَبْسُطْهَا كُلَّ الْبَسْطِ فَتَقْعُدَ مَلُوْمًا مَّحْسُوْرًا",
    "transliteration_en": "Wa laa taj'al yadaka maghloolatan il 'unuqika wa laa tabsut haa kullal basti fataq'uda maloomam mahsooraa",
    "transliteration_id": "Wa lā taj‘al yadaka maglūlatan ilā ‘unuqika wa lā tabsuṭhā kullal-basṭi fa taq‘uda malūmam maḥsūrā(n).",
    "translation_en": "And do not make your hand [as] chained to your neck or extend it completely and [thereby] become blamed and insolvent.",
    "translation_id": "Janganlah engkau jadikan tanganmu terbelenggu pada lehermu (kikir) dan jangan (pula) engkau mengulurkannya secara berlebihan sebab nanti engkau menjadi tercela lagi menyesal."
  },
  {
    "ayat": 30,
    "arabic": "اِنَّ رَبَّكَ يَبْسُطُ الرِّزْقَ لِمَنْ يَّشَاۤءُ وَيَقْدِرُ ۗاِنَّهٗ كَانَ بِعِبَادِهٖ خَبِيْرًاۢ بَصِيْرًا ࣖ",
    "transliteration_en": "Inna Rabbaka yabsuturrizqa limai yashaaa'u wa yaqdir; innahoo kaana bi'ibaadihee Khabeeram Baseera",
    "transliteration_id": "Inna rabbaka yabsuṭur-rizqa limay yasyā'u wa yaqdir(u), innahū kāna bi‘ibādihī khabīram baṣīrā(n).",
    "translation_en": "Indeed, your Lord extends provision for whom He wills and restricts [it]. Indeed He is ever, concerning His servants, Acquainted and Seeing.",
    "translation_id": "Sesungguhnya Tuhanmu melapangkan rezeki bagi siapa yang Dia kehendaki dan menyempitkan (-nya bagi siapa yang Dia kehendaki). Sesungguhnya Dia Maha Teliti lagi Maha Melihat hamba-hamba-Nya."
  },
  {
    "ayat": 31,
    "arabic": "وَلَا تَقْتُلُوْٓا اَوْلَادَكُمْ خَشْيَةَ اِمْلَاقٍۗ نَحْنُ نَرْزُقُهُمْ وَاِيَّاكُمْۗ اِنَّ قَتْلَهُمْ كَانَ خِطْـًٔا كَبِيْرًا",
    "transliteration_en": "Wa laa taqtulooo awlaadakum khashyata imlaaq; nahnu narzuquhum wa iyyaakum; inna qatlahum kaana khitan kabeeraa",
    "transliteration_id": "Wa lā taqtulū aulādakum khasy-yata imlāq(in), naḥnu narzuquhum wa iyyākum, inna qatlahum kāna khiṭ'an kabīrā(n).",
    "translation_en": "And do not kill your children for fear of poverty. We provide for them and for you. Indeed, their killing is ever a great sin.",
    "translation_id": "Janganlah kamu membunuh anak-anakmu karena takut miskin. Kamilah yang memberi rezeki kepada mereka dan (juga) kepadamu. Sesungguhnya membunuh mereka itu adalah suatu dosa yang besar."
  },
  {
    "ayat": 32,
    "arabic": "وَلَا تَقْرَبُوا الزِّنٰىٓ اِنَّهٗ كَانَ فَاحِشَةً ۗوَسَاۤءَ سَبِيْلًا",
    "transliteration_en": "Wa laa taqrabuz zinaaa innahoo kaana faahishatanw wa saaa'a sabeelaa",
    "transliteration_id": "Wa lā taqrabuz-zinā innahū kāna fāḥisyah(tan), wa sā'a sabīlā(n).",
    "translation_en": "And do not approach unlawful sexual intercourse. Indeed, it is ever an immorality and is evil as a way.",
    "translation_id": "Janganlah kamu mendekati zina. Sesungguhnya (zina) itu adalah perbuatan keji dan jalan terburuk."
  },
  {
    "ayat": 33,
    "arabic": "وَلَا تَقْتُلُوا النَّفْسَ الَّتِيْ حَرَّمَ اللّٰهُ اِلَّا بِالْحَقِّۗ وَمَنْ قُتِلَ مَظْلُوْمًا فَقَدْ جَعَلْنَا لِوَلِيِّهٖ سُلْطٰنًا فَلَا يُسْرِفْ فِّى الْقَتْلِۗ اِنَّهٗ كَانَ مَنْصُوْرًا",
    "transliteration_en": "Wa laa taqtulun nafsal latee harramal laahu illaa bilhaqq; wa man qutila mazlooman faqad ja'alnaa liwaliyyihee sultaanan falaa yusrif fil qatli innahoo kaana mansooraa",
    "transliteration_id": "Wa lā taqtulun-nafsal-latī ḥarramallāhu illā bil-ḥaqq(i), wa man qutila maẓlūman faqad ja‘alnā liwaliyyihī sulṭānan falā yusrif fil-qatl(i), innahū kāna manṣūrā(n).",
    "translation_en": "And do not kill the soul which Allah has forbidden, except by right. And whoever is killed unjustly - We have given his heir authority, but let him not exceed limits in [the matter of] taking life. Indeed, he has been supported [by the law].",
    "translation_id": "Janganlah kamu membunuh orang yang diharamkan Allah (membunuhnya), kecuali dengan suatu (alasan) yang benar. Siapa yang dibunuh secara teraniaya, sungguh Kami telah memberi kekuasaan kepada walinya. Akan tetapi, janganlah dia (walinya itu) melampaui batas dalam pembunuhan (kisas). Sesungguhnya dia adalah orang yang mendapat pertolongan."
  },
  {
    "ayat": 34,
    "arabic": "وَلَا تَقْرَبُوْا مَالَ الْيَتِيْمِ اِلَّا بِالَّتِيْ هِيَ اَحْسَنُ حَتّٰى يَبْلُغَ اَشُدَّهٗۖ وَاَوْفُوْا بِالْعَهْدِۖ اِنَّ الْعَهْدَ كَانَ مَسْـُٔوْلًا",
    "transliteration_en": "Wa laa taqraboo maalal yateemi illaa billatee hiya ahsanu hattaa yablugha ashuddah; wa awfoo bil'ahd, innal 'ahda kaana mas'oolaa",
    "transliteration_id": "Wa lā taqrabū mālal-yatīmi illā bil-latī hiya aḥsanu ḥattā yabluga asyuddah(ū), wa aufū bil-‘ahd(i), innal-‘ahda kāna mas'ūlā(n).",
    "translation_en": "And do not approach the property of an orphan, except in the way that is best, until he reaches maturity. And fulfill [every] commitment. Indeed, the commitment is ever [that about which one will be] questioned.",
    "translation_id": "Janganlah kamu mendekati harta anak yatim, kecuali dengan (cara) yang terbaik (dengan mengembangkannya) sampai dia dewasa dan penuhilah janji (karena) sesungguhnya janji itu pasti diminta pertanggungjawabannya."
  },
  {
    "ayat": 35,
    "arabic": "وَاَوْفُوا الْكَيْلَ اِذَا كِلْتُمْ وَزِنُوْا بِالْقِسْطَاسِ الْمُسْتَقِيْمِۗ ذٰلِكَ خَيْرٌ وَّاَحْسَنُ تَأْوِيْلًا",
    "transliteration_en": "Wa awful kaila izaa kiltum wa zinoo bilqistaasil mustaqeem; zaalika khairunw wa ahsanu taaweelaa",
    "transliteration_id": "Wa auful-kaila iżā kiltum wa zinū bil-qisṭāsil-mustaqīm(i), żālika khairuw wa aḥsanu ta'wīlā(n).",
    "translation_en": "And give full measure when you measure, and weigh with an even balance. That is the best [way] and best in result.",
    "translation_id": "Sempurnakanlah takaran apabila kamu menakar dan timbanglah dengan timbangan yang benar. Itulah yang paling baik dan paling bagus akibatnya."
  },
  {
    "ayat": 36,
    "arabic": "وَلَا تَقْفُ مَا لَيْسَ لَكَ بِهٖ عِلْمٌ ۗاِنَّ السَّمْعَ وَالْبَصَرَ وَالْفُؤَادَ كُلُّ اُولٰۤىِٕكَ كَانَ عَنْهُ مَسْـُٔوْلًا",
    "transliteration_en": "Wa laa taqfu maa laisa laka bihee 'ilm; innas sam'a walbasara walfu'aada kullu ulaaa'ika kaana 'anhu mas'oolaa",
    "transliteration_id": "Wa lā taqfu mā laisa laka bihī ‘ilm(un), innas-sam‘a wal-baṣara wal-fu'āda kullu ulā'ika kāna ‘anhu mas'ūlā(n).",
    "translation_en": "And do not pursue that of which you have no knowledge. Indeed, the hearing, the sight and the heart - about all those [one] will be questioned.",
    "translation_id": "Janganlah engkau mengikuti sesuatu yang tidak kauketahui. Sesungguhnya pendengaran, penglihatan, dan hati nurani, semua itu akan diminta pertanggungjawabannya."
  },
  {
    "ayat": 37,
    "arabic": "وَلَا تَمْشِ فِى الْاَرْضِ مَرَحًاۚ اِنَّكَ لَنْ تَخْرِقَ الْاَرْضَ وَلَنْ تَبْلُغَ الْجِبَالَ طُوْلًا",
    "transliteration_en": "Wa laa tamshi fil ardi marahan innaka lan takhriqal arda wa lan tablughal jibaala toola",
    "transliteration_id": "Wa lā tamsyi fil-arḍi marahā(n), innaka lan takhriqal-arḍa wa lan tablugal-jibāla ṭūlā(n).",
    "translation_en": "And do not walk upon the earth exultantly. Indeed, you will never tear the earth [apart], and you will never reach the mountains in height.",
    "translation_id": "Janganlah engkau berjalan di bumi ini dengan sombong karena sesungguhnya engkau tidak akan dapat menembus bumi dan tidak akan mampu menjulang setinggi gunung."
  },
  {
    "ayat": 38,
    "arabic": "كُلُّ ذٰلِكَ كَانَ سَيِّئُهٗ عِنْدَ رَبِّكَ مَكْرُوْهًا",
    "transliteration_en": "Kullu zaalika kaana sayyi'uhoo inda Rabbika makroohaa",
    "transliteration_id": "Kullu żālika kāna sayyi'uhū ‘inda rabbika makrūhā(n).",
    "translation_en": "All that - its evil is ever, in the sight of your Lord, detested.",
    "translation_id": "Kejahatan dari semua (larangan) itu dibenci di sisi Tuhanmu."
  },
  {
    "ayat": 39,
    "arabic": "ذٰلِكَ مِمَّآ اَوْحٰٓى اِلَيْكَ رَبُّكَ مِنَ الْحِكْمَةِۗ وَلَا تَجْعَلْ مَعَ اللّٰهِ اِلٰهًا اٰخَرَ فَتُلْقٰى فِيْ جَهَنَّمَ مَلُوْمًا مَّدْحُوْرًا",
    "transliteration_en": "Zaalika mimmaaa awhaaa ilaika Rabbuka minal hikmah; wa laa taj'al ma'allaahi ilaahan aakhara fatulqaa fee Jahannama maloomam mad hooraa",
    "transliteration_id": "Żālika mimmā auḥā ilaika rabbuka minal-ḥikmah(ti), wa lā taj‘al ma‘allāhi ilāhan ākhara fa tulqā fī jahannama malūmam madḥūrā(n).",
    "translation_en": "That is from what your Lord has revealed to you, [O Muhammad], of wisdom. And, [O mankind], do not make [as equal] with Allah another deity, lest you be thrown into Hell, blamed and banished.",
    "translation_id": "Itulah sebagian hikmah yang diwahyukan Tuhan kepada engkau (Nabi Muhammad). Janganlah engkau menjadikan tuhan yang lain di samping Allah, yang menyebabkan engkau dilemparkan ke dalam neraka dalam keadaan tercela lagi terusir (dari rahmat Allah)."
  },
  {
    "ayat": 40,
    "arabic": "اَفَاَصْفٰىكُمْ رَبُّكُمْ بِالْبَنِيْنَ وَاتَّخَذَ مِنَ الْمَلٰۤىِٕكَةِ اِنَاثًاۗ اِنَّكُمْ لَتَقُوْلُوْنَ قَوْلًا عَظِيْمًا ࣖ",
    "transliteration_en": "Afa asfaakum rabbukum bilbaneena wattakhaza minal malaaa'ikati inaasaa; innakum lataqooloona qawlan 'azeema",
    "transliteration_id": "Afa aṣfākum rabbukum bil-banīna wattakhaża minal-malā'ikati ināṡā(n), innakum lataqūlūna qaulan ‘aẓīmā(n).",
    "translation_en": "Then, has your Lord chosen you for [having] sons and taken from among the angels daughters? Indeed, you say a grave saying.",
    "translation_id": "Apakah (pantas) Tuhanmu memilihkan anak laki-laki untukmu, sedangkan Dia menjadikan malaikat sebagai anak perempuan? Sesungguhnya kamu (kaum musyrik) benar-benar mengucapkan perkataan yang (dosanya) sangat besar."
  },
  {
    "ayat": 41,
    "arabic": "وَلَقَدْ صَرَّفْنَا فِيْ هٰذَا الْقُرْاٰنِ لِيَذَّكَّرُوْاۗ وَمَا يَزِيْدُهُمْ اِلَّا نُفُوْرًا",
    "transliteration_en": "Wa laqad sarrafnaa fee haazal Quraani liyazzakkaroo wa maa yazeeduhum illaa nufooraa",
    "transliteration_id": "Wa laqad ṣarrafnā fī hāżal-qur'āni liyażżakkarū, wa mā yazīduhum illā nufūrā(n).",
    "translation_en": "And We have certainly diversified [the contents] in this Qur'an that mankind may be reminded, but it does not increase the disbelievers except in aversion.",
    "translation_id": "Sungguh telah Kami (jelaskan) berulang-ulang (peringatan) dalam Al-Qur’an ini agar mereka selalu ingat. Akan tetapi, (peringatan) itu tidak menambah (apa pun) kepada mereka, kecuali makin lari (dari kebenaran)."
  },
  {
    "ayat": 42,
    "arabic": "قُلْ لَّوْ كَانَ مَعَهٗ ٓ اٰلِهَةٌ كَمَا يَقُوْلُوْنَ اِذًا لَّابْتَغَوْا اِلٰى ذِى الْعَرْشِ سَبِيْلًا",
    "transliteration_en": "Qul law kaana ma'ahooo aalihatun kamaa yaqooloona izal labtaghaw ilaa zil 'Arshi Sabeela",
    "transliteration_id": "Qul lau kāna ma‘ahū ālihatun kamā yaqūlūna iżal labtagau ilā żil-‘arsyi sabīlā(n).",
    "translation_en": "Say, [O Muhammad], \"If there had been with Him [other] gods, as they say, then they [each] would have sought to the Owner of the Throne a way.\"",
    "translation_id": "Katakanlah (Nabi Muhammad), “Seandainya ada tuhan-tuhan (lain) di samping-Nya, sebagaimana yang mereka katakan, niscaya tuhan-tuhan itu mencari jalan kepada (Tuhan) Pemilik ʻArasy (untuk mengalahkan atau menyaingi-Nya).”"
  },
  {
    "ayat": 43,
    "arabic": "سُبْحٰنَهٗ وَتَعٰلٰى عَمَّا يَقُوْلُوْنَ عُلُوًّا كَبِيْرًا",
    "transliteration_en": "Subhaanahoo wa Ta'aalaa 'ammaa yaqooloona 'uluwwan kabeeraa",
    "transliteration_id": "Subḥānahū wa ta‘ālā ‘ammā yaqūlūna ‘uluwwan kabīrā(n).",
    "translation_en": "Exalted is He and high above what they say by great sublimity.",
    "translation_id": "Maha Suci dan Maha Tinggi Dia dari apa yang mereka katakan dengan ketinggian yang agung."
  },
  {
    "ayat": 44,
    "arabic": "تُسَبِّحُ لَهُ السَّمٰوٰتُ السَّبْعُ وَالْاَرْضُ وَمَنْ فِيْهِنَّۗ وَاِنْ مِّنْ شَيْءٍ اِلَّا يُسَبِّحُ بِحَمْدِهٖ وَلٰكِنْ لَّا تَفْقَهُوْنَ تَسْبِيْحَهُمْۗ اِنَّهٗ كَانَ حَلِيْمًا غَفُوْرًا",
    "transliteration_en": "Tusabbihu lahus samaawaatus sab'u wal ardu wa man feehinn; wa im min shai'in illaa yusabbihu bihamdihee wa laakil laa tafqahoona tasbeehahum; innahoo kaana Haleeman Ghafooraa",
    "transliteration_id": "Tusabbiḥu lahus-samāwātus-sab‘u wal-arḍu wa man fīhinn(a), wa im min syai'in illā yusabbiḥu biḥamdihī wa lākil lā tafqahūna tasbīḥahum, innahū kāna ḥalīman gafūrā(n).",
    "translation_en": "The seven heavens and the earth and whatever is in them exalt Him. And there is not a thing except that it exalts [Allah] by His praise, but you do not understand their [way of] exalting. Indeed, He is ever Forbearing and Forgiving.",
    "translation_id": "Langit yang tujuh, bumi, dan semua yang ada di dalamnya senantiasa bertasbih kepada Allah. Tidak ada sesuatu pun, kecuali senantiasa bertasbih dengan memuji-Nya, tetapi kamu tidak mengerti tasbih mereka. Sesungguhnya Dia Maha Penyantun lagi Maha Pengampun."
  },
  {
    "ayat": 45,
    "arabic": "وَاِذَا قَرَأْتَ الْقُرْاٰنَ جَعَلْنَا بَيْنَكَ وَبَيْنَ الَّذِيْنَ لَا يُؤْمِنُوْنَ بِالْاٰخِرَةِ حِجَابًا مَّسْتُوْرًاۙ",
    "transliteration_en": "Wa izaa qaraatal Quraana ja'alnaa bainaka wa bainal lazeena laa yu'minoona bil aakhirati hijaabam mastooraa",
    "transliteration_id": "Wa iżā qara'tal-qur'āna ja‘alnā bainaka wa bainal-lażīna lā yu'minūna bil-ākhirati ḥijābam mastūrā(n).",
    "translation_en": "And when you recite the Qur'an, We put between you and those who do not believe in the Hereafter a concealed partition.",
    "translation_id": "Apabila engkau (Nabi Muhammad) membaca Al-Qur’an, Kami adakan suatu tabir yang tertutup antara engkau dan orang-orang yang tidak beriman pada kehidupan akhirat."
  },
  {
    "ayat": 46,
    "arabic": "وَّجَعَلْنَا عَلٰى قُلُوْبِهِمْ اَكِنَّةً اَنْ يَّفْقَهُوْهُ وَفِيْٓ اٰذَانِهِمْ وَقْرًاۗ وَاِذَا ذَكَرْتَ رَبَّكَ فِى الْقُرْاٰنِ وَحْدَهٗ وَلَّوْا عَلٰٓى اَدْبَارِهِمْ نُفُوْرًا",
    "transliteration_en": "Wa ja'alnaa 'alaa quloo bihim akinnatan any yafqahoohu wa feee aazaanihim waqraa; wa izaa zakarta Rabbaka fil Quraani wahdahoo wallaw 'alaaa adbaarihim nufooraa",
    "transliteration_id": "Wa ja‘alnā ‘alā qulūbihim akinnatan ay yafqahūhu wa fī āżānihim waqrā(n), wa iżā żakarta rabbaka fil-qur'āni waḥdahū wallau ‘alā adbārihim nufūrā(n).",
    "translation_en": "And We have placed over their hearts coverings, lest they understand it, and in their ears deafness. And when you mention your Lord alone in the Qur'an, they turn back in aversion.",
    "translation_id": "Kami jadikan di atas hati mereka penutup-penutup (sesuai dengan kehendak dan sikap mereka) sehingga mereka tidak memahaminya dan di telinga mereka ada penyumbat (sehingga tidak mendengarnya). Apabila engkau menyebut (nama) Tuhanmu saja dalam Al-Qur’an, mereka berpaling ke belakang melarikan diri (karena benci)."
  },
  {
    "ayat": 47,
    "arabic": "نَحْنُ اَعْلَمُ بِمَا يَسْتَمِعُوْنَ بِهٖٓ اِذْ يَسْتَمِعُوْنَ اِلَيْكَ وَاِذْ هُمْ نَجْوٰٓى اِذْ يَقُوْلُ الظّٰلِمُوْنَ اِنْ تَتَّبِعُوْنَ اِلَّا رَجُلًا مَّسْحُوْرًا",
    "transliteration_en": "nahnu a'lamu bimaa yastami'oona biheee iz yastami'oona ilaika wa iz hum najwaaa iz yaqooluz zaalimoona in tattabi'oona illaa rajulam mas hooraa",
    "transliteration_id": "Naḥnu a‘lamu bimā yastami‘ūna bihī iż yastami‘ūna ilaika wa iż hum najwā iż yaqūluẓ-ẓālimūna in tattabi‘ūna illā rajulam masḥūrā(n).",
    "translation_en": "We are most knowing of how they listen to it when they listen to you and [of] when they are in private conversation, when the wrongdoers say, \"You follow not but a man affected by magic.\"",
    "translation_id": "Kami lebih tahu bagaimana (sikap) mereka mendengarkan (Al-Qur’an) saat mereka mendengarkan engkau (Nabi Muhammad) dan berbisik-bisik (sesama mereka) ketika orang-orang zalim itu berkata, “Kamu tidak mengikuti (siapa pun), kecuali seorang laki-laki yang kena sihir.”"
  },
  {
    "ayat": 48,
    "arabic": "اُنْظُرْ كَيْفَ ضَرَبُوْا لَكَ الْاَمْثَالَ فَضَلُّوْا فَلَا يَسْتَطِيْعُوْنَ سَبِيْلًا",
    "transliteration_en": "Unzur kaifa daraboo lakal amsaala fadalloo falaa yastatee'oona sabeelaa",
    "transliteration_id": "Unẓur kaifa ḍarabū lakal-amṡāla fa ḍallū falā yastaṭī‘ūna sabīlā(n).",
    "translation_en": "Look how they strike for you comparisons; but they have strayed, so they cannot [find] a way.",
    "translation_id": "Perhatikanlah (Nabi Muhammad) bagaimana mereka membuat perumpamaan-perumpamaan (yang buruk) tentang engkau! Maka, sesatlah mereka sehingga tidak sanggup (mendapatkan) jalan (untuk menentang kerasulanmu)."
  },
  {
    "ayat": 49,
    "arabic": "وَقَالُوْٓا ءَاِذَا كُنَّا عِظَامًا وَّرُفَاتًا ءَاِنَّا لَمَبْعُوْثُوْنَ خَلْقًا جَدِيْدًا",
    "transliteration_en": "Wa qaalooo'a izaa kunnaa 'izaamanw wa rufaatan 'a innaa lamab'oosoona khalqan jadeedaa",
    "transliteration_id": "Wa qālū a'iżā kunnā ‘iẓāmaw wa rufātan a'innā lamab‘ūṡūna khalqan jadīdā(n).",
    "translation_en": "And they say, \"When we are bones and crumbled particles, will we [truly] be resurrected as a new creation?\"",
    "translation_id": "Mereka berkata, “Apabila kami telah menjadi tulang-belulang dan kepingan-kepingan (yang berserakan), apakah kami benar-benar akan dibangkitkan kembali sebagai makhluk yang baru?”"
  },
  {
    "ayat": 50,
    "arabic": "۞ قُلْ كُوْنُوْا حِجَارَةً اَوْ حَدِيْدًاۙ",
    "transliteration_en": "Qul koonoo jijaaratan aw hadeedaa",
    "transliteration_id": "Qul kūnū ḥijāratan au ḥadīdā(n).",
    "translation_en": "Say, \"Be you stones or iron",
    "translation_id": "Katakanlah (Nabi Muhammad), “Jadilah kamu batu atau besi,"
  }
]