[
  {
    "ayat": 101,
    "arabic": "وَلَقَدْ اٰتَيْنَا مُوْسٰى تِسْعَ اٰيٰتٍۢ بَيِّنٰتٍ فَسْـَٔلْ بَنِيْٓ اِسْرَاۤءِيْلَ اِذْ جَاۤءَهُمْ فَقَالَ لَهٗ فِرْعَوْنُ اِنِّيْ لَاَظُنُّكَ يٰمُوْسٰى مَسْحُوْرًا",
    "transliteration_en": "Wa laqad aatainaa Moosaa tis'a Aayaatim baiyinaatin fas'al Baneee Israaa'eela iz jaaa'ahum faqaala lahoo Fir'awnu inee la azunnuka yaa Moosaa mas hooraa",
    "transliteration_id": "Wa laqad ātainā mūsā tis‘a āyātim bayyinātin fas'al banī isrā'īla iż jā'ahum fa qāla lahū fir‘aunu innī la'aẓunnuka yā mūsā masḥūrā(n).",
    "translation_en": "And We had certainly given Moses nine evident signs, so ask the Children of Israel [about] when he came to them and Pharaoh said to him, \"Indeed I think, O Moses, that you are affected by magic.\"",
    "translation_id": "Sungguh, Kami telah menganugerahkan kepada Musa sembilan mukjizat yang nyata. Maka, tanyakanlah kepada Bani Israil ketika dia datang kepada mereka lalu Fir‘aun berkata kepadanya, “Sesungguhnya aku benar-benar yakin bahwa engkau, wahai Musa, terkena sihir.”"
  },
  {
    "ayat": 102,
    "arabic": "قَالَ لَقَدْ عَلِمْتَ مَآ اَنْزَلَ هٰٓؤُلَاۤءِ اِلَّا رَبُّ السَّمٰوٰتِ وَالْاَرْضِ بَصَاۤىِٕرَۚ وَاِنِّيْ لَاَظُنُّكَ يٰفِرْعَوْنُ مَثْبُوْرًا",
    "transliteration_en": "Qaala laqad 'alimta maaa anzala haaa'ulaaa'i illaa Rabbus samaawaati wal ardi basaaa'ira wa innee la azun nuka yaa Fir'awnu masbooraa",
    "transliteration_id": "Qāla laqad ‘alimta mā anzala hā'ulā'i illā rabbus-samāwāti wal-arḍi baṣā'ir(a), wa innī la'aẓunnuka yā fir‘aunu maṡbūrā(n).",
    "translation_en": "[Moses] said, \"You have already known that none has sent down these [signs] except the Lord of the heavens and the earth as evidence, and indeed I think, O Pharaoh, that you are destroyed.\"",
    "translation_id": "Dia (Musa) menjawab, “Sungguh, engkau benar-benar telah mengetahui bahwa tidak ada yang menurunkan (mukjizat-mukjizat) itu kecuali Tuhan langit dan bumi sebagai bukti-bukti yang nyata. Sesungguhnya aku benar-benar yakin bahwa engkau, wahai Fir‘aun, terlaknat.”"
  },
  {
    "ayat": 103,
    "arabic": "فَاَرَادَ اَنْ يَّسْتَفِزَّهُمْ مِّنَ الْاَرْضِ فَاَغْرَقْنٰهُ وَمَنْ مَّعَهٗ جَمِيْعًاۙ",
    "transliteration_en": "Fa araada any yastafizzahum minal ardi fa aghraqnaahu wa mam ma'ahoo jamee'aa",
    "transliteration_id": "Fa arāda ay yastafizzahum minal arḍi fa agraqnāhu wa mam ma‘ahū jamī‘ā(n).",
    "translation_en": "So he intended to drive them from the land, but We drowned him and those with him all together.",
    "translation_id": "Kemudian, dia (Fir‘aun) hendak mengusir mereka (Musa dan pengikutnya) dari bumi (Mesir), maka Kami tenggelamkan dia (Fir‘aun) beserta seluruh orang yang bersamanya."
  },
  {
    "ayat": 104,
    "arabic": "وَّقُلْنَا مِنْۢ بَعْدِهٖ لِبَنِيْٓ اِسْرَاۤءِيْلَ اسْكُنُوا الْاَرْضَ فَاِذَا جَاۤءَ وَعْدُ الْاٰخِرَةِ جِئْنَا بِكُمْ لَفِيْفًاۗ",
    "transliteration_en": "Wa qulnaa mim ba'dihee li Baneee Israaa'eelas kunul arda faizaa jaaa'a wa'dulaakhirati ji'naa bikum lafeefaa",
    "transliteration_id": "Wa qulnā mim ba‘dihī libanī isrā'īlaskunul-arḍa fa iżā jā'a wa‘dul-ākhirati ji'nā bikum lafīfā(n).",
    "translation_en": "And We said after Pharaoh to the Children of Israel, \"Dwell in the land, and when there comes the promise of the Hereafter, We will bring you forth in [one] gathering.\"",
    "translation_id": "Setelah itu Kami berfirman kepada Bani Israil, “Tinggallah di negeri ini! Apabila janji kebangkitan datang, niscaya Kami kumpulkan kamu dalam keadaan bercampur baur.”"
  },
  {
    "ayat": 105,
    "arabic": "وَبِالْحَقِّ اَنْزَلْنٰهُ وَبِالْحَقِّ نَزَلَۗ وَمَآ اَرْسَلْنٰكَ اِلَّا مُبَشِّرًا وَّنَذِيْرًاۘ",
    "transliteration_en": "Wa bilhaqqi anzalnaahu wa bilhaqqi nazal; wa maaa arsalnaaka illaa mubash shiranw wa nazeeraa",
    "transliteration_id": "Wa bil-ḥaqqi anzalnāhu wa bil-ḥaqqi nazal(a), wa mā arsalnāka illā mubasysyiraw wa nażīrā(n).",
    "translation_en": "And with the truth We have sent the Qur'an down, and with the truth it has descended. And We have not sent you, [O Muhammad], except as a bringer of good tidings and a warner.",
    "translation_id": "Kami menurunkannya (Al-Qur’an) dengan sebenarnya dan ia (Al-Qur’an) turun dengan (membawa) kebenaran. Kami mengutus engkau (Nabi Muhammad) hanya sebagai pembawa berita gembira dan pemberi peringatan."
  },
  {
    "ayat": 106,
    "arabic": "وَقُرْاٰنًا فَرَقْنٰهُ لِتَقْرَاَهٗ عَلَى النَّاسِ عَلٰى مُكْثٍ وَّنَزَّلْنٰهُ تَنْزِيْلًا",
    "transliteration_en": "Wa quraanan faraqnaahu litaqra ahoo 'alan naasi 'alaa muksinw wa nazzalnaahu tanzeelaa",
    "transliteration_id": "Wa qur'ānan faraqnāhu litaqra'ahū ‘alan-nāsi ‘alā mukṡiw wa nazzalnāhu tanzīlā(n).",
    "translation_en": "And [it is] a Qur'an which We have separated [by intervals] that you might recite it to the people over a prolonged period. And We have sent it down progressively.",
    "translation_id": "Al-Qur’an Kami turunkan berangsur-angsur agar engkau (Nabi Muhammad) membacakannya kepada manusia secara perlahan-lahan dan Kami benar-benar menurunkannya secara bertahap."
  },
  {
    "ayat": 107,
    "arabic": "قُلْ اٰمِنُوْا بِهٖٓ اَوْ لَا تُؤْمِنُوْاۗ اِنَّ الَّذِيْنَ اُوْتُوا الْعِلْمَ مِنْ قَبْلِهٖٓ اِذَا يُتْلٰى عَلَيْهِمْ يَخِرُّوْنَ لِلْاَذْقَانِ سُجَّدًاۙ",
    "transliteration_en": "Qul aaaniminoo biheee aw laa tu'minoo; innal lazeena ootul 'ilma min qabliheee izaa yutlaa 'alaihim yakhirroona lil azqaani sujjadaa",
    "transliteration_id": "Qul āminū bihī au lā tu'minū, innal-lażīna ūtul-‘ilma min qablihī iżā yutlā ‘alaihim yakhirrūna lil-ażqāni sujjadā(n).",
    "translation_en": "Say, \"Believe in it or do not believe. Indeed, those who were given knowledge before it - when it is recited to them, they fall upon their faces in prostration,",
    "translation_id": "Katakanlah (Nabi Muhammad), “Berimanlah kamu kepadanya (Al-Qur’an) atau tidak usah beriman (itu sama saja bagi Allah)! Sesungguhnya orang-orang yang telah diberi pengetahuan sebelumnya, apabila (Al-Qur’an) dibacakan kepada mereka, mereka menyungkurkan wajah (dengan) bersujud.”"
  },
  {
    "ayat": 108,
    "arabic": "وَّيَقُوْلُوْنَ سُبْحٰنَ رَبِّنَآ اِنْ كَانَ وَعْدُ رَبِّنَا لَمَفْعُوْلًا",
    "transliteration_en": "Wa yaqooloona Subhaana Rabbinaaa in kaana wa'du Rabbinaa lamaf'oolaa",
    "transliteration_id": "Wa yaqūlūna subḥāna rabbinā in kāna wa‘du rabbinā lamaf‘ūlā(n).",
    "translation_en": "And they say, \"Exalted is our Lord! Indeed, the promise of our Lord has been fulfilled.\"",
    "translation_id": "Mereka berkata, “Maha Suci Tuhan kami. Sesungguhnya janji Tuhan kami pasti terlaksana.”"
  },
  {
    "ayat": 109,
    "arabic": "وَيَخِرُّوْنَ لِلْاَذْقَانِ يَبْكُوْنَ وَيَزِيْدُهُمْ خُشُوْعًا ۩",
    "transliteration_en": "Wa yakhirroona lil azqaani yabkoona wa yazeeduhum khushoo'aa",
    "transliteration_id": "Wa yakhirrūna lil-ażqāni yabkūna wa yazīduhum khusyū‘ā(n).",
    "translation_en": "And they fall upon their faces weeping, and the Qur'an increases them in humble submission.",
    "translation_id": "Mereka menyungkurkan wajah seraya menangis dan ia (Al-Qur’an) menambah kekhusyukan mereka."
  },
  {
    "ayat": 110,
    "arabic": "قُلِ ادْعُوا اللّٰهَ اَوِ ادْعُوا الرَّحْمٰنَۗ اَيًّا مَّا تَدْعُوْا فَلَهُ الْاَسْمَاۤءُ الْحُسْنٰىۚ وَلَا تَجْهَرْ بِصَلَاتِكَ وَلَا تُخَافِتْ بِهَا وَابْتَغِ بَيْنَ ذٰلِكَ سَبِيْلًا",
    "transliteration_en": "Qulid'ul laaha awid'ur Rahmaana ayyam maa tad'oo falahul asmaaa'ul Husnaa; wa laa tajhar bi Salaatika wa laa tukhaafit bihaa wabtaghi baina zaalika sabeela",
    "transliteration_id": "Qulid‘ullāha awid‘ur-raḥmān(a), ayyam mā tad‘ū fa lahul-asmā'ul-ḥusnā, wa lā tajhar biṣalātika wa lā tukhāfit bihā wabtagi baina żālika sabīlā(n).",
    "translation_en": "Say, \"Call upon Allah or call upon the Most Merciful. Whichever [name] you call - to Him belong the best names.\" And do not recite [too] loudly in your prayer or [too] quietly but seek between that an [intermediate] way.",
    "translation_id": "Katakanlah (Nabi Muhammad), “Serulah ‘Allah’ atau serulah ‘Ar-Raḥmān’! Nama mana saja yang kamu seru, (maka itu baik) karena Dia mempunyai nama-nama yang terbaik (Asmaulhusna). Janganlah engkau mengeraskan (bacaan) salatmu dan janganlah (pula) merendahkannya. Usahakan jalan (tengah) di antara (kedua)-nya!”"
  },
  {
    "ayat": 111,
    "arabic": "وَقُلِ الْحَمْدُ لِلّٰهِ الَّذِيْ لَمْ يَتَّخِذْ وَلَدًا وَّلَمْ يَكُنْ لَّهٗ شَرِيْكٌ فِى الْمُلْكِ وَلَمْ يَكُنْ لَّهٗ وَلِيٌّ مِّنَ الذُّلِّ وَكَبِّرْهُ تَكْبِيْرًا ࣖ",
    "transliteration_en": "Wa qulil hamdu lillaahil lazee lam yattakhiz waladanw wa lam yakul lahoo shareekun fil mulki wa lam yakul lahoo waliyyum minaz zulli wa kabbirhu takbeeraa",
    "transliteration_id": "Wa qulil-ḥamdu lillāhil-lażī lam yattakhiż waladaw wa lam yakul lahū syarīkun fil-mulki wa lam yakul lahū waliyyum minaż-żulli wa kabbirhu takbīrā(n).",
    "translation_en": "And say, \"Praise to Allah, who has not taken a son and has had no partner in [His] dominion and has no [need of a] protector out of weakness; and glorify Him with [great] glorification.\"",
    "translation_id": "Katakanlah, “Segala puji bagi Allah yang tidak mengangkat seorang anak, tidak mempunyai sekutu dalam kerajaan-Nya, dan tidak memerlukan penolong dari kehinaan! Agungkanlah Dia setinggi-tingginya!”"
  }
]