[
  {
    "ayat": 1,
    "arabic": "اَلْحَمْدُ لِلّٰهِ الَّذِيْٓ اَنْزَلَ عَلٰى عَبْدِهِ الْكِتٰبَ وَلَمْ يَجْعَلْ لَّهٗ عِوَجًا ۜ",
    "transliteration_en": "Alhamdu lillaahil lazeee anzala 'alaa 'abdihil kitaaba wa lam yaj'al lahoo 'iwajaa",
    "transliteration_id": "Al-ḥamdu lillāhil-lażī anzala ‘alā ‘abdihil-kitāba wa lam yaj‘al lahū ‘iwajā(n).",
    "translation_en": "[All] praise is [due] to Allah, who has sent down upon His Servant the Book and has not made therein any deviance.",
    "translation_id": "Segala puji bagi Allah yang telah menurunkan Kitab Suci (Al-Qur’an) kepada hamba-Nya dan Dia tidak membuat padanya sedikit pun kebengkokan."
  },
  {
    "ayat": 2,
    "arabic": "قَيِّمًا لِّيُنْذِرَ بَأْسًا شَدِيْدًا مِّنْ لَّدُنْهُ وَيُبَشِّرَ الْمُؤْمِنِيْنَ الَّذِيْنَ يَعْمَلُوْنَ الصّٰلِحٰتِ اَنَّ لَهُمْ اَجْرًا حَسَنًاۙ",
    "transliteration_en": "Qaiyimal liyunzira baasan shadeedam mil ladunhu wa yubashshiral mu'mineenal lazeena ya'maloonas saalihaati anna lahum ajran hasanaa",
    "transliteration_id": "Qayyimal liyunżira ba'san syadīdam mil ladunhu wa yubasysyiral-mu'minīnal-lażīna ya‘malūnaṣ-ṣāliḥāti anna lahum ajran ḥasanā(n).",
    "translation_en": "[He has made it] straight, to warn of severe punishment from Him and to give good tidings to the believers who do righteous deeds that they will have a good reward",
    "translation_id": "(Dia menjadikannya kitab) yang lurus agar Dia memberi peringatan akan siksa yang sangat pedih dari sisi-Nya dan memberi kabar gembira kepada orang-orang mukmin yang mengerjakan kebajikan bahwa mereka akan mendapat balasan yang baik."
  },
  {
    "ayat": 3,
    "arabic": "مّٰكِثِيْنَ فِيْهِ اَبَدًاۙ",
    "transliteration_en": "Maakiseena feehi abadaa",
    "transliteration_id": "Mākiṡīna fīhi abadā(n).",
    "translation_en": "In which they will remain forever",
    "translation_id": "Mereka kekal di dalamnya untuk selama-lamanya."
  },
  {
    "ayat": 4,
    "arabic": "وَّيُنْذِرَ الَّذِيْنَ قَالُوا اتَّخَذَ اللّٰهُ وَلَدًاۖ",
    "transliteration_en": "Wa yunziral lazeena qaalut takhazal laahu waladaa",
    "transliteration_id": "Wa yunżiral-lażīna qāluttakhażallāhu waladā(n).",
    "translation_en": "And to warn those who say, \"Allah has taken a son.\"",
    "translation_id": "(Dia menurunkan Al-Qur’an itu) juga agar Dia memberi peringatan kepada orang-orang yang berkata, “Allah mengangkat seorang anak.”"
  },
  {
    "ayat": 5,
    "arabic": "مَّا لَهُمْ بِهٖ مِنْ عِلْمٍ وَّلَا لِاٰبَاۤىِٕهِمْۗ  كَبُرَتْ كَلِمَةً تَخْرُجُ مِنْ اَفْوَاهِهِمْۗ اِنْ يَّقُوْلُوْنَ اِلَّا كَذِبًا",
    "transliteration_en": "Maa lahum bihee min 'ilminw wa laa li aabaaa'ihim; kaburat kalimatan takhruju min afwaahihim; iny yaqooloona illaa kazibaa",
    "transliteration_id": "Mā lahum bihī min ‘ilmiw wa lā li'ābā'ihim, kaburat kalimatan takhruju min afwāhihim, iy yaqūlūna illā każibā(n).",
    "translation_en": "They have no knowledge of it, nor had their fathers. Grave is the word that comes out of their mouths; they speak not except a lie.",
    "translation_id": "Mereka sama sekali tidak mempunyai pengetahuan tentang (hal) itu, begitu pula nenek moyang mereka. Alangkah besar (dosa) perkataan yang keluar dari mulut mereka. Mereka hanya mengatakan (sesuatu) kebohongan belaka."
  },
  {
    "ayat": 6,
    "arabic": "فَلَعَلَّكَ بَاخِعٌ نَّفْسَكَ عَلٰٓى اٰثَارِهِمْ اِنْ لَّمْ يُؤْمِنُوْا بِهٰذَا الْحَدِيْثِ اَسَفًا",
    "transliteration_en": "Fala'allaka baakhi'un nafsaka 'alaaa aasaarihim illam yu;minoo bihaazal hadeesi asafaa",
    "transliteration_id": "Fa la‘allaka bākhi‘un nafsaka ‘alā āṡārihim illam yu'minū bihāżal-ḥadīṡi asafā(n).",
    "translation_en": "Then perhaps you would kill yourself through grief over them, [O Muhammad], if they do not believe in this message, [and] out of sorrow.",
    "translation_id": "Maka, boleh jadi engkau (Nabi Muhammad) akan mencelakakan dirimu karena bersedih hati setelah mereka berpaling sekiranya mereka tidak beriman kepada keterangan ini (Al-Qur’an)."
  },
  {
    "ayat": 7,
    "arabic": "اِنَّا جَعَلْنَا مَا عَلَى الْاَرْضِ زِيْنَةً لَّهَا لِنَبْلُوَهُمْ اَيُّهُمْ اَحْسَنُ عَمَلًا",
    "transliteration_en": "Innaa ja'alnaa ma 'alal ardi zeenatal lahaa linabluwahum ayyuhum ahsanu 'amalaa",
    "transliteration_id": "Innā ja‘alnā mā ‘alal-arḍi zīnatal lahā linabluwahum ayyuhum aḥsanu ‘amalā(n).",
    "translation_en": "Indeed, We have made that which is on the earth adornment for it that We may test them [as to] which of them is best in deed.",
    "translation_id": "Sesungguhnya Kami telah menjadikan apa yang ada di atas bumi sebagai perhiasan baginya agar Kami menguji mereka siapakah di antaranya yang lebih baik perbuatannya."
  },
  {
    "ayat": 8,
    "arabic": "وَاِنَّا لَجٰعِلُوْنَ مَا عَلَيْهَا صَعِيْدًا جُرُزًاۗ",
    "transliteration_en": "Wa innaa lajaa 'iloona maa 'alaihaa sa'aeedan juruzaa",
    "transliteration_id": "Wa innā lajā‘ilūna mā ‘alaihā ṣa‘īdan juruzā(n).",
    "translation_en": "And indeed, We will make that which is upon it [into] a barren ground.",
    "translation_id": "Kami benar-benar akan menjadikan (pula) apa yang di atasnya sebagai tanah yang tandus lagi kering."
  },
  {
    "ayat": 9,
    "arabic": "اَمْ حَسِبْتَ اَنَّ اَصْحٰبَ الْكَهْفِ وَالرَّقِيْمِ كَانُوْا مِنْ اٰيٰتِنَا عَجَبًا",
    "transliteration_en": "Am hasibta anna Ashaabal Kahfi war Raqeemi kaanoo min Aayaatinaa 'ajabaa",
    "transliteration_id": "Am ḥasibta anna aṣḥābal-kahfi war-raqīmi kānū min āyātinā ‘ajabā(n).",
    "translation_en": "Or have you thought that the companions of the cave and the inscription were, among Our signs, a wonder?",
    "translation_id": "Apakah engkau mengira bahwa sesungguhnya para penghuni gua dan (yang mempunyai) raqīm benar-benar merupakan keajaiban di antara tanda-tanda (kebesaran) Kami?"
  },
  {
    "ayat": 10,
    "arabic": "اِذْ اَوَى الْفِتْيَةُ اِلَى الْكَهْفِ فَقَالُوْا رَبَّنَآ اٰتِنَا مِنْ لَّدُنْكَ رَحْمَةً وَّهَيِّئْ لَنَا مِنْ اَمْرِنَا رَشَدًا",
    "transliteration_en": "Iz awal fityatu ilal Kahfi faqaaloo Rabbanaaa aatinaa mil ladunka rahmatanw wa haiyi' lanaa min amrinaa rashadaa",
    "transliteration_id": "Iż awal-fityatu ilal-kahfi fa qālū rabbanā ātinā mil ladunka raḥmataw wa hayyi' lanā min amrinā rasyadā(n).",
    "translation_en": "[Mention] when the youths retreated to the cave and said, \"Our Lord, grant us from Yourself mercy and prepare for us from our affair right guidance.\"",
    "translation_id": "(Ingatlah) ketika pemuda-pemuda itu berlindung ke dalam gua lalu berdoa, “Ya Tuhan kami, anugerahkanlah kepada kami rahmat dari sisi-Mu dan mudahkanlah bagi kami petunjuk untuk segala urusan kami.”"
  },
  {
    "ayat": 11,
    "arabic": "فَضَرَبْنَا عَلٰٓى اٰذَانِهِمْ فِى الْكَهْفِ سِنِيْنَ عَدَدًاۙ",
    "transliteration_en": "Fadarabnaa 'alaaa aazaanihim fil Kahfi seneena 'adadaa",
    "transliteration_id": "Faḍarabnā ‘alā āżānihim fil-kahfi sinīna ‘adadā(n).",
    "translation_en": "So We cast [a cover of sleep] over their ears within the cave for a number of years.",
    "translation_id": "Maka, Kami tutup telinga mereka di dalam gua itu selama bertahun-tahun."
  },
  {
    "ayat": 12,
    "arabic": "ثُمَّ بَعَثْنٰهُمْ لِنَعْلَمَ اَيُّ الْحِزْبَيْنِ اَحْصٰى لِمَا لَبِثُوْٓا اَمَدًا ࣖ",
    "transliteration_en": "Summa ba'asnaahum lina'lama ayyul hizbaini ahsaa limaa labisooo amadaa",
    "transliteration_id": "Ṡumma ba‘aṡnāhum lina‘lama ayyul-ḥizbaini aḥṣā limā labiṡū amadā(n).",
    "translation_en": "Then We awakened them that We might show which of the two factions was most precise in calculating what [extent] they had remained in time.",
    "translation_id": "Kemudian Kami bangunkan mereka supaya Kami mengetahui manakah di antara dua golongan itu yang lebih tepat dalam menghitung berapa lama mereka tinggal (dalam gua itu)."
  },
  {
    "ayat": 13,
    "arabic": "نَحْنُ نَقُصُّ عَلَيْكَ نَبَاَهُمْ بِالْحَقِّۗ اِنَّهُمْ فِتْيَةٌ اٰمَنُوْا بِرَبِّهِمْ وَزِدْنٰهُمْ هُدًىۖ",
    "transliteration_en": "Nahnu naqussu 'alaika naba ahum bilhaqq; innahum fityatun aamanoo bi Rabbihim wa zidnaahum hudaa",
    "transliteration_id": "Naḥnu naquṣṣu ‘alaika naba'ahum bil-ḥaqq(i), innahum fityatun āmanū birabbihim wa zidnāhum hudā(n).",
    "translation_en": "It is We who relate to you, [O Muhammad], their story in truth. Indeed, they were youths who believed in their Lord, and We increased them in guidance.",
    "translation_id": "Kami menceritakan kepadamu (Nabi Muhammad) kisah mereka dengan sebenarnya. Sesungguhnya mereka adalah pemuda-pemuda yang beriman kepada Tuhan mereka dan Kami menambahkan petunjuk kepada mereka."
  },
  {
    "ayat": 14,
    "arabic": "وَّرَبَطْنَا عَلٰى قُلُوْبِهِمْ اِذْ قَامُوْا فَقَالُوْا رَبُّنَا رَبُّ السَّمٰوٰتِ وَالْاَرْضِ لَنْ نَّدْعُوَا۟ مِنْ دُوْنِهٖٓ اِلٰهًا لَّقَدْ قُلْنَآ اِذًا شَطَطًا",
    "transliteration_en": "Wa rabatnaa 'alaa quloo bihim iz qaamoo faqaaloo Rabbunaa Rabbus samaawaati wal ardi lan nad'uwa min dooniheee ilaahal laqad qulnaaa izan shatataa",
    "transliteration_id": "Wa rabaṭnā ‘alā qulūbihim iż qāmū fa qālū rabbunā rabbus-samāwāti wal-arḍi lan nad‘uwa min dūnihī ilāhal laqad qulnā iżan syaṭaṭā(n).",
    "translation_en": "And We made firm their hearts when they stood up and said, \"Our Lord is the Lord of the heavens and the earth. Never will we invoke besides Him any deity. We would have certainly spoken, then, an excessive transgression.",
    "translation_id": "Kami meneguhkan hati mereka ketika mereka berdiri lalu berkata, “Tuhan kami adalah Tuhan langit dan bumi. Kami tidak akan menyeru Tuhan selain Dia. Sungguh, kalau kami berbuat demikian, kami telah mengucapkan perkataan yang sangat jauh dari kebenaran.”"
  },
  {
    "ayat": 15,
    "arabic": "هٰٓؤُلَاۤءِ قَوْمُنَا اتَّخَذُوْا مِنْ دُوْنِهٖٓ اٰلِهَةًۗ  لَوْلَا يَأْتُوْنَ عَلَيْهِمْ بِسُلْطٰنٍۢ بَيِّنٍۗ فَمَنْ اَظْلَمُ مِمَّنِ افْتَرٰى عَلَى اللّٰهِ كَذِبًاۗ",
    "transliteration_en": "Haaa'ulaaa'i qawmunat takhazoo min dooniheee aalihatal law laa yaatoona 'alaihim bisultaanim baiyin; faman azlamu mimmaniftaraa 'alal laahi kazibaa",
    "transliteration_id": "Hā'ulā'i qaumunattakhażū min dūnihī ālihah(tan), lau lā ya'tūna ‘alaihim bisulṭānim bayyin(in), faman aẓlamu mimmaniftarā ‘alallāhi każibā(n).",
    "translation_en": "These, our people, have taken besides Him deities. Why do they not bring for [worship of] them a clear authority? And who is more unjust than one who invents about Allah a lie?\"",
    "translation_id": "(Salah seorang dari para pemuda itu berkata kepada yang lain,) “Mereka itu kaum kami yang telah menjadikan tuhan-tuhan (untuk disembah) selain Dia. Mengapa mereka tidak mengemukakan alasan yang jelas (tentang kepercayaan mereka)? Maka, siapakah yang lebih zalim daripada orang yang mengada-adakan kebohongan terhadap Allah?"
  },
  {
    "ayat": 16,
    "arabic": "وَاِذِ اعْتَزَلْتُمُوْهُمْ وَمَا يَعْبُدُوْنَ اِلَّا اللّٰهَ فَأْوٗٓا اِلَى الْكَهْفِ يَنْشُرْ لَكُمْ رَبُّكُمْ مِّنْ رَّحْمَتِهٖ وَيُهَيِّئْ لَكُمْ مِّنْ اَمْرِكُمْ مِّرْفَقًا",
    "transliteration_en": "Wa izi'tazal tumoohum wa maa ya'budoona illal laaha faawooo ilal kahfi yanshur lakum Rabbukum mir rahmatihee wa yuhaiyi' lakum min amrikum mirfaqa",
    "transliteration_id": "Wa iżi‘tazaltumūhum wa mā ya‘budūna illallāha fa'wū ilal-kahfi yansyur lakum rabbukum mir raḥmatihī wa yuhayyi' lakum min amrikum mirfaqā(n).",
    "translation_en": "[The youths said to one another], \"And when you have withdrawn from them and that which they worship other than Allah, retreat to the cave. Your Lord will spread out for you of His mercy and will prepare for you from your affair facility.\"",
    "translation_id": "Karena kamu juga telah meninggalkan mereka dan apa yang mereka sembah selain Allah, maka berlindunglah ke dalam gua itu. (Dengan demikian,) niscaya Tuhanmu akan melimpahkan sebagian rahmat-Nya kepadamu dan menyediakan bagimu sesuatu yang berguna bagi urusanmu.”"
  },
  {
    "ayat": 17,
    "arabic": "۞ وَتَرَى الشَّمْسَ اِذَا طَلَعَتْ تَّزٰوَرُ عَنْ كَهْفِهِمْ ذَاتَ الْيَمِيْنِ وَاِذَا غَرَبَتْ تَّقْرِضُهُمْ ذَاتَ الشِّمَالِ وَهُمْ فِيْ فَجْوَةٍ مِّنْهُۗ ذٰلِكَ مِنْ اٰيٰتِ اللّٰهِ ۗمَنْ يَّهْدِ اللّٰهُ فَهُوَ الْمُهْتَدِ وَمَنْ يُّضْلِلْ فَلَنْ تَجِدَ لَهٗ وَلِيًّا مُّرْشِدًا ࣖ",
    "transliteration_en": "Wa tarash shamsa izaa tala'at tazaawaru 'an kahfihim zaatal yameeni wa izaa gharabat taqriduhum zaatash shimaali wa hum fee fajwatim minh; zaalika min Aayaatillaah; mai yahdil laahu fahuwal muhtad, wa mai yudlil falan tajida lahoo waliyyam murshidaa",
    "transliteration_id": "Wa tarasy-syamsa iżā ṭala‘at tazāwaru ‘an kahfihim żātal-yamīni wa iżā garabat taqriḍuhum żātasy-syimāli wa hum fī fajwatim minh(u), żālika min āyātillāh(i), may yahdillāhu fa huwal-muhtadi wa may yuḍlil falan tajida lahū waliyyam mursyidā(n).",
    "translation_en": "And [had you been present], you would see the sun when it rose, inclining away from their cave on the right, and when it set, passing away from them on the left, while they were [laying] within an open space thereof. That was from the signs of Allah. He whom Allah guides is the [rightly] guided, but he whom He leaves astray - never will you find for him a protecting guide.",
    "translation_id": "Engkau akan melihat matahari yang ketika terbit condong ke sebelah kanan dari gua mereka dan yang ketika terbenam menjauhi mereka ke sebelah kiri, sedang mereka berada di tempat yang luas di dalamnya (gua itu). Itu adalah sebagian dari tanda-tanda (kebesaran) Allah. Siapa yang Allah memberinya petunjuk, dialah yang mendapat petunjuk. Siapa yang Dia sesatkan, engkau tidak akan menemukan seorang penolong pun yang dapat memberinya petunjuk."
  },
  {
    "ayat": 18,
    "arabic": "وَتَحْسَبُهُمْ اَيْقَاظًا وَّهُمْ رُقُوْدٌ  ۖوَّنُقَلِّبُهُمْ ذَاتَ الْيَمِيْنِ وَذَاتَ الشِّمَالِ ۖوَكَلْبُهُمْ بَاسِطٌ ذِرَاعَيْهِ بِالْوَصِيْدِۗ  لَوِ اطَّلَعْتَ عَلَيْهِمْ لَوَلَّيْتَ مِنْهُمْ فِرَارًا وَّلَمُلِئْتَ مِنْهُمْ رُعْبًا",
    "transliteration_en": "Wa tahsabuhum ayqaazanw wa hum ruqood; wa nuqallibuhum zaatal yameeni wa zaatash shimaali wa kalbuhum baasitun ziraa'ayhi bilwaseed; lawit tala'ta 'alaihim la wallaita minhum firaaranw wa lamuli'ta minhum rubaa",
    "transliteration_id": "Wa taḥsabuhum aiqāẓaw wa hum ruqūd(un), wa nuqallibuhum żātal-yamīni wa żātasy-syimāl(i), wa kalbuhum bāsiṭun żirā‘aihi bil-waṣīd(i), lawiṭṭala‘ta ‘alaihim lawallaita minhum firāraw wa lamuli'ta minhum ru‘bā(n).",
    "translation_en": "And you would think them awake, while they were asleep. And We turned them to the right and to the left, while their dog stretched his forelegs at the entrance. If you had looked at them, you would have turned from them in flight and been filled by them with terror.",
    "translation_id": "Engkau mengira mereka terjaga, padahal mereka tidur. Kami membolak-balikkan mereka ke kanan dan ke kiri, sedangkan anjing mereka membentangkan kedua kaki depannya di muka pintu gua. Seandainya menyaksikan mereka, tentu engkau akan berpaling melarikan (diri) dari mereka dan pasti akan dipenuhi rasa takut terhadap mereka."
  },
  {
    "ayat": 19,
    "arabic": "وَكَذٰلِكَ بَعَثْنٰهُمْ لِيَتَسَاۤءَلُوْا بَيْنَهُمْۗ قَالَ قَاۤىِٕلٌ مِّنْهُمْ كَمْ لَبِثْتُمْۗ قَالُوْا لَبِثْنَا يَوْمًا اَوْ بَعْضَ يَوْمٍۗ قَالُوْا رَبُّكُمْ اَعْلَمُ بِمَا لَبِثْتُمْۗ فَابْعَثُوْٓا اَحَدَكُمْ بِوَرِقِكُمْ هٰذِهٖٓ اِلَى الْمَدِيْنَةِ فَلْيَنْظُرْ اَيُّهَآ اَزْكٰى طَعَامًا فَلْيَأْتِكُمْ بِرِزْقٍ مِّنْهُ وَلْيَتَلَطَّفْ وَلَا يُشْعِرَنَّ بِكُمْ اَحَدًا",
    "transliteration_en": "Wa kazaalika ba'asnaahum liyatasaaa'aloo bainahum; qaala qaaa'ilum minhum kam labistum qaaloo labisnaa yawman aw ba'da yawm; qaaloo Rabbukum a'almu bimaa labistum fab'asooo ahadakum biwariqikum haazihee ilal madeenati falyanzur ayyuhaaa azkaa ta'aaman falyaatikum birizqim minhu walyatalattaf wa laa yush'iranna bikum ahadaa",
    "transliteration_id": "Wa każālika ba‘aṡnāhum liyatasā'alū bainahum, qāla qā'ilum minhum kam labiṡtum, qālū labiṡnā yauman au ba‘ḍa yaum(in), qālū rabbukum a‘lamu bimā labiṡtum, fab‘aṡū aḥadakum biwariqikum hāżihī ilal-madīnati falyanẓur ayyuhā azkā ṭa‘āman falya'tikum  birizqim minhu walyatalaṭṭaf wa lā yusy‘iranna bikum aḥadā(n).",
    "translation_en": "And similarly, We awakened them that they might question one another. Said a speaker from among them, \"How long have you remained [here]?\" They said, \"We have remained a day or part of a day.\" They said, \"Your Lord is most knowing of how long you remained. So send one of you with this silver coin of yours to the city and let him look to which is the best of food and bring you provision from it and let him be cautious. And let no one be aware of you.",
    "translation_id": "Demikianlah, Kami membangunkan mereka agar saling bertanya di antara mereka (sendiri). Salah seorang di antara mereka berkata, “Sudah berapa lama kamu berada (di sini)?” Mereka menjawab, “Kita berada (di sini) sehari atau setengah hari.” Mereka (yang lain lagi) berkata, “Tuhanmu lebih mengetahui berapa lama kamu berada (di sini). Maka, utuslah salah seorang di antara kamu pergi ke kota dengan membawa uang perakmu ini. Hendaklah dia melihat manakah makanan yang lebih baik, lalu membawa sebagian makanan itu untukmu. Hendaklah pula dia berlaku lemah lembut dan jangan sekali-kali memberitahukan keadaanmu kepada siapa pun."
  },
  {
    "ayat": 20,
    "arabic": "اِنَّهُمْ اِنْ يَّظْهَرُوْا عَلَيْكُمْ يَرْجُمُوْكُمْ اَوْ يُعِيْدُوْكُمْ فِيْ مِلَّتِهِمْ وَلَنْ تُفْلِحُوْٓا اِذًا اَبَدًا",
    "transliteration_en": "Innahum iny yazharoo 'alaikum yarjumookum aw yu'eedookum fee millatihim wa lan tuflihooo izan abadaa",
    "transliteration_id": "Innahum iy yaẓharū ‘alaikum yarjumūkum au yu‘īdūkum fī millatihim wa lan tufliḥū iżan abadā(n).",
    "translation_en": "Indeed, if they come to know of you, they will stone you or return you to their religion. And never would you succeed, then - ever.\"",
    "translation_id": "Sesungguhnya jika mereka (mengetahui dan) menangkapmu, niscaya mereka akan melemparimu dengan batu atau memaksamu kembali kepada agama mereka. Jika demikian, niscaya kamu tidak akan beruntung selama-lamanya.”"
  },
  {
    "ayat": 21,
    "arabic": "وَكَذٰلِكَ اَعْثَرْنَا عَلَيْهِمْ لِيَعْلَمُوْٓا اَنَّ وَعْدَ اللّٰهِ حَقٌّ وَّاَنَّ السَّاعَةَ لَا رَيْبَ فِيْهَاۚ اِذْ يَتَنَازَعُوْنَ بَيْنَهُمْ اَمْرَهُمْ فَقَالُوا ابْنُوْا عَلَيْهِمْ بُنْيَانًاۗ رَبُّهُمْ اَعْلَمُ بِهِمْۗ قَالَ الَّذِيْنَ غَلَبُوْا عَلٰٓى اَمْرِهِمْ لَنَتَّخِذَنَّ عَلَيْهِمْ مَّسْجِدًا",
    "transliteration_en": "Wa kazaalika a'sarnaa 'alaihim liya'lamooo anna wa'dal laahi haqqunw wa annas Saa'ata laa raiba feehaa iz yatanaaza'oona bainahum amrahum faqaalub noo 'alaihim bunyaanaa; Rabbuhum a'lamu bihim; qaalal lazeena ghalaboo 'alaaa amrihim lanat takhizanna 'alaihim masjidaa",
    "transliteration_id": "Wa każālika a‘ṡarnā ‘alaihim liya‘lamū anna wa‘dallāhi ḥaqquw wa annas-sā‘ata lā raiba fīhā, iż yatanāza‘ūna bainahum amrahum fa qālubnū ‘alaihim bun-yānā(n), rabbuhum a‘lamu bihim, qālal-lażīna galabū ‘alā amrihim lanattakhiżanna ‘alaihim masjidā(n).",
    "translation_en": "And similarly, We caused them to be found that they [who found them] would know that the promise of Allah is truth and that of the Hour there is no doubt. [That was] when they disputed among themselves about their affair and [then] said, \"Construct over them a structure. Their Lord is most knowing about them.\" Said those who prevailed in the matter, \"We will surely take [for ourselves] over them a masjid.\"",
    "translation_id": "Demikian (pula) Kami perlihatkan (penduduk negeri) kepada mereka agar mengetahui bahwa janji Allah benar dan bahwa (kedatangan) hari Kiamat tidak ada keraguan padanya. (Hal itu terjadi) ketika mereka (penduduk negeri) berselisih tentang urusan (penghuni gua). Kemudian mereka berkata, “Dirikanlah sebuah bangunan di atas (gua itu). Tuhannya lebih mengetahui (keadaan) mereka (penghuni gua).” Orang-orang yang berkuasa atas urusan mereka berkata, “Kami pasti akan mendirikan sebuah masjid di atasnya.”"
  },
  {
    "ayat": 22,
    "arabic": "سَيَقُوْلُوْنَ ثَلٰثَةٌ رَّابِعُهُمْ كَلْبُهُمْۚ وَيَقُوْلُوْنَ خَمْسَةٌ سَادِسُهُمْ كَلْبُهُمْ رَجْمًاۢ بِالْغَيْبِۚ وَيَقُوْلُوْنَ سَبْعَةٌ وَّثَامِنُهُمْ كَلْبُهُمْ ۗقُلْ رَّبِّيْٓ اَعْلَمُ بِعِدَّتِهِمْ مَّا يَعْلَمُهُمْ اِلَّا قَلِيْلٌ ەۗ فَلَا تُمَارِ فِيْهِمْ اِلَّا مِرَاۤءً ظَاهِرًا ۖوَّلَا تَسْتَفْتِ فِيْهِمْ مِّنْهُمْ اَحَدًا ࣖ",
    "transliteration_en": "Sa yaqooloona salaasatur raabi'uhum kalbuhum wa yaqooloona khamsatun saadisuhum kalbuhum rajmam bilghaib; wa yaqooloona sab'atunw wa saaminuhum kalbuhum; qur Rabbeee a'lamu bi'iddatihim maa ya'lamuhum illaa qaleel; falaa tumaari feehim illaa miraaa'an zaahiranw wa laa tastafti feehim minhum ahadaa",
    "transliteration_id": "Sayaqūlūna ṡalāṡatur rābi‘uhum kalbuhum, wa yaqūlūna khamsatun sādisuhum kalbuhum rajmam bil-gaib(i), wa yaqūlūna sab‘atuw wa ṡāminuhum kalbuhum, qur rabbī a‘lamu bi‘iddatihim mā ya‘lamuhum illā qalīl(un), falā tumāri fīhim illā mirā'an ẓāhirā(n), wa lā tastafti fīhim minhum aḥadā(n).",
    "translation_en": "They will say there were three, the fourth of them being their dog; and they will say there were five, the sixth of them being their dog - guessing at the unseen; and they will say there were seven, and the eighth of them was their dog. Say, [O Muhammad], \"My Lord is most knowing of their number. None knows them except a few. So do not argue about them except with an obvious argument and do not inquire about them among [the speculators] from anyone.\"",
    "translation_id": "Kelak (sebagian orang) mengatakan, “(Jumlah mereka) tiga (orang). Yang keempat adalah anjingnya.” (Sebagian lain) mengatakan, “(Jumlah mereka) lima (orang). Yang keenam adalah anjingnya,” sebagai terkaan terhadap yang gaib. (Sebagian lain lagi) mengatakan, “(Jumlah mereka) tujuh (orang). Yang kedelapan adalah anjingnya.” Katakanlah (Nabi Muhammad), “Tuhanku lebih mengetahui jumlah mereka. Tidak ada yang mengetahui (jumlah) mereka kecuali sedikit.” Oleh karena itu, janganlah engkau (Nabi Muhammad) berbantah tentang hal mereka, kecuali perbantahan yang jelas-jelas saja (ringan). Janganlah engkau minta penjelasan tentang mereka (penghuni gua itu) kepada siapa pun dari mereka (Ahlulkitab)."
  },
  {
    "ayat": 23,
    "arabic": "وَلَا تَقُوْلَنَّ لِشَا۟يْءٍ اِنِّيْ فَاعِلٌ ذٰلِكَ غَدًاۙ",
    "transliteration_en": "Wa laa taqoolanna lishai'in innee faa'ilun zaalika ghadaa",
    "transliteration_id": "Wa lā taqūlanna lisyai'in innī fā‘ilun żālika gadā(n).",
    "translation_en": "And never say of anything, \"Indeed, I will do that tomorrow,\"",
    "translation_id": "Jangan sekali-kali engkau mengatakan terhadap sesuatu, “Aku pasti melakukan hal itu besok,”"
  },
  {
    "ayat": 24,
    "arabic": "اِلَّآ اَنْ يَّشَاۤءَ اللّٰهُ ۖوَاذْكُرْ رَّبَّكَ اِذَا نَسِيْتَ وَقُلْ عَسٰٓى اَنْ يَّهْدِيَنِ رَبِّيْ لِاَقْرَبَ مِنْ هٰذَا رَشَدًا",
    "transliteration_en": "Illaaa any yashaaa'al laah; wazkur Rabbaka izaa naseeta wa qul 'asaaa any yahdiyani Rabbee li aqraba min haazaa rashadaa",
    "transliteration_id": "Illā ay yasyā'allāh(u), ważkur rabbaka iżā nasīta wa qul ‘asā ay yahdiyani rabbī li'aqraba  min hāżā rasyadā(n).",
    "translation_en": "Except [when adding], \"If Allah wills.\" And remember your Lord when you forget [it] and say, \"Perhaps my Lord will guide me to what is nearer than this to right conduct.\"",
    "translation_id": "kecuali (dengan mengatakan), “Insyaallah.” Ingatlah kepada Tuhanmu apabila engkau lupa dan katakanlah, “Mudah-mudahan Tuhanku akan memberiku petunjuk kepada yang lebih dekat kebenarannya daripada ini.”"
  },
  {
    "ayat": 25,
    "arabic": "وَلَبِثُوْا فِيْ كَهْفِهِمْ ثَلٰثَ مِائَةٍ سِنِيْنَ وَازْدَادُوْا تِسْعًا",
    "transliteration_en": "Wa labisoo fee kahfihim salaasa mi'atin sineena wazdaadoo tis'aa",
    "transliteration_id": "Wa labiṡū fī kahfihim ṡalāṡa mi'atin sinīna wazdādū tis‘ā(n).",
    "translation_en": "And they remained in their cave for three hundred years and exceeded by nine.",
    "translation_id": "Mereka tinggal dalam gua selama tiga ratus tahun dan ditambah sembilan tahun."
  },
  {
    "ayat": 26,
    "arabic": "قُلِ اللّٰهُ اَعْلَمُ بِمَا لَبِثُوْا ۚ لَهٗ غَيْبُ السَّمٰوٰتِ وَالْاَرْضِۗ اَبْصِرْ بِهٖ وَاَسْمِعْۗ مَا لَهُمْ مِّنْ دُوْنِهٖ مِنْ وَّلِيٍّۗ وَلَا يُشْرِكُ فِيْ حُكْمِهٖٓ اَحَدًا",
    "transliteration_en": "Qulil laahu a'lamu bimaa labisoo lahoo ghaibus samaawaati wal ardi absir bihee wa asmi'; maa lahum min doonihee minw waliyyinw wa laa yushriku fee hukmihee ahadaa",
    "transliteration_id": "Qulillāhu a‘lamu bimā labiṡū, lahū gaibus-samāwāti wal-arḍ(i), abṣir bihī wa asmi‘, mā lahum min dūnihī miw waliyy(in), wa lā yusyriku fī ḥukmihī aḥadā(n).",
    "translation_en": "Say, \"Allah is most knowing of how long they remained. He has [knowledge of] the unseen [aspects] of the heavens and the earth. How Seeing is He and how Hearing! They have not besides Him any protector, and He shares not His legislation with anyone.\"",
    "translation_id": "Katakanlah, “Allah lebih mengetahui berapa lamanya mereka tinggal (di gua). Milik-Nya semua yang tersembunyi di langit dan di bumi. Alangkah terang penglihatan-Nya dan alangkah tajam pendengaran-Nya. Tidak ada seorang pelindung pun bagi mereka selain Dia dan Dia tidak mengambil seorang pun menjadi sekutu-Nya dalam menetapkan keputusan.”"
  },
  {
    "ayat": 27,
    "arabic": "وَاتْلُ مَآ اُوْحِيَ اِلَيْكَ مِنْ كِتَابِ رَبِّكَۗ  لَا مُبَدِّلَ لِكَلِمٰتِهٖۗ وَلَنْ تَجِدَ مِنْ دُوْنِهٖ مُلْتَحَدًا",
    "transliteration_en": "Watlu maaa oohiya ilaika min Kitaabi Rabbika laa mubaddila li Kalimaatihee wa lan tajida min doonihee multahadaa",
    "transliteration_id": "Watlu mā ūḥiya ilaika min kitābi rabbik(a), lā mubaddila likalimātih(ī), wa lan tajida min dūnihī multaḥadā(n).",
    "translation_en": "And recite, [O Muhammad], what has been revealed to you of the Book of your Lord. There is no changer of His words, and never will you find in other than Him a refuge.",
    "translation_id": "Bacakanlah (Nabi Muhammad) apa yang diwahyukan kepadamu, yaitu Kitab Tuhanmu (Al-Qur’an). Tidak ada yang dapat mengubah kalimat-kalimat-Nya dan engkau tidak akan dapat menemukan tempat berlindung selain kepada-Nya."
  },
  {
    "ayat": 28,
    "arabic": "وَاصْبِرْ نَفْسَكَ مَعَ الَّذِيْنَ يَدْعُوْنَ رَبَّهُمْ بِالْغَدٰوةِ وَالْعَشِيِّ يُرِيْدُوْنَ وَجْهَهٗ وَلَا تَعْدُ عَيْنٰكَ عَنْهُمْۚ تُرِيْدُ زِيْنَةَ الْحَيٰوةِ الدُّنْيَاۚ وَلَا تُطِعْ مَنْ اَغْفَلْنَا قَلْبَهٗ عَنْ ذِكْرِنَا وَاتَّبَعَ هَوٰىهُ وَكَانَ اَمْرُهٗ فُرُطًا",
    "transliteration_en": "Wasbir nafsaka ma'al lazeena yad'oona Rabbahum bilghadaati wal'ashiyyi yureedoona Wajhahoo wa laa ta'du 'aynaaka 'anhum tureedu zeenatal hayaatid dunyaa wa laa tuti' man aghfalnaa qalbahoo 'an zikrinaa wattaba'a hawaahu wa kaana amruhoo furutaa",
    "transliteration_id": "Waṣbir nafsaka ma‘al-lażīna yad‘ūna rabbahum bil-gadāti wal-‘asyiyyi yurīdūna wajhahū wa lā ta‘du ‘aināka ‘anhum, turīdu zīnatal-ḥayātid-dun-yā, wa lā tuṭi‘ man agfalnā qalbahū ‘an żikrinā wattaba‘a hawāhu wa kāna amruhū furuṭā(n).",
    "translation_en": "And keep yourself patient [by being] with those who call upon their Lord in the morning and the evening, seeking His countenance. And let not your eyes pass beyond them, desiring adornments of the worldly life, and do not obey one whose heart We have made heedless of Our remembrance and who follows his desire and whose affair is ever [in] neglect.",
    "translation_id": "Bersabarlah engkau (Nabi Muhammad) bersama orang-orang yang menyeru Tuhannya pada pagi dan petang hari dengan mengharap keridaan-Nya. Janganlah kedua matamu berpaling dari mereka karena mengharapkan perhiasan kehidupan dunia. Janganlah engkau mengikuti orang yang hatinya telah Kami lalaikan dari mengingat Kami serta menuruti hawa nafsunya dan keadaannya melewati batas."
  },
  {
    "ayat": 29,
    "arabic": "وَقُلِ الْحَقُّ مِنْ رَّبِّكُمْۗ فَمَنْ شَاۤءَ فَلْيُؤْمِنْ وَّمَنْ شَاۤءَ فَلْيَكْفُرْۚ اِنَّآ اَعْتَدْنَا لِلظّٰلِمِيْنَ نَارًاۙ اَحَاطَ بِهِمْ سُرَادِقُهَاۗ وَاِنْ يَّسْتَغِيْثُوْا يُغَاثُوْا بِمَاۤءٍ كَالْمُهْلِ يَشْوِى الْوُجُوْهَۗ بِئْسَ الشَّرَابُۗ وَسَاۤءَتْ مُرْتَفَقًا",
    "transliteration_en": "Wa qulil haqqu mir Rabbikum faman shaaa'a falyu minw wa man shaaa'a falyakfur; innaaa a'tadnaa lizzaalimeena Naaran ahaata bihim suraadiquhaa; wa iny yastagheesoo yaghaasoo bimaaa'in kalmuhli yashwil wujooh' bi'sash-sharaab; wa saaa'at murtafaqaa",
    "transliteration_id": "Wa qulil-ḥaqqu mir rabbikum, faman syā'a falyu'miw wa man syā'a falyakfur, innā a‘tadnā liẓ-ẓālimīna nārā(n), aḥāṭa bihim surādiquhā, wa iy yastagīṡū yugāṡū bimā'in kal-muhli yasywil-wujūh(a), bi'sasy-syarāb(u), wa sā'at murtafaqā(n).",
    "translation_en": "And say, \"The truth is from your Lord, so whoever wills - let him believe; and whoever wills - let him disbelieve.\" Indeed, We have prepared for the wrongdoers a fire whose walls will surround them. And if they call for relief, they will be relieved with water like murky oil, which scalds [their] faces. Wretched is the drink, and evil is the resting place.",
    "translation_id": "Katakanlah (Nabi Muhammad), “Kebenaran itu datangnya dari Tuhanmu. Maka, siapa yang menghendaki (beriman), hendaklah dia beriman dan siapa yang menghendaki (kufur), biarlah dia kufur.” Sesungguhnya Kami telah menyediakan neraka bagi orang-orang zalim yang gejolaknya mengepung mereka. Jika mereka meminta pertolongan (dengan meminta minum), mereka akan diberi air seperti (cairan) besi yang mendidih yang menghanguskan wajah. (Itulah) seburuk-buruk minuman dan tempat istirahat yang paling jelek."
  },
  {
    "ayat": 30,
    "arabic": "اِنَّ الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ اِنَّا لَا نُضِيْعُ اَجْرَ مَنْ اَحْسَنَ عَمَلًاۚ",
    "transliteration_en": "Innal lazeena aamanoo wa 'amilus saalihaati innaa laa nudee'u ajra man ahsana 'amalaa",
    "transliteration_id": "Innal-lażīna āmanū wa ‘amiluṣ-ṣāliḥāti innā lā nuḍī‘u ajra man aḥsana ‘amalā(n).",
    "translation_en": "Indeed, those who have believed and done righteous deeds - indeed, We will not allow to be lost the reward of any who did well in deeds.",
    "translation_id": "Sesungguhnya mereka yang beriman dan mengerjakan kebajikan, Kami benar-benar tidak akan menyia-nyiakan pahala orang yang mengerjakan perbuatan baik."
  },
  {
    "ayat": 31,
    "arabic": "اُولٰۤىِٕكَ لَهُمْ جَنّٰتُ عَدْنٍ تَجْرِيْ مِنْ تَحْتِهِمُ الْاَنْهٰرُ يُحَلَّوْنَ فِيْهَا مِنْ اَسَاوِرَ مِنْ ذَهَبٍ وَّيَلْبَسُوْنَ ثِيَابًا خُضْرًا مِّنْ سُنْدُسٍ وَّاِسْتَبْرَقٍ مُّتَّكِـِٕيْنَ فِيْهَا عَلَى الْاَرَاۤىِٕكِۗ نِعْمَ الثَّوَابُۗ وَحَسُنَتْ مُرْتَفَقًا ࣖ",
    "transliteration_en": "Ulaaa'ika lahum Jannaatu 'Adnin tajree min tahtihimul anhaaru yuhallawna feehaa min asaawira min zahabinw wa yalbasoona siyaaban khudram min sundusinw wa istabraqim muttaki'eena feehaa 'alal araaa'ik; ni'mas sawaab; wa hasunat murtafaqaa",
    "transliteration_id": "Ulā'ika lahum jannātu ‘adnin tajrī min taḥtihimul-anhāru yuḥallauna fīhā min asāwira min żahabiw wa yalbasūna ṡiyāban khuḍram min sundusiw wa istabraqim muttaki'īna fīhā ‘alal-arā'ik(i), ni‘maṡ-ṡawāb(u), wa ḥasunat murtafaqā(n).",
    "translation_en": "Those will have gardens of perpetual residence; beneath them rivers will flow. They will be adorned therein with bracelets of gold and will wear green garments of fine silk and brocade, reclining therein on adorned couches. Excellent is the reward, and good is the resting place.",
    "translation_id": "Mereka itulah yang memperoleh surga ‘Adn yang mengalir di bawahnya sungai-sungai. (Dalam surga itu) mereka diberi hiasan gelang emas dan mereka memakai pakaian hijau dari sutra halus dan sutra tebal. Mereka duduk-duduk sambil bersandar di atas dipan-dipan yang indah. (Itulah) sebaik-baik pahala dan tempat istirahat yang indah."
  },
  {
    "ayat": 32,
    "arabic": "۞ وَاضْرِبْ لَهُمْ مَّثَلًا رَّجُلَيْنِ جَعَلْنَا لِاَحَدِهِمَا جَنَّتَيْنِ مِنْ اَعْنَابٍ وَّحَفَفْنٰهُمَا بِنَخْلٍ وَّجَعَلْنَا بَيْنَهُمَا زَرْعًاۗ",
    "transliteration_en": "Wadrib lahum masalar rajulaini ja'alnaa li ahadihimaa jannataini min a'naabinw wa hafafnaahumaa binakhilinw wa ja'alnaa bainahumaa zar'aa",
    "transliteration_id": "Waḍrib lahum maṡalar rajulaini ja‘alnā li'aḥadihimā jannataini min a‘nābiw wa ḥafafnāhumā binakhliw wa ja‘alnā bainahumā zar‘ā(n).",
    "translation_en": "And present to them an example of two men: We granted to one of them two gardens of grapevines, and We bordered them with palm trees and placed between them [fields of] crops.",
    "translation_id": "Berikanlah (Nabi Muhammad) kepada mereka sebuah perumpamaan, yaitu dua orang laki-laki. Kami berikan kepada salah satunya (yang kufur) dua kebun anggur. Kami kelilingi kedua kebun itu dengan pohon-pohon kurma dan Kami buatkan ladang di antara kedua (kebun) itu."
  },
  {
    "ayat": 33,
    "arabic": "كِلْتَا الْجَنَّتَيْنِ اٰتَتْ اُكُلَهَا وَلَمْ تَظْلِمْ مِّنْهُ شَيْـًٔاۙ وَّفَجَّرْنَا خِلٰلَهُمَا نَهَرًاۙ",
    "transliteration_en": "Kiltal jannataini aatat ukulahaa wa lam tazlim minhu shai'anw wa fajjarnaa khi laalahumaa naharaa",
    "transliteration_id": "Kiltal-jannataini ātat ukulahā wa lam taẓlim minhu syai'ā(n), wa fajjarnā khilālahumā naharā(n).",
    "translation_en": "Each of the two gardens produced its fruit and did not fall short thereof in anything. And We caused to gush forth within them a river.",
    "translation_id": "Kedua kebun itu menghasilkan buahnya dan tidak berkurang (buahnya) sedikit pun. Kami pun alirkan sungai dengan deras di celah-celah kedua (kebun) itu."
  },
  {
    "ayat": 34,
    "arabic": "وَّكَانَ لَهٗ ثَمَرٌۚ فَقَالَ لِصَاحِبِهٖ وَهُوَ يُحَاوِرُهٗٓ اَنَا۠ اَكْثَرُ مِنْكَ مَالًا وَّاَعَزُّ نَفَرًا",
    "transliteration_en": "Wa kaana lahoo samarun faqaala lisaahibihee wa huwa yuhaawiruhoo ana aksaru minka maalanw wa a'azzu nafaraa",
    "transliteration_id": "Wa kāna lahū ṡamar(un), fa qāla liṣāḥibihī wa huwa yuḥāwiruhū ana akṡaru minka mālaw wa a‘azzu nafarā(n).",
    "translation_en": "And he had fruit, so he said to his companion while he was conversing with him, \"I am greater than you in wealth and mightier in [numbers of] men.\"",
    "translation_id": "Dia (orang kafir itu) juga memiliki kekayaan besar. Dia lalu berkata kepada kawannya (yang beriman) ketika bercakap-cakap dengannya, “Hartaku lebih banyak daripada hartamu dan pengikutku lebih kuat.”"
  },
  {
    "ayat": 35,
    "arabic": "وَدَخَلَ جَنَّتَهٗ وَهُوَ ظَالِمٌ لِّنَفْسِهٖۚ قَالَ مَآ اَظُنُّ اَنْ تَبِيْدَ هٰذِهٖٓ اَبَدًاۙ",
    "transliteration_en": "Wa dakhala jannatahoo wa huwa zaalimul linafsihee qaala maaa azunnu an tabeeda haaziheee abadaa",
    "transliteration_id": "Wa dakhala jannatahū wa huwa ẓālimul linafsih(ī), qāla mā aẓunnu an tabīda hāżihī abadā(n).",
    "translation_en": "And he entered his garden while he was unjust to himself. He said, \"I do not think that this will perish - ever.",
    "translation_id": "Dia memasuki kebunnya dengan sikap menzalimi dirinya sendiri (karena angkuh dan kufur). Dia berkata, “Aku kira kebun ini tidak akan binasa selama-lamanya,"
  },
  {
    "ayat": 36,
    "arabic": "وَّمَآ اَظُنُّ السَّاعَةَ قَاۤىِٕمَةً وَّلَىِٕنْ رُّدِدْتُّ اِلٰى رَبِّيْ لَاَجِدَنَّ خَيْرًا مِّنْهَا مُنْقَلَبًا",
    "transliteration_en": "Wa maaa azunnus Saa'ata qaaa'imatanw wa la'ir rudittu ilaa Rabbee la ajidanna khairam minhaa munqalabaa",
    "transliteration_id": "Wa mā aẓunnus-sā‘ata qā'imataw wa la'ir rudittu ilā rabbī la'ajidanna khairam minhā munqalabā(n).",
    "translation_en": "And I do not think the Hour will occur. And even if I should be brought back to my Lord, I will surely find better than this as a return.\"",
    "translation_id": "aku kira hari Kiamat tidak akan datang dan sekiranya aku dikembalikan kepada Tuhanku, pasti aku akan mendapat tempat kembali yang lebih baik daripada ini.”"
  },
  {
    "ayat": 37,
    "arabic": "قَالَ لَهٗ صَاحِبُهٗ وَهُوَ يُحَاوِرُهٗٓ اَكَفَرْتَ بِالَّذِيْ خَلَقَكَ مِنْ تُرَابٍ ثُمَّ مِنْ نُّطْفَةٍ ثُمَّ سَوّٰىكَ رَجُلًاۗ",
    "transliteration_en": "Qaala lahoo saahibuhoo wa huwa yuhaawiruhooo akafarta billazee khalaqaka min turaabin summa min nutfatin summa sawwaaka rajulaa",
    "transliteration_id": "Qāla lahū ṣāḥibuhū  wa huwa yuḥāwiruhū akafarta bil-lażī khalaqaka min turābin ṡumma min nuṭfatin ṡumma sawwāka rajulā(n).",
    "translation_en": "His companion said to him while he was conversing with him, \"Have you disbelieved in He who created you from dust and then from a sperm-drop and then proportioned you [as] a man?",
    "translation_id": "Kawannya (yang beriman) berkata kepadanya ketika bercakap-cakap dengannya, “Apakah engkau ingkar kepada (Tuhan) yang menciptakanmu dari tanah, kemudian dari setetes air mani, lalu Dia menjadikan engkau seorang laki-laki yang sempurna?"
  },
  {
    "ayat": 38,
    "arabic": "لٰكِنَّا۠ هُوَ اللّٰهُ رَبِّيْ وَلَآ اُشْرِكُ بِرَبِّيْٓ اَحَدًا",
    "transliteration_en": "Laakinaa Huwal laahu Rabbee wa laa ushriku bi Rabbeee ahadaa",
    "transliteration_id": "Lākinna huwallāhu rabbī wa lā usyriku birabbī aḥadā(n).",
    "translation_en": "But as for me, He is Allah, my Lord, and I do not associate with my Lord anyone.",
    "translation_id": "Akan tetapi, aku (percaya bahwa) Dia adalah Allah, Tuhanku, dan aku tidak mempersekutukan sesuatu pun dengan Tuhanku."
  },
  {
    "ayat": 39,
    "arabic": "وَلَوْلَآ اِذْ دَخَلْتَ جَنَّتَكَ قُلْتَ مَا شَاۤءَ اللّٰهُ ۙ لَا قُوَّةَ اِلَّا بِاللّٰهِ ۚاِنْ تَرَنِ اَنَا۠ اَقَلَّ مِنْكَ مَالًا وَّوَلَدًاۚ",
    "transliteration_en": "Wa law laaa iz dakhalta jannataka qulta maa shaaa'al laahu laa quwwata illaa billaah; in tarani ana aqalla minka maalanw wa waladaa",
    "transliteration_id": "Wa lau lā iż dakhalta jannataka qulta mā syā'allāh(u), lā quwwata illā billāh(i), in tarani ana aqalla minka mālaw wa waladā(n).",
    "translation_en": "And why did you, when you entered your garden, not say, 'What Allah willed [has occurred]; there is no power except in Allah '? Although you see me less than you in wealth and children,",
    "translation_id": "Mengapa ketika engkau memasuki kebunmu tidak mengucapkan, “Mā syā’allāh, lā quwwata illā billāh” (sungguh, ini semua kehendak Allah. Tidak ada kekuatan apa pun kecuali dengan [pertolongan] Allah). Jika engkau anggap harta dan keturunanku lebih sedikit daripadamu,"
  },
  {
    "ayat": 40,
    "arabic": "فَعَسٰى رَبِّيْٓ اَنْ يُّؤْتِيَنِ خَيْرًا مِّنْ جَنَّتِكَ وَيُرْسِلَ عَلَيْهَا حُسْبَانًا مِّنَ السَّمَاۤءِ فَتُصْبِحَ صَعِيْدًا زَلَقًاۙ",
    "transliteration_en": "Fa'asaa Rabeee any yu'tiyani khairam min jannatika wa yursila 'alaihaa husbaanam minas samaaa'i fatusbiha sa'eedan zalaqaa",
    "transliteration_id": "Fa ‘asā rabbī ay yu'tiyani khairam min jannatika wa yursila ‘alaihā ḥusbānam minas-samā'i fa tuṣbiḥa ṣa‘īdan zalaqā(n).",
    "translation_en": "It may be that my Lord will give me [something] better than your garden and will send upon it a calamity from the sky, and it will become a smooth, dusty ground,",
    "translation_id": "mudah-mudahan Tuhanku akan memberikan kepadaku (kebun) yang lebih baik daripada kebunmu (ini) dan mengirimkan petir dari langit ke kebunmu sehingga (kebun itu) menjadi tanah yang licin"
  },
  {
    "ayat": 41,
    "arabic": "اَوْ يُصْبِحَ مَاۤؤُهَا غَوْرًا فَلَنْ تَسْتَطِيْعَ لَهٗ طَلَبًا",
    "transliteration_en": "Aw yusbiha maaa'uhaaa ghawran falan tastatee'a lahoo talabaa",
    "transliteration_id": "Au yuṣbiḥa mā'uhā gauran falan tastaṭī‘a lahū ṭalabā(n).",
    "translation_en": "Or its water will become sunken [into the earth], so you would never be able to seek it.\"",
    "translation_id": "atau airnya menjadi surut ke dalam tanah sehingga engkau tidak akan dapat menemukannya lagi.”"
  },
  {
    "ayat": 42,
    "arabic": "وَاُحِيْطَ بِثَمَرِهٖ فَاَصْبَحَ يُقَلِّبُ كَفَّيْهِ عَلٰى مَآ اَنْفَقَ فِيْهَا وَهِيَ خَاوِيَةٌ عَلٰى عُرُوْشِهَا وَيَقُوْلُ يٰلَيْتَنِيْ لَمْ اُشْرِكْ بِرَبِّيْٓ اَحَدًا",
    "transliteration_en": "Wa uheeta bisamarihee faasbaha yuqallibu kaffaihi 'alaa maaa anfaqa feehaa wa hiya khaawiyatun 'alaa 'urooshihaa wa yaqoolu yaalaitanee lam ushrik bi Rabbeee ahadaa",
    "transliteration_id": "Wa uḥīṭa biṡamarihī fa aṣbaḥa yuqallibu kaffaihi ‘alā mā anfaqa fīhā wa hiya khāwiyatun ‘alā ‘urūsyihā wa yaqūlu yā laitanī lam usyrik birabbī aḥadā(n).",
    "translation_en": "And his fruits were encompassed [by ruin], so he began to turn his hands about [in dismay] over what he had spent on it, while it had collapsed upon its trellises, and said, \"Oh, I wish I had not associated with my Lord anyone.\"",
    "translation_id": "Harta kekayaannya dibinasakan, lalu dia membolak-balikkan kedua telapak tangannya (tanda sangat menyesal) terhadap apa yang telah dia belanjakan untuk itu, sedangkan pohon anggur roboh bersama penyangganya dan dia berkata, “Aduhai, seandainya saja dahulu aku tidak mempersekutukan sesuatu pun dengan Tuhanku.”"
  },
  {
    "ayat": 43,
    "arabic": "وَلَمْ تَكُنْ لَّهٗ فِئَةٌ يَّنْصُرُوْنَهٗ مِنْ دُوْنِ اللّٰهِ وَمَا كَانَ مُنْتَصِرًاۗ",
    "transliteration_en": "Wa lam takul lahoo fi'atuny yansuroonahoo min doonil laahi wa maa kaana muntasiraa",
    "transliteration_id": "Wa lam takul lahū fi'atuy yanṣurūnahū min dūnillāhi wa mā kāna muntaṣirā(n).",
    "translation_en": "And there was for him no company to aid him other than Allah, nor could he defend himself.",
    "translation_id": "Tidak ada (lagi) baginya segolongan pun yang dapat menolongnya selain Allah dan dia pun tidak dapat membela dirinya."
  },
  {
    "ayat": 44,
    "arabic": "هُنَالِكَ الْوَلَايَةُ لِلّٰهِ الْحَقِّۗ هُوَ خَيْرٌ ثَوَابًا وَّخَيْرٌ عُقْبًا ࣖ",
    "transliteration_en": "Hunaalikal walaayatu lillaahil haqq; huwa khairun sawaabanw wa khairun 'uqbaa",
    "transliteration_id": "Hunālikal-walāyatu lillāhil-ḥaqq(i), huwa khairun ṡawābaw wa khairun ‘uqbā(n).",
    "translation_en": "There the authority is [completely] for Allah, the Truth. He is best in reward and best in outcome.",
    "translation_id": "Di sana pertolongan itu hanya milik Allah Yang Maha Benar. Dia adalah (pemberi) pahala terbaik dan (pemberi) kesudahan terbaik."
  },
  {
    "ayat": 45,
    "arabic": "وَاضْرِبْ لَهُمْ مَّثَلَ الْحَيٰوةِ الدُّنْيَا كَمَاۤءٍ اَنْزَلْنٰهُ مِنَ السَّمَاۤءِ فَاخْتَلَطَ بِهٖ نَبَاتُ الْاَرْضِ فَاَصْبَحَ هَشِيْمًا تَذْرُوْهُ الرِّيٰحُ ۗوَكَانَ اللّٰهُ عَلٰى كُلِّ شَيْءٍ مُّقْتَدِرًا",
    "transliteration_en": "Wadrib lahum masalal hayaatid dunyaa kamaaa'in anzalnaahu minas samaaa'i fakhtalata bihee nabaatul ardi fa asbaha hasheeman tazroo hur riyaah; wa kaanal laahu 'alaa kulli shai'im muqtadiraa",
    "transliteration_id": "Waḍrib lahum maṡalal-ḥayātid-dun-yā kamā'in anzalnāhu minas-samā'i fakhtalaṭa bihī nabātul-arḍi fa aṣbaḥa hasyīman tażrūhur-riyāḥ(u), wa kānallāhu ‘alā kulli syai'im muqtadirā(n).",
    "translation_en": "And present to them the example of the life of this world, [its being] like rain which We send down from the sky, and the vegetation of the earth mingles with it and [then] it becomes dry remnants, scattered by the winds. And Allah is ever, over all things, Perfect in Ability.",
    "translation_id": "Buatkanlah untuk mereka (umat manusia) perumpamaan kehidupan dunia ini, yaitu ibarat air (hujan) yang Kami turunkan dari langit sehingga menyuburkan tumbuh-tumbuhan di bumi, kemudian (tumbuh-tumbuhan) itu menjadi kering kerontang yang diterbangkan oleh angin. Allah Maha Kuasa atas segala sesuatu."
  },
  {
    "ayat": 46,
    "arabic": "اَلْمَالُ وَالْبَنُوْنَ زِيْنَةُ الْحَيٰوةِ الدُّنْيَاۚ وَالْبٰقِيٰتُ الصّٰلِحٰتُ خَيْرٌ عِنْدَ رَبِّكَ ثَوَابًا وَّخَيْرٌ اَمَلًا",
    "transliteration_en": "Almaalu walbanoona zeenatul hayaatid dunya wal baaqiyaatus saalihaatu khairun 'inda Rabbika sawaabanw wa khairun amalaa",
    "transliteration_id": "Al-mālu wal-banūna zīnatul-ḥayātid-dun-yā, wal-bāqiyātuṣ-ṣāliḥātu khairun ‘inda rabbika ṡawābaw wa khairun amalā(n).",
    "translation_en": "Wealth and children are [but] adornment of the worldly life. But the enduring good deeds are better to your Lord for reward and better for [one's] hope.",
    "translation_id": "Harta dan anak-anak adalah perhiasan kehidupan dunia, sedangkan amal kebajikan yang abadi (pahalanya) adalah lebih baik balasannya di sisi Tuhanmu serta lebih baik untuk menjadi harapan."
  },
  {
    "ayat": 47,
    "arabic": "وَيَوْمَ نُسَيِّرُ الْجِبَالَ وَتَرَى الْاَرْضَ بَارِزَةًۙ وَّحَشَرْنٰهُمْ فَلَمْ نُغَادِرْ مِنْهُمْ اَحَدًاۚ",
    "transliteration_en": "Wa yawma nusaiyirul jibaala wa taral arda baariza tanw wa hasharnaahum falam nughaadir minhum ahadaa",
    "transliteration_id": "Wa yauma nusayyirul-jibāla wa taral-arḍa  bārizah(tan), wa ḥasyarnāhum falam nugādir minhum aḥadā(n).",
    "translation_en": "And [warn of] the Day when We will remove the mountains and you will see the earth prominent, and We will gather them and not leave behind from them anyone.",
    "translation_id": "(Ingatlah) pada hari (ketika) Kami perjalankan gunung-gunung (untuk dihancurkan) dan engkau melihat bumi itu rata. Kami kumpulkan mereka (seluruh manusia) dan tidak Kami tinggalkan seorang pun dari mereka."
  },
  {
    "ayat": 48,
    "arabic": "وَعُرِضُوْا عَلٰى رَبِّكَ صَفًّاۗ  لَقَدْ جِئْتُمُوْنَا كَمَا خَلَقْنٰكُمْ اَوَّلَ مَرَّةٍۢ  ۖبَلْ زَعَمْتُمْ اَلَّنْ نَّجْعَلَ لَكُمْ مَّوْعِدًا",
    "transliteration_en": "Wa 'uridoo 'alaa Rabbika saffaa, laqad ji'tumoonaa kamaa khalaqnaakum awala marrah; bal za'amtum allannaj'ala lakum maw'idaa",
    "transliteration_id": "Wa ‘uriḍū ‘alā rabbika ṣaffā(n), laqad ji'tumūnā kamā khalaqnākum awwala marratim bal za‘amtum allan naj‘ala lakum mau‘idā(n).",
    "translation_en": "And they will be presented before your Lord in rows, [and He will say], \"You have certainly come to Us just as We created you the first time. But you claimed that We would never make for you an appointment.\"",
    "translation_id": "Mereka (akan) dibawa ke hadapan Tuhanmu dengan berbaris. (Allah berfirman,) “Sungguh, kamu telah datang kepada Kami, sebagaimana Kami menciptakan kamu pada pertama kali. Bahkan kamu menganggap bahwa Kami tidak akan menetapkan bagimu waktu (berbangkit untuk memenuhi) perjanjian.”"
  },
  {
    "ayat": 49,
    "arabic": "وَوُضِعَ الْكِتٰبُ فَتَرَى الْمُجْرِمِيْنَ مُشْفِقِيْنَ مِمَّا فِيْهِ وَيَقُوْلُوْنَ يٰوَيْلَتَنَا مَالِ هٰذَا الْكِتٰبِ لَا يُغَادِرُ صَغِيْرَةً وَّلَا كَبِيْرَةً اِلَّآ اَحْصٰىهَاۚ وَوَجَدُوْا مَا عَمِلُوْا حَاضِرًاۗ وَلَا يَظْلِمُ رَبُّكَ اَحَدًا ࣖ",
    "transliteration_en": "Wa wudi'al kitaabu fataral mujrimeena mushfiqeena mimmaa feehi wa yaqooloona yaa wailatanaa maa lihaazal kitaabi laa yughaadiru saghee ratanw wa laa kabeeratan illaaa ahsaahaa; wa wajadoo maa 'amiloo haadiraa; wa laa yazlimu Rabbuka ahadaa",
    "transliteration_id": "Wa wuḍi‘al-kitābu fa taral-mujrimīna musyfiqīna mimmā fīhi wa yaqūlūna yā wailatanā mā lihāżal-kitābi lā yugādiru ṣagīrataw wa lā kabīratan illā aḥṣāhā, wa wajadū mā ‘amilū ḥaḍirā(n), wa lā yaẓlimu rabbuka aḥadā(n).",
    "translation_en": "And the record [of deeds] will be placed [open], and you will see the criminals fearful of that within it, and they will say, \"Oh, woe to us! What is this book that leaves nothing small or great except that it has enumerated it?\" And they will find what they did present [before them]. And your Lord does injustice to no one.",
    "translation_id": "Diletakkanlah kitab (catatan amal pada setiap orang), lalu engkau akan melihat orang yang berdosa merasa ketakutan terhadap apa yang (tertulis) di dalamnya. Mereka berkata, “Betapa celaka kami, kitab apakah ini, tidak meninggalkan yang kecil dan yang besar, kecuali mencatatnya.” Mereka mendapati (semua) apa yang telah mereka kerjakan (tertulis). Tuhanmu tidak menzalimi seorang pun."
  },
  {
    "ayat": 50,
    "arabic": "وَاِذْ قُلْنَا لِلْمَلٰۤىِٕكَةِ اسْجُدُوْا لِاٰدَمَ فَسَجَدُوْٓا اِلَّآ اِبْلِيْسَۗ كَانَ مِنَ الْجِنِّ فَفَسَقَ عَنْ اَمْرِ رَبِّهٖۗ اَفَتَتَّخِذُوْنَهٗ وَذُرِّيَّتَهٗٓ اَوْلِيَاۤءَ مِنْ دُوْنِيْ وَهُمْ لَكُمْ عَدُوٌّۗ بِئْسَ لِلظّٰلِمِيْنَ بَدَلًا",
    "transliteration_en": "Wa iz qulnaa lilma laaa'ikatis judoo li Aadama fasajadooo illaaa Ibleesa kaana minal jinni fafasaqa 'an amri Rabbih; afatattakhizoonahoo wa zurriyatahooo awliyaaa'a min doonee wa hum lakum 'aduww; bi'sa lizzaalimeena badalaa",
    "transliteration_id": "Wa iż qulnā lil-malā'ikatisjudū li'ādama fa sajadū illā iblīs(a), kāna minal-jinni fa fasaqa ‘an amri rabbih(ī), afa tattakhiżūnahū wa żurriyyatahū auliyā'a min dūnī wa hum lakum ‘aduww(un), bi'sa liẓ-ẓālimīna badalā(n).",
    "translation_en": "And [mention] when We said to the angels, \"Prostrate to Adam,\" and they prostrated, except for Iblees. He was of the jinn and departed from the command of his Lord. Then will you take him and his descendants as allies other than Me while they are enemies to you? Wretched it is for the wrongdoers as an exchange.",
    "translation_id": "(Ingatlah) ketika Kami berfirman kepada para malaikat, “Sujudlah kamu semua kepada Adam!” Mereka pun sujud, tetapi Iblis (enggan). Dia termasuk (golongan) jin, kemudian dia mendurhakai perintah Tuhannya. Pantaskah kamu menjadikan dia dan keturunannya sebagai penolong selain Aku, padahal mereka adalah musuhmu? Dia (Iblis) seburuk-buruk pengganti (Allah) bagi orang-orang zalim."
  }
]