[
  {
    "ayat": 101,
    "arabic": "ۨالَّذِيْنَ كَانَتْ اَعْيُنُهُمْ فِيْ غِطَاۤءٍ عَنْ ذِكْرِيْ وَكَانُوْا لَا يَسْتَطِيْعُوْنَ سَمْعًا ࣖ",
    "transliteration_en": "Allazeena kaanat a'yunuhum fee ghitaaa'in 'an zikree wa kaanoo la yastatee'oona sam'aa",
    "transliteration_id": "Allażīna kānat a‘yunuhum fī giṭā'in ‘an żikrī wa kānū lā yastaṭī‘ūna sam‘ā(n).",
    "translation_en": "Those whose eyes had been within a cover [removed] from My remembrance, and they were not able to hear.",
    "translation_id": "(yaitu) orang-orang yang mata (hati)-nya dalam keadaan tertutup dari ingat kepada-Ku dan mereka tidak sanggup mendengar."
  },
  {
    "ayat": 102,
    "arabic": "اَفَحَسِبَ الَّذِيْنَ كَفَرُوْٓا اَنْ يَّتَّخِذُوْا عِبَادِيْ مِنْ دُوْنِيْٓ اَوْلِيَاۤءَ ۗاِنَّآ اَعْتَدْنَا جَهَنَّمَ لِلْكٰفِرِيْنَ نُزُلًا",
    "transliteration_en": "Afahasibal lazeena kafarooo any yattakhizoo 'ibaadee min dooneee awliyaaa'; innaaa a'tadnaa jahannama lilkaafi reena nuzulaa",
    "transliteration_id": "Afaḥasibal-lażīna kafarū ay yattakhiżū ‘ibādī min dūnī auliyā'(a), innā a‘tadnā jahannama lil-kāfirīna nuzulā(n).",
    "translation_en": "Then do those who disbelieve think that they can take My servants instead of Me as allies? Indeed, We have prepared Hell for the disbelievers as a lodging.",
    "translation_id": "Maka, apakah orang-orang yang kufur mengira bahwa mereka (dapat) mengambil hamba-hamba-Ku menjadi penolong selain Aku? Sesungguhnya Kami telah menyediakan (neraka) Jahanam sebagai tempat tinggal bagi orang-orang kafir."
  },
  {
    "ayat": 103,
    "arabic": "قُلْ هَلْ نُنَبِّئُكُمْ بِالْاَخْسَرِيْنَ اَعْمَالًا ۗ",
    "transliteration_en": "Qul hal nunabbi'ukum bilakhsareena a'maalaa",
    "transliteration_id": "Qul hal nunabbi'ukum bil-akhsarīna a‘mālā(n).",
    "translation_en": "Say, [O Muhammad], \"Shall we [believers] inform you of the greatest losers as to [their] deeds?",
    "translation_id": "Katakanlah (Nabi Muhammad), “Apakah perlu kami beri tahukan orang-orang yang paling rugi perbuatannya kepadamu?”"
  },
  {
    "ayat": 104,
    "arabic": "اَلَّذِيْنَ ضَلَّ سَعْيُهُمْ فِى الْحَيٰوةِ الدُّنْيَا وَهُمْ يَحْسَبُوْنَ اَنَّهُمْ يُحْسِنُوْنَ صُنْعًا",
    "transliteration_en": "Allazeena dalla sa'yuhum fil hayaatid dunyaa wa hum yahsaboona annahum yuhsinoona sun'aa",
    "transliteration_id": "Al-lażīna ḍalla sa‘yuhum fil-ḥayātid-dun-yā wa hum yaḥsabūna annahum yuḥsinūna ṣun‘ā(n).",
    "translation_en": "[They are] those whose effort is lost in worldly life, while they think that they are doing well in work.\"",
    "translation_id": "(Yaitu) orang-orang yang sia-sia usahanya dalam kehidupan dunia, sedangkan mereka mengira bahwa mereka berbuat sebaik-baiknya."
  },
  {
    "ayat": 105,
    "arabic": "اُولٰۤىِٕكَ الَّذِيْنَ كَفَرُوْا بِاٰيٰتِ رَبِّهِمْ وَلِقَاۤىِٕهٖ فَحَبِطَتْ اَعْمَالُهُمْ فَلَا نُقِيْمُ لَهُمْ يَوْمَ الْقِيٰمَةِ وَزْنًا",
    "transliteration_en": "Ulaaa'ikal lazeena kafaroo bi aayaati Rabbihim wa liqaaa'ihee fahabitat a'maaluhum falaa nuqeemu lahum Yawmal Qiyaamati waznaa",
    "transliteration_id": "Ulā'ikal-lażīna kafarū bi'āyāti rabbihim wa liqā'ihī fa ḥabiṭat a‘māluhum falā nuqīma lahum yaumal-qiyāmati waznā(n).",
    "translation_en": "Those are the ones who disbelieve in the verses of their Lord and in [their] meeting Him, so their deeds have become worthless; and We will not assign to them on the Day of Resurrection any importance.",
    "translation_id": "Mereka itu adalah orang-orang yang kufur terhadap ayat-ayat Tuhannya dan (kufur pula terhadap) pertemuan dengan-Nya. Maka, amal mereka sia-sia dan Kami tidak memberikan penimbangan terhadap (amal) mereka pada hari Kiamat."
  },
  {
    "ayat": 106,
    "arabic": "ذٰلِكَ جَزَاۤؤُهُمْ جَهَنَّمُ بِمَا كَفَرُوْا وَاتَّخَذُوْٓا اٰيٰتِيْ وَرُسُلِيْ هُزُوًا",
    "transliteration_en": "Zaalika jazaaa'uhum jahannamu bimaa kafaroo wattakhazooo Aayaatee wa Rusulee huzuwaa",
    "transliteration_id": "Żālika jazā'uhum jahannamu bimā kafarū wattakhażū āyātī wa rusulī huzuwā(n).",
    "translation_en": "That is their recompense - Hell - for what they denied and [because] they took My signs and My messengers in ridicule.",
    "translation_id": "Itulah balasan mereka (berupa neraka) Jahanam karena mereka telah kufur serta menjadikan ayat-ayat-Ku dan rasul-rasul-Ku sebagai olok-olokan."
  },
  {
    "ayat": 107,
    "arabic": "اِنَّ الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ كَانَتْ لَهُمْ جَنّٰتُ الْفِرْدَوْسِ نُزُلًا ۙ",
    "transliteration_en": "Innal lazeena aamanoo wa 'amilus saalihaati kaanat lahum Jannaatul Firdawsi nuzulaa",
    "transliteration_id": "Innal-lażīna āmanū wa ‘amiluṣ-ṣāliḥāti kānat lahum jannātul-firdausi nuzulā(n).",
    "translation_en": "Indeed, those who have believed and done righteous deeds - they will have the Gardens of Paradise as a lodging,",
    "translation_id": "Sesungguhnya orang-orang yang beriman dan beramal saleh memperoleh surga Firdaus sebagai tempat tinggal."
  },
  {
    "ayat": 108,
    "arabic": "خٰلِدِيْنَ فِيْهَا لَا يَبْغُوْنَ عَنْهَا حِوَلًا",
    "transliteration_en": "Khaalideena feeha la yabghoona 'anhaa hiwalaa",
    "transliteration_id": "Khālidīna fīhā lā yabgūna ‘anhā ḥiwalā(n).",
    "translation_en": "Wherein they abide eternally. They will not desire from it any transfer.",
    "translation_id": "Mereka kekal di dalamnya, mereka tidak ingin pindah dari sana."
  },
  {
    "ayat": 109,
    "arabic": "قُلْ لَّوْ كَانَ الْبَحْرُ مِدَادًا لِّكَلِمٰتِ رَبِّيْ لَنَفِدَ الْبَحْرُ قَبْلَ اَنْ تَنْفَدَ كَلِمٰتُ رَبِّيْ وَلَوْ جِئْنَا بِمِثْلِهٖ مَدَدًا",
    "transliteration_en": "Qul law kaanal bahru midaadal lik Kalimaati Rabbee lanafidal bahru qabla an tanfada Kalimaatu Rabbee wa law ji'naa bimislihee madadaa",
    "transliteration_id": "Qul lau kānal-baḥru midādal likalimāti rabbī lanafidal-baḥru qabla an tanfada kalimāṭu rabbī wa lau ji'nā bimiṡlihī madadā(n).",
    "translation_en": "Say, \"If the sea were ink for [writing] the words of my Lord, the sea would be exhausted before the words of my Lord were exhausted, even if We brought the like of it as a supplement.\"",
    "translation_id": "Katakanlah (Nabi Muhammad), “Seandainya lautan menjadi tinta untuk (menulis) kalimat-kalimat Tuhanku, niscaya habislah lautan itu sebelum kalimat-kalimat Tuhanku selesai (ditulis) meskipun Kami datangkan tambahan sebanyak itu (pula).”"
  },
  {
    "ayat": 110,
    "arabic": "قُلْ اِنَّمَآ اَنَا۠ بَشَرٌ مِّثْلُكُمْ يُوْحٰٓى اِلَيَّ اَنَّمَآ اِلٰهُكُمْ اِلٰهٌ وَّاحِدٌۚ فَمَنْ كَانَ يَرْجُوْا لِقَاۤءَ رَبِّهٖ فَلْيَعْمَلْ عَمَلًا صَالِحًا وَّلَا يُشْرِكْ بِعِبَادَةِ رَبِّهٖٓ اَحَدًا ࣖ",
    "transliteration_en": "Qul innamaaa ana basharum mislukum yoohaaa ilaiya annamaa ilaahukum Ilaahunw Waahid; faman kaana yarjoo liqaaa'a Rabbihee falya'mal 'amalan saalihanw wa laa yushrik bi'ibaadati Rabbiheee ahadaa",
    "transliteration_id": "Qul innamā ana basyarum miṡlukum yūḥā ilayya annamā ilāhukum ilāhuw wāḥid(un), faman kāna yarjū liqā'a rabbihī falya‘mal ‘amalan ṣāliḥaw wa lā yusyrik bi‘ibādati rabbihī aḥadā(n).",
    "translation_en": "Say, \"I am only a man like you, to whom has been revealed that your god is one God. So whoever would hope for the meeting with his Lord - let him do righteous work and not associate in the worship of his Lord anyone.\"",
    "translation_id": "Katakanlah (Nabi Muhammad), “Sesungguhnya aku ini hanya seorang manusia seperti kamu yang diwahyukan kepadaku bahwa Tuhan kamu adalah Tuhan Yang Maha Esa.” Siapa yang mengharapkan pertemuan dengan Tuhannya hendaklah melakukan amal saleh dan tidak menjadikan apa dan siapa pun sebagai sekutu dalam beribadah kepada Tuhannya."
  }
]