[
  {
    "ayat": 51,
    "arabic": "۞ مَآ اَشْهَدْتُّهُمْ خَلْقَ السَّمٰوٰتِ وَالْاَرْضِ وَلَا خَلْقَ اَنْفُسِهِمْۖ وَمَا كُنْتُ مُتَّخِذَ الْمُضِلِّيْنَ عَضُدًا",
    "transliteration_en": "Maaa ash hattuhum khalqas samaawaati wal ardi wa laa khalqa anfusihim wa maa kuntu muttakizal mudilleena 'adudaa",
    "transliteration_id": "Mā asyhattuhum khalqas-samāwāti wal-arḍi wa lā khalqa anfusihim, wa mā kuntu muttakhiżal-muḍillīna ‘aḍudā(n).",
    "translation_en": "I did not make them witness to the creation of the heavens and the earth or to the creation of themselves, and I would not have taken the misguiders as assistants.",
    "translation_id": "Aku tidak menghadirkan mereka (Iblis dan anak cucunya) untuk menyaksikan penciptaan langit dan bumi, tidak (pula) penciptaan diri mereka sendiri. Aku tidak menjadikan mereka yang telah menyesatkan itu sebagai penolong."
  },
  {
    "ayat": 52,
    "arabic": "وَيَوْمَ يَقُوْلُ نَادُوْا شُرَكَاۤءِيَ الَّذِيْنَ زَعَمْتُمْ فَدَعَوْهُمْ فَلَمْ يَسْتَجِيْبُوْا لَهُمْ وَجَعَلْنَا بَيْنَهُمْ مَّوْبِقًا",
    "transliteration_en": "Wa Yawma yaqoolu naadoo shurakaaa'i yal lazeena za'amtum fada'awhum falam yastajeeboo lahum wa ja'alnaa bainahum maw biqaa",
    "transliteration_id": "Wa yauma yaqūlu nādū syurakā'iyal-lażīna za‘amtum fa da‘auhum falam yastajībū lahum wa ja‘alnā bainahum maubiqā(n).",
    "translation_en": "And [warn of] the Day when He will say, \"Call 'My partners' whom you claimed,\" and they will invoke them, but they will not respond to them. And We will put between them [a valley of] destruction.",
    "translation_id": "(Ingatlah) pada hari (ketika) Dia berfirman, “Panggillah sekutu-sekutu-Ku yang kamu anggap (dapat menyelamatkanmu dari siksaan-Ku).” Mereka lalu memanggilnya, tetapi mereka (sekutu-sekutu itu) tidak membalas (seruan) mereka. Kami jadikan di antara mereka (yang menyembah dan disembah) tempat kebinasaan (neraka)."
  },
  {
    "ayat": 53,
    "arabic": "وَرَاَ الْمُجْرِمُوْنَ النَّارَ فَظَنُّوْٓا اَنَّهُمْ مُّوَاقِعُوْهَا وَلَمْ يَجِدُوْا عَنْهَا مَصْرِفًا ࣖ",
    "transliteration_en": "Wa ra al mujrimoonan Naara fazannooo annahum muwaaqi'oohaa wa lam yajidoo 'anhaa masrifaa",
    "transliteration_id": "Wa ra'al-mujrimūnan nāra fa ẓannū annahum muwāqi‘ūhā wa lam yajidū ‘anhā maṣrifā(n).",
    "translation_en": "And the criminals will see the Fire and will be certain that they are to fall therein. And they will not find from it a way elsewhere.",
    "translation_id": "Orang yang berdosa itu melihat neraka, lalu merasa yakin akan jatuh ke dalamnya (seketika itu juga). Mereka tidak menemukan tempat berpaling darinya."
  },
  {
    "ayat": 54,
    "arabic": "وَلَقَدْ صَرَّفْنَا فِيْ هٰذَا الْقُرْاٰنِ لِلنَّاسِ مِنْ كُلِّ مَثَلٍۗ وَكَانَ الْاِنْسَانُ اَكْثَرَ شَيْءٍ جَدَلًا",
    "transliteration_en": "Wa laqad sarrafnaa fee haazal quraani linnaasi mn kulli masal; wa kaanal insaanu aksara shai'in jadalaa",
    "transliteration_id": "Wa laqad ṣarrafnā fī hāżal-qur'āni lin-nāsi min kulli maṡal(in), wa kānal-insānu akṡara syai'in jadalā(n).",
    "translation_en": "And We have certainly diversified in this Qur'an for the people from every [kind of] example; but man has ever been, most of anything, [prone to] dispute.",
    "translation_id": "Sungguh, Kami telah menjelaskan segala perumpamaan dengan berbagai macam cara dan berulang-ulang kepada manusia dalam Al-Qur’an ini. Akan tetapi, manusia adalah (makhluk) yang paling banyak membantah."
  },
  {
    "ayat": 55,
    "arabic": "وَمَا مَنَعَ النَّاسَ اَنْ يُّؤْمِنُوْٓا اِذْ جَاۤءَهُمُ الْهُدٰى وَيَسْتَغْفِرُوْا رَبَّهُمْ اِلَّآ اَنْ تَأْتِيَهُمْ سُنَّةُ الْاَوَّلِيْنَ اَوْ يَأْتِيَهُمُ الْعَذَابُ قُبُلًا",
    "transliteration_en": "Wa maa mana'an naasa any yu'minooo iz jaaa'ahumul hudaa wa yastaghfiroo Rabbahum illaaa an taatiyahum sunnatul awwaleena aw yaatiyahumul 'azaabu qubulaa",
    "transliteration_id": "Wa mā mana‘an-nāsa ay yu'minū iż jā'ahumul-hudā wa yastagfirū rabbahum illā an ta'tiyahum sunnatul-awwalīna au ya'tiyahumul-‘ażābu qubulā(n).",
    "translation_en": "And nothing has prevented the people from believing when guidance came to them and from asking forgiveness of their Lord except that there [must] befall them the [accustomed] precedent of the former peoples or that the punishment should come [directly] before them.",
    "translation_id": "Tidak ada yang menghalangi manusia untuk beriman ketika petunjuk telah datang kepada mereka dan untuk memohon ampunan kepada Tuhannya, kecuali akan datang kepada mereka ketetapan (Allah yang telah berlaku pada) umat yang terdahulu atau datang kepada mereka azab yang nyata."
  },
  {
    "ayat": 56,
    "arabic": "وَمَا نُرْسِلُ الْمُرْسَلِيْنَ اِلَّا مُبَشِّرِيْنَ وَمُنْذِرِيْنَۚ وَيُجَادِلُ الَّذِيْنَ كَفَرُوْا بِالْبَاطِلِ لِيُدْحِضُوْا بِهِ الْحَقَّ وَاتَّخَذُوْٓا اٰيٰتِيْ وَمَآ اُنْذِرُوْا هُزُوًا",
    "transliteration_en": "Wa maa nursilul mursaleena illaa mubashshireena wa munzireen; wa yujaadilul lazeena kafaroo bilbaatili liyudhidoo bihil haqqa wattakhazooo Aayaatee wa maaa unziroo huzuwaa",
    "transliteration_id": "Wa mā nursilul-mursalīna illā mubasysyirīna wa munżirīn(a), wa yujādilul-lażīna kafarū bil-bāṭili liyudḥiḍū bihil-ḥaqqa wattakhażū āyātī wa mā unżirū huzuwā(n).",
    "translation_en": "And We send not the messengers except as bringers of good tidings and warners. And those who disbelieve dispute by [using] falsehood to [attempt to] invalidate thereby the truth and have taken My verses, and that of which they are warned, in ridicule.",
    "translation_id": "Kami tidak mengutus rasul-rasul melainkan sebagai pembawa kabar gembira dan pemberi peringatan. (Akan tetapi,) orang-orang yang kufur membantah dengan (cara) yang batil agar dengan itu mereka dapat melenyapkan sesuatu yang hak (kebenaran). Mereka menjadikan ayat-ayat-Ku dan apa yang diperingatkan terhadap mereka sebagai olok-olok."
  },
  {
    "ayat": 57,
    "arabic": "وَمَنْ اَظْلَمُ مِمَّنْ ذُكِّرَ بِاٰيٰتِ رَبِّهٖ فَاَعْرَضَ عَنْهَا وَنَسِيَ مَا قَدَّمَتْ يَدَاهُۗ اِنَّا جَعَلْنَا عَلٰى قُلُوْبِهِمْ اَكِنَّةً اَنْ يَّفْقَهُوْهُ وَفِيْٓ اٰذَانِهِمْ وَقْرًاۗ وَاِنْ تَدْعُهُمْ اِلَى الْهُدٰى فَلَنْ يَّهْتَدُوْٓا اِذًا اَبَدًا",
    "transliteration_en": "Wa man azlamu mimman zukkira bi ayaati Rabbihee fa-a'rada 'anhaa wa nasiya maa qaddamat yadaah; innaa ja'alnaa 'alaa quloobihim akinnatan any yafqahoohu wa feee aazaanihim waqraa; wa in tad'uhum ilal hudaa falany yahtadooo izan abadaa",
    "transliteration_id": "Wa man aẓlamu mimman żukkira bi'āyāti rabbihī fa a‘raḍa ‘anhā wa nasiya mā qaddamat yadāh(u), innā ja‘alnā ‘alā qulūbihim akinnatan ay yafqahūhu  wa fī āżānihim waqrā(n), wa in tad‘uhum ilal-hudā falay yahtadū iżan abadā(n).",
    "translation_en": "And who is more unjust than one who is reminded of the verses of his Lord but turns away from them and forgets what his hands have put forth? Indeed, We have placed over their hearts coverings, lest they understand it, and in their ears deafness. And if you invite them to guidance - they will never be guided, then - ever.",
    "translation_id": "Siapakah yang lebih zalim daripada orang yang telah diperingatkan dengan ayat-ayat Tuhannya, lalu dia berpaling darinya dan melupakan apa yang telah dikerjakan oleh kedua tangannya? Sesungguhnya Kami telah meletakkan penutup pada hati mereka, (sehingga mereka tidak) memahaminya dan (meletakkan pula) sumbatan di telinga mereka. (Dengan demikian,) kendatipun engkau (Nabi Muhammad) menyeru mereka kepada petunjuk, niscaya mereka tidak akan mendapat petunjuk untuk selama-lamanya."
  },
  {
    "ayat": 58,
    "arabic": "وَرَبُّكَ الْغَفُوْرُ ذُو الرَّحْمَةِۗ  لَوْ يُؤَاخِذُهُمْ بِمَا كَسَبُوْا لَعَجَّلَ لَهُمُ الْعَذَابَۗ بَلْ لَّهُمْ مَّوْعِدٌ لَّنْ يَّجِدُوْا مِنْ دُوْنِهٖ مَوْىِٕلًا",
    "transliteration_en": "Wa Rabbukal Ghafooru zur rahmati law yu'aakhi zuhum bimaa kasaboo la'ajala lahumul 'azaab; bal lahum maw'idul lany yajidoo min doonihee maw'ilaa",
    "transliteration_id": "Wa rabbukal-gafūru żur-raḥmah(ti), lau yu'ākhiżuhum bimā kasabū la‘ajjala lahumul-‘ażāb(a), bal lahum mau‘idul lay yajidū min dūnihī mau'ilā(n).",
    "translation_en": "And your Lord is the Forgiving, full of mercy. If He were to impose blame upon them for what they earned, He would have hastened for them the punishment. Rather, for them is an appointment from which they will never find an escape.",
    "translation_id": "Tuhanmu Maha Pengampun lagi Maha Pemilik rahmat. Seandainya Dia hendak menyiksa mereka karena perbuatan mereka, tentu Dia akan menyegerakan siksa bagi mereka. Akan tetapi, bagi mereka ada waktu (untuk mendapat siksa) yang mereka tidak akan menemukan tempat berlindung selain-Nya."
  },
  {
    "ayat": 59,
    "arabic": "وَتِلْكَ الْقُرٰٓى اَهْلَكْنٰهُمْ لَمَّا ظَلَمُوْا وَجَعَلْنَا لِمَهْلِكِهِمْ مَّوْعِدًا ࣖ",
    "transliteration_en": "Wa tkal quraaa ahlak nahum lammaa zulamoo wa ja'alnaa limahlikihim maw'idaa",
    "transliteration_id": "Wa tilkal-qurā ahlaknāhum lammā ẓalamū wa ja‘alnā limahlikihim mau‘idā(n).",
    "translation_en": "And those cities - We destroyed them when they wronged, and We made for their destruction an appointed time.",
    "translation_id": "(Penduduk) negeri-negeri itu telah Kami binasakan ketika mereka berbuat zalim dan telah Kami tetapkan waktu bagi kebinasaan mereka."
  },
  {
    "ayat": 60,
    "arabic": "وَاِذْ قَالَ مُوْسٰى لِفَتٰىهُ لَآ اَبْرَحُ حَتّٰٓى  اَبْلُغَ مَجْمَعَ الْبَحْرَيْنِ اَوْ اَمْضِيَ حُقُبًا",
    "transliteration_en": "Wa iz qaalaa Moosaa lifataahu laaa abrahu hattaaa ablugha majma'al bahrayni aw amdiya huqubaa",
    "transliteration_id": "Wa iż qāla mūsā lifatāhu lā abraḥu ḥattā abluga majma‘al-baḥraini au amḍiya ḥuqubā(n).",
    "translation_en": "And [mention] when Moses said to his servant, \"I will not cease [traveling] until I reach the junction of the two seas or continue for a long period.\"",
    "translation_id": "(Ingatlah) ketika Musa berkata kepada pembantunya, “Aku tidak akan berhenti (berjalan) sebelum sampai ke pertemuan dua laut atau aku akan berjalan (terus sampai) bertahun-tahun.”"
  },
  {
    "ayat": 61,
    "arabic": "فَلَمَّا بَلَغَا مَجْمَعَ بَيْنِهِمَا نَسِيَا حُوْتَهُمَا فَاتَّخَذَ سَبِيْلَهٗ فِى الْبَحْرِ سَرَبًا",
    "transliteration_en": "Falammaa balaghaa majma'a bainihimaa nasiyaa hootahumaa fattakhaza sabeelahoo fil bahri sarabaa",
    "transliteration_id": "Falammā balagā majma‘a bainihimā nasiyā ḥūtahumā fattakhaża sabīlahū fil-baḥri sarabā(n).",
    "translation_en": "But when they reached the junction between them, they forgot their fish, and it took its course into the sea, slipping away.",
    "translation_id": "Ketika mereka sampai ke pertemuan dua laut, mereka lupa ikannya, lalu (ikan mereka) melompat mengambil jalan ke laut itu."
  },
  {
    "ayat": 62,
    "arabic": "فَلَمَّا جَاوَزَا قَالَ لِفَتٰىهُ اٰتِنَا غَدَاۤءَنَاۖ  لَقَدْ لَقِيْنَا مِنْ سَفَرِنَا هٰذَا نَصَبًا",
    "transliteration_en": "Falammaa jaawazaa qaala lifataahu aatinaa ghadaaa'anaa laqad laqeena min safarinaa haazaa nasabaa",
    "transliteration_id": "Falammā jāwazā qāla lifatāhu ātinā gadā'anā laqad laqīnā min safarinā hāżā naṣabā(n).",
    "translation_en": "So when they had passed beyond it, [Moses] said to his boy, \"Bring us our morning meal. We have certainly suffered in this, our journey, [much] fatigue.\"",
    "translation_id": "Ketika mereka telah melewati (tempat itu), Musa berkata kepada pembantunya, “Bawalah kemari makanan kita. Sungguh, kita benar-benar telah merasa letih karena perjalanan kita ini.”"
  },
  {
    "ayat": 63,
    "arabic": "قَالَ اَرَاَيْتَ اِذْ اَوَيْنَآ اِلَى الصَّخْرَةِ فَاِنِّيْ نَسِيْتُ الْحُوْتَۖ وَمَآ اَنْسٰىنِيْهُ اِلَّا الشَّيْطٰنُ اَنْ اَذْكُرَهٗۚ وَاتَّخَذَ سَبِيْلَهٗ فِى الْبَحْرِ عَجَبًا",
    "transliteration_en": "Qaala ara'ayta iz awainaaa ilas sakhrati fa innee naseetul hoota wa maaa ansaaneehu illash Shaitaanu an azkurah; wattakhaza sabeelahoo fil bahri'ajabaa",
    "transliteration_id": "Qāla ara'aita iż awainā ilaṣ-ṣakhrati fa innī nasītul-ḥūt(a), wa mā ansānīhu illasy-syaiṭanu an ażkurah(ū), wattakhaża sabīlahū fil-baḥri ‘ajabā(n).",
    "translation_en": "He said, \"Did you see when we retired to the rock? Indeed, I forgot [there] the fish. And none made me forget it except Satan - that I should mention it. And it took its course into the sea amazingly\".",
    "translation_id": "Dia (pembantunya) menjawab, “Tahukah engkau ketika kita mencari tempat berlindung di batu tadi, sesungguhnya aku lupa (bercerita tentang) ikan itu dan tidak ada yang membuatku lupa untuk mengingatnya, kecuali setan. (Ikan) itu mengambil jalannya ke laut dengan cara yang aneh.”"
  },
  {
    "ayat": 64,
    "arabic": "قَالَ ذٰلِكَ مَا كُنَّا نَبْغِۖ فَارْتَدَّا عَلٰٓى اٰثَارِهِمَا قَصَصًاۙ",
    "transliteration_en": "Qaala zaalika maa kunnaa nabgh; fartaddaa 'alaa aasaari him maa qasasaa",
    "transliteration_id": "Qāla żālika mā kunnā nabg(i), fartaddā ‘alā āṡārihimā qaṣaṣā(n).",
    "translation_en": "[Moses] said, \"That is what we were seeking.\" So they returned, following their footprints.",
    "translation_id": "Dia (Musa) berkata, “Itulah yang kita cari.” Lalu keduanya kembali dan menyusuri jejak mereka semula."
  },
  {
    "ayat": 65,
    "arabic": "فَوَجَدَا عَبْدًا مِّنْ عِبَادِنَآ اٰتَيْنٰهُ رَحْمَةً مِّنْ عِنْدِنَا وَعَلَّمْنٰهُ مِنْ لَّدُنَّا عِلْمًا",
    "transliteration_en": "Fa wajadaa 'abdam min 'ibaadinaaa aatainaahu Rahmatam min 'indinaa wa 'allamnaahu mil ladunnaa 'ilmaa",
    "transliteration_id": "Fa wajadā ‘abdam min ‘ibādinā ātaināhu raḥmatam min ‘indinā wa ‘allamnāhu mil ladunnā ‘ilmā(n).",
    "translation_en": "And they found a servant from among Our servants to whom we had given mercy from us and had taught him from Us a [certain] knowledge.",
    "translation_id": "Lalu, mereka berdua bertemu dengan seorang dari hamba-hamba Kami yang telah Kami anugerahi rahmat kepadanya dari sisi Kami. Kami telah mengajarkan ilmu kepadanya dari sisi Kami."
  },
  {
    "ayat": 66,
    "arabic": "قَالَ لَهٗ مُوْسٰى هَلْ اَتَّبِعُكَ عَلٰٓى اَنْ تُعَلِّمَنِ مِمَّا عُلِّمْتَ رُشْدًا",
    "transliteration_en": "Qaala lahoo Moosaa hal attabi'uka 'alaaa an tu'allimani mimmaa 'ullimta rushdaa",
    "transliteration_id": "Qāla lahū mūsā hal attabi‘uka ‘alā an tu‘allimani mimmā ‘ullimta rusydā(n).",
    "translation_en": "Moses said to him, \"May I follow you on [the condition] that you teach me from what you have been taught of sound judgement?\"",
    "translation_id": "Musa berkata kepadanya, “Bolehkah aku mengikutimu agar engkau mengajarkan kepadaku (ilmu yang benar) dari apa yang telah diajarkan kepadamu (untuk menjadi) petunjuk?”"
  },
  {
    "ayat": 67,
    "arabic": "قَالَ اِنَّكَ لَنْ تَسْتَطِيْعَ مَعِيَ صَبْرًا",
    "transliteration_en": "Qaalaa innaka lan tastatee'a ma'iya sabraa",
    "transliteration_id": "Qāla innaka lan tastaṭī‘a ma‘iya ṣabrā(n).",
    "translation_en": "He said, \"Indeed, with me you will never be able to have patience.",
    "translation_id": "Dia menjawab, “Sesungguhnya engkau tidak akan sanggup bersabar bersamaku."
  },
  {
    "ayat": 68,
    "arabic": "وَكَيْفَ تَصْبِرُ عَلٰى مَا لَمْ تُحِطْ بِهٖ خُبْرًا",
    "transliteration_en": "Wa kaifa tasbiru 'alaa maa lam tuhit bihee khubraa",
    "transliteration_id": "Wa kaifa taṣbiru ‘alā mā lam tuḥiṭ bihī khubrā(n).",
    "translation_en": "And how can you have patience for what you do not encompass in knowledge?\"",
    "translation_id": "Bagaimana engkau akan sanggup bersabar atas sesuatu yang engkau belum mempunyai pengetahuan yang cukup tentangnya?”"
  },
  {
    "ayat": 69,
    "arabic": "قَالَ سَتَجِدُنِيْٓ اِنْ شَاۤءَ اللّٰهُ صَابِرًا وَّلَآ اَعْصِيْ لَكَ اَمْرًا",
    "transliteration_en": "Qaala satajiduneee in shaa 'al laahu saabiranw wa laaa a'see laka amraa",
    "transliteration_id": "Qāla satajidunī in syā'allāhu ṣābiraw wa lā a‘ṣī laka amrā(n).",
    "translation_en": "[Moses] said, \"You will find me, if Allah wills, patient, and I will not disobey you in [any] order.\"",
    "translation_id": "Dia (Musa) berkata, “Insyaallah engkau akan mendapatiku sebagai orang yang sabar dan aku tidak akan menentangmu dalam urusan apa pun.”"
  },
  {
    "ayat": 70,
    "arabic": "قَالَ فَاِنِ اتَّبَعْتَنِيْ فَلَا تَسْـَٔلْنِيْ عَنْ شَيْءٍ حَتّٰٓى اُحْدِثَ لَكَ مِنْهُ ذِكْرًا ࣖ",
    "transliteration_en": "Qaala fa init taba'tanee falaa tas'alnee 'an shai'in hattaaa uhdisa laka minhu zikraa",
    "transliteration_id": "Qāla fa inittaba‘tanī falā tas'alnī ‘an syai'in ḥattā uḥdiṡa laka minhu żikrā(n).",
    "translation_en": "He said, \"Then if you follow me, do not ask me about anything until I make to you about it mention.\"",
    "translation_id": "Dia berkata, “Jika engkau mengikutiku, janganlah engkau menanyakan kepadaku tentang apa pun sampai aku menerangkannya kepadamu.”"
  },
  {
    "ayat": 71,
    "arabic": "فَانْطَلَقَاۗ حَتّٰٓى اِذَا رَكِبَا فِى السَّفِيْنَةِ خَرَقَهَاۗ قَالَ اَخَرَقْتَهَا لِتُغْرِقَ اَهْلَهَاۚ  لَقَدْ جِئْتَ شَيْـًٔا اِمْرًا",
    "transliteration_en": "Fantalaqaa hattaaa izaa rakibaa fis safeenati kharaqahaa qaala akharaqtahaa litughriqa ahlahaa laqad ji'ta shai'an imraa",
    "transliteration_id": "Fanṭalaqā, ḥattā iżā rakibā fis-safīnati khara ahā, qāla akharaqtahā litugriqa ahlahā, laqad ji'ta syai'an imrā(n).",
    "translation_en": "So they set out, until when they had embarked on the ship, al-Khidh r tore it open. [Moses] said, \"Have you torn it open to drown its people? You have certainly done a grave thing.\"",
    "translation_id": "Kemudian, berjalanlah keduanya, hingga ketika menaiki perahu, dia melubanginya. Dia (Musa) berkata, “Apakah engkau melubanginya untuk menenggelamkan penumpangnya? Sungguh, engkau telah berbuat suatu kesalahan yang besar.”"
  },
  {
    "ayat": 72,
    "arabic": "قَالَ اَلَمْ اَقُلْ اِنَّكَ لَنْ تَسْتَطِيْعَ مَعِيَ صَبْرًا",
    "transliteration_en": "Qaala alam aqul innaka lan tastatee'a ma'iya sabraa",
    "transliteration_id": "Qāla alam aqul innaka lan tastaṭī‘a ma‘iya ṣabrā(n).",
    "translation_en": "[Al-Khidh r] said, \"Did I not say that with me you would never be able to have patience?\"",
    "translation_id": "Dia berkata, “Bukankah sudah aku katakan bahwa sesungguhnya engkau tidak akan sanggup bersabar bersamaku?”"
  },
  {
    "ayat": 73,
    "arabic": "قَالَ لَا تُؤَاخِذْنِيْ بِمَا نَسِيْتُ وَلَا تُرْهِقْنِيْ مِنْ اَمْرِيْ عُسْرًا",
    "transliteration_en": "Qaala laa tu'aakhiznee bimaa naseetu wa laa turhiqnee min amree 'usraa",
    "transliteration_id": "Qāla lā tu'ākhiżnī bimā nasītu wa lā turhiqnī min amrī ‘usrā(n).",
    "translation_en": "[Moses] said, \"Do not blame me for what I forgot and do not cover me in my matter with difficulty.\"",
    "translation_id": "Dia (Musa) berkata, “Janganlah engkau menghukumku karena kelupaanku dan janganlah engkau membebaniku dengan kesulitan dalam urusanku.”"
  },
  {
    "ayat": 74,
    "arabic": "فَانْطَلَقَا ۗحَتّٰٓى اِذَا لَقِيَا غُلٰمًا فَقَتَلَهٗ ۙقَالَ اَقَتَلْتَ نَفْسًا زَكِيَّةً ۢبِغَيْرِ نَفْسٍۗ  لَقَدْ جِئْتَ شَيْـًٔا نُّكْرًا ۔",
    "transliteration_en": "Fantalaqaa hattaa izaa laqiyaa ghulaaman faqatalahoo qaala aqatalta nafsan zakiy yatam bighairi nafs; laqad ji'ta shai'an nukraa",
    "transliteration_id": "Fanṭalaqā, ḥattā iżā laqiyā gulāman fa qatalah(ū), qāla aqatalta nafsan zakiyyatam bigairi nafs(in), laqad ji'ta syai'an nukrā(n).",
    "translation_en": "So they set out, until when they met a boy, al-Khidh r killed him. [Moses] said, \"Have you killed a pure soul for other than [having killed] a soul? You have certainly done a deplorable thing.\"",
    "translation_id": "Kemudian, berjalanlah keduanya, hingga ketika berjumpa dengan seorang anak, dia membunuhnya. Dia (Musa) berkata, “Mengapa engkau membunuh jiwa yang bersih bukan karena dia membunuh orang lain? Sungguh, engkau benar-benar telah melakukan sesuatu yang sangat mungkar.”"
  },
  {
    "ayat": 75,
    "arabic": "۞ قَالَ اَلَمْ اَقُلْ لَّكَ اِنَّكَ لَنْ تَسْتَطِيْعَ مَعِيَ صَبْرًا",
    "transliteration_en": "Qaala alam aqul laka innaka lan tastatee'a ma'iya sabraa",
    "transliteration_id": "Qāla alam aqul laka innaka lan tastaṭī‘a ma‘iya ṣabrā(n).",
    "translation_en": "[Al-Khidh r] said, \"Did I not tell you that with me you would never be able to have patience?\"",
    "translation_id": "Dia berkata, “Bukankah sudah kukatakan kepadamu bahwa sesungguhnya engkau tidak akan mampu bersabar bersamaku?”"
  },
  {
    "ayat": 76,
    "arabic": "قَالَ اِنْ سَاَلْتُكَ عَنْ شَيْءٍۢ بَعْدَهَا فَلَا تُصٰحِبْنِيْۚ قَدْ بَلَغْتَ مِنْ لَّدُنِّيْ عُذْرًا",
    "transliteration_en": "Qaala in sa altuka 'an shai'im ba'dahaa falaa tusaahibnee qad balaghta mil ladunnee 'uzraa",
    "transliteration_id": "Qāla in sa'altuka ‘an syai'im ba‘dahā falā tuṣāḥibnī, qad balagta mil ladunnī ‘użrā(n).",
    "translation_en": "[Moses] said, \"If I should ask you about anything after this, then do not keep me as a companion. You have obtained from me an excuse.\"",
    "translation_id": "Dia (Musa) berkata, “Jika aku bertanya kepadamu tentang sesuatu setelah ini, jangan lagi engkau memperbolehkan aku menyertaimu. Sungguh engkau telah mencapai batas (yang wajar dalam) memberikan uzur (maaf) kepadaku.”"
  },
  {
    "ayat": 77,
    "arabic": "فَانْطَلَقَا ۗحَتّٰىٓ اِذَآ اَتَيَآ اَهْلَ قَرْيَةِ ِۨاسْتَطْعَمَآ اَهْلَهَا فَاَبَوْا اَنْ يُّضَيِّفُوْهُمَا فَوَجَدَا فِيْهَا جِدَارًا يُّرِيْدُ اَنْ يَّنْقَضَّ فَاَقَامَهٗ ۗقَالَ لَوْ شِئْتَ لَتَّخَذْتَ عَلَيْهِ اَجْرًا",
    "transliteration_en": "Fantalaqaa hattaaa izaaa atayaaa ahla qaryatinis tat'amaaa ahlahaa fa abaw any yudaiyifoohumaa fawajadaa feehaa jidaarany yureedu any yanqadda fa aqaamah; qaala law shi'ta lattakhazta 'alaihi ajraa",
    "transliteration_id": "Fanṭalaqā, ḥattā iżā atayā ahla qaryatinistaṭ‘amā ahlahā fa abau ay yuḍayyifūhumā fa wajadā fīhā jidāray yurīdu ay yaqaḍḍa fa aqāmah(ū), qāla lau syi'ta lattakhażta ‘alaihi ajrā(n).",
    "translation_en": "So they set out, until when they came to the people of a town, they asked its people for food, but they refused to offer them hospitality. And they found therein a wall about to collapse, so al-Khidh r restored it. [Moses] said, \"If you wished, you could have taken for it a payment.\"",
    "translation_id": "Lalu, keduanya berjalan, hingga ketika keduanya sampai ke penduduk suatu negeri, mereka berdua meminta dijamu oleh penduduknya, tetapi mereka tidak mau menjamu keduanya. Kemudian, keduanya mendapati dinding (rumah) yang hampir roboh di negeri itu, lalu dia menegakkannya. Dia (Musa) berkata, “Jika engkau mau, niscaya engkau dapat meminta imbalan untuk itu.”"
  },
  {
    "ayat": 78,
    "arabic": "قَالَ هٰذَا فِرَاقُ بَيْنِيْ وَبَيْنِكَۚ سَاُنَبِّئُكَ بِتَأْوِيْلِ مَا لَمْ تَسْتَطِعْ عَّلَيْهِ صَبْرًا",
    "transliteration_en": "Qaala haazaa firaaqu bainee wa bainik; sa unabi 'uka bitaaweeli maa lam tastati' 'alaihi sabraa",
    "transliteration_id": "Qāla hāżā firāqu bainī wa bainik(a), sa'unabbi'uka bita'wīli mā lam tastaṭī‘ ‘alaihi ṣabrā(n).",
    "translation_en": "[Al-Khidh r] said, \"This is parting between me and you. I will inform you of the interpretation of that about which you could not have patience.",
    "translation_id": "Dia berkata, “Inilah (waktu) perpisahan antara aku dan engkau. Aku akan memberitahukan kepadamu makna sesuatu yang engkau tidak mampu bersabar terhadapnya."
  },
  {
    "ayat": 79,
    "arabic": "اَمَّا السَّفِيْنَةُ فَكَانَتْ لِمَسٰكِيْنَ يَعْمَلُوْنَ فِى الْبَحْرِ فَاَرَدْتُّ اَنْ اَعِيْبَهَاۗ وَكَانَ وَرَاۤءَهُمْ مَّلِكٌ يَّأْخُذُ كُلَّ سَفِيْنَةٍ غَصْبًا",
    "transliteration_en": "Ammas safeenatu fakaanat limasaakeena ya'maloona fil bahri fa arattu an a'eebahaa wa kaana waraaa' ahum malikuny yaakhuzu kulla safeenatin ghasbaa",
    "transliteration_id": "Ammas-safīnatu fa kānat limasākīna ya‘malūna fil-baḥri fa arattu an a‘ībahā, wa kāna warā'ahum malikuy ya'khużu kulla safīnatin gaṣbā(n).",
    "translation_en": "As for the ship, it belonged to poor people working at sea. So I intended to cause defect in it as there was after them a king who seized every [good] ship by force.",
    "translation_id": "Adapun perahu itu adalah milik orang-orang miskin yang bekerja di laut. Maka, aku bermaksud membuatnya cacat karena di hadapan mereka ada seorang raja (zalim) yang mengambil setiap perahu (yang baik) secara paksa."
  },
  {
    "ayat": 80,
    "arabic": "وَاَمَّا الْغُلٰمُ فَكَانَ اَبَوَاهُ مُؤْمِنَيْنِ فَخَشِيْنَآ اَنْ يُّرْهِقَهُمَا طُغْيَانًا وَّكُفْرًا ۚ",
    "transliteration_en": "Wa aammal ghulaamu fakaana abawaahu mu'minaini fakhasheenaaa any yurhiqa humaa tughyaananw wa kufraa",
    "transliteration_id": "Wa ammal-gulāmu fa kāna abawāhu mu'minaini fa khasyīnā ay yurhiqahumā ṭugyānaw wa kufrā(n).",
    "translation_en": "And as for the boy, his parents were believers, and we feared that he would overburden them by transgression and disbelief.",
    "translation_id": "Adapun anak itu (yang aku bunuh), kedua orang tuanya mukmin dan kami khawatir kalau dia akan memaksa kedua orang tuanya untuk durhaka dan kufur."
  },
  {
    "ayat": 81,
    "arabic": "فَاَرَدْنَآ اَنْ يُّبْدِلَهُمَا رَبُّهُمَا خَيْرًا مِّنْهُ زَكٰوةً وَّاَقْرَبَ رُحْمًا",
    "transliteration_en": "Faradnaa any yubdila humaa Rabbuhumaa khairam minhu zakaatanw wa aqraba ruhmaa",
    "transliteration_id": "Fa aradnā ay yubdilahumā rabbuhumā khairam minhu zakātaw wa aqraba ruḥmā(n).",
    "translation_en": "So we intended that their Lord should substitute for them one better than him in purity and nearer to mercy.",
    "translation_id": "Maka, kami menghendaki bahwa Tuhan mereka menggantinya (dengan seorang anak lain) yang lebih baik kesuciannya daripada (anak) itu dan lebih sayang (kepada ibu bapaknya)."
  },
  {
    "ayat": 82,
    "arabic": "وَاَمَّا الْجِدَارُ فَكَانَ لِغُلٰمَيْنِ يَتِيْمَيْنِ فِى الْمَدِيْنَةِ وَكَانَ تَحْتَهٗ كَنْزٌ لَّهُمَا وَكَانَ اَبُوْهُمَا صَالِحًا ۚفَاَرَادَ رَبُّكَ اَنْ يَّبْلُغَآ اَشُدَّهُمَا وَيَسْتَخْرِجَا كَنْزَهُمَا رَحْمَةً مِّنْ رَّبِّكَۚ وَمَا فَعَلْتُهٗ عَنْ اَمْرِيْۗ ذٰلِكَ تَأْوِيْلُ مَا لَمْ تَسْطِعْ عَّلَيْهِ صَبْرًاۗ  ࣖ",
    "transliteration_en": "Wa ammal jidaaru fakaana lighulaamaini yateemaini fil madeenati wa kaana tahtahoo kanzul lahumaa wa kaana aboohumaa saalihan fa araada Rabbuka any yablughaaa ashuddahumaa wa yastakhrijaa kanzahumaa rahmatam mir Rabbik; wa maa fa'altuhoo 'an amree; zaalika taaweelu maa lam tasti' 'alaihi sabra",
    "transliteration_id": "Wa ammal-jidāru fa kāna ligulāmaini yatīmaini fil-madīnati wa kāna taḥtahū kanzul lahumā wa kāna abūhumā ṣāliḥā(n), fa arāda rabbuka ay yablugā asyuddahumā wa yastakhrijā kanzahumā raḥmatam mir rabbik(a), wa mā fa‘altuhū ‘an amrī, żālika ta'wīlu mā lam tasṭī‘ ‘alaihi ṣabrā(n).",
    "translation_en": "And as for the wall, it belonged to two orphan boys in the city, and there was beneath it a treasure for them, and their father had been righteous. So your Lord intended that they reach maturity and extract their treasure, as a mercy from your Lord. And I did it not of my own accord. That is the interpretation of that about which you could not have patience.\"",
    "translation_id": "Adapun dinding (rumah) itu adalah milik dua anak yatim di kota itu dan di bawahnya tersimpan harta milik mereka berdua, sedangkan ayah mereka adalah orang saleh. Maka, Tuhanmu menghendaki agar keduanya mencapai usia dewasa dan mengeluarkan simpanannya itu sebagai rahmat dari Tuhanmu. Aku tidak melakukannya berdasarkan kemauanku (sendiri). Itulah makna sesuatu yang engkau tidak mampu bersabar terhadapnya.”"
  },
  {
    "ayat": 83,
    "arabic": "وَيَسْـَٔلُوْنَكَ عَنْ ذِى الْقَرْنَيْنِۗ قُلْ سَاَتْلُوْا عَلَيْكُمْ مِّنْهُ ذِكْرًا ۗ",
    "transliteration_en": "Wa yas'aloonaka 'an Zil Qarnaini qul sa atloo 'alaikum minhu zikraa",
    "transliteration_id": "Wa yas'alūnaka ‘an żil qarnain(i), qul sa'atlū ‘alaikum minhu żikrā(n).",
    "translation_en": "And they ask you, [O Muhammad], about Dhul-Qarnayn. Say, \"I will recite to you about him a report.\"",
    "translation_id": "Mereka bertanya kepadamu (Nabi Muhammad) tentang Zulqarnain. Katakanlah, “Akan aku bacakan kepadamu sebagian kisahnya.”"
  },
  {
    "ayat": 84,
    "arabic": "اِنَّا مَكَّنَّا لَهٗ فِى الْاَرْضِ وَاٰتَيْنٰهُ مِنْ كُلِّ شَيْءٍ سَبَبًا ۙ",
    "transliteration_en": "Innaa makkannaa lahoo fil ardi wa aatainaahu min kulli shai'in sababaa",
    "transliteration_id": "Innā makkannā lahū fil-arḍi wa ātaināhu min kulli syai'in sababā(n).",
    "translation_en": "Indeed We established him upon the earth, and We gave him to everything a way.",
    "translation_id": "Sesungguhnya Kami telah memberi kedudukan kepadanya di bumi dan Kami telah memberikan jalan kepadanya (untuk mencapai) segala sesuatu."
  },
  {
    "ayat": 85,
    "arabic": "فَاَتْبَعَ سَبَبًا",
    "transliteration_en": "Fa atba'a sababaa",
    "transliteration_id": "Fa atba‘a sababā(n).",
    "translation_en": "So he followed a way",
    "translation_id": "Maka, dia menyusuri suatu jalan."
  },
  {
    "ayat": 86,
    "arabic": "حَتّٰىٓ اِذَا بَلَغَ مَغْرِبَ الشَّمْسِ وَجَدَهَا تَغْرُبُ فِيْ عَيْنٍ حَمِئَةٍ وَّوَجَدَ عِنْدَهَا قَوْمًا ەۗ قُلْنَا يٰذَا الْقَرْنَيْنِ اِمَّآ اَنْ تُعَذِّبَ وَاِمَّآ اَنْ تَتَّخِذَ فِيْهِمْ حُسْنًا",
    "transliteration_en": "Hattaaa izaa balagha maghribash shamsi wajadahaaa taghrubu fee 'aynin hami'a tinw wa wajada 'indahaa qawmaa; qulnaa yaa Zal Qarnaini immaaa an tu'az ziba wa immaaa an tattakhiza feehim husnaa",
    "transliteration_id": "Ḥattā iżā balaga magribasy-syamsi wajadahā tagrubu fī ‘ainin ḥami'atiw wa wajada ‘indahā qaumā(n), qulnā yā żal-qarnaini immā an tu‘ażżiba wa immā an tattakhiża fīhim ḥusnā(n).",
    "translation_en": "Until, when he reached the setting of the sun, he found it [as if] setting in a spring of dark mud, and he found near it a people. Allah said, \"O Dhul-Qarnayn, either you punish [them] or else adopt among them [a way of] goodness.\"",
    "translation_id": "Hingga ketika telah sampai ke tempat terbenamnya matahari, dia mendapatinya terbenam di dalam mata air panas lagi berlumpur hitam. Di sana dia menemukan suatu kaum (yang tidak mengenal agama). Kami berfirman, “Wahai Zulqarnain, engkau boleh menghukum atau berbuat kebaikan kepada mereka (dengan mengajak mereka beriman).”"
  },
  {
    "ayat": 87,
    "arabic": "قَالَ اَمَّا مَنْ ظَلَمَ فَسَوْفَ نُعَذِّبُهٗ ثُمَّ يُرَدُّ اِلٰى رَبِّهٖ فَيُعَذِّبُهٗ عَذَابًا نُّكْرًا",
    "transliteration_en": "Qaala amaa man zalama fasawfa nu'azzibuhoo summa yuraddu ilaa Rabbihee fa yu 'azzibuhoo azaaban nukraa",
    "transliteration_id": "Qāla ammā man ẓalama fa saufa nu‘ażżibuhū ṡumma yuraddu ilā rabbihī fa yu‘ażżibuhū ‘ażāban nukrā(n).",
    "translation_en": "He said, \"As for one who wrongs, we will punish him. Then he will be returned to his Lord, and He will punish him with a terrible punishment.",
    "translation_id": "Dia (Zulqarnain) berkata, “Adapun orang yang berbuat zalim akan kami hukum. Lalu, dia akan dikembalikan kepada Tuhannya. Kemudian, Dia mengazabnya dengan azab yang sangat keras."
  },
  {
    "ayat": 88,
    "arabic": "وَاَمَّا مَنْ اٰمَنَ وَعَمِلَ صَالِحًا فَلَهٗ جَزَاۤءً ۨالْحُسْنٰىۚ وَسَنَقُوْلُ لَهٗ مِنْ اَمْرِنَا يُسْرًا ۗ",
    "transliteration_en": "Wa ammaa man aamana wa 'amila saalihan falahoo jazaaa'anil husnaa wa sanaqoolu lahoo min amrinaa yusraa",
    "transliteration_id": "Wa ammā man āmana wa ‘amila ṣāliḥan fa lahū jazā'anil-ḥusnā, wa sanaqūlu lahū min amrinā yusrā(n).",
    "translation_en": "But as for one who believes and does righteousness, he will have a reward of Paradise, and we will speak to him from our command with ease.\"",
    "translation_id": "Adapun orang yang beriman dan beramal saleh mendapat (pahala) yang terbaik sebagai balasan dan akan kami sampaikan kepadanya perintah kami yang mudah-mudah.”"
  },
  {
    "ayat": 89,
    "arabic": "ثُمَّ اَتْبَعَ سَبَبًا",
    "transliteration_en": "Summa atba'a sababaa",
    "transliteration_id": "Ṡumma  atba‘a sababā(n).",
    "translation_en": "Then he followed a way",
    "translation_id": "Kemudian, dia mengikuti suatu jalan (yang lain)."
  },
  {
    "ayat": 90,
    "arabic": "حَتّٰىٓ اِذَا بَلَغَ مَطْلِعَ الشَّمْسِ وَجَدَهَا تَطْلُعُ عَلٰى قَوْمٍ لَّمْ نَجْعَلْ لَّهُمْ مِّنْ دُوْنِهَا سِتْرًا ۙ",
    "transliteration_en": "Hattaaa izaa balagha matli'ash shamsi wajdahaa tatlu'u alaa qawmil lam naj'al lahum min doonihaa sitraa",
    "transliteration_id": "Ḥattā iżā balaga maṭli‘asy-syamsi wajadahā taṭlu‘u ‘alā qaumil lam naj‘al lahum min dūnihā sitrā(n).",
    "translation_en": "Until, when he came to the rising of the sun, he found it rising on a people for whom We had not made against it any shield.",
    "translation_id": "Hingga ketika sampai di posisi terbitnya matahari (arah timur), dia mendapatinya terbit pada suatu kaum yang tidak Kami buatkan suatu pelindung bagi mereka dari (cahaya) matahari itu."
  },
  {
    "ayat": 91,
    "arabic": "كَذٰلِكَۗ وَقَدْ اَحَطْنَا بِمَا لَدَيْهِ خُبْرًا",
    "transliteration_en": "Kazaalika wa qad ahatnaa bimaa ladaihi khubraa",
    "transliteration_id": "Każālik(a), wa  qad aḥaṭnā bimā ladaihi khubrā(n).",
    "translation_en": "Thus. And We had encompassed [all] that he had in knowledge.",
    "translation_id": "Demikianlah (kisahnya). Sungguh, Kami mengetahui segala sesuatu yang ada padanya (Zulqarnain)."
  },
  {
    "ayat": 92,
    "arabic": "ثُمَّ اَتْبَعَ سَبَبًا",
    "transliteration_en": "Summa atba'a sababaa",
    "transliteration_id": "Ṡumma atba‘a sababā(n).",
    "translation_en": "Then he followed a way",
    "translation_id": "Kemudian, dia mengikuti suatu jalan (yang lain lagi)."
  },
  {
    "ayat": 93,
    "arabic": "حَتّٰىٓ اِذَا بَلَغَ بَيْنَ السَّدَّيْنِ وَجَدَ مِنْ دُوْنِهِمَا قَوْمًاۙ  لَّا يَكَادُوْنَ يَفْقَهُوْنَ قَوْلًا",
    "transliteration_en": "Hattaaa izaa balagha bainas saddaini wajada min doonihimaa qawmal laa yakaa doona yafqahoona qawlaa",
    "transliteration_id": "Ḥattā iżā balaga bainas-saddaini wajada min dūnihimā qaumal lā yakādūna yafqahūna qaulā(n).",
    "translation_en": "Until, when he reached [a pass] between two mountains, he found beside them a people who could hardly understand [his] speech.",
    "translation_id": "Hingga ketika sampai di antara dua gunung, dia mendapati di balik keduanya (kedua gunung itu) suatu kaum yang hampir tidak memahami pembicaraan."
  },
  {
    "ayat": 94,
    "arabic": "قَالُوْا يٰذَا الْقَرْنَيْنِ اِنَّ يَأْجُوْجَ وَمَأْجُوْجَ مُفْسِدُوْنَ فِى الْاَرْضِ فَهَلْ نَجْعَلُ لَكَ خَرْجًا عَلٰٓى اَنْ تَجْعَلَ بَيْنَنَا وَبَيْنَهُمْ سَدًّا",
    "transliteration_en": "Qaaloo yaa Zal qarnaini inna Yaajooja wa Maajooja mufsidoona fil ardi fahal naj'alu laka kharjan 'alaaa an taj'ala bainanaa wa bainahum saddas",
    "transliteration_id": "Qālū yā żal-qarnaini inna ya'jūja wa ma'jūja mufsidūna fil-arḍi  fahal naj‘alu laka kharjan ‘alā an taj‘alā bainanā wa bainahum saddā(n).",
    "translation_en": "They said, \"O Dhul-Qarnayn, indeed Gog and Magog are [great] corrupters in the land. So may we assign for you an expenditure that you might make between us and them a barrier?\"",
    "translation_id": "Mereka berkata, “Wahai Zulqarnain, sesungguhnya Ya’juj dan Ma’juj adalah (bangsa) pembuat kerusakan di bumi, bolehkah kami memberimu imbalan agar engkau membuatkan tembok penghalang antara kami dan mereka?”"
  },
  {
    "ayat": 95,
    "arabic": "قَالَ مَا مَكَّنِّيْ فِيْهِ رَبِّيْ خَيْرٌ فَاَعِيْنُوْنِيْ بِقُوَّةٍ اَجْعَلْ بَيْنَكُمْ وَبَيْنَهُمْ رَدْمًا ۙ",
    "transliteration_en": "Qaala maa makkannee feehi Rabbee khairun fa-a'eenoonee biquwwatin aj'al bainakum wa bainahum radmaa",
    "transliteration_id": "Qāla mā makkannī fīhi rabbī fa a‘īnūnī biquwwatin aj‘al bainakum wa bainahum radmā(n).",
    "translation_en": "He said, \"That in which my Lord has established me is better [than what you offer], but assist me with strength; I will make between you and them a dam.",
    "translation_id": "Dia (Zulqarnain) berkata, “Apa yang telah dikuasakan kepadaku oleh Tuhanku lebih baik (daripada apa yang kamu tawarkan). Maka, bantulah aku dengan kekuatan agar aku dapat membuatkan tembok penghalang antara kamu dan mereka."
  },
  {
    "ayat": 96,
    "arabic": "اٰتُوْنِيْ زُبَرَ الْحَدِيْدِۗ حَتّٰىٓ اِذَا سَاوٰى بَيْنَ الصَّدَفَيْنِ قَالَ انْفُخُوْا ۗحَتّٰىٓ اِذَا جَعَلَهٗ نَارًاۙ قَالَ اٰتُوْنِيْٓ اُفْرِغْ عَلَيْهِ قِطْرًا ۗ",
    "transliteration_en": "Aatoonee zubaral hadeed, hattaaa izaa saawaa bainas sadafaini qaalan fukhoo hattaaa izaa ja'alahoo naaran qaala aatooneee ufrigh 'alaihi qitraa",
    "transliteration_id": "Ātūnī zubaral-ḥadīd(i), ḥattā iżā sāwā bainaṣ-ṣadafaini qālanfukhū, ḥattā iżā ja‘alahū nārā(n), qāla ātūnī ufrig ‘alaihi qiṭrā(n).",
    "translation_en": "Bring me sheets of iron\" - until, when he had leveled [them] between the two mountain walls, he said, \"Blow [with bellows],\" until when he had made it [like] fire, he said, \"Bring me, that I may pour over it molten copper.\"",
    "translation_id": "Berilah aku potongan-potongan besi.” Hingga ketika (potongan besi) itu telah (terpasang) sama rata dengan kedua (puncak) gunung itu, dia (Zulqarnain) berkata, “Tiuplah (api itu).” Ketika (besi) itu sudah menjadi (merah seperti) api, dia pun berkata, “Berilah aku tembaga (yang mendidih) agar kutuangkan ke atasnya (besi panas itu).”"
  },
  {
    "ayat": 97,
    "arabic": "فَمَا اسْطَاعُوْٓا اَنْ يَّظْهَرُوْهُ وَمَا اسْتَطَاعُوْا لَهٗ نَقْبًا",
    "transliteration_en": "Famas taa'ooo any yazharoohu wa mastataa'oo lahoo naqbaa",
    "transliteration_id": "Famasṭā‘ū ay yaẓharūhu wa mastaṭā‘ū lahū naqbā(n).",
    "translation_en": "So Gog and Magog were unable to pass over it, nor were they able [to effect] in it any penetration.",
    "translation_id": "Maka, mereka (Ya’juj dan Ma’juj) tidak mampu mendakinya dan tidak mampu (pula) melubanginya."
  },
  {
    "ayat": 98,
    "arabic": "قَالَ هٰذَا رَحْمَةٌ مِّنْ رَّبِّيْۚ فَاِذَا جَاۤءَ وَعْدُ رَبِّيْ جَعَلَهٗ دَكَّاۤءَۚ وَكَانَ وَعْدُ رَبِّيْ حَقًّا ۗ",
    "transliteration_en": "Qaala haaza rahmatummir Rabbee fa izaa jaaa'a wa'du Rabbee ja'alahoo dakkaaa'a; wa kaana; wa du Rabbee haqqaa",
    "transliteration_id": "Qāla hāżā raḥmatum mir rabbī, fa iżā jā'a wa‘du rabbī ja‘alahū dakkā'(a), wa kāna wa‘du rabbī ḥaqqā(n).",
    "translation_en": "[Dhul-Qarnayn] said, \"This is a mercy from my Lord; but when the promise of my Lord comes, He will make it level, and ever is the promise of my Lord true.\"",
    "translation_id": "Dia (Zulqarnain) berkata, “(Tembok) ini adalah rahmat dari Tuhanku. Apabila janji Tuhanku telah tiba, Dia akan menjadikannya hancur luluh. Janji Tuhanku itu benar.”"
  },
  {
    "ayat": 99,
    "arabic": "۞ وَتَرَكْنَا بَعْضَهُمْ يَوْمَىِٕذٍ يَّمُوْجُ فِيْ بَعْضٍ وَّنُفِخَ فِى الصُّوْرِ فَجَمَعْنٰهُمْ جَمْعًا ۙ",
    "transliteration_en": "Wa taraknaa ba'dahum Yawma'iziny yamooju fee ba'dinw wa nufikha fis Soori fajama'naahum jam'aa",
    "transliteration_id": "Wa taraknā ba‘ḍahum yauma'iżiy yamūju fī ba‘ḍiw wa nufikha fiṣ-ṣūri fa jama‘nāhum jam‘ā(n).",
    "translation_en": "And We will leave them that day surging over each other, and [then] the Horn will be blown, and We will assemble them in [one] assembly.",
    "translation_id": "Pada hari itu Kami biarkan sebagian mereka (Ya’juj dan Ma’juj) berbaur dengan sebagian yang lain. (Apabila) sangkakala ditiup (lagi), Kami benar-benar akan mengumpulkan mereka seluruhnya."
  },
  {
    "ayat": 100,
    "arabic": "وَّعَرَضْنَا جَهَنَّمَ يَوْمَىِٕذٍ لِّلْكٰفِرِيْنَ عَرْضًا ۙ",
    "transliteration_en": "Wa 'aradnaa jahannama Yawma'izil lilkaafireena 'ardaa",
    "transliteration_id": "Wa ‘araḍnā jahannama yauma'iżil lil-kāfirīna ‘arḍā(n).",
    "translation_en": "And We will present Hell that Day to the Disbelievers, on display -",
    "translation_id": "Kami perlihatkan (neraka) Jahanam dengan jelas pada hari itu kepada orang-orang kafir,"
  }
]