[
  {
    "ayat": 101,
    "arabic": "تِلْكَ الْقُرٰى نَقُصُّ عَلَيْكَ مِنْ اَنْۢبَاۤىِٕهَاۚ وَلَقَدْ جَاۤءَتْهُمْ رُسُلُهُمْ بِالْبَيِّنٰتِۚ فَمَا كَانُوْا لِيُؤْمِنُوْا بِمَا كَذَّبُوْا مِنْ قَبْلُۗ  كَذٰلِكَ يَطْبَعُ اللّٰهُ عَلٰى قُلُوْبِ الْكٰفِرِيْنَ",
    "transliteration_en": "Tilkal quraa naqussu 'alaika min ambaaa'ihaa; wa laqad jaaa'at hum Rusuluhum bilbaiyinaati famaa kaanoo liyu'minoo bimaa kazzaboo min qabl; kazaalika yatba'ul laahu 'alaa quloobil kaafireen",
    "transliteration_id": "Tilkal-qurā naquṣṣu ‘alaika min ambā'ihā, wa laqad jā'athum rusuluhum bil-bayyināt(i), famā kānū liyu'minū bimā każżabū min qabl(u), każālika yaṭba‘ullāhu ‘alā qulūbil-kāfirīn(a).",
    "translation_en": "Those cities - We relate to you, [O Muhammad], some of their news. And certainly did their messengers come to them with clear proofs, but they were not to believe in that which they had denied before. Thus does Allah seal over the hearts of the disbelievers.",
    "translation_id": "Negeri-negeri (yang telah Kami binasakan) itu Kami ceritakan sebagian kisahnya kepadamu (Nabi Muhammad). Sungguh, rasul-rasul mereka telah datang dengan membawa bukti-bukti yang nyata kepada mereka. Akan tetapi, mereka tidak mau beriman pada apa yang telah mereka dustakan sebelumnya. Demikianlah Allah mengunci hati orang-orang yang kafir."
  },
  {
    "ayat": 102,
    "arabic": "وَمَا وَجَدْنَا لِاَكْثَرِهِمْ مِّنْ عَهْدٍۚ وَاِنْ وَّجَدْنَآ اَكْثَرَهُمْ لَفٰسِقِيْنَ",
    "transliteration_en": "Wa maa wajadnaa li aksarihim min 'ahd; wa inw wajadnaaa aksarahum lafaasiqeen",
    "transliteration_id": "Wa mā wajadnā li'akṡarihim min ‘ahd(in), wa iw wajadnā akṡarahum lafāsiqīn(a).",
    "translation_en": "And We did not find for most of them any covenant; but indeed, We found most of them defiantly disobedient.",
    "translation_id": "Kami tidak mendapati kebanyakan mereka memenuhi janji. Sesungguhnya Kami dapati kebanyakan mereka adalah orang-orang yang fasik."
  },
  {
    "ayat": 103,
    "arabic": "ثُمَّ بَعَثْنَا مِنْۢ بَعْدِهِمْ مُّوْسٰى بِاٰيٰتِنَآ اِلٰى فِرْعَوْنَ وَمَلَا۟ىِٕهٖ فَظَلَمُوْا بِهَاۚ فَانْظُرْ كَيْفَ كَانَ عَاقِبَةُ الْمُفْسِدِيْنَ",
    "transliteration_en": "Summa ba'asnaa mim ba'dihim Moosaa bi Aayaatinaaa ilaa Fir'awana wa mala'ihee fazalamoo bihaa fanzur kaifa kaana 'aaqibatul mufsideen",
    "transliteration_id": "Ṡumma ba‘aṡnā mim ba‘dihim mūsā bi'āyātinā ilā fir‘auna wa mala'ihī fa ẓalamū bihā, fanẓur kaifa kāna ‘āqibatul-mufsidīn(a).",
    "translation_en": "Then We sent after them Moses with Our signs to Pharaoh and his establishment, but they were unjust toward them. So see how was the end of the corrupters.",
    "translation_id": "Kemudian, Kami utus Musa setelah mereka dengan membawa tanda-tanda (kekuasaan) Kami kepada Fir‘aun dan pemuka-pemuka kaumnya. Lalu, mereka mengingkarinya. Perhatikanlah bagaimana kesudahan orang-orang yang berbuat kerusakan."
  },
  {
    "ayat": 104,
    "arabic": "وَقَالَ مُوْسٰى يٰفِرْعَوْنُ اِنِّيْ رَسُوْلٌ مِّنْ رَّبِّ الْعٰلَمِيْنَۙ",
    "transliteration_en": "Wa qaala Moosaa yaa Fir'awnu inee Rasoolum mir Rabbil 'aalameen",
    "transliteration_id": "Wa qāla mūsa yā fir‘aunu innī rasūlum mir rabbil-‘ālamīn(a).",
    "translation_en": "And Moses said, \"O Pharaoh, I am a messenger from the Lord of the worlds",
    "translation_id": "Musa berkata, “Wahai Fir‘aun, sesungguhnya aku adalah seorang utusan dari Tuhan semesta alam."
  },
  {
    "ayat": 105,
    "arabic": "حَقِيْقٌ عَلٰٓى اَنْ لَّآ اَقُوْلَ عَلَى اللّٰهِ اِلَّا الْحَقَّۗ قَدْ جِئْتُكُمْ بِبَيِّنَةٍ مِّنْ رَّبِّكُمْ فَاَرْسِلْ مَعِيَ بَنِيْٓ اِسْرَاۤءِيْلَ ۗ",
    "transliteration_en": "Haqeequn 'alaaa al laaa aqoola 'alal laahi illal haqq; qad ji'tukum bibaiyinatim mir Rabbikum fa arsil ma'iya Baneee Israaa'eel",
    "transliteration_id": "Ḥaqīqun ‘alā allā aqūla ‘alallāhi illal-ḥaqq(a), qad ji'tukum bibayyinatim mir rabbikum fa arsil ma‘iya banī isrā'īl(a).",
    "translation_en": "[Who is] obligated not to say about Allah except the truth. I have come to you with clear evidence from your Lord, so send with me the Children of Israel.\"",
    "translation_id": "Wajib atasku tidak mengatakan (sesuatu) terhadap Allah, kecuali yang hak (benar). Sungguh, aku datang kepadamu dengan membawa bukti yang nyata dari Tuhanmu. Maka, lepaskanlah Bani Israil (pergi) bersamaku.”"
  },
  {
    "ayat": 106,
    "arabic": "قَالَ اِنْ كُنْتَ جِئْتَ بِاٰيَةٍ فَأْتِ بِهَآ اِنْ كُنْتَ مِنَ الصّٰدِقِيْنَ",
    "transliteration_en": "Qaala in kunta ji'ta bi Aayatin faati bihaaa in kunta minas saadiqeen",
    "transliteration_id": "Qāla in kunta ji'ta bi'āyatin fa'ti bihā in kunta minaṣ ṣādiqīn(a).",
    "translation_en": "[Pharaoh] said, \"If you have come with a sign, then bring it forth, if you should be of the truthful.\"",
    "translation_id": "Dia (Fir‘aun) berkata, “Jika benar engkau membawa suatu bukti, tunjukkanlah, kalau kamu termasuk orang-orang yang benar.”"
  },
  {
    "ayat": 107,
    "arabic": "فَاَلْقٰى عَصَاهُ فَاِذَا هِيَ ثُعْبَانٌ مُّبِيْنٌ ۖ",
    "transliteration_en": "Qa alqaa 'asaahu fa izaa hiya su'baanum mubeen",
    "transliteration_id": "Fa alqā ‘aṣāhu fa iżā hiya ṡu‘bānum mubīn(un).",
    "translation_en": "So Moses threw his staff, and suddenly it was a serpent, manifest.",
    "translation_id": "Maka, dia (Musa) melemparkan tongkatnya, tiba-tiba ia (tongkat itu) menjadi ular besar yang nyata."
  },
  {
    "ayat": 108,
    "arabic": "وَّنَزَعَ يَدَهٗ فَاِذَا هِيَ بَيْضَاۤءُ لِلنّٰظِرِيْنَ ࣖ",
    "transliteration_en": "Wa naza'a yadahoo fa izaa hiya baidaaa'u linnaazireen",
    "transliteration_id": "Wa naza‘a yadahū fa iżā hiya baiḍā'u lin-nāẓirīn(a).",
    "translation_en": "And he drew out his hand; thereupon it was white [with radiance] for the observers.",
    "translation_id": "Dia menarik tangannya, tiba-tiba ia (tangan itu) menjadi putih (bercahaya) bagi orang-orang yang melihat(-nya)."
  },
  {
    "ayat": 109,
    "arabic": "قَالَ الْمَلَاُ مِنْ قَوْمِ فِرْعَوْنَ اِنَّ هٰذَا لَسٰحِرٌ عَلِيْمٌۙ",
    "transliteration_en": "Qaalal mala-u min qawmi Fir'awna inna haazaa lasaa hirun 'aleem",
    "transliteration_id": "Qālal-mala'u min qaumi fir‘auna inna hāżā lasāḥirum ‘alīm(un).",
    "translation_en": "Said the eminent among the people of Pharaoh, \"Indeed, this is a learned magician",
    "translation_id": "Para pemuka kaum Fir‘aun berkata, “Sesungguhnya orang ini benar-benar penyihir yang sangat pandai."
  },
  {
    "ayat": 110,
    "arabic": "يُّرِيْدُ اَنْ يُّخْرِجَكُمْ مِّنْ اَرْضِكُمْ ۚ فَمَاذَا تَأْمُرُوْنَ",
    "transliteration_en": "Yureedu ai yukhrijakum min ardikum famaazaa taamuroon",
    "transliteration_id": "Yurīdu ay yukhrijakum min arḍikum, fa māżā ta'murūn(a).",
    "translation_en": "Who wants to expel you from your land [through magic], so what do you instruct?\"",
    "translation_id": "Dia hendak mengusir kamu dari negerimu.” (Fir‘aun berkata,) “Maka, apa saran kamu?”"
  },
  {
    "ayat": 111,
    "arabic": "قَالُوْآ اَرْجِهْ وَاَخَاهُ وَاَرْسِلْ فِى الْمَدَاۤىِٕنِ حٰشِرِيْنَۙ",
    "transliteration_en": "Qaalooo arjih wa akhaahu wa arsil filmadaaa'ini haashireen",
    "transliteration_id": "Qālū arjih wa akhāhu wa arsil fil-madā'ini ḥāsyirīn(a).",
    "translation_en": "They said, \"Postpone [the matter of] him and his brother and send among the cities gatherers",
    "translation_id": "Mereka (para pemuka) itu menjawab, “Beri tangguhlah dia dan saudaranya dan utuslah ke kota-kota beberapa orang untuk mengumpulkan (para penyihir)"
  },
  {
    "ayat": 112,
    "arabic": "يَأْتُوْكَ بِكُلِّ سٰحِرٍ عَلِيْمٍ",
    "transliteration_en": "Yaatooka bikulli saahirin 'aleem",
    "transliteration_id": "Ya'tūka bikulli sāḥirin ‘alīm(in).",
    "translation_en": "Who will bring you every learned magician.\"",
    "translation_id": "(agar) mereka membawa semua penyihir yang pandai kepadamu.”"
  },
  {
    "ayat": 113,
    "arabic": "وَجَاۤءَ السَّحَرَةُ فِرْعَوْنَ قَالُوْٓا اِنَّ لَنَا لَاَجْرًا اِنْ كُنَّا نَحْنُ الْغٰلِبِيْنَ",
    "transliteration_en": "Wa jaaa'as saharatu Fir'awna qaaloo inna lanaa la ajjran in kunnaa nahnul ghaalibeen",
    "transliteration_id": "Wa jā'as-saḥaratu fir‘auna qālū inna lanā la'ajran in kunnā naḥnul-gālibīn(a).",
    "translation_en": "And the magicians came to Pharaoh. They said, \"Indeed for us is a reward if we are the predominant.\"",
    "translation_id": "Para penyihir datang kepada Fir‘aun. Mereka berkata, “(Apakah) kami benar-benar akan mendapat imbalan jika kami menang?”"
  },
  {
    "ayat": 114,
    "arabic": "قَالَ نَعَمْ وَاِنَّكُمْ لَمِنَ الْمُقَرَّبِيْنَ",
    "transliteration_en": "Qaala na'am wa innakum laminal muqarrabeen",
    "transliteration_id": "Qāla na‘am wa innakum laminal-muqarrabīn(a).",
    "translation_en": "He said, \"Yes, and, [moreover], you will be among those made near [to me].\"",
    "translation_id": "Dia (Fir‘aun) menjawab, “Ya, bahkan sesungguhnya kamu pasti termasuk orang-orang yang didekatkan (kedudukannya kepadaku).”"
  },
  {
    "ayat": 115,
    "arabic": "قَالُوْا يٰمُوْسٰٓى اِمَّآ اَنْ تُلْقِيَ وَاِمَّآ اَنْ نَّكُوْنَ نَحْنُ الْمُلْقِيْنَ",
    "transliteration_en": "Qaaloo yaa Moosaaa immaaa an tulqiya wa immaaa an nakoona nahnul mulqeen",
    "transliteration_id": "Qālū yā mūsā immā an tulqiya wa immā an nakūna naḥnul-mulqīn(a).",
    "translation_en": "They said, \"O Moses, either you throw [your staff], or we will be the ones to throw [first].\"",
    "translation_id": "Mereka (para penyihir) berkata, “Wahai Musa, engkaukah yang akan melemparkan (lebih dahulu) atau kami yang melemparkan?”"
  },
  {
    "ayat": 116,
    "arabic": "قَالَ اَلْقُوْاۚ فَلَمَّآ اَلْقَوْا سَحَرُوْٓا اَعْيُنَ النَّاسِ وَاسْتَرْهَبُوْهُمْ وَجَاۤءُوْ بِسِحْرٍ عَظِيْمٍ",
    "transliteration_en": "Qaala alqoo falam maaa alqaw saharooo a'yunannaasi wastarhaboohum wa jaaa'oo bisihrin 'azeem",
    "transliteration_id": "Qāla alqū, falammā alqau saḥarū a‘yunan-nāsi wastarhabūhum wa jā'ū bisiḥrin ‘aẓīm(in).",
    "translation_en": "He said, \"Throw,\" and when they threw, they bewitched the eyes of the people and struck terror into them, and they presented a great [feat of] magic.",
    "translation_id": "Dia (Musa) menjawab, “Lemparkanlah (lebih dahulu)!” Maka, ketika melemparkan (tali-temali), mereka menyihir mata orang banyak dan menjadikan mereka takut. Mereka memperlihatkan sihir yang hebat (menakjubkan)."
  },
  {
    "ayat": 117,
    "arabic": "۞ وَاَوْحَيْنَآ اِلٰى مُوْسٰٓى اَنْ اَلْقِ عَصَاكَۚ فَاِذَا هِيَ تَلْقَفُ مَا يَأْفِكُوْنَۚ",
    "transliteration_en": "Wa awhainaaa ilaa Moosaaa an alqi 'asaaka fa izaa hiya talqafu maa yaafikoon",
    "transliteration_id": "Wa auḥainā ilā mūsā an alqi ‘aṣāk(a), fa iżā hiya talqafu mā ya'fikūn(a).",
    "translation_en": "And We inspired to Moses, \"Throw your staff,\" and at once it devoured what they were falsifying.",
    "translation_id": "Kami wahyukan kepada Musa, “Lemparkanlah tongkatmu!” Maka, tiba-tiba ia menelan (habis) segala kepalsuan mereka."
  },
  {
    "ayat": 118,
    "arabic": "فَوَقَعَ الْحَقُّ وَبَطَلَ مَا كَانُوْا يَعْمَلُوْنَۚ",
    "transliteration_en": "Fawaqa'al haqqu wa batala maa kaanoo ya'maloon",
    "transliteration_id": "Fa waqa‘al-ḥaqqu wa baṭala mā kānū ya‘malūn(a).",
    "translation_en": "So the truth was established, and abolished was what they were doing.",
    "translation_id": "Maka, terbuktilah kebenaran dan sia-sialah segala yang mereka kerjakan."
  },
  {
    "ayat": 119,
    "arabic": "فَغُلِبُوْا هُنَالِكَ وَانْقَلَبُوْا صٰغِرِيْنَۚ",
    "transliteration_en": "Faghuliboo hunaalika wanqalaboo saaghireen",
    "transliteration_id": "Fa gulibū hunālika wanqalabū ṣāgirīn(a).",
    "translation_en": "And Pharaoh and his people were overcome right there and became debased.",
    "translation_id": "Mereka dikalahkan di tempat itu dan jadilah mereka orang-orang yang hina."
  },
  {
    "ayat": 120,
    "arabic": "وَاُلْقِيَ السَّحَرَةُ سٰجِدِيْنَۙ",
    "transliteration_en": "Wa ulqiyas saharatu saajideen",
    "transliteration_id": "Wa ulqiyas-saḥaratu sājidīn(a).",
    "translation_en": "And the magicians fell down in prostration [to Allah].",
    "translation_id": "Para penyihir itu tersungkur dalam keadaan sujud."
  },
  {
    "ayat": 121,
    "arabic": "قَالُوْٓا اٰمَنَّا بِرَبِّ الْعٰلَمِيْنَۙ",
    "transliteration_en": "Qaaloo aamannaa bi Rabbil 'aalameen",
    "transliteration_id": "Qālū āmannā birabbil-‘ālamīn(a).",
    "translation_en": "They said, \"We have believed in the Lord of the worlds,",
    "translation_id": "Mereka berkata, “Kami beriman kepada Tuhan semesta alam,"
  },
  {
    "ayat": 122,
    "arabic": "رَبِّ مُوْسٰى وَهٰرُوْنَ",
    "transliteration_en": "Rabbi Moosaa wa Haaroon",
    "transliteration_id": "Rabbi mūsā wa hārūn(a).",
    "translation_en": "The Lord of Moses and Aaron.\"",
    "translation_id": "(yaitu) Tuhannya Musa dan Harun.”"
  },
  {
    "ayat": 123,
    "arabic": "قَالَ فِرْعَوْنُ اٰمَنْتُمْ بِهٖ قَبْلَ اَنْ اٰذَنَ لَكُمْۚ اِنَّ هٰذَا لَمَكْرٌ مَّكَرْتُمُوْهُ فِى الْمَدِيْنَةِ لِتُخْرِجُوْا مِنْهَآ اَهْلَهَاۚ فَسَوْفَ تَعْلَمُوْنَ",
    "transliteration_en": "Qaala Fir'awnu aamantum bihee qabla an aazana lakum; inna haaza lamakrum makartumoohu filmadeenati litukhrijoo minhaaa ahlahaa fasawfa ta'almoon",
    "transliteration_id": "Qāla fir‘aunu āmantum bihī qabla an āżana lakum, inna hāżā lamakrum makartumūhu fil-madīnati litukhrijū minhā ahlahā, fa saufa ta‘lamūn(a).",
    "translation_en": "Said Pharaoh, \"You believed in him before I gave you permission. Indeed, this is a conspiracy which you conspired in the city to expel therefrom its people. But you are going to know.",
    "translation_id": "Fir‘aun berkata, “Mengapa kamu beriman kepadanya sebelum aku memberi izin kepadamu? Sesungguhnya ini benar-benar tipu muslihat yang telah kamu rencanakan di kota ini untuk mengusir penduduknya. Kelak kamu akan mengetahui (akibat perbuatanmu ini)."
  },
  {
    "ayat": 124,
    "arabic": "لَاُقَطِّعَنَّ اَيْدِيَكُمْ وَاَرْجُلَكُمْ مِّنْ خِلَافٍ ثُمَّ لَاُصَلِّبَنَّكُمْ اَجْمَعِيْنَ",
    "transliteration_en": "La uqatti'anna aidiyakum wa arjulakum min khilaafin summa la usallibannakum ajma'een",
    "transliteration_id": "La'uqaṭṭi‘anna aidiyakum wa arjulakum min khilāfin ṡumma la'uṣallibannakum ajma‘īn(a).",
    "translation_en": "I will surely cut off your hands and your feet on opposite sides; then I will surely crucify you all.\"",
    "translation_id": "Pasti akan aku potong tangan dan kakimu dengan bersilang (tangan kanan dan kaki kiri atau sebaliknya) kemudian sungguh akan aku salib kamu semua.”"
  },
  {
    "ayat": 125,
    "arabic": "قَالُوْٓا اِنَّآ اِلٰى رَبِّنَا مُنْقَلِبُوْنَۙ",
    "transliteration_en": "Qaaloo innaaa ilaa Rabbinaa munqaliboon",
    "transliteration_id": "Qālū innā ilā rabbinā munqalibūn(a).",
    "translation_en": "They said, \"Indeed, to our Lord we will return.",
    "translation_id": "Mereka (para penyihir) menjawab, “Sesungguhnya kami hanya akan kembali kepada Tuhan kami."
  },
  {
    "ayat": 126,
    "arabic": "وَمَا تَنْقِمُ مِنَّآ اِلَّآ اَنْ اٰمَنَّا بِاٰيٰتِ رَبِّنَا لَمَّا جَاۤءَتْنَا ۗرَبَّنَآ اَفْرِغْ عَلَيْنَا صَبْرًا وَّتَوَفَّنَا مُسْلِمِيْنَ ࣖ",
    "transliteration_en": "Wa maa tanqimu minnaaa illaaa an aamannaa bi Aayaati Rabbinaa lammaa jaaa'atnaa; Rabbanaaa afrigh 'alainaa sabranw wa tawaffanaa muslimeen",
    "transliteration_id": "Wa mā tanqimu minnā illā an āmannā bi'āyāti rabbinā lammā jā'atnā, rabanā afrig ‘alainā ṣabraw wa tawaffanā muslimīn(a).",
    "translation_en": "And you do not resent us except because we believed in the signs of our Lord when they came to us. Our Lord, pour upon us patience and let us die as Muslims [in submission to You].\"",
    "translation_id": "Engkau (Fir‘aun) tidak menghukum kami, kecuali karena kami beriman kepada ayat-ayat Tuhan kami ketika ayat-ayat itu datang kepada kami.” (Mereka berdoa,) “Ya Tuhan kami, limpahkanlah kesabaran kepada kami dan matikanlah kami dalam keadaan muslim (berserah diri kepada-Mu).”"
  },
  {
    "ayat": 127,
    "arabic": "وَقَالَ الْمَلَاُ مِنْ قَوْمِ فِرْعَوْنَ اَتَذَرُ مُوْسٰى وَقَوْمَهٗ لِيُفْسِدُوْا فِى الْاَرْضِ وَيَذَرَكَ وَاٰلِهَتَكَۗ قَالَ سَنُقَتِّلُ اَبْنَاۤءَهُمْ وَنَسْتَحْيٖ نِسَاۤءَهُمْۚ وَاِنَّا فَوْقَهُمْ قٰهِرُوْنَ",
    "transliteration_en": "Wa qaalal mala-u min qawmi Fir'awna atazaru Moosaa wa qawmahoo liyufsidoo fil ardi wa yazaraka wa aalihatak; qaala sanuqattilu abnaaa 'ahum wa nastahyee nisaaa'ahum wa innaa fawqahum qaahiroon",
    "transliteration_id": "Wa qālal-mala'u min qaumi fir‘auna atażaru mūsā wa qaumahū liyufsidū fil-arḍi wa yażaraka wa ālihatak(a), qāla sanuqattilu abnā'ahum wa nastaḥyī nisā'ahum, wa innā fauqahum qāhirūn(a).",
    "translation_en": "And the eminent among the people of Pharaoh said,\" Will you leave Moses and his people to cause corruption in the land and abandon you and your gods?\" [Pharaoh] said, \"We will kill their sons and keep their women alive; and indeed, we are subjugators over them.\"",
    "translation_id": "Para pemuka dari kaum Fir‘aun berkata, “Apakah engkau akan membiarkan Musa dan kaumnya sehingga mereka berbuat kerusakan di negeri ini (Mesir) dan dia (Musa) meninggalkanmu dan tuhan-tuhanmu?” (Fir‘aun) menjawab, “Akan kita bunuh anak-anak laki-laki mereka dan kita biarkan hidup anak-anak perempuan mereka. Sesungguhnya kita berkuasa penuh atas mereka.”"
  },
  {
    "ayat": 128,
    "arabic": "قَالَ مُوْسٰى لِقَوْمِهِ اسْتَعِيْنُوْا بِاللّٰهِ وَاصْبِرُوْاۚ اِنَّ الْاَرْضَ لِلّٰهِ ۗيُوْرِثُهَا مَنْ يَّشَاۤءُ مِنْ عِبَادِهٖۗ وَالْعَاقِبَةُ لِلْمُتَّقِيْنَ",
    "transliteration_en": "Qaala Moosaa liqawmihis ta'eenoo billaahi wasbiroo innal arda lillaahi yoorisuhaa mai yashaaa'u min 'ibaadihee wal 'aaqibatu lilmuttaqeen",
    "transliteration_id": "Qāla mūsā liqaumihista‘īnū billāhi waṣbirū, innal-arḍa lillāh(i), yūriṡuhā may yasyā'u min ‘ibādih(ī), wal-‘āqibatu lil-muttaqīn(a).",
    "translation_en": "Said Moses to his people, \"Seek help through Allah and be patient. Indeed, the earth belongs to Allah. He causes to inherit it whom He wills of His servants. And the [best] outcome is for the righteous.\"",
    "translation_id": "Musa berkata kepada kaumnya, “Mohonlah pertolongan kepada Allah dan bersabarlah. Sesungguhnya bumi (ini) milik Allah. Dia akan mewariskannya kepada siapa saja yang Dia kehendaki di antara hamba-hamba-Nya. Kesudahan (yang baik) adalah bagi orang-orang yang bertakwa.”"
  },
  {
    "ayat": 129,
    "arabic": "قَالُوْٓا اُوْذِيْنَا مِنْ قَبْلِ اَنْ تَأْتِيَنَا وَمِنْۢ بَعْدِ مَا جِئْتَنَا ۗقَالَ عَسٰى رَبُّكُمْ اَنْ يُّهْلِكَ عَدُوَّكُمْ وَيَسْتَخْلِفَكُمْ فِى الْاَرْضِ فَيَنْظُرَ كَيْفَ تَعْمَلُوْنَ ࣖ",
    "transliteration_en": "Qaaloo oozeenaa min qabli an taatiyanaa wa mim ba'di maa ji'tanaa; qaala 'asaa Rabbukum ai yuhlika 'aduwwakum wa yastakhli fakum fil ardi fayanzura kaifa ta'maloon",
    "transliteration_id": "Qālū ūżīnā min qabli an ta'tiyanā wa mim ba‘di mā ji'tanā, qāla ‘asā rabbukum ay yuhlika ‘aduwwakum wa yastakhlifakum fil-arḍi fa yanẓura kaifa ta‘malūn(a).",
    "translation_en": "They said, \"We have been harmed before you came to us and after you have come to us.\" He said, \"Perhaps your Lord will destroy your enemy and grant you succession in the land and see how you will do.\"",
    "translation_id": "Mereka (kaum Musa) berkata, “Kami telah ditindas (oleh Fir‘aun) sebelum engkau datang kepada kami dan setelah engkau datang.” (Musa) menjawab, “Mudah-mudahan Tuhanmu membinasakan musuhmu dan menjadikan kamu penguasa di bumi lalu Dia akan melihat bagaimana perbuatanmu.”"
  },
  {
    "ayat": 130,
    "arabic": "وَلَقَدْ اَخَذْنَآ اٰلَ فِرْعَوْنَ بِالسِّنِيْنَ وَنَقْصٍ مِّنَ الثَّمَرٰتِ لَعَلَّهُمْ يَذَّكَّرُوْنَ",
    "transliteration_en": "Wa laqad akhaznaaa Aala Fir'awna bis sineena wa naqsim minas samaraati la'allahum yazzakkaroon",
    "transliteration_id": "Wa laqad akhażnā āla fir‘auna bis-sinīna wa naqṣim minaṡ-ṡamarāti la‘allahum yażżakkarūn(a).",
    "translation_en": "And We certainly seized the people of Pharaoh with years of famine and a deficiency in fruits that perhaps they would be reminded.",
    "translation_id": "Sungguh, Kami telah menghukum Fir‘aun dan kaumnya dengan (mendatangkan) kemarau panjang dan kekurangan buah-buahan agar mereka mengambil pelajaran."
  },
  {
    "ayat": 131,
    "arabic": "فَاِذَا جَاۤءَتْهُمُ الْحَسَنَةُ قَالُوْا لَنَا هٰذِهٖ ۚوَاِنْ تُصِبْهُمْ سَيِّئَةٌ يَّطَّيَّرُوْا بِمُوْسٰى وَمَنْ مَّعَهٗۗ  اَلَآ اِنَّمَا طٰۤىِٕرُهُمْ عِنْدَ اللّٰهِ وَلٰكِنَّ اَكْثَرَهُمْ لَا يَعْلَمُوْنَ",
    "transliteration_en": "Fa izaa jaaa'at humul hasanatu qaaloo lanaa haazihee wa in tusibhum saiyi'atuny yattaiyaroo bi Moosaa wa mam ma'ah; alaaa innamaa taaa'iruhum 'indal laahi wa laakinna aksarahum laa ya'lamoon",
    "transliteration_id": "Fa iżā jā'athumul-ḥasanatu qālū lanā hāżihī, wa in tuṣibhum sayyi'atuy yaṭṭayyarū bimūsā wa mam ma‘ah(ū), alā innamā ṭā'iruhum ‘indallāhi wa lākinna aksṡarahum lā ya‘lamūn(a).",
    "translation_en": "But when good came to them, they said, \"This is ours [by right].\" And if a bad [condition] struck them, they saw an evil omen in Moses and those with him. Unquestionably, their fortune is with Allah, but most of them do not know.",
    "translation_id": "Maka, apabila kebaikan (kemakmuran) datang kepada mereka, mereka berkata, “Kami pantas mendapatkan ini (karena usaha kami).” Jika ditimpa kesusahan, mereka lemparkan sebab kesialan itu kepada Musa dan orang-orang yang bersamanya. Ketahuilah, sesungguhnya ketentuan tentang nasib mereka (baik dan buruk) di sisi Allah, tetapi kebanyakan mereka tidak mengetahui."
  },
  {
    "ayat": 132,
    "arabic": "وَقَالُوْا مَهْمَا تَأْتِنَا بِهٖ مِنْ اٰيَةٍ لِّتَسْحَرَنَا بِهَاۙ فَمَا نَحْنُ لَكَ بِمُؤْمِنِيْنَ",
    "transliteration_en": "Wa qaaloo mahmaa taatinaa bihee min Aayatil litasharanaa bihaa famaa nahnu laka bimu'mineen",
    "transliteration_id": "Wa qālū mahmā ta'tinā bihī min āyatil litasḥaranā bihā, famā naḥnu laka bimu'minīn(a).",
    "translation_en": "And they said, \"No matter what sign you bring us with which to bewitch us, we will not be believers in you.\"",
    "translation_id": "Mereka (kaum Fir‘aun) berkata (kepada Musa), “Bukti apa pun yang engkau bawa kepada kami untuk menyihir kami dengannya, kami tidak akan beriman kepadamu.”"
  },
  {
    "ayat": 133,
    "arabic": "فَاَرْسَلْنَا عَلَيْهِمُ الطُّوْفَانَ وَالْجَرَادَ وَالْقُمَّلَ وَالضَّفَادِعَ وَالدَّمَ اٰيٰتٍ مُّفَصَّلٰتٍۗ فَاسْتَكْبَرُوْا وَكَانُوْا قَوْمًا مُّجْرِمِيْنَ",
    "transliteration_en": "Fa arsalnaa 'alaihimut toofaana waljaraada walqum mala waddafaadi'a waddama Aayaatim mufassalaatin fastakbaroo wa kaanoo qawmam mujrimeen",
    "transliteration_id": "Fa arsalnā ‘alaihimuṭ-ṭūfāna wal-jarāda wal-qummala waḍ-ḍafādi‘a wad-dama āyātim mufaṣṣalāt(in), fastakbarū wa kānū qaumam mujrimīn(a).",
    "translation_en": "So We sent upon them the flood and locusts and lice and frogs and blood as distinct signs, but they were arrogant and were a criminal people.",
    "translation_id": "Maka, Kami kirimkan kepada mereka (siksa berupa) banjir besar, belalang, kutu, katak, dan darah (air minum berubah menjadi darah) sebagai bukti-bukti yang jelas dan terperinci. Akan tetapi, mereka tetap menyombongkan diri dan mereka adalah kaum pendurhaka."
  },
  {
    "ayat": 134,
    "arabic": "وَلَمَّا وَقَعَ عَلَيْهِمُ الرِّجْزُ قَالُوْا يٰمُوْسَى ادْعُ لَنَا رَبَّكَ بِمَا عَهِدَ عِنْدَكَۚ  لَىِٕنْ كَشَفْتَ عَنَّا الرِّجْزَ لَنُؤْمِنَنَّ لَكَ وَلَنُرْسِلَنَّ مَعَكَ بَنِيْٓ اِسْرَاۤءِيْلَ ۚ",
    "transliteration_en": "Wa lammaa waqa'a 'alaihimur rijzu qaaloo ya Moosad-u lanaa rabbaka bimaa 'ahida 'indaka la'in kashafta 'annar rijza lanu 'minanna laka wa lanursilanna ma'aka Banee Israaa'eel",
    "transliteration_id": "Wa lammā waqa‘a ‘alihimur-rijzu qālū yā mūsad‘u lanā rabbaka bimā ‘ahida ‘indak(a), la'in kasyafta ‘annar-rijza lanu'minanna laka wa lanursilanna ma‘aka banī isrā'īl(a).",
    "translation_en": "And when the punishment descended upon them, they said, \"O Moses, invoke for us your Lord by what He has promised you. If you [can] remove the punishment from us, we will surely believe you, and we will send with you the Children of Israel.\"",
    "translation_id": "Ketika azab (yang telah diterangkan itu) menimpa mereka, mereka pun berkata, “Wahai Musa, mohonkanlah untuk kami kepada Tuhanmu sesuai dengan janji-Nya kepadamu. Jika engkau dapat menghilangkan azab itu dari kami, niscaya kami akan beriman kepadamu dan pasti akan kami biarkan Bani Israil pergi bersamamu.”"
  },
  {
    "ayat": 135,
    "arabic": "فَلَمَّا كَشَفْنَا عَنْهُمُ الرِّجْزَ اِلٰٓى اَجَلٍ هُمْ بَالِغُوْهُ اِذَا هُمْ يَنْكُثُوْنَ",
    "transliteration_en": "Falammaa kashafnaa 'anhumur rijza ilaaa ajalin hum baalighoohu izaa hum yankusoon",
    "transliteration_id": "Falammā kasyafnā ‘anhumur-rijza ilā ajalin hum bāligūhu iżā hum yankuṡūn(a).",
    "translation_en": "But when We removed the punishment from them until a term which they were to reach, then at once they broke their word.",
    "translation_id": "Namun, setelah Kami hilangkan azab itu dari mereka hingga batas waktu yang harus mereka penuhi, ternyata mereka ingkar janji."
  },
  {
    "ayat": 136,
    "arabic": "فَانْتَقَمْنَا مِنْهُمْ فَاَغْرَقْنٰهُمْ فِى الْيَمِّ بِاَنَّهُمْ كَذَّبُوْا بِاٰيٰتِنَا وَكَانُوْا عَنْهَا غٰفِلِيْنَ",
    "transliteration_en": "Fantaqamnaa minhum fa aghraqnaahum kazzaboo bi Aayaatinaa wa kaanoo 'anhaa ghaafileen",
    "transliteration_id": "Fantaqamnā minhum fa agraqnāhum fil-yammi bi'annahum każżabū bi'āyātinā wa kānū ‘anhā gāfilīn(a).",
    "translation_en": "So We took retribution from them, and We drowned them in the sea because they denied Our signs and were heedless of them.",
    "translation_id": "Maka, Kami membalas mereka (dengan siksa yang lebih berat). Kami tenggelamkan mereka di laut karena mereka telah mendustakan ayat-ayat Kami dan mereka adalah orang-orang yang lengah terhadapnya."
  },
  {
    "ayat": 137,
    "arabic": "وَاَوْرَثْنَا الْقَوْمَ الَّذِيْنَ كَانُوْا يُسْتَضْعَفُوْنَ مَشَارِقَ الْاَرْضِ وَمَغَارِبَهَا الَّتِيْ بٰرَكْنَا فِيْهَاۗ وَتَمَّتْ كَلِمَتُ رَبِّكَ الْحُسْنٰى عَلٰى بَنِيْٓ اِسْرَاۤءِيْلَۙ بِمَا صَبَرُوْاۗ وَدَمَّرْنَا مَا كَانَ يَصْنَعُ فِرْعَوْنُ وَقَوْمُهٗ وَمَا كَانُوْا يَعْرِشُوْنَ",
    "transliteration_en": "Wa awrasnal qawmal lazeena kaanoo yustad'afoona mashaariqal ardi wa maghaari bahal latee baaraknaa feehaa wa tammat kalimatu Rabbikal husnaa 'alaa Baneee Israaa'eela bimaa sabaroo wa dammarnaa maa kaana yasna'u Fir'awnu wa qawmuhoo wa maa kaanoo ya'rishoon",
    "transliteration_id": "Wa auraṡnal-qaumal-lażīna kānū yustaḍ‘afūna masyāriqal-arḍi wa magāribahal-latī bāraknā fīhā, wa tammat kalimatu rabbikal-ḥusnā ‘alā banī isrā'īl(a), bimā ṣabarū, wa dammarnā mā kāna yaṣna‘u fir‘aunu wa qaumuhū wa mā kānū ya‘risyūn(a).",
    "translation_en": "And We caused the people who had been oppressed to inherit the eastern regions of the land and the western ones, which We had blessed. And the good word of your Lord was fulfilled for the Children of Israel because of what they had patiently endured. And We destroyed [all] that Pharaoh and his people were producing and what they had been building.",
    "translation_id": "Kami wariskan kepada kaum yang selalu tertindas itu, bumi bagian timur dan bagian baratnya yang telah Kami berkahi. (Dengan demikian,) telah sempurnalah firman Tuhanmu yang baik itu (sebagai janji) untuk Bani Israil disebabkan kesabaran mereka. Kami hancurkan apa pun yang telah dibuat Fir‘aun dan kaumnya serta apa pun yang telah mereka bangun."
  },
  {
    "ayat": 138,
    "arabic": "وَجَاوَزْنَا بِبَنِيْٓ اِسْرَاۤءِيْلَ الْبَحْرَ فَاَتَوْا عَلٰى قَوْمٍ يَّعْكُفُوْنَ عَلٰٓى اَصْنَامٍ لَّهُمْ ۚقَالُوْا يٰمُوْسَى اجْعَلْ لَّنَآ اِلٰهًا كَمَا لَهُمْ اٰلِهَةٌ  ۗقَالَ اِنَّكُمْ قَوْمٌ تَجْهَلُوْنَ",
    "transliteration_en": "Wa jaawaznaa bi Banneee Israaa'eelal bahra fa ataw 'alaa qawminy ya'kufoona 'alaaa asnaamil lahum; qaaloo yaa Moosaj'al lanaa ilaahan kamaa lahum aalihah; qaala innakum qawmun tajhaloon",
    "transliteration_id": "Wa jāwaznā bibanī isrā'īlal-baḥra fa atau ‘alā qaumiy ya‘kufūna ‘alā aṣnāmil lahum, qālū yā mūsaj‘al lanā ilāhan kamā lahum ālihah(tun), qāla innakum qaumun tajhalūn(a).",
    "translation_en": "And We took the Children of Israel across the sea; then they came upon a people intent in devotion to [some] idols of theirs. They said, \"O Moses, make for us a god just as they have gods.\" He said, \"Indeed, you are a people behaving ignorantly.",
    "translation_id": "Kami menyeberangkan Bani Israil (melintasi) laut itu (dengan selamat). Ketika mereka sampai kepada suatu kaum yang masih tetap menyembah berhala, mereka (Bani Israil) berkata, “Wahai Musa, buatlah untuk kami tuhan (berupa berhala) sebagaimana tuhan-tuhan mereka.” (Musa) menjawab, “Sesungguhnya kamu adalah kaum yang bodoh.”"
  },
  {
    "ayat": 139,
    "arabic": "اِنَّ هٰٓؤُلَاۤءِ مُتَبَّرٌ مَّا هُمْ فِيْهِ وَبٰطِلٌ مَّا كَانُوْا يَعْمَلُوْنَ",
    "transliteration_en": "Innaa haaa'ulaaa'i mutabbarum maa hum feehi wa baatilum maa kaanoo ya'maloon",
    "transliteration_id": "Inna hā'ulā'i mutabbarum mā hum fīhi wa bāṭilum mā kānū ya‘malūn(a).",
    "translation_en": "Indeed, those [worshippers] - destroyed is that in which they are [engaged], and worthless is whatever they were doing.\"",
    "translation_id": "Sesungguhnya apa yang mereka anut (kemusyrikan) akan dihancurkan dan akan sia-sia apa yang telah mereka kerjakan."
  },
  {
    "ayat": 140,
    "arabic": "قَالَ اَغَيْرَ اللّٰهِ اَبْغِيْكُمْ اِلٰهًا وَّهُوَ فَضَّلَكُمْ عَلَى الْعٰلَمِيْنَ",
    "transliteration_en": "Qaala a-ghairal laahi abgheekum ilaahanw wa Huwa faddalakum 'alal 'aalameen",
    "transliteration_id": "Qāla agairallāhi abgīkum ilāhaw wa huwa faḍḍalakum ‘alal-‘ālamīn(a).",
    "translation_en": "He said, \"Is it other than Allah I should desire for you as a god while He has preferred you over the worlds?\"",
    "translation_id": "Dia (Musa) berkata (kepada kaumnya), “Apakah aku mencarikan untukmu tuhan selain Allah, padahal Dialah yang telah melebihkan kamu atas segala umat (pada masa itu)?”"
  },
  {
    "ayat": 141,
    "arabic": "وَاِذْ اَنْجَيْنٰكُمْ مِّنْ اٰلِ فِرْعَوْنَ يَسُوْمُوْنَكُمْ سُوْۤءَ الْعَذَابِۚ يُقَتِّلُوْنَ اَبْنَاۤءَكُمْ وَيَسْتَحْيُوْنَ نِسَاۤءَكُمْۗ وَفِيْ ذٰلِكُمْ بَلَاۤءٌ مِّنْ رَّبِّكُمْ عَظِيْمٌ ࣖ",
    "transliteration_en": "Wa iz anjainaakum min Aali Fir'awna yasoomoo nakum sooo'al 'azaab, yuqattiloona abnaaa'akum wa yastahyoona nisaaa'akum; wa fee zaalikum balaaa'um mir Rabbikum 'azeem",
    "transliteration_id": "Wa iż anjainākum min āli fir‘auna yasūmūnakum sū'al-‘ażāb(i), yuqattilūna abnā'akum wa yastaḥyūna nisā'akum wa fī żālikum balā'um mir rabbikum ‘aẓīm(un).",
    "translation_en": "And [recall, O Children of Israel], when We saved you from the people of Pharaoh, [who were] afflicting you with the worst torment - killing your sons and keeping your women alive. And in that was a great trial from your Lord.",
    "translation_id": "(Ingatlah wahai Bani Israil) ketika Kami menyelamatkan kamu dari para pengikut Fir‘aun yang menyiksa kamu dengan siksaan yang paling buruk. Mereka membunuh anak-anakmu yang laki-laki dan membiarkan hidup anak-anakmu yang perempuan. Pada yang demikian itu terdapat cobaan yang besar dari Tuhanmu."
  },
  {
    "ayat": 142,
    "arabic": "۞ وَوٰعَدْنَا مُوْسٰى ثَلٰثِيْنَ لَيْلَةً وَّاَتْمَمْنٰهَا بِعَشْرٍ فَتَمَّ مِيْقَاتُ رَبِّهٖٓ اَرْبَعِيْنَ لَيْلَةً ۚوَقَالَ مُوْسٰى لِاَخِيْهِ هٰرُوْنَ اخْلُفْنِيْ فِيْ قَوْمِيْ وَاَصْلِحْ وَلَا تَتَّبِعْ سَبِيْلَ الْمُفْسِدِيْنَ",
    "transliteration_en": "Wa waa'adnaa Moosaa salaaseena lailatanw wa at mamnaahaa bi'ashrim fatamma meeqaatu Rabbihee arba'eena lailah; wa qaala Moosaa liakheehi Haaroonakh lufnee fee qawmee wa aslih wa laa tattabi' sabeelal mufsideen",
    "transliteration_id": "Wa wā‘adnā mūsā ṡalāṡīna lailataw wa atmamnāhā bi‘asyrin fa tamma mīqātu rabbihī arba‘īna lailah(tan), wa qāla mūsā li'akhīhi hārūnakhlufnī fī qaumī wa aṣliḥ wa lā tattabi‘ sabīlal-mufsidīn(a).",
    "translation_en": "And We made an appointment with Moses for thirty nights and perfected them by [the addition of] ten; so the term of his Lord was completed as forty nights. And Moses said to his brother Aaron, \"Take my place among my people, do right [by them], and do not follow the way of the corrupters.\"",
    "translation_id": "Kami telah menjanjikan Musa (untuk memberikan kitab Taurat setelah bermunajat selama) tiga puluh malam. Kami sempurnakan jumlah malam itu dengan sepuluh (malam lagi). Maka, lengkaplah waktu yang telah ditentukan Tuhannya empat puluh malam. Musa berkata kepada saudaranya, (yaitu) Harun, “Gantikanlah aku dalam (memimpin) kaumku, perbaikilah (dirimu dan kaummu), dan janganlah engkau mengikuti jalan orang-orang yang berbuat kerusakan.”"
  },
  {
    "ayat": 143,
    "arabic": "وَلَمَّا جَاۤءَ مُوْسٰى لِمِيْقَاتِنَا وَكَلَّمَهٗ رَبُّهٗۙ قَالَ رَبِّ اَرِنِيْٓ اَنْظُرْ اِلَيْكَۗ قَالَ لَنْ تَرٰىنِيْ وَلٰكِنِ انْظُرْ اِلَى الْجَبَلِ فَاِنِ اسْتَقَرَّ مَكَانَهٗ فَسَوْفَ تَرٰىنِيْۚ فَلَمَّا تَجَلّٰى رَبُّهٗ لِلْجَبَلِ جَعَلَهٗ دَكًّا وَّخَرَّ مُوْسٰى صَعِقًاۚ فَلَمَّآ اَفَاقَ قَالَ سُبْحٰنَكَ تُبْتُ اِلَيْكَ وَاَنَا۠ اَوَّلُ الْمُؤْمِنِيْنَ",
    "transliteration_en": "Wa lammaa jaaa'a Moosa limeeqaatinaa wa kallamahoo Rabbuhoo qaala Rabbi arineee anzur ilaik; qaala lan taraanee wa laakininzur ilal jabali fa inistaqarra makaanahoo faswfa taraanee; falammaa tajallaa Rabbuhoo liljabali ja'alahoo dakkanw wa kharra Moosaa sa'iqaa; falammaaa afaaqa qaala Subhaanaka tubtu ilaika wa ana awwalul mu'mineen",
    "transliteration_id": "Wa lammā jā'a mūsā limīqātinā wa kallamahū rabbuh(ū), qāla rabbi arinī anẓur ilaik(a), qāla lan tarānī wa lākininẓur ilal-jabali fa inistaqarra makānahū fa saufa tarānī, falammā tajallā rabbuhū lil-jabali ja‘alahū dakkaw wa kharra mūsā ṣa‘iqā(n), falammā afāqa qāla subḥānaka tubtu ilaika wa ana awwalul-mu'minīn(a).",
    "translation_en": "And when Moses arrived at Our appointed time and his Lord spoke to him, he said, \"My Lord, show me [Yourself] that I may look at You.\" [Allah] said, \"You will not see Me, but look at the mountain; if it should remain in place, then you will see Me.\" But when his Lord appeared to the mountain, He rendered it level, and Moses fell unconscious. And when he awoke, he said, \"Exalted are You! I have repented to You, and I am the first of the believers.\"",
    "translation_id": "Ketika Musa datang untuk (bermunajat) pada waktu yang telah Kami tentukan (selama empat puluh hari) dan Tuhan telah berfirman (langsung) kepadanya, dia berkata, “Ya Tuhanku, tampakkanlah (diri-Mu) kepadaku agar aku dapat melihat Engkau.” Dia berfirman, “Engkau tidak akan (sanggup) melihat-Ku, namun lihatlah ke gunung itu. Jika ia tetap di tempatnya (seperti sediakala), niscaya engkau dapat melihat-Ku.” Maka, ketika Tuhannya menampakkan (keagungan-Nya) pada gunung itu, gunung itu hancur luluh dan Musa pun jatuh pingsan. Setelah Musa sadar, dia berkata, “Maha Suci Engkau. Aku bertobat kepada-Mu dan aku adalah orang yang pertama-tama beriman.”"
  },
  {
    "ayat": 144,
    "arabic": "قَالَ يٰمُوْسٰٓى اِنِّى اصْطَفَيْتُكَ عَلَى النَّاسِ بِرِسٰلٰتِيْ وَبِكَلَامِيْ ۖفَخُذْ مَآ اٰتَيْتُكَ وَكُنْ مِّنَ الشّٰكِرِيْنَ",
    "transliteration_en": "Qaala yaa Moosaaa innis tafaituka 'alan naasi bi Risaalaatee wa bi kalaamee fakhuz maaa aataituka wa kum minash shaakireen",
    "transliteration_id": "Qāla yā mūsā inniṣṭafaituka ‘alan-nāsi birisālātī wa bikalāmī, fa khuż  mā ātaituka wa kum minasy-syākirīn(a).",
    "translation_en": "[Allah] said, \"O Moses, I have chosen you over the people with My messages and My words [to you]. So take what I have given you and be among the grateful.\"",
    "translation_id": "Dia berfirman, “Wahai Musa, sesungguhnya Aku memilih (melebihkan) engkau dari manusia (yang lain) untuk membawa risalah dan berbicara (langsung) dengan-Ku. Maka, berpegang teguhlah pada apa yang Aku berikan kepadamu dan jadilah kamu termasuk orang-orang yang bersyukur.”"
  },
  {
    "ayat": 145,
    "arabic": "وَكَتَبْنَا لَهٗ فِى الْاَلْوَاحِ مِنْ كُلِّ شَيْءٍ مَّوْعِظَةً وَّتَفْصِيْلًا لِّكُلِّ شَيْءٍۚ فَخُذْهَا بِقُوَّةٍ وَّأْمُرْ قَوْمَكَ يَأْخُذُوْا بِاَحْسَنِهَا ۗسَاُورِيْكُمْ دَارَ الْفٰسِقِيْنَ",
    "transliteration_en": "Wa katabnaa lahoo fil alwaahi minkulli shai'immaw 'izaanw wa tafseelal likulli shai'in fakhuzhaa biquwwatinw waamur qawmaka yaakhuzoo bi ahsanihaa; wa ooreekum daaral faasiqeen",
    "transliteration_id": "Wa katabnā lahū fil-alwāḥi min kulli syai'im mau‘iẓataw wa tafṣīlal likulli syai'(in), fa khużhā biquwwatiw wa'mur qaumaka ya'khużū bi'aḥsanihā, sa'urīkum dāral-fāsiqīn(a).",
    "translation_en": "And We wrote for him on the tablets [something] of all things - instruction and explanation for all things, [saying], \"Take them with determination and order your people to take the best of it. I will show you the home of the defiantly disobedient.\"",
    "translation_id": "Kami telah menuliskan untuk Musa pada lauh-lauh (Taurat) segala sesuatu sebagai pelajaran dan penjelasan untuk segala hal. Lalu (Kami berfirman kepadanya,) “Berpegang teguhlah padanya dengan sungguh-sungguh dan suruhlah kaummu berpegang padanya dengan sebaik-baiknya. Aku akan memperlihatkan kepadamu (kehancuran) negeri orang-orang fasik.”"
  },
  {
    "ayat": 146,
    "arabic": "سَاَصْرِفُ عَنْ اٰيٰتِيَ الَّذِيْنَ يَتَكَبَّرُوْنَ فِى الْاَرْضِ بِغَيْرِ الْحَقِّۗ وَاِنْ يَّرَوْا كُلَّ اٰيَةٍ لَّا يُؤْمِنُوْا بِهَاۚ وَاِنْ يَّرَوْا سَبِيْلَ الرُّشْدِ لَا يَتَّخِذُوْهُ سَبِيْلًاۚ وَاِنْ يَّرَوْا سَبِيْلَ الْغَيِّ يَتَّخِذُوْهُ سَبِيْلًاۗ ذٰلِكَ بِاَنَّهُمْ كَذَّبُوْا بِاٰيٰتِنَا وَكَانُوْا عَنْهَا غٰفِلِيْنَ",
    "transliteration_en": "Sa asrifu 'an Aayaatiyal lazeena yatakabbaroona fil ardi bighairil haqq; wa iny-yaraw kulla Aayatil laa yu'minoo bihaa wa iny-yaraw sabeelar rushdi laa yattakhizoohu sabeelanw wa iny-yaraw sabeelal ghaiyi yatta khizoohu sabeelaa; zaalika bi annahum kazzaboo bi Aayaatinaa wa kaanoo 'anhaa ghaafileen",
    "transliteration_id": "Sa'aṣrifu ‘an āyātiyal-lażīna yatakabbarūna fil-arḍi bigairil-ḥaqq(i), wa iy yarau kulla āyatil lā yu'minū bihā, wa iy yarau sabīlar-rusydi lā yattakhiżūhu sabīlā(n), wa iy yarau sabīlal-gayyi yattakhiżūhu sabīlā(n), żālika bi'annahum każżabū bi'āyātinā wa kānū  ‘anhā gāfilīn(a).",
    "translation_en": "I will turn away from My signs those who are arrogant upon the earth without right; and if they should see every sign, they will not believe in it. And if they see the way of consciousness, they will not adopt it as a way; but if they see the way of error, they will adopt it as a way. That is because they have denied Our signs and they were heedless of them.",
    "translation_id": "Aku akan memalingkan orang-orang yang menyombongkan diri di bumi tanpa alasan yang benar dari tanda-tanda (kekuasaan-Ku). Jika mereka melihat semua tanda-tanda itu, mereka tetap tidak mau beriman padanya. Jika mereka melihat jalan kebenaran, mereka tetap tidak mau menempuhnya. (Sebaliknya,) jika mereka melihat jalan kesesatan, mereka menempuhnya. Demikian itu adalah karena mereka mendustakan ayat-ayat Kami dan mereka selalu lengah terhadapnya."
  },
  {
    "ayat": 147,
    "arabic": "وَالَّذِيْنَ كَذَّبُوْا بِاٰيٰتِنَا وَلِقَاۤءِ الْاٰخِرَةِ حَبِطَتْ اَعْمَالُهُمْۗ هَلْ يُجْزَوْنَ اِلَّا مَا كَانُوْا يَعْمَلُوْنَ ࣖ",
    "transliteration_en": "Wallazeena kazzaboo bi Aayaatinaa wa liqaaa'il Aakhirati habitat 'amaaluhum; hal yujzawna illaa maa kaanoo ya'maloon",
    "transliteration_id": "Wal-lażīna każżabū bi'āyātinā wa liqā'il-ākhirati ḥabiṭat a‘māluhum, hal yujzauna illā mā kānū ya‘malūn(a).",
    "translation_en": "Those who denied Our signs and the meeting of the Hereafter - their deeds have become worthless. Are they recompensed except for what they used to do?",
    "translation_id": "Orang-orang yang mendustakan tanda-tanda (kekuasaan) Kami dan adanya pertemuan akhirat, sia-sialah amal mereka. Bukankah mereka (tidak) akan dibalas, kecuali (sesuai dengan) apa yang telah mereka kerjakan."
  },
  {
    "ayat": 148,
    "arabic": "وَاتَّخَذَ قَوْمُ مُوْسٰى مِنْۢ بَعْدِهٖ مِنْ حُلِيِّهِمْ عِجْلًا جَسَدًا لَّهٗ خُوَارٌۗ  اَلَمْ يَرَوْا اَنَّهٗ لَا يُكَلِّمُهُمْ وَلَا يَهْدِيْهِمْ سَبِيْلًاۘ اِتَّخَذُوْهُ وَكَانُوْا ظٰلِمِيْنَ",
    "transliteration_en": "Wattakhaza qawmu Moosaa mim ba'dihee min huliyyihim 'ijlan jasadal lahoo khuwaar; alam yaraw annahoo laa yukallimuhum wa laa yahdeehim sabeelaa; ittakha zoohu wa kaanoo zaalimeen",
    "transliteration_id": "Wattakhaża mūsā mim ba‘dihī min ḥuliyyihim ‘ijlan jasadal lahū khuwār(un), alam yarau annahū lā yukallimuhum wa lā yahdīhim sabīlā(n), ittakhażūhu wa kānū ẓālimīn(a).",
    "translation_en": "And the people of Moses made, after [his departure], from their ornaments a calf - an image having a lowing sound. Did they not see that it could neither speak to them nor guide them to a way? They took it [for worship], and they were wrongdoers.",
    "translation_id": "Kaum Musa, setelah kepergian (Musa ke Gunung Sinai), membuat (sembahan berupa) patung anak sapi yang bertubuh dan dapat melenguh (bersuara) dari perhiasan emas mereka. Apakah mereka tidak mengetahui bahwa (patung) anak sapi itu tidak dapat berbicara dengan mereka dan tidak dapat (pula) menunjukkan jalan (kebaikan) kepada mereka? (Bahkan,) mereka menjadikannya (sebagai sembahan). Mereka adalah orang-orang zalim."
  },
  {
    "ayat": 149,
    "arabic": "وَلَمَّا سُقِطَ فِيْٓ اَيْدِيْهِمْ وَرَاَوْا اَنَّهُمْ قَدْ ضَلُّوْاۙ قَالُوْا لَىِٕنْ لَّمْ يَرْحَمْنَا رَبُّنَا وَيَغْفِرْ لَنَا لَنَكُوْنَنَّ مِنَ الْخٰسِرِيْنَ",
    "transliteration_en": "Wa lammaa suqita feee aideehim wa ra aw annahum qad dalloo qaaloo la'il lam yarhamnaa Rabbunaa wa yaghfir lanaa lanakoonanna minal khaasireen",
    "transliteration_id": "Wa lammā suqiṭa fī aidīhim wa ra'au annahum qad ḍallū, qālū la'il lam yarḥamnā rabbunā wa yagfir lanā lanakūnanna minal-khāsirīn(a).",
    "translation_en": "And when regret overcame them and they saw that they had gone astray, they said, \"If our Lord does not have mercy upon us and forgive us, we will surely be among the losers.\"",
    "translation_id": "Setelah mereka (sangat) menyesali perbuatannya dan mengetahui bahwa mereka benar-benar sesat, mereka berkata, “Sungguh, jika Tuhan kami tidak memberi rahmat kepada kami dan tidak mengampuni kami, pastilah kami menjadi orang-orang yang merugi.”"
  },
  {
    "ayat": 150,
    "arabic": "وَلَمَّا رَجَعَ مُوْسٰٓى اِلٰى قَوْمِهٖ غَضْبَانَ اَسِفًاۙ قَالَ بِئْسَمَا خَلَفْتُمُوْنِيْ مِنْۢ بَعْدِيْۚ اَعَجِلْتُمْ اَمْرَ رَبِّكُمْۚ وَاَلْقَى الْاَلْوَاحَ وَاَخَذَ بِرَأْسِ اَخِيْهِ يَجُرُّهٗٓ اِلَيْهِ ۗقَالَ ابْنَ اُمَّ اِنَّ الْقَوْمَ اسْتَضْعَفُوْنِيْ وَكَادُوْا يَقْتُلُوْنَنِيْۖ فَلَا تُشْمِتْ بِيَ الْاَعْدَاۤءَ وَلَا تَجْعَلْنِيْ مَعَ الْقَوْمِ الظّٰلِمِيْنَ",
    "transliteration_en": "Wa lammaa raja'a Moosaaa ilaa qawmihee ghadbaana asifan qaala bi'samaa khalaftumoonee mim ba'dee a-'ajiltum amra Rabbikum wa alqal alwaaha wa akhaza biraasi akheehi yajurruhoo ilaih; qaalab na umma innal qawmas tad'afoonee wa kadoo yaqtu loonanee; falaa tushmit biyal a'daaa'a wa laa taj'alnee ma'al qawmiz zaalimeen",
    "transliteration_id": "Wa lammā raja‘a mūsā ilā qaumihī gaḍbāna asifā(n), qāla bi'samā khalaftumūnī mim ba‘dī, a‘ajiltum amra rabbikum, wa alqal-alwāḥa wa akhaża bira'si akhīhi yajurruhū ilaih(i), qālabna umma innal-qaumastaḍ‘afūnī wa kādū yaqtulūnanī, falā tusymit biyal-a‘dā'a wa lā taj‘alnī ma‘al-qaumiẓ-ẓālimīn(a).",
    "translation_en": "And when Moses returned to his people, angry and grieved, he said, \"How wretched is that by which you have replaced me after [my departure]. Were you impatient over the matter of your Lord?\" And he threw down the tablets and seized his brother by [the hair of] his head, pulling him toward him. [Aaron] said, \"O son of my mother, indeed the people oppressed me and were about to kill me, so let not the enemies rejoice over me and do not place me among the wrongdoing people.\"",
    "translation_id": "Ketika Musa kembali kepada kaumnya dalam keadaan marah lagi sedih, dia berkata, “Alangkah buruknya perbuatan yang kamu kerjakan selama kepergianku! Apakah kamu hendak mendahului janji Tuhanmu?” Musa pun melemparkan lauh-lauh (Taurat) itu dan memegang kepala (menjambak) saudaranya (Harun) sambil menariknya ke arahnya. (Harun) berkata, “Wahai anak ibuku, kaum ini telah menganggapku lemah dan hampir saja mereka membunuhku. Oleh karena itu, janganlah engkau menjadikan musuh-musuh menyorakiku (karena melihat perlakuan kasarmu terhadapku). Janganlah engkau menjadikanku (dalam pandanganmu) bersama kaum yang zalim.”"
  }
]