[
  {
    "ayat": 1,
    "arabic": "الۤمّۤصۤ ۚ",
    "transliteration_en": "Alif-Laaam-Meeem-Saaad",
    "transliteration_id": "Alif lām mīm ṣād.",
    "translation_en": "Alif, Lam, Meem, Sad.",
    "translation_id": "Alif Lām Mīm Ṣād."
  },
  {
    "ayat": 2,
    "arabic": "كِتٰبٌ اُنْزِلَ اِلَيْكَ فَلَا يَكُنْ فِيْ صَدْرِكَ حَرَجٌ مِّنْهُ لِتُنْذِرَ بِهٖ وَذِكْرٰى لِلْمُؤْمِنِيْنَ",
    "transliteration_en": "Kitaabun unzila ilaika falaa yakum fee sadrika harajum minhu litunzira bihee wa zikraa lilmu'mineen",
    "transliteration_id": "Kitābun unzila ilaika falā yakun fī ṣadrika ḥarajum minhu litunżira bihī wa żikrā lil-mu'minīn(a).",
    "translation_en": "[This is] a Book revealed to you, [O Muhammad] - so let there not be in your breast distress therefrom - that you may warn thereby and as a reminder to the believers.",
    "translation_id": "(Inilah) Kitab yang diturunkan kepadamu (Nabi Muhammad), maka janganlah engkau sesak dada karenanya supaya dengan (kitab itu) engkau memberi peringatan, dan menjadi pelajaran bagi orang-orang yang beriman."
  },
  {
    "ayat": 3,
    "arabic": "اِتَّبِعُوْا مَآ اُنْزِلَ اِلَيْكُمْ مِّنْ رَّبِّكُمْ وَلَا تَتَّبِعُوْا مِنْ دُوْنِهٖٓ اَوْلِيَاۤءَۗ قَلِيْلًا مَّا تَذَكَّرُوْنَ",
    "transliteration_en": "Ittabi'oo maaa unzila 'ilaikum mir Rabbikum wa laa tattabi'oo min dooniheee awliyaaa'; qaleelam maa tazakkaroon",
    "transliteration_id": "Ittabi‘ū mā unzila ilaikum mir rabbikum wa lā tattabi‘ū min dūnihī auliyā'(a), qalīlam mā tażakkarūn(a).",
    "translation_en": "Follow, [O mankind], what has been revealed to you from your Lord and do not follow other than Him any allies. Little do you remember.",
    "translation_id": "Ikutilah apa yang diturunkan kepadamu dari Tuhanmu dan janganlah kamu ikuti pelindung selain Dia. Sedikit sekali kamu mengambil pelajaran."
  },
  {
    "ayat": 4,
    "arabic": "وَكَمْ مِّنْ قَرْيَةٍ اَهْلَكْنٰهَا فَجَاۤءَهَا بَأْسُنَا بَيَاتًا اَوْ هُمْ قَاۤىِٕلُوْنَ",
    "transliteration_en": "Wa kam min qaryatin ahlaknaahaa fajaaa'ahaa baasunaa bayaatan aw hum qaaa'iloon",
    "transliteration_id": "Wa kam min qaryatin ahlaknāhā fa jā'ahā ba'sunā bayātan au hum qā'ilūn(a).",
    "translation_en": "And how many cities have We destroyed, and Our punishment came to them at night or while they were sleeping at noon.",
    "translation_id": "Betapa banyak negeri yang telah Kami binasakan. Siksaan Kami datang (menimpa penduduknya) pada malam hari atau pada saat mereka beristirahat pada siang hari."
  },
  {
    "ayat": 5,
    "arabic": "فَمَا كَانَ دَعْوٰىهُمْ اِذْ جَاۤءَهُمْ بَأْسُنَآ اِلَّآ اَنْ قَالُوْٓا اِنَّا كُنَّا ظٰلِمِيْنَ",
    "transliteration_en": "Famaa kaana da'waahum iz jaaa'ahum baasunaa illaaa an qaalooo innaa kunnaa zaalimeen",
    "transliteration_id": "Famā kāna da‘wāhum iż jā'ahum ba'sunā illā an qālū innā kunnā ẓālimīn(a).",
    "translation_en": "And their declaration when Our punishment came to them was only that they said, \"Indeed, we were wrongdoers!\"",
    "translation_id": "Maka, ketika siksaan Kami datang menimpa mereka, keluhan mereka tidak lain hanyalah ucapan “Sesungguhnya kami adalah orang-orang zalim.”"
  },
  {
    "ayat": 6,
    "arabic": "فَلَنَسْـَٔلَنَّ الَّذِيْنَ اُرْسِلَ اِلَيْهِمْ وَلَنَسْـَٔلَنَّ الْمُرْسَلِيْنَۙ",
    "transliteration_en": "Falanas 'alannal lazeena ursila ilaihim wa lanas 'alannal mursaleen",
    "transliteration_id": "Fa lanas'alannal-lażīna ursila ilaihim wa lanas'alannal-mursalīn(a).",
    "translation_en": "Then We will surely question those to whom [a message] was sent, and We will surely question the messengers.",
    "translation_id": "Pasti akan Kami tanyai umat yang kepada mereka telah diutus para rasul. Pasti akan Kami tanyai (pula) para rasul."
  },
  {
    "ayat": 7,
    "arabic": "فَلَنَقُصَّنَّ عَلَيْهِمْ بِعِلْمٍ وَّمَا كُنَّا غَاۤىِٕبِيْنَ",
    "transliteration_en": "Falanaqussanna 'alaihim bi'ilminw wa maa kunnaa ghaaa'ibeen",
    "transliteration_id": "Fa lanaquṣṣanna ‘alaihim bi‘ilmiw wa mā kunnā gā'ibīn(a).",
    "translation_en": "Then We will surely relate [their deeds] to them with knowledge, and We were not [at all] absent.",
    "translation_id": "Kemudian, pasti akan Kami kabarkan (hal itu) kepada mereka berdasarkan ilmu (Kami). Sedikit pun Kami tidak pernah gaib (jauh dari mereka)."
  },
  {
    "ayat": 8,
    "arabic": "وَالْوَزْنُ يَوْمَىِٕذِ ِۨالْحَقُّۚ فَمَنْ ثَقُلَتْ مَوَازِيْنُهٗ فَاُولٰۤىِٕكَ هُمُ الْمُفْلِحُوْنَ",
    "transliteration_en": "Walwaznu Yawma'izinil haqq; faman saqulat mawaa zeenuhoo fa-ulaaa'ika humul muflihoon",
    "transliteration_id": "Wal-waznu yauma'iżinil-ḥaqq(u), faman ṡaqulat mawāzīnuhū fa ulā'ika humul-mufliḥūn(a).",
    "translation_en": "And the weighing [of deeds] that Day will be the truth. So those whose scales are heavy - it is they who will be the successful.",
    "translation_id": "Timbangan pada hari itu (menjadi ukuran) kebenaran. Siapa yang berat timbangan (kebaikan)-nya, mereka itulah orang yang beruntung."
  },
  {
    "ayat": 9,
    "arabic": "وَمَنْ خَفَّتْ مَوَازِيْنُهٗ فَاُولٰۤىِٕكَ الَّذِيْنَ خَسِرُوْٓا اَنْفُسَهُمْ بِمَا كَانُوْا بِاٰيٰتِنَا يَظْلِمُوْنَ",
    "transliteration_en": "Wa man khaffat mawaazeenuhoo fa ulaaa'ikal lazeena khasirooo anfusahum bimaa kaanoo bi Aayaatinaa yazlimoon",
    "transliteration_id": "Wa man khaffat mawāzīnuhū fa ulā'ikal-lażīna khasirū anfusahum bimā kānū bi'āyātinā yaẓlimūn(a).",
    "translation_en": "And those whose scales are light - they are the ones who will lose themselves for what injustice they were doing toward Our verses.",
    "translation_id": "Siapa yang ringan timbangan (kebaikan)-nya, mereka itulah orang yang telah merugikan dirinya sendiri karena mereka selalu mengingkari ayat-ayat Kami."
  },
  {
    "ayat": 10,
    "arabic": "وَلَقَدْ مَكَّنّٰكُمْ فِى الْاَرْضِ وَجَعَلْنَا لَكُمْ فِيْهَا مَعَايِشَۗ قَلِيْلًا مَّا تَشْكُرُوْنَ ࣖ",
    "transliteration_en": "Wa laqad makkannaakum fil ardi wa ja'alnaa lakum feehaa ma'aayish; qaleelam maa tashkuroon",
    "transliteration_id": "Wa laqad makkannākum fil-arḍi wa ja‘alnā lakum fīhā ma‘āyisy(a), qalīlam mā tasykurūn(a).",
    "translation_en": "And We have certainly established you upon the earth and made for you therein ways of livelihood. Little are you grateful.",
    "translation_id": "Sungguh, Kami benar-benar telah menempatkan kamu sekalian di bumi dan Kami sediakan di sana (bumi) penghidupan untukmu. (Akan tetapi,) sedikit sekali kamu bersyukur"
  },
  {
    "ayat": 11,
    "arabic": "وَلَقَدْ خَلَقْنٰكُمْ ثُمَّ صَوَّرْنٰكُمْ ثُمَّ قُلْنَا لِلْمَلٰۤىِٕكَةِ اسْجُدُوْا لِاٰدَمَ فَسَجَدُوْٓا اِلَّآ اِبْلِيْسَۗ  لَمْ يَكُنْ مِّنَ السّٰجِدِيْنَ",
    "transliteration_en": "Wa laqad khalaqnaakum summa sawwarnaakum summa qulnaa lilmalaaa'ikatis judoo li Aadama fa-sajadooo illaaa Ibleesa lam yakum minas saajideen",
    "transliteration_id": "Wa laqad khalaqnākum ṡumma ṣawwarnākum ṡumma qulnā lil-malā'ikatisjudū li'ādama fa sajadū illā iblīs(a), lam yakum minas-sājidīn(a).",
    "translation_en": "And We have certainly created you, [O Mankind], and given you [human] form. Then We said to the angels, \"Prostrate to Adam\"; so they prostrated, except for Iblees. He was not of those who prostrated.",
    "translation_id": "Sungguh, Kami benar-benar telah menciptakan kamu (Adam), kemudian Kami membentuk (tubuh)-mu. Lalu, Kami katakan kepada para malaikat, “Bersujudlah kamu kepada Adam.” Mereka pun sujud, tetapi Iblis (enggan). Ia (Iblis) tidak termasuk kelompok yang bersujud."
  },
  {
    "ayat": 12,
    "arabic": "قَالَ مَا مَنَعَكَ اَلَّا تَسْجُدَ اِذْ اَمَرْتُكَ ۗقَالَ اَنَا۠ خَيْرٌ مِّنْهُۚ خَلَقْتَنِيْ مِنْ نَّارٍ وَّخَلَقْتَهٗ مِنْ طِيْنٍ",
    "transliteration_en": "Qaala maa mana'aka allaa tasjuda iz amartuka qaala ana khairum minhu khalaqtanee min naarinw wa khalaqtahoo min teen",
    "transliteration_id": "Qāla mā mana‘aka allā tasjuda iż amartuk(a), qāla ana khairum minh(u), khalaqtanī min nāriw wa khalaqtahū min ṭīn(in).",
    "translation_en": "[Allah] said, \"What prevented you from prostrating when I commanded you?\" [Satan] said, \"I am better than him. You created me from fire and created him from clay.\"",
    "translation_id": "Dia (Allah) berfirman, “Apakah yang menghalangimu (sehingga) kamu tidak bersujud ketika Aku menyuruhmu?” Ia (Iblis) menjawab, “Aku lebih baik daripada dia. Engkau menciptakanku dari api, sedangkan dia Engkau ciptakan dari tanah.”"
  },
  {
    "ayat": 13,
    "arabic": "قَالَ فَاهْبِطْ مِنْهَا فَمَا يَكُوْنُ لَكَ اَنْ تَتَكَبَّرَ فِيْهَا فَاخْرُجْ اِنَّكَ مِنَ الصّٰغِرِيْنَ",
    "transliteration_en": "Qaala fahbit minhaa famaa yakoonu laka an tatakabbara feehaa fakhruj innaka minas saaghireen",
    "transliteration_id": "Qāla fahbiṭ minhā famā yakūnu laka an tatakabbara fīhā fakhruj innaka minaṣ-ṣāgirīn(a).",
    "translation_en": "[Allah] said, \"Descend from Paradise, for it is not for you to be arrogant therein. So get out; indeed, you are of the debased.",
    "translation_id": "Dia (Allah) berfirman, “Turunlah kamu darinya (surga) karena kamu tidak sepatutnya menyombongkan diri di dalamnya. Keluarlah! Sesungguhnya kamu termasuk makhluk yang hina.”"
  },
  {
    "ayat": 14,
    "arabic": "قَالَ اَنْظِرْنِيْٓ اِلٰى يَوْمِ يُبْعَثُوْنَ",
    "transliteration_en": "Qaala anzirneee ilaa Yawmi yub'asoon",
    "transliteration_id": "Qāla anẓirnī ilā yaumi yub‘aṡūn(a).",
    "translation_en": "[Satan] said, \"Reprieve me until the Day they are resurrected.\"",
    "translation_id": "Ia (Iblis) menjawab, “Berilah aku penangguhan waktu sampai hari mereka dibangkitkan.”"
  },
  {
    "ayat": 15,
    "arabic": "قَالَ اِنَّكَ مِنَ الْمُنْظَرِيْنَ",
    "transliteration_en": "Qaala innaka minal munzareen",
    "transliteration_id": "Qāla innaka minal-munẓarīn(a).",
    "translation_en": "[Allah] said, \"Indeed, you are of those reprieved.\"",
    "translation_id": "Dia (Allah) berfirman, “Sesungguhnya kamu termasuk mereka yang diberi penangguhan waktu.”"
  },
  {
    "ayat": 16,
    "arabic": "قَالَ فَبِمَآ اَغْوَيْتَنِيْ لَاَقْعُدَنَّ لَهُمْ صِرَاطَكَ الْمُسْتَقِيْمَۙ",
    "transliteration_en": "Qaala fabimaaa aghway tanee la aq'udanna lahum Siraatakal Mustaqeem",
    "transliteration_id": "Qāla fabimā agwaitanī la'aq‘udanna lahum  ṣirāṭakal-mustaqīm(a).",
    "translation_en": "[Satan] said, \"Because You have put me in error, I will surely sit in wait for them on Your straight path.",
    "translation_id": "Ia (Iblis) menjawab, “Karena Engkau telah menyesatkan aku, pasti aku akan selalu menghalangi mereka dari jalan-Mu yang lurus."
  },
  {
    "ayat": 17,
    "arabic": "ثُمَّ لَاٰتِيَنَّهُمْ مِّنْۢ بَيْنِ اَيْدِيْهِمْ وَمِنْ خَلْفِهِمْ وَعَنْ اَيْمَانِهِمْ وَعَنْ شَمَاۤىِٕلِهِمْۗ وَلَا تَجِدُ اَكْثَرَهُمْ شٰكِرِيْنَ",
    "transliteration_en": "Summa la aatiyannahum mim baine aideehim wa min khalfihim wa 'an aimaanihim wa 'an shamaaa'ilihim wa laa tajidu aksarahum shaakireen",
    "transliteration_id": "Ṡumma la'ātiyannahum mim baini aidīhim wa min khalfihim wa ‘an aimānihim wa ‘an syamā'ilihim, wa lā tajidu akṡarahum syākirīn(a).",
    "translation_en": "Then I will come to them from before them and from behind them and on their right and on their left, and You will not find most of them grateful [to You].\"",
    "translation_id": "Kemudian, pasti aku akan mendatangi mereka dari depan, dari belakang, dari kanan, dan dari kiri mereka. Engkau tidak akan mendapati kebanyakan mereka bersyukur.”"
  },
  {
    "ayat": 18,
    "arabic": "قَالَ اخْرُجْ مِنْهَا مَذْءُوْمًا مَّدْحُوْرًا ۗ لَمَنْ تَبِعَكَ مِنْهُمْ لَاَمْلَـَٔنَّ جَهَنَّمَ مِنْكُمْ اَجْمَعِيْنَ",
    "transliteration_en": "Qaalakh ruj mnhaa maz'oomam madhooraa; laman tabi'aka minhum la amla'anna Jahannama minkum ajma'een",
    "transliteration_id": "Qālakhruj minhā maż'ūmam madḥūrā(n), laman tabi‘aka minhum la'amla'anna  jahannama minkum ajma‘īn(a).",
    "translation_en": "[Allah] said, \"Get out of Paradise, reproached and expelled. Whoever follows you among them - I will surely fill Hell with you, all together.\"",
    "translation_id": "Dia (Allah) berfirman, “Keluarlah kamu darinya (surga) dalam keadaan terhina dan terusir! Sungguh, siapa pun di antara mereka yang mengikutimu pasti akan Aku isi (neraka) Jahanam dengan kamu semua.”"
  },
  {
    "ayat": 19,
    "arabic": "وَيٰٓاٰدَمُ اسْكُنْ اَنْتَ وَزَوْجُكَ الْجَنَّةَ فَكُلَا مِنْ حَيْثُ شِئْتُمَا وَلَا تَقْرَبَا هٰذِهِ الشَّجَرَةَ فَتَكُوْنَا مِنَ الظّٰلِمِيْنَ",
    "transliteration_en": "Wa yaaa Aadamus kun anta wa zawjukal Jannata fakulaa min haisu shi'tumaa wa laa taqrabaa haazihish shajarata fatakoonaa minza zaalimeen",
    "transliteration_id": "Wa yā ādamuskun anta wa zaujukal-jannata fa kulā min ḥaiṡu syi'tumā wa lā taqrabā hāżihisy-syajarata fa takūnā minaẓ-ẓālimīn(a).",
    "translation_en": "And \"O Adam, dwell, you and your wife, in Paradise and eat from wherever you will but do not approach this tree, lest you be among the wrongdoers.\"",
    "translation_id": "(Allah berfirman,) “Wahai Adam, tinggallah engkau dan istrimu di surga (ini). Lalu, makanlah apa saja yang kamu berdua sukai dan janganlah kamu berdua mendekati pohon yang satu ini sehingga kamu berdua termasuk orang-orang yang zalim.”"
  },
  {
    "ayat": 20,
    "arabic": "فَوَسْوَسَ لَهُمَا الشَّيْطٰنُ لِيُبْدِيَ لَهُمَا مَا وٗرِيَ عَنْهُمَا مِنْ سَوْءٰتِهِمَا وَقَالَ مَا نَهٰىكُمَا رَبُّكُمَا عَنْ هٰذِهِ الشَّجَرَةِ اِلَّآ اَنْ تَكُوْنَا مَلَكَيْنِ اَوْ تَكُوْنَا مِنَ الْخٰلِدِيْنَ",
    "transliteration_en": "Fawaswasa lahumash Shaitaanu liyubdiya lahumaa maa wooriya 'anhumaa min saw aatihimaa wa qaala maa nahaakumaa Rabbukumaa 'an haazihish shajarati illaaa an takoonaa malakaini aw takoonaa minal khaalideen",
    "transliteration_id": "Fa waswasa lahumasy-syaiṭānu liyubdiya lahumā mā wūriya ‘anhumā min sau'ātihimā wa qāla mā nahākumā rabbukumā ‘an hāżihisy-syajarati illā an takūnā malakaini au takūnā minal-khālidīn(a).",
    "translation_en": "But Satan whispered to them to make apparent to them that which was concealed from them of their private parts. He said, \"Your Lord did not forbid you this tree except that you become angels or become of the immortal.\"",
    "translation_id": "Maka, setan membisikkan (pikiran jahat) kepada keduanya yang berakibat tampak pada keduanya sesuatu yang tertutup dari aurat keduanya. Ia (setan) berkata, “Tuhanmu tidak melarang kamu berdua untuk mendekati pohon ini, kecuali (karena Dia tidak senang) kamu berdua menjadi malaikat atau kamu berdua termasuk orang-orang yang kekal (dalam surga).”"
  },
  {
    "ayat": 21,
    "arabic": "وَقَاسَمَهُمَآ اِنِّيْ لَكُمَا لَمِنَ النّٰصِحِيْنَۙ",
    "transliteration_en": "Wa qaasamahumaaa innee lakumaa laminan naasiheen",
    "transliteration_id": "Wa qāsamahumā innī lakumā laminan-nāṣiḥīn(a).",
    "translation_en": "And he swore [by Allah] to them, \"Indeed, I am to you from among the sincere advisors.\"",
    "translation_id": "Ia (setan) bersumpah kepada keduanya, “Sesungguhnya aku ini bagi kamu berdua benar-benar termasuk para pemberi nasihat.”"
  },
  {
    "ayat": 22,
    "arabic": "فَدَلّٰىهُمَا بِغُرُوْرٍۚ فَلَمَّا ذَاقَا الشَّجَرَةَ بَدَتْ لَهُمَا سَوْءٰتُهُمَا وَطَفِقَا يَخْصِفٰنِ عَلَيْهِمَا مِنْ وَّرَقِ الْجَنَّةِۗ وَنَادٰىهُمَا رَبُّهُمَآ اَلَمْ اَنْهَكُمَا عَنْ تِلْكُمَا الشَّجَرَةِ وَاَقُلْ لَّكُمَآ اِنَّ الشَّيْطٰنَ لَكُمَا عَدُوٌّ مُّبِيْنٌ",
    "transliteration_en": "Fadallaahumaa bighuroor; falammaa zaaqash shajarata badat lahumaa saw aatuhumaa wa tafiqaa yakhsifaani 'alaihimaa minw waraqil jannati wa naadaahumaa Rabbuhumaaa alam anhakumaa 'an tilkumash shajarati wa aqul lakumaaa innash Shaitaana lakumaa 'aduwwum mubeen",
    "transliteration_id": "Fa dallāhumā bigurūr(in), falammā żāqasy-syajarata badat lahumā sau'ātuhumā wa ṭafiqā yakhṣifāni ‘alaihimā miw waraqil-jannah(ti), wa nādāhumā rabbuhumā alam anhakumā ‘an tilkumasy-syajarati wa aqul lakumā innasy-syaiṭāna lakumā ‘aduwwum mubīn(un).",
    "translation_en": "So he made them fall, through deception. And when they tasted of the tree, their private parts became apparent to them, and they began to fasten together over themselves from the leaves of Paradise. And their Lord called to them, \"Did I not forbid you from that tree and tell you that Satan is to you a clear enemy?\"",
    "translation_id": "Ia (setan) menjerumuskan keduanya dengan tipu daya. Maka, ketika keduanya telah mencicipi (buah) pohon itu, tampaklah pada keduanya auratnya dan mulailah keduanya menutupinya dengan daun-daun (di) surga. Tuhan mereka menyeru mereka, “Bukankah Aku telah melarang kamu berdua dari pohon itu dan Aku telah mengatakan bahwa sesungguhnya setan adalah musuh yang nyata bagi kamu berdua?”"
  },
  {
    "ayat": 23,
    "arabic": "قَالَا رَبَّنَا ظَلَمْنَآ اَنْفُسَنَا وَاِنْ لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُوْنَنَّ مِنَ الْخٰسِرِيْنَ",
    "transliteration_en": "Qaalaa Rabbanaa zalamnaaa anfusanaa wa illam taghfir lanaa wa tarhamnaa lanakoonanna minal khaasireen",
    "transliteration_id": "Qālā rabbanā ẓalamnā anfusanā wa illam tagfir lanā wa tarḥamnā lanakūnanna minal-khāsirīn(a).",
    "translation_en": "They said, \"Our Lord, we have wronged ourselves, and if You do not forgive us and have mercy upon us, we will surely be among the losers.\"",
    "translation_id": "Keduanya berkata, “Ya Tuhan kami, kami telah menzalimi diri kami sendiri. Jika Engkau tidak mengampuni kami dan tidak merahmati kami, niscaya kami termasuk orang-orang yang rugi.”"
  },
  {
    "ayat": 24,
    "arabic": "قَالَ اهْبِطُوْا بَعْضُكُمْ لِبَعْضٍ عَدُوٌّ ۚوَلَكُمْ فِى الْاَرْضِ مُسْتَقَرٌّ وَّمَتَاعٌ اِلٰى حِيْنٍ",
    "transliteration_en": "Qaalah bitoo ba'dukum liba'din aduwwunw wa lakum fil ardi mmustaqarrunw wa mataa'un ilaaheen",
    "transliteration_id": "Qālahbiṭū ba‘ḍukum liba‘ḍin ‘aduww(un), wa lakum fil-arḍi mustaqarruw wa matā‘un ilā ḥīn(in).",
    "translation_en": "[Allah] said, \"Descend, being to one another enemies. And for you on the earth is a place of settlement and enjoyment for a time.\"",
    "translation_id": "Dia (Allah) berfirman, “Turunlah kamu! Sebagian kamu menjadi musuh bagi yang lain serta bagi kamu ada tempat tinggal dan kesenangan di bumi sampai waktu yang telah ditentukan.”"
  },
  {
    "ayat": 25,
    "arabic": "قَالَ فِيْهَا تَحْيَوْنَ وَفِيْهَا تَمُوْتُوْنَ وَمِنْهَا تُخْرَجُوْنَ ࣖ",
    "transliteration_en": "Qaala feehaa tahyawna wa feehaa tamootoona wa minhaa tukhrajoon",
    "transliteration_id": "Qāla fīhā taḥyauna wa fīhā tamūtūna wa minhā tukhrajūn(a).",
    "translation_en": "He said, \"Therein you will live, and therein you will die, and from it you will be brought forth.\"",
    "translation_id": "Dia (Allah) berfirman, “Di sana kamu hidup, di sana kamu mati, dan dari sana (pula) kamu akan dikeluarkan (dibangkitkan).”"
  },
  {
    "ayat": 26,
    "arabic": "يٰبَنِيْٓ اٰدَمَ قَدْ اَنْزَلْنَا عَلَيْكُمْ لِبَاسًا يُّوَارِيْ سَوْءٰتِكُمْ وَرِيْشًاۗ وَلِبَاسُ التَّقْوٰى ذٰلِكَ خَيْرٌۗ ذٰلِكَ مِنْ اٰيٰتِ اللّٰهِ لَعَلَّهُمْ يَذَّكَّرُوْنَ",
    "transliteration_en": "Yaa Baneee Aadama qad anzalnaa 'alaikum libaasany yuwaaree saw aatikum wa reeshanw wa libaasut taqwaa zaalika khair; zaalika min Aayaatil laahi la'allahum yaz zakkaroon",
    "transliteration_id": "Yā banī ādama qad anzalnā ‘alaikum libāsay yuwārī sau'ātikum wa rīsyā(n), wa libāsut-taqwā żālika khair(un), żālika min āyātillāhi la‘allahum yażżakkarūn(a).",
    "translation_en": "O children of Adam, We have bestowed upon you clothing to conceal your private parts and as adornment. But the clothing of righteousness - that is best. That is from the signs of Allah that perhaps they will remember.",
    "translation_id": "Wahai anak cucu Adam, sungguh Kami telah menurunkan kepadamu pakaian untuk menutupi auratmu dan bulu (sebagai bahan pakaian untuk menghias diri). (Akan tetapi,) pakaian takwa itulah yang paling baik. Yang demikian itu merupakan sebagian tanda-tanda (kekuasaan) Allah agar mereka selalu ingat."
  },
  {
    "ayat": 27,
    "arabic": "يٰبَنِيْٓ اٰدَمَ لَا يَفْتِنَنَّكُمُ الشَّيْطٰنُ كَمَآ اَخْرَجَ اَبَوَيْكُمْ مِّنَ الْجَنَّةِ يَنْزِعُ عَنْهُمَا لِبَاسَهُمَا لِيُرِيَهُمَا سَوْءٰتِهِمَا ۗاِنَّهٗ يَرٰىكُمْ هُوَ وَقَبِيْلُهٗ مِنْ حَيْثُ لَا تَرَوْنَهُمْۗ اِنَّا جَعَلْنَا الشَّيٰطِيْنَ اَوْلِيَاۤءَ لِلَّذِيْنَ لَا يُؤْمِنُوْنَ",
    "transliteration_en": "Yaa Banee Aadama laa yaftinannnakumush Shaitaanu kamaaa akhraja abawaikum minal Jannati yanzi'u 'anhumaa libaasahumaa liyuriyahumaa saw aatihimaaa; innahoo yaraakum huwa wa qabeeluhoo min haisu laa tarawnahum; innaa ja'alnash Shayaateena awliyaaa'a lillazeena laa yu'minoon",
    "transliteration_id": "Yā banī ādama lā yaftinannakumusy-syaiṭānu kamā akhraja abawaikum minal-jannati yanzi‘u ‘anhumā libāsahumā liyuriyahumā sau'ātihimā, innahū yarākum huwa wa qabīluhū min ḥaiṡu lā taraunahum, innā ja‘alnasy-syayāṭīna auliyā'a lil-lażīna lā yu'minūn(a).",
    "translation_en": "O children of Adam, let not Satan tempt you as he removed your parents from Paradise, stripping them of their clothing to show them their private parts. Indeed, he sees you, he and his tribe, from where you do not see them. Indeed, We have made the devils allies to those who do not believe.",
    "translation_id": "Wahai anak cucu Adam, janganlah sekali-kali kamu tertipu oleh setan sebagaimana ia (setan) telah mengeluarkan ibu bapakmu dari surga dengan menanggalkan pakaian keduanya untuk memperlihatkan kepada keduanya aurat mereka berdua. Sesungguhnya ia (setan) dan para pengikutnya melihat kamu dari suatu tempat yang kamu tidak (bisa) melihat mereka. Sesungguhnya Kami telah menjadikan setan-setan itu (sebagai) penolong bagi orang-orang yang tidak beriman."
  },
  {
    "ayat": 28,
    "arabic": "وَاِذَا فَعَلُوْا فَاحِشَةً قَالُوْا وَجَدْنَا عَلَيْهَآ اٰبَاۤءَنَا وَاللّٰهُ اَمَرَنَا بِهَاۗ قُلْ اِنَّ اللّٰهَ لَا يَأْمُرُ بِالْفَحْشَاۤءِۗ اَتَقُوْلُوْنَ عَلَى اللّٰهِ مَا لَا تَعْلَمُوْنَ",
    "transliteration_en": "Wa izaa fa'aloo faahishatan qaaloo wajadnaa 'alaihaaa aabaaa'ana wallaahu amaranaa bihaa; qul innal laaha laa yaamuru bilfahshaaa'i a-taqooloona 'alal laahi mmaa laa ta'lamoon",
    "transliteration_id": "Wa iżā fa‘alū fāḥisyatan qālū wajadnā ‘alaihā ābā'anā wallāhu amaranā bihā, qul innallāha lā ya'muru bil-faḥsyā'(i), ataqūlūna ‘alallāhi mā lā ta‘lamūn(a).",
    "translation_en": "And when they commit an immorality, they say, \"We found our fathers doing it, and Allah has ordered us to do it.\" Say, \"Indeed, Allah does not order immorality. Do you say about Allah that which you do not know?\"",
    "translation_id": "Apabila mereka melakukan perbuatan keji, mereka berkata, “Kami mendapati nenek moyang kami melakukan yang demikian dan Allah menyuruh kami mengerjakannya.” Katakanlah (Nabi Muhammad), “Sesungguhnya Allah tidak memerintahkan kekejian. Pantaskah kamu mengatakan tentang Allah apa yang tidak kamu ketahui?”"
  },
  {
    "ayat": 29,
    "arabic": "قُلْ اَمَرَ رَبِّيْ بِالْقِسْطِۗ وَاَقِيْمُوْا وُجُوْهَكُمْ عِنْدَ كُلِّ مَسْجِدٍ وَّادْعُوْهُ مُخْلِصِيْنَ لَهُ الدِّيْنَ ەۗ كَمَا بَدَاَكُمْ تَعُوْدُوْنَۗ",
    "transliteration_en": "Qul amara Rabbee bilqisti wa aqeemoo wujoohakum 'inda kulli masjidin wad'oohu mukhliseena lahud deen; kamaa bada akum ta'oodoon",
    "transliteration_id": "Qul amara rabbī bil-qisṭ(i), wa aqīmū wujūhakum ‘inda kulli masjidiw wad‘ūhu mukhliṣīna lahud-dīn(a), kamā bada'akum ta‘ūdūn(a).",
    "translation_en": "Say, [O Muhammad], \"My Lord has ordered justice and that you maintain yourselves [in worship of Him] at every place [or time] of prostration, and invoke Him, sincere to Him in religion.\" Just as He originated you, you will return [to life] -",
    "translation_id": "Katakanlah (Nabi Muhammad), “Tuhanku memerintahkan aku berlaku adil. Hadapkanlah wajahmu (kepada Allah) di setiap masjid dan berdoalah kepada-Nya dengan mengikhlaskan ketaatan kepada-Nya. Kamu akan kembali kepada-Nya sebagaimana Dia telah menciptakan kamu pada permulaan.”"
  },
  {
    "ayat": 30,
    "arabic": "فَرِيْقًا هَدٰى وَفَرِيْقًا حَقَّ عَلَيْهِمُ الضَّلٰلَةُ  ۗاِنَّهُمُ اتَّخَذُوا الشَّيٰطِيْنَ اَوْلِيَاۤءَ مِنْ دُوْنِ اللّٰهِ وَيَحْسَبُوْنَ اَنَّهُمْ مُّهْتَدُوْنَ",
    "transliteration_en": "Fareeqan hadaa wa fareeqan haqqa 'alaihimud dalaalah; innahumut takhazush Shayaateena awliyaaa'a min doonil laahi wa yahsaboona annnahum muhtadoon",
    "transliteration_id": "Farīqan hadā wa farīqan ḥaqqa ‘alaihimuḍ-ḍalālah(tu), innahumuttakhażusy-syayāṭīna auliyā'a min dūnillāhi wa yaḥsabūna annahum muhtadūn(a).",
    "translation_en": "A group [of you] He guided, and a group deserved [to be in] error. Indeed, they had taken the devils as allies instead of Allah while they thought that they were guided.",
    "translation_id": "Sekelompok (manusia) telah diberi-Nya petunjuk dan sekelompok (lainnya) telah pasti kesesatan atas mereka. Sesungguhnya mereka menjadikan setan-setan sebagai pelindung selain Allah. Mereka mengira bahwa mereka adalah orang-orang yang mendapat petunjuk."
  },
  {
    "ayat": 31,
    "arabic": "۞ يٰبَنِيْٓ اٰدَمَ خُذُوْا زِيْنَتَكُمْ عِنْدَ كُلِّ مَسْجِدٍ وَّكُلُوْا وَاشْرَبُوْا وَلَا تُسْرِفُوْاۚ اِنَّهٗ لَا يُحِبُّ الْمُسْرِفِيْنَ ࣖ",
    "transliteration_en": "Yaa Banneee Adama khuzoo zeenatakum 'inda kulli masjidinw wa kuloo washraboo wa laa tusrifoo; innahoo laa yuhibbul musrifeen",
    "transliteration_id": "Yā banī ādama khużū zīnatakum ‘inda kulli masjidiw wa kulū wasyrabū wa lā tusrifū, innahū lā yuḥibbul-musrifīn(a).",
    "translation_en": "O children of Adam, take your adornment at every masjid, and eat and drink, but be not excessive. Indeed, He likes not those who commit excess.",
    "translation_id": "Wahai anak cucu Adam, pakailah pakaianmu yang indah pada setiap (memasuki) masjid dan makan serta minumlah, tetapi janganlah berlebihan. Sesungguhnya Dia tidak menyukai orang-orang yang berlebihan."
  },
  {
    "ayat": 32,
    "arabic": "قُلْ مَنْ حَرَّمَ زِيْنَةَ اللّٰهِ الَّتِيْٓ اَخْرَجَ لِعِبَادِهٖ وَالطَّيِّبٰتِ مِنَ الرِّزْقِۗ قُلْ هِيَ لِلَّذِيْنَ اٰمَنُوْا فِى الْحَيٰوةِ الدُّنْيَا خَالِصَةً يَّوْمَ الْقِيٰمَةِۗ  كَذٰلِكَ نُفَصِّلُ الْاٰيٰتِ لِقَوْمٍ يَّعْلَمُوْنَ",
    "transliteration_en": "Qul man harrama zeenatal laahil lateee akhraja li'ibaadihee wattaiyibaati minar rizq; qul hiya lillazeena aamanoo fil hayaatid dunyaa khaalisatany Yawmal Qiyaamah; kazaalika nufassihul Aayaati liqawminy ya'lamoon",
    "transliteration_id": "Qul man ḥarrama zīnatallāhil-latī akhraja li‘ibādihī waṭ-ṭayyibāti minar-rizq(i), qul hiya lil-lażīna āmanū fil-ḥayātid-dun-yā khāliṣatay yaumal-qiyāmah(ti), każālika nufaṣṣilul-āyāti liqaumiy ya‘lamūn(a).",
    "translation_en": "Say, \"Who has forbidden the adornment of Allah which He has produced for His servants and the good [lawful] things of provision?\" Say, \"They are for those who believe during the worldly life [but] exclusively for them on the Day of Resurrection.\" Thus do We detail the verses for a people who know.",
    "translation_id": "Katakanlah (Nabi Muhammad), “Siapakah yang mengharamkan perhiasan (dari) Allah yang telah Dia sediakan untuk hamba-hamba-Nya dan rezeki yang baik-baik? Katakanlah, ‘Semua itu adalah untuk orang-orang yang beriman (dan juga tidak beriman) dalam kehidupan dunia, (tetapi ia akan menjadi) khusus (untuk mereka yang beriman saja) pada hari Kiamat.’” Demikianlah Kami menjelaskan secara terperinci ayat-ayat itu kepada kaum yang mengetahui."
  },
  {
    "ayat": 33,
    "arabic": "قُلْ اِنَّمَا حَرَّمَ رَبِّيَ الْفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ وَالْاِثْمَ وَالْبَغْيَ بِغَيْرِ الْحَقِّ وَاَنْ تُشْرِكُوْا بِاللّٰهِ مَا لَمْ يُنَزِّلْ بِهٖ سُلْطٰنًا وَّاَنْ تَقُوْلُوْا عَلَى اللّٰهِ مَا لَا تَعْلَمُوْنَ",
    "transliteration_en": "Qul innamaa harrama Rabbiyal fawaahisha maa zahara minhaa wa maa bataa wal isma walbaghya bighairil haqqi wa an tushrikoo billaahi maa lam yunazzil bihee sultaananw wa an taqooloo 'alal laahi maa laa ta'lamoon",
    "transliteration_id": "Qul innamā ḥarrama rabbiyal-fawāḥisya mā ẓahara minhā wa mā baṭana wal-iṡma wal-bagya bigairil-ḥaqqi wa an tusyrikū billāhi mā lam yunazzil bihī sulṭānaw wa an taqūlū ‘alallāhi mā lā ta‘lamūn(a).",
    "translation_en": "Say, \"My Lord has only forbidden immoralities - what is apparent of them and what is concealed - and sin, and oppression without right, and that you associate with Allah that for which He has not sent down authority, and that you say about Allah that which you do not know.\"",
    "translation_id": "Katakanlah (Nabi Muhammad), “Sesungguhnya Tuhanku hanya mengharamkan segala perbuatan keji yang tampak dan yang tersembunyi, perbuatan dosa, dan perbuatan melampaui batas tanpa alasan yang benar. (Dia juga mengharamkan) kamu mempersekutukan Allah dengan sesuatu yang Allah tidak menurunkan bukti pembenaran untuk itu dan (mengharamkan) kamu mengatakan tentang Allah apa yang tidak kamu ketahui.”"
  },
  {
    "ayat": 34,
    "arabic": "وَلِكُلِّ اُمَّةٍ اَجَلٌۚ فَاِذَا جَاۤءَ اَجَلُهُمْ لَا يَسْتَأْخِرُوْنَ سَاعَةً وَّلَا يَسْتَقْدِمُوْنَ",
    "transliteration_en": "Wa likulli ummatin ajalun fa izaa jaaa'a ajaluhum laa yastaakhiroona saa'atanw wa laa yastaqdimoon",
    "transliteration_id": "Wa likulli ummatin ajal(un), fa iżā jā'a ajaluhum lā yasta'khirūna sā‘ataw wa lā yastaqdimūn(a).",
    "translation_en": "And for every nation is a [specified] term. So when their time has come, they will not remain behind an hour, nor will they precede [it].",
    "translation_id": "Setiap umat mempunyai ajal (batas waktu). Jika ajalnya tiba, mereka tidak dapat meminta penundaan sesaat pun dan tidak dapat (pula) meminta percepatan."
  },
  {
    "ayat": 35,
    "arabic": "يٰبَنِيْٓ اٰدَمَ اِمَّا يَأْتِيَنَّكُمْ رُسُلٌ مِّنْكُمْ يَقُصُّوْنَ عَلَيْكُمْ اٰيٰتِيْۙ فَمَنِ اتَّقٰى وَاَصْلَحَ فَلَا خَوْفٌ عَلَيْهِمْ وَلَا هُمْ يَحْزَنُوْنَ",
    "transliteration_en": "yaa Banee Aadama immaa yaatiyannakum Rusulum minkum yaqussoona 'alaikum Aayaatee famanit taqaa wa aslaha falaa khawfun 'alaihim wa laa hum yahzanoon",
    "transliteration_id": "Yā banī ādama immā ya'tiyannakum rusulum minkum yaquṣṣūna ‘alaikum āyātī, famanittaqā wa aṣlaḥa falā khaufun ‘alaihim wa lā hum yaḥzanūn(a).",
    "translation_en": "O children of Adam, if there come to you messengers from among you relating to you My verses, then whoever fears Allah and reforms - there will be no fear concerning them, nor will they grieve.",
    "translation_id": "Wahai anak cucu Adam, jika datang kepadamu rasul-rasul dari kalanganmu sendiri, yang menceritakan kepadamu ayat-ayat-Ku, siapa pun yang bertakwa dan melakukan perbaikan, tidak ada rasa takut menimpa mereka dan tidak (pula) mereka bersedih."
  },
  {
    "ayat": 36,
    "arabic": "وَالَّذِيْنَ كَذَّبُوْا بِاٰيٰتِنَا وَاسْتَكْبَرُوْا عَنْهَآ اُولٰۤىِٕكَ اَصْحٰبُ النَّارِۚ هُمْ فِيْهَا خٰلِدُوْنَ",
    "transliteration_en": "Wallazeena kazzaboo bi Aayaatinaa wastakbaroo 'anhhaaa ulaaa'ika Ashaabun naari hum feehaa khaalidoon",
    "transliteration_id": "Wal-lażīna każżabū bi'āyātinā wastakbarū ‘anhā ulā'ika aṣḥābun-nār(i), hum fīhā khālidūn(a).",
    "translation_en": "But the ones who deny Our verses and are arrogant toward them - those are the companions of the Fire; they will abide therein eternally.",
    "translation_id": "Orang-orang yang mendustakan ayat-ayat Kami dan menyombongkan diri terhadapnya, mereka itulah penghuni neraka, mereka kekal di dalamnya."
  },
  {
    "ayat": 37,
    "arabic": "فَمَنْ اَظْلَمُ مِمَّنِ افْتَرٰى عَلَى اللّٰهِ كَذِبًا اَوْ كَذَّبَ بِاٰيٰتِهٖۗ اُولٰۤىِٕكَ يَنَالُهُمْ نَصِيْبُهُمْ مِّنَ الْكِتٰبِۗ حَتّٰٓى اِذَا جَاۤءَتْهُمْ رُسُلُنَا يَتَوَفَّوْنَهُمْۙ  قَالُوْٓا اَيْنَ مَا كُنْتُمْ تَدْعُوْنَ مِنْ دُوْنِ اللّٰهِ ۗقَالُوْا ضَلُّوْا عَنَّا وَشَهِدُوْا عَلٰٓى اَنْفُسِهِمْ اَنَّهُمْ كَانُوْا كٰفِرِيْنَ",
    "transliteration_en": "Faman azlamu mimmanif taraa 'alal laahi kaziban aw kazzaba bi Aayaatih; ulaaa'ika yanaaluhum naseebuhum minal Kitaab; hataaa izaa jaaa'at hum rusulunaa yatawaf fawnahum qaalooo aina maa kuntum tad'oonaa min doonil laahi qaaloo dalloo 'annaa wa shahidoo 'alaaa anfusihim annahum kaanoo kaafieen",
    "transliteration_id": "Faman aẓlamu mimmaniftarā ‘alallāhi każiban au każżaba bi'āyātih(ī), ulā'ika yanāluhum naṣībuhum minal-kitāb(i), ḥattā iżā jā'athum rusulunā yatawaffaunahum, qālū aina mā kuntum tad‘ūna min dūnillāh(i), qālū ḍallū ‘annā wa syahidū ‘alā anfusihim annahum kānū kāfirīn(a).",
    "translation_en": "And who is more unjust than one who invents about Allah a lie or denies His verses? Those will attain their portion of the decree until when Our messengers come to them to take them in death, they will say, \"Where are those you used to invoke besides Allah?\" They will say, \"They have departed from us,\" and will bear witness against themselves that they were disbelievers.",
    "translation_id": "Siapakah yang lebih zalim daripada orang yang mengada-adakan kebohongan terhadap Allah atau yang mendustakan ayat-ayat-Nya? Mereka itu akan memperoleh bagian (yang telah ditentukan) dari ketetapan Allah (di dunia) sehingga apabila datang kepada mereka para utusan (malaikat) Kami untuk mencabut nyawanya, mereka (para malaikat) berkata, “Manakah sembahan yang biasa kamu sembah selain Allah?” Mereka (orang-orang musyrik) menjawab, “Semuanya telah lenyap dari kami.” Mereka memberikan kesaksian terhadap diri mereka sendiri bahwa mereka adalah orang-orang kafir."
  },
  {
    "ayat": 38,
    "arabic": "قَالَ ادْخُلُوْا فِيْٓ اُمَمٍ قَدْ خَلَتْ مِنْ قَبْلِكُمْ مِّنَ الْجِنِّ وَالْاِنْسِ فِى النَّارِۙ كُلَّمَا دَخَلَتْ اُمَّةٌ لَّعَنَتْ اُخْتَهَا ۗحَتّٰٓى اِذَا ادَّارَكُوْا فِيْهَا جَمِيْعًا ۙقَالَتْ اُخْرٰىهُمْ لِاُوْلٰىهُمْ رَبَّنَا هٰٓؤُلَاۤءِ اَضَلُّوْنَا فَاٰتِهِمْ عَذَابًا ضِعْفًا مِّنَ النَّارِ ەۗ قَالَ لِكُلٍّ ضِعْفٌ وَّلٰكِنْ لَّا تَعْلَمُوْنَ",
    "transliteration_en": "Qaalad khuloo feee umamin qad khalat min qablikum minal jinni wal insifin naari kullamaa dakhalat ummatul la'anat ukhtahaa hattaaa izad daarakoo feehaa jamee'an qaalat ukhraahum li oolaahum Rabbannaa haaa'u laaa'i adalloonaa fa aatihim 'azaaban di'fam minan naari qaala likullin di funw wa laakil laa ta'lamoon",
    "transliteration_id": "Qāladkhulū fī umamin qad khalat min qablikum minal-jinni wal-insi fin-nār(i), kullamā dakhalat ummatul la‘anat ukhtahā, ḥattā iżaddārakū fīhā jamī‘ā(n), qālat ukhrāhum li'ūlāhum rabbanā hā'ulā'i aḍallūnā fa ātihim ‘ażāban ḍi‘fam minan-nār(i), qāla likullin ḍi‘fuw wa lākil lā ta‘lamūn(a).",
    "translation_en": "[Allah] will say, \"Enter among nations which had passed on before you of jinn and mankind into the Fire.\" Every time a nation enters, it will curse its sister until, when they have all overtaken one another therein, the last of them will say about the first of them \"Our Lord, these had misled us, so give them a double punishment of the Fire. He will say, \"For each is double, but you do not know.\"",
    "translation_id": "Allah berfirman, “Masuklah kamu ke dalam api neraka bersama umat-umat yang telah berlalu sebelum kamu dari (golongan) jin dan manusia.” Setiap kali suatu umat masuk, dia melaknat saudaranya, sehingga apabila mereka telah masuk semuanya, berkatalah orang yang (masuk) belakangan (kepada) orang yang (masuk) terlebih dahulu, “Ya Tuhan kami, mereka telah menyesatkan kami. Datangkanlah siksaan api neraka yang berlipat ganda kepada mereka.” Allah berfirman, “Masing-masing mendapatkan (siksaan) yang berlipat ganda, tetapi kamu tidak mengetahui.”"
  },
  {
    "ayat": 39,
    "arabic": "وَقَالَتْ اُوْلٰىهُمْ لِاُخْرٰىهُمْ فَمَا كَانَ لَكُمْ عَلَيْنَا مِنْ فَضْلٍ فَذُوْقُوا الْعَذَابَ بِمَا كُنْتُمْ تَكْسِبُوْنَ ࣖ",
    "transliteration_en": "Wa qaalat oolaahum li ukhraahum famaa kaana lakum 'alainaa min fadlin fazooqul azaaba bimaa kuntum taksiboon",
    "transliteration_id": "Wa qālat ūlāhum li'ukhrāhum famā kāna lakum ‘alainā min faḍlin fa żūqul-‘ażāba bimā kuntum taksibūn(a).",
    "translation_en": "And the first of them will say to the last of them, \"Then you had not any favor over us, so taste the punishment for what you used to earn.\"",
    "translation_id": "Orang yang (masuk) terlebih dahulu berkata kepada yang (masuk) belakangan, “Kamu tidak mempunyai kelebihan sedikit pun atas kami. Maka, rasakanlah azab itu karena perbuatan yang telah kamu lakukan.”"
  },
  {
    "ayat": 40,
    "arabic": "اِنَّ الَّذِيْنَ كَذَّبُوْا بِاٰيٰتِنَا وَاسْتَكْبَرُوْا عَنْهَا لَا تُفَتَّحُ لَهُمْ اَبْوَابُ السَّمَاۤءِ وَلَا يَدْخُلُوْنَ الْجَنَّةَ حَتّٰى يَلِجَ الْجَمَلُ فِيْ سَمِّ الْخِيَاطِ ۗ وَكَذٰلِكَ نَجْزِى الْمُجْرِمِيْنَ",
    "transliteration_en": "Innal lazeena kazzaboo bi Aayaatinaa wastakbaroo 'anhaa laa tufattahu lahum ahwaabus samaaa'i wa laa yadkhuloonal jannata hattaa yalijal jamalu fee sammil khiyaat; wa kazaalika najzil mujrimeen",
    "transliteration_id": "Innal-lażīna każżabū bi'āyātinā wastakbarū ‘anhā lā tufattaḥu lahum abwābus-samā'i wa lā yadkhulūnal-jannata ḥattā yalijal-jamalu fī sammil-khiyāṭ(i), wa każālika najzil-mujrimīn(a).",
    "translation_en": "Indeed, those who deny Our verses and are arrogant toward them - the gates of Heaven will not be opened for them, nor will they enter Paradise until a camel enters into the eye of a needle. And thus do We recompense the criminals.",
    "translation_id": "Sesungguhnya (bagi) orang-orang yang mendustakan ayat-ayat Kami dan menyombongkan diri terhadapnya, tidak akan dibukakan bagi mereka pintu-pintu langit dan mereka tidak akan masuk surga sebelum unta masuk ke dalam lubang jarum. Demikianlah Kami memberi balasan kepada orang-orang yang berbuat durhaka."
  },
  {
    "ayat": 41,
    "arabic": "لَهُمْ مِّنْ جَهَنَّمَ مِهَادٌ وَّمِنْ فَوْقِهِمْ غَوَاشٍۗ وَكَذٰلِكَ نَجْزِى الظّٰلِمِيْنَ",
    "transliteration_en": "Lahum min jahannama mihaadunw wa min fawqihim ghawaash; wa kazaalika najziz zaalimeen",
    "transliteration_id": "Lahum min jahannama mihāduw wa min fauqihim gawāsy(in), wa każālika najziẓ-ẓālimīn(a).",
    "translation_en": "They will have from Hell a bed and over them coverings [of fire]. And thus do We recompense the wrongdoers.",
    "translation_id": "Bagi mereka (disediakan) alas tidur dari (api neraka) Jahanam dan di atas mereka ada selimut (dari api neraka). Demikianlah Kami memberi balasan kepada orang-orang yang zalim."
  },
  {
    "ayat": 42,
    "arabic": "وَالَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ لَا نُكَلِّفُ نَفْسًا اِلَّا وُسْعَهَآ اُولٰۤىِٕكَ اَصْحٰبُ الْجَنَّةِۚ هُمْ فِيْهَا خٰلِدُوْنَ",
    "transliteration_en": "Wallazeena aamanoo wa 'amilus saalihaati la nukallifu nafsan illaa wus'ahaaa ulaaa'ika Ashaabul jannati hum feehaa khaalidoon",
    "transliteration_id": "Wal-lażīna āmanū wa ‘amiluṣ-ṣāliḥāti lā nukallifu nafsan illā wus‘ahā, ulā'ika aṣḥābul-jannah(ti), hum fīhā khālidūn(a).",
    "translation_en": "But those who believed and did righteous deeds - We charge no soul except [within] its capacity. Those are the companions of Paradise; they will abide therein eternally.",
    "translation_id": "(Adapun) orang-orang yang beriman dan mengerjakan kebajikan, Kami tidak akan membebani seseorang melainkan menurut kesanggupannya. Mereka itulah penghuni surga. Mereka kekal di dalamnya."
  },
  {
    "ayat": 43,
    "arabic": "وَنَزَعْنَا مَا فِيْ صُدُوْرِهِمْ مِّنْ غِلٍّ تَجْرِيْ مِنْ تَحْتِهِمُ الْاَنْهٰرُۚ وَقَالُوا الْحَمْدُ لِلّٰهِ الَّذِيْ هَدٰىنَا لِهٰذَاۗ وَمَا كُنَّا لِنَهْتَدِيَ لَوْلَآ اَنْ هَدٰىنَا اللّٰهُ ۚ لَقَدْ جَاۤءَتْ رُسُلُ رَبِّنَا بِالْحَقِّۗ وَنُوْدُوْٓا اَنْ تِلْكُمُ الْجَنَّةُ اُوْرِثْتُمُوْهَا بِمَا كُنْتُمْ تَعْمَلُوْنَ",
    "transliteration_en": "Wa naza'naa maa fee sudoorihim min ghillin tajree min tahtihimul anhaaru wa qaalul hamdu lillaahil lazee hadaanaa lihaaza wa maa kunna linahtadiya law laaa ann hadaanal laahu laqad jaaa'at Rusulu Rabbinaa bilhaqq; wa noodoo an tilkumul jannnatu ooristumoohaa bimaa kuntum ta'maloon",
    "transliteration_id": "Wa naza‘nā mā fī ṣudūrihim min gillin tajrī min taḥtihimul-anhār(u), wa qālul-ḥamdu lillāhil-lażī hadānā lihāżā, wa mā kunnā linahtadiya lau lā an hadānallāh(u), laqad jā'at rusulu rabbinā bil-ḥaqq(i), wa nūdū an tilkumul-jannatu ūriṡtumūhā bimā kuntum ta‘malūn(a).",
    "translation_en": "And We will have removed whatever is within their breasts of resentment, [while] flowing beneath them are rivers. And they will say, \"Praise to Allah, who has guided us to this; and we would never have been guided if Allah had not guided us. Certainly the messengers of our Lord had come with the truth.\" And they will be called, \"This is Paradise, which you have been made to inherit for what you used to do.\"",
    "translation_id": "Kami mencabut rasa dendam dari dalam dada mereka, (di surga) mengalir di bawah mereka sungai-sungai. Mereka berkata, “Segala puji bagi Allah yang telah menunjukkan kami ke (surga) ini. Kami tidak akan mendapat petunjuk sekiranya Allah tidak menunjukkan kami. Sungguh, rasul-rasul Tuhan kami telah datang membawa kebenaran.” Diserukan kepada mereka, “Itulah surga yang telah diwariskan kepadamu karena apa yang selalu kamu kerjakan.”"
  },
  {
    "ayat": 44,
    "arabic": "وَنَادٰٓى اَصْحٰبُ الْجَنَّةِ اَصْحٰبَ النَّارِ اَنْ قَدْ وَجَدْنَا مَا وَعَدَنَا رَبُّنَا حَقًّا فَهَلْ وَجَدْتُّمْ مَّا وَعَدَ رَبُّكُمْ حَقًّا ۗقَالُوْا نَعَمْۚ فَاَذَّنَ مُؤَذِّنٌۢ بَيْنَهُمْ اَنْ لَّعْنَةُ اللّٰهِ عَلَى الظّٰلِمِيْنَ",
    "transliteration_en": "Wa naadaa Ashaabul jannati ashaaban Naari an qad wajadnaa maa wa'adannaa Rabbunaa haqqan fahal wajattum maa wa'ada Rabbukum haqqan qaaloo na'am; fa azzana mu'azzinum bainahum al la'natul laahi 'alaz zaalimeen",
    "transliteration_id": "Wa nādā aṣḥābul-jannati aṣḥāban-nāri an qad wajadnā mā wa‘adanā rabbunā ḥaqqan fahal wajattum mā wa‘ada rabbukum ḥaqqā(n), qālū na‘am, fa ażżana mu'ażżinum bainahum al la‘natullāhi ‘alaẓ-ẓālimīn(a).",
    "translation_en": "And the companions of Paradise will call out to the companions of the Fire, \"We have already found what our Lord promised us to be true. Have you found what your Lord promised to be true?\" They will say, \"Yes.\" Then an announcer will announce among them, \"The curse of Allah shall be upon the wrongdoers.\"",
    "translation_id": "Para penghuni surga menyeru para penghuni neraka, “Sungguh, kami telah mendapati sesuatu (surga) yang dijanjikan Tuhan kepada kami itu benar. Apakah kamu telah mendapati (pula) sesuatu (azab) yang dijanjikan Tuhan kepadamu itu benar?” Mereka menjawab, “Benar.” Kemudian penyeru (malaikat) mengumumkan di antara mereka, “Laknat Allah bagi orang-orang yang zalim.”"
  },
  {
    "ayat": 45,
    "arabic": "اَلَّذِيْنَ يَصُدُّوْنَ عَنْ سَبِيْلِ اللّٰهِ وَيَبْغُوْنَهَا عِوَجًاۚ وَهُمْ بِالْاٰخِرَةِ كٰفِرُوْنَۘ",
    "transliteration_en": "Allazeena yasuddoona 'an sabeelil laahi wa yabghoo nahaa 'iwajanw wa hum bil Aakhirati kaafiroon",
    "transliteration_id": "Al-lażīna yaṣuddūna ‘an sabīlillāhi wa yabgūnahā ‘iwajā(n), wa hum bil-ākhirati kāfirūn(a).",
    "translation_en": "Who averted [people] from the way of Allah and sought to make it [seem] deviant while they were, concerning the Hereafter, disbelievers.",
    "translation_id": "(Mereka adalah) orang-orang yang menghalang-halangi (orang lain) dari jalan Allah serta menginginkan jalan itu menjadi bengkok dan mereka itu orang-orang yang mengingkari (kehidupan) akhirat."
  },
  {
    "ayat": 46,
    "arabic": "وَبَيْنَهُمَا حِجَابٌۚ وَعَلَى الْاَعْرَافِ رِجَالٌ يَّعْرِفُوْنَ كُلًّا ۢ بِسِيْمٰىهُمْۚ وَنَادَوْا اَصْحٰبَ الْجَنَّةِ اَنْ سَلٰمٌ عَلَيْكُمْۗ  لَمْ يَدْخُلُوْهَا وَهُمْ يَطْمَعُوْنَ",
    "transliteration_en": "Wa bainahumaa hijaab; wa 'alal A'raafi rijaaluny ya'rifoona kullam biseemaahum; wa naadaw Ashaabal jannati an salaamun 'alaikum; lam yadkhuloohaa wa hum yatma'oon",
    "transliteration_id": "Wa bainahumā ḥijāb(un), wa ‘alal-a‘rāfi rijāluy ya‘rifūna kullam bisīmāhum, wa nādau aṣḥābal-jannati an salāmun ‘alaikum, lam yadkhulūhā wa hum yaṭma‘ūn(a).",
    "translation_en": "And between them will be a partition, and on [its] elevations are men who recognize all by their mark. And they call out to the companions of Paradise, \"Peace be upon you.\" They have not [yet] entered it, but they long intensely.",
    "translation_id": "Di antara keduanya (para penghuni surga dan neraka) ada batas pemisah dan di atas tempat yang tertinggi (al-a‘rāf) ada orang-orang yang saling mengenal dengan tandanya masing-masing. Mereka menyeru para penghuni surga, “Salāmun ‘alaikum (semoga keselamatan tercurah kepadamu).” Mereka belum dapat memasukinya, padahal mereka sangat ingin (memasukinya)."
  },
  {
    "ayat": 47,
    "arabic": "۞ وَاِذَا صُرِفَتْ اَبْصَارُهُمْ تِلْقَاۤءَ اَصْحٰبِ النَّارِۙ قَالُوْا رَبَّنَا لَا تَجْعَلْنَا مَعَ الْقَوْمِ الظّٰلِمِيْنَ ࣖ",
    "transliteration_en": "Wa izaa surifat absaaruhum tilqaaa'a Ashaabin Naari qaalo Rabbanaa laa taj'alnaa ma'al qawmiz zaalimneen",
    "transliteration_id": "Wa iżā ṣurifat abṣāruhum tilqā'a aṣḥābin-nāri qālū rabbanā lā taj‘alnā ma‘al-qaumiẓ-ẓālimīn(a).",
    "translation_en": "And when their eyes are turned toward the companions of the Fire, they say, \"Our Lord, do not place us with the wrongdoing people.\"",
    "translation_id": "Apabila pandangan mereka dialihkan ke arah penghuni neraka, mereka berkata, “Ya Tuhan kami, janganlah Engkau tempatkan kami bersama kaum yang zalim itu.”"
  },
  {
    "ayat": 48,
    "arabic": "وَنَادٰٓى اَصْحٰبُ الْاَعْرَافِ رِجَالًا يَّعْرِفُوْنَهُمْ بِسِيْمٰىهُمْ قَالُوْا مَآ اَغْنٰى عَنْكُمْ جَمْعُكُمْ وَمَا كُنْتُمْ تَسْتَكْبِرُوْنَ",
    "transliteration_en": "Wa naadaaa Ashaabul A'raffi rijaalany ya'rifoonahum biseemaahum qaaloo maaa aghnaa 'ankum jam'ukum wa maa kuntum tastakbiroon",
    "transliteration_id": "Wa nādā aṣḥābul-a‘rāfi rijālay ya‘rifūnahum bisīmāhum qālū mā agnā ‘ankum jam‘ukum wa mā kuntum tastakbirūn(a).",
    "translation_en": "And the companions of the Elevations will call to men [within Hell] whom they recognize by their mark, saying, \"Of no avail to you was your gathering and [the fact] that you were arrogant.\"",
    "translation_id": "Orang-orang di atas tempat yang tertinggi (al-a‘rāf) menyeru orang-orang yang mereka kenal dengan tanda-tanda (khusus) sambil berkata, “Tidak ada manfaatnya bagimu (harta) yang kamu kumpulkan dan apa yang selalu kamu sombongkan."
  },
  {
    "ayat": 49,
    "arabic": "اَهٰٓؤُلَاۤءِ الَّذِيْنَ اَقْسَمْتُمْ لَا يَنَالُهُمُ اللّٰهُ بِرَحْمَةٍۗ  اُدْخُلُوا الْجَنَّةَ لَا خَوْفٌ عَلَيْكُمْ وَلَآ اَنْتُمْ تَحْزَنُوْنَ",
    "transliteration_en": "A haaa'ulaaa'il lazeena aqsamtum laa yanaaluhumul laahu birahma; udkhulul Jannata laa khawfun 'alaikum wa laaa antum tahzanoon",
    "transliteration_id": "Ahā'ulā'il-lażīna aqsamtum lā yanāluhumullāhu biraḥmah(tin), udkhulul-jannata lā khaufun ‘alaikum wa lā antum taḥzanūn(a).",
    "translation_en": "[Allah will say], \"Are these the ones whom you [inhabitants of Hell] swore that Allah would never offer them mercy? Enter Paradise, [O People of the Elevations]. No fear will there be concerning you, nor will you grieve.\"",
    "translation_id": "Itukah orang-orang yang kamu telah bersumpah (ketika kamu hidup di dunia), bahwa mereka tidak akan diberi rahmat oleh Allah?” (Allah berfirman,) “Masuklah kamu ke dalam surga! Tidak ada rasa takut padamu dan kamu juga tidak akan bersedih.”"
  },
  {
    "ayat": 50,
    "arabic": "وَنَادٰٓى اَصْحٰبُ النَّارِ اَصْحٰبَ الْجَنَّةِ اَنْ اَفِيْضُوْا عَلَيْنَا مِنَ الْمَاۤءِ اَوْ مِمَّا رَزَقَكُمُ اللّٰهُ ۗقَالُوْٓا اِنَّ اللّٰهَ حَرَّمَهُمَا عَلَى الْكٰفِرِيْنَۙ",
    "transliteration_en": "Wa naadaaa Ashaabun Naari Ashaabal jannati an afeedoo 'alainaa minal maaa'i aw mimma razaqakumul laah; qaaloo innal laaha harrama humaa 'alal kaafireen",
    "transliteration_id": "Wa nādā aṣḥābun-nāri aṣḥābal-jannati an afīḍū ‘alainā minal-mā'i au mimmā razaqakumullāh(u), qālū innallāha ḥarramahumā ‘alal-kāfirīn(a).",
    "translation_en": "And the companions of the Fire will call to the companions of Paradise, \"Pour upon us some water or from whatever Allah has provided you.\" They will say, \"Indeed, Allah has forbidden them both to the disbelievers.\"",
    "translation_id": "Para penghuni neraka menyeru para penghuni surga, “Tuangkanlah (sedikit) air kepada kami atau rezeki apa saja yang telah dikaruniakan Allah kepadamu.” Mereka menjawab, “Sesungguhnya Allah telah mengharamkan keduanya (air dan rezeki) bagi orang-orang kafir.”"
  }
]