[
  {
    "ayat": 51,
    "arabic": "وَلَوْ تَرٰىٓ اِذْ فَزِعُوْا فَلَا فَوْتَ وَاُخِذُوْا مِنْ مَّكَانٍ قَرِيْبٍۙ",
    "transliteration_en": "Wa law taraaa iz fazi'oo falaa fawta wa ukhizoo mim makaanin qareeb",
    "transliteration_id": "Wa lau tarā iż fazi‘ū falā fauta wa ukhiżū mim makānin qarīb(in).",
    "translation_en": "And if you could see when they are terrified but there is no escape, and they will be seized from a place nearby.",
    "translation_id": "(Alangkah mengerikan) seandainya engkau melihat ketika mereka (orang-orang kafir) terperanjat ketakutan (pada hari Kiamat). Mereka tidak dapat melepaskan diri dan ditangkap dari tempat yang dekat (untuk diseret ke neraka)."
  },
  {
    "ayat": 52,
    "arabic": "وَّقَالُوْٓا اٰمَنَّا بِهٖۚ وَاَنّٰى لَهُمُ التَّنَاوُشُ مِنْ مَّكَانٍۢ بَعِيْدٍۚ",
    "transliteration_en": "Wa qaloo aamannaa bihee wa annaa lahumut tanaawushu mim makaanim ba'eed",
    "transliteration_id": "Wa qālū āmannā bih(ī), wa annā lahumut-tanāwusyu mim makānim ba‘īd(in).",
    "translation_en": "And they will [then] say, \"We believe in it!\" But how for them will be the taking [of faith] from a place far away?",
    "translation_id": "(Ketika melihat azab) mereka berkata, “Kami beriman kepadanya (kebenaran).” Namun, bagaimana mungkin (di akhirat) mereka dapat mencapai keimanan (dengan mudah) dari tempat yang jauh (dunia fana)?"
  },
  {
    "ayat": 53,
    "arabic": "وَقَدْ كَفَرُوْا بِهٖ مِنْ قَبْلُۚ وَيَقْذِفُوْنَ بِالْغَيْبِ مِنْ مَّكَانٍۢ بَعِيْدٍۚ",
    "transliteration_en": "Wa qad kafaroo bihee min qablu wa yaqzifoona bilghaibi mim makaanim ba'eed",
    "transliteration_id": "Wa qad kafarū bihī min qabl(u), wa yaqżifūna bil-gaibi mim makānim ba‘īd(in).",
    "translation_en": "And they had already disbelieved in it before and would assault the unseen from a place far away.",
    "translation_id": "Sungguh, mereka telah kufur terhadap kebenaran sebelum itu (ketika di dunia) dan melontarkan (keraguan) tentang yang gaib dari tempat yang jauh."
  },
  {
    "ayat": 54,
    "arabic": "وَحِيْلَ بَيْنَهُمْ وَبَيْنَ مَا يَشْتَهُوْنَۙ  كَمَا فُعِلَ بِاَشْيَاعِهِمْ مِّنْ قَبْلُۗ اِنَّهُمْ كَانُوْا فِيْ شَكٍّ مُّرِيْبٍ ࣖ",
    "transliteration_en": "Wa heela bainahum wa baina maa yashtahoona kamaa fu'ila bi-ashyaa'ihim min qabl; innahum kaanoo fee shakkim mureeb",
    "transliteration_id": "Wa ḥīla bainahum wa baina mā yasytahūn(a), kamā fu‘ila bi'asy-yā‘ihim min qabl(u), innahum fī syakkim murīb(in).",
    "translation_en": "And prevention will be placed between them and what they desire, as was done with their kind before. Indeed, they were in disquieting denial.",
    "translation_id": "Diberilah penghalang antara mereka dan apa yang mereka inginkan sebagaimana yang dilakukan terhadap orang-orang terdahulu yang serupa dengan mereka. Sesungguhnya mereka dahulu (di dunia) dalam keraguan yang mendalam."
  }
]