[
  {
    "ayat": 51,
    "arabic": "قُلْ لَّنْ يُّصِيْبَنَآ اِلَّا مَا كَتَبَ اللّٰهُ لَنَاۚ هُوَ مَوْلٰىنَا وَعَلَى اللّٰهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُوْنَ",
    "transliteration_en": "Qul lany-yuseebanaaa illaa maa katabal laahu lanaa Huwa mawlaanaa; wa 'alal laahi falyatawak kalimu 'minoon",
    "transliteration_id": "Qul lay yuṣībanā illā mā kataballāhu lanā, huwa maulānā wa ‘alallāhi falyatawakkalil-mu'minūn(a).",
    "translation_en": "Say, \"Never will we be struck except by what Allah has decreed for us; He is our protector.\" And upon Allah let the believers rely.",
    "translation_id": "Katakanlah (Nabi Muhammad), “Tidak akan menimpa kami melainkan apa yang telah ditetapkan Allah bagi kami. Dialah Pelindung kami, dan hanya kepada Allah hendaknya orang-orang mukmin bertawakal."
  },
  {
    "ayat": 52,
    "arabic": "قُلْ هَلْ تَرَبَّصُوْنَ بِنَآ اِلَّآ اِحْدَى الْحُسْنَيَيْنِۗ وَنَحْنُ نَتَرَبَّصُ بِكُمْ اَنْ يُّصِيْبَكُمُ اللّٰهُ بِعَذَابٍ مِّنْ عِنْدِهٖٓ اَوْ بِاَيْدِيْنَاۖ فَتَرَبَّصُوْٓا اِنَّا مَعَكُمْ مُّتَرَبِّصُوْنَ",
    "transliteration_en": "Qul hal tarabbasoona binaaa illaaa ihdal husnayayni wa nahnu natrabbasu bikum ai yus eebakumul laahu bi'azaa bim min 'indiheee aw biaidee naa fatarabbasooo innaa ma'akum mutarabbisoon",
    "transliteration_id": "Qul hal tarabbaṣūna binā illā iḥdal-ḥusnayain(i), wa naḥnu natarabbaṣu bikum ay yuṣībakumullāhu bi‘ażābim min ‘indihī au bi'aidīnā, fa tarabbaṣū innā ma‘akum mutarabbiṣūn(a).",
    "translation_en": "Say, \"Do you await for us except one of the two best things while we await for you that Allah will afflict you with punishment from Himself or at our hands? So wait; indeed we, along with you, are waiting.\"",
    "translation_id": "Katakanlah (Nabi Muhammad), “Tidak ada yang kamu tunggu-tunggu (kedatangannya) bagi kami, kecuali salah satu dari dua kebaikan (menang atau mati syahid). (Sebaliknya,) kami menunggu-nunggu bagi kamu bahwa Allah akan menimpakan azab kepadamu dari sisi-Nya atau (azab) melalui tangan kami. Maka, tunggulah, sesungguhnya kami menunggu (pula) bersamamu.”"
  },
  {
    "ayat": 53,
    "arabic": "قُلْ اَنْفِقُوْا طَوْعًا اَوْ كَرْهًا لَّنْ يُّتَقَبَّلَ مِنْكُمْ ۗاِنَّكُمْ كُنْتُمْ قَوْمًا فٰسِقِيْنَ",
    "transliteration_en": "Qul anfiqoo taw'an aw karhal lany yutaqabbala min kum innakum kuntum qawman faasiqeen",
    "transliteration_id": "Qul anfiqū ṭau‘an au karhal lay yutaqabbala minkum, innakum kuntum qauman fāsiqīn(a).",
    "translation_en": "Say, \"Spend willingly or unwillingly; never will it be accepted from you. Indeed, you have been a defiantly disobedient people.\"",
    "translation_id": "Katakanlah (Nabi Muhammad), “(Wahai orang-orang munafik,) infakkanlah (hartamu) baik dengan sukarela maupun dengan terpaksa, (tetapi ketahuilah bahwa infak itu) sekali-kali tidak akan diterima (oleh Allah) dari kamu. Sesungguhnya kamu adalah kaum yang fasik.”"
  },
  {
    "ayat": 54,
    "arabic": "وَمَا مَنَعَهُمْ اَنْ تُقْبَلَ مِنْهُمْ نَفَقٰتُهُمْ اِلَّآ اَنَّهُمْ كَفَرُوْا بِاللّٰهِ وَبِرَسُوْلِهٖ وَلَا يَأْتُوْنَ الصَّلٰوةَ اِلَّا وَهُمْ كُسَالٰى وَلَا يُنْفِقُوْنَ اِلَّا وَهُمْ كٰرِهُوْنَ",
    "transliteration_en": "Wa maa mana'ahum an tuqbala minhum nafaqaatuhum illaaa annnahum kafaroo billaahi wa bi Rasoolihee wa laa yaatoonas Salaata illaa wa hum kusaalaa wa laa yunfiqoona illaa wa hum kaarihoon",
    "transliteration_id": "Wa mā mana‘ahum an tuqbala minhum nafaqātuhum illā annahum kafarū billāhi wa birasūlihī wa lā ya'tūnaṣ-ṣalāta illā wa hum kusālā wa lā yunfiqūna illā wa hum kārihūn(a).",
    "translation_en": "And what prevents their expenditures from being accepted from them but that they have disbelieved in Allah and in His Messenger and that they come not to prayer except while they are lazy and that they do not spend except while they are unwilling.",
    "translation_id": "Tidak ada yang menghalangi infak mereka untuk diterima kecuali karena sesungguhnya mereka adalah orang-orang yang kufur kepada Allah dan Rasul-Nya dan mereka tidak melaksanakan salat, melainkan dengan malas dan tidak (pula) menginfakkan (harta) mereka, melainkan dengan rasa enggan (terpaksa)."
  },
  {
    "ayat": 55,
    "arabic": "فَلَا تُعْجِبْكَ اَمْوَالُهُمْ وَلَآ اَوْلَادُهُمْ ۗاِنَّمَا يُرِيْدُ اللّٰهُ لِيُعَذِّبَهُمْ بِهَا فِى الْحَيٰوةِ الدُّنْيَا وَتَزْهَقَ اَنْفُسُهُمْ وَهُمْ كٰفِرُوْنَ",
    "transliteration_en": "Falaa tu'jibka amwaaluhum wa laaa awlaaduhum; innamaa yureedul laahu liyu'az zibahum bihaa fil hayaatid dunyaa wa tazhaqa anfusuhum wa hum kaafiroon",
    "transliteration_id": "Falā tu‘jibka amwāluhum wa lā aulāduhum, innamā yurīdullāhu liyu‘ażżibahum bihā fil-ḥayātid-dun-yā wa tazhaqa anfusuhum wa hum kāfirūn(a).",
    "translation_en": "So let not their wealth or their children impress you. Allah only intends to punish them through them in worldly life and that their souls should depart [at death] while they are disbelievers.",
    "translation_id": "(Oleh karena itu,) janganlah harta dan anak-anak mereka membuatmu kagum. Sesungguhnya Allah hendak menyiksa mereka dengan itu dalam kehidupan dunia dan kelak nyawa mereka keluar dengan susah payah, sedangkan mereka dalam keadaan kafir."
  },
  {
    "ayat": 56,
    "arabic": "وَيَحْلِفُوْنَ بِاللّٰهِ اِنَّهُمْ لَمِنْكُمْۗ وَمَا هُمْ مِّنْكُمْ وَلٰكِنَّهُمْ قَوْمٌ يَّفْرَقُوْنَ",
    "transliteration_en": "Wa yahlifoona billaahi innnahum laminkum wa maa hum minkum wa laakinnahum qawmuny yafraqoon",
    "transliteration_id": "Wa yaḥlifūna billāhi innahum laminkum, wa mā hum minkum wa lākinnahum qaumuy yafraqūn(a).",
    "translation_en": "And they swear by Allah that they are from among you while they are not from among you; but they are a people who are afraid.",
    "translation_id": "Mereka (orang-orang munafik) bersumpah dengan (nama) Allah, bahwa sesungguhnya mereka termasuk golonganmu, padahal mereka bukanlah dari golonganmu, tetapi mereka adalah kaum yang sangat takut (kepadamu)."
  },
  {
    "ayat": 57,
    "arabic": "لَوْ يَجِدُوْنَ مَلْجَاً اَوْ مَغٰرٰتٍ اَوْ مُدَّخَلًا لَّوَلَّوْا اِلَيْهِ وَهُمْ يَجْمَحُوْنَ",
    "transliteration_en": "Law yajidoona malja'an aw maghaaraatin aw mudda khalal lawallaw ilaihi wa hum yajmahoon",
    "transliteration_id": "Lau yajidūna malja'an au magārātin au muddakhalal lawallau ilaihi wa hum yajmaḥūn(a).",
    "translation_en": "If they could find a refuge or some caves or any place to enter [and hide], they would turn to it while they run heedlessly.",
    "translation_id": "Seandainya mereka memperoleh tempat berlindung, gua-gua, atau lubang-lubang (dalam tanah), niscaya mereka pergi (lari) ke sana dengan secepat-cepatnya."
  },
  {
    "ayat": 58,
    "arabic": "وَمِنْهُمْ مَّنْ يَّلْمِزُكَ فِى الصَّدَقٰتِۚ فَاِنْ اُعْطُوْا مِنْهَا رَضُوْا وَاِنْ لَّمْ يُعْطَوْا مِنْهَآ اِذَا هُمْ يَسْخَطُوْنَ",
    "transliteration_en": "Wa minhum mai yalmizuka fis sadaqaati fa-in u'too minhaa radoo wa illam yu'taw minhaaa izaa hum yaskhatoon",
    "transliteration_id": "Wa minhum may yalmizuka fiṣ-ṣadaqāt(i), fa in u‘ṭū minhā raḍū wa illam yu‘ṭau minhā iżā hum yaskhaṭūn(a).",
    "translation_en": "And among them are some who criticize you concerning the [distribution of] charities. If they are given from them, they approve; but if they are not given from them, at once they become angry.",
    "translation_id": "Di antara mereka ada yang mencela engkau (Nabi Muhammad) dalam hal (pembagian) sedekah-sedekah (zakat atau rampasan perang). Jika mereka diberi sebagian darinya, mereka bersenang hati, dan jika mereka tidak diberi bagian, dengan serta merta mereka marah."
  },
  {
    "ayat": 59,
    "arabic": "وَلَوْ اَنَّهُمْ رَضُوْا مَآ اٰتٰىهُمُ اللّٰهُ وَرَسُوْلُهٗۙ وَقَالُوْا حَسْبُنَا اللّٰهُ سَيُؤْتِيْنَا اللّٰهُ مِنْ فَضْلِهٖ وَرَسُوْلُهٗٓ اِنَّآ اِلَى اللّٰهِ رٰغِبُوْنَ ࣖ",
    "transliteration_en": "Wa law annahum radoo maaa aataahumul laahu wa Rasooluhoo wa qaaloo hasbunal laahu wayu'teenallaahu min fadlihee wa Rasooluhooo innaaa ilallaahi raaghiboon",
    "transliteration_id": "Wa lau annahum raḍū mā ātāhumullāhu wa rasūluh(ū), wa qālū ḥasbunallāhu sayu'tīnallāhu min faḍlihī wa rasūluhū innā ilallāhi rāgibūn(a).",
    "translation_en": "If only they had been satisfied with what Allah and His Messenger gave them and said, \"Sufficient for us is Allah; Allah will give us of His bounty, and [so will] His Messenger; indeed, we are desirous toward Allah,\" [it would have been better for them].",
    "translation_id": "Seandainya mereka benar-benar rida dengan apa yang diberikan kepada mereka oleh Allah dan Rasul-Nya, dan berkata, “Cukuplah Allah bagi kami, Allah akan memberikan kepada kami sebagian dari karunia-Nya, dan (demikian pula) Rasul-Nya. Sesungguhnya kami adalah orang-orang yang selalu hanya berharap kepada Allah.”"
  },
  {
    "ayat": 60,
    "arabic": "۞ اِنَّمَا الصَّدَقٰتُ لِلْفُقَرَاۤءِ وَالْمَسٰكِيْنِ وَالْعٰمِلِيْنَ عَلَيْهَا وَالْمُؤَلَّفَةِ قُلُوْبُهُمْ وَفِى الرِّقَابِ وَالْغٰرِمِيْنَ وَفِيْ سَبِيْلِ اللّٰهِ وَابْنِ السَّبِيْلِۗ فَرِيْضَةً مِّنَ اللّٰهِ ۗوَاللّٰهُ عَلِيْمٌ حَكِيْمٌ",
    "transliteration_en": "Innamas sadaqaatu lilfuqaraaa'i walmasaakeeni wal 'aamileena 'alaihaa wal mu'al lafati quloobuhum wa fir riqaabi walghaarimeena wa fee sabeelil laahi wabnis sabeeli fareedatam minal laah; wal laahu 'Aleemun Hakeem",
    "transliteration_id": "Innamaṣ-ṣadaqātu lil-fuqarā'i wal-masākīni wal-‘āmilīna ‘alaihā wal-mu'allafati qulūbuhum wa fir-riqābi wal-gārimīna wa fī sabīlillāhi wabnis-sabīl(i), farīḍatam minallāh(i), wallāhu ‘alīmun ḥakīm(un).",
    "translation_en": "Zakah expenditures are only for the poor and for the needy and for those employed to collect [zakah] and for bringing hearts together [for Islam] and for freeing captives [or slaves] and for those in debt and for the cause of Allah and for the [stranded] traveler - an obligation [imposed] by Allah. And Allah is Knowing and Wise.",
    "translation_id": "Sesungguhnya zakat itu hanyalah untuk orang-orang fakir, orang-orang miskin, para amil zakat, orang-orang yang dilunakkan hatinya (mualaf), untuk (memerdekakan) para hamba sahaya, untuk (membebaskan) orang-orang yang berutang, untuk jalan Allah dan untuk orang-orang yang sedang dalam perjalanan (yang memerlukan pertolongan), sebagai kewajiban dari Allah. Allah Maha Mengetahui lagi Maha Bijaksana."
  },
  {
    "ayat": 61,
    "arabic": "وَمِنْهُمُ الَّذِيْنَ يُؤْذُوْنَ النَّبِيَّ وَيَقُوْلُوْنَ هُوَ اُذُنٌ ۗقُلْ اُذُنُ خَيْرٍ لَّكُمْ يُؤْمِنُ بِاللّٰهِ وَيُؤْمِنُ لِلْمُؤْمِنِيْنَ وَرَحْمَةٌ لِّلَّذِيْنَ اٰمَنُوْا مِنْكُمْۗ وَالَّذِيْنَ يُؤْذُوْنَ رَسُوْلَ اللّٰهِ لَهُمْ عَذَابٌ اَلِيْمٌ",
    "transliteration_en": "Wa minhumul lazeena yu'zoonan nabiyya wa yaqooloona huwa uzun; qul uzunu khairil lakum yu'minu billaahi wa yu'minu lilmu mi neena wa rahmatul lillazeena aamanoo minkum; wallazeena yu'zoona Rasoolal laahi lahum 'azaabun aleem",
    "transliteration_id": "Wa minhumul-lażīna yu'żūnan nabiyya wa yaqūlūna huwa użun(un), qul użunu khairil lakum yu'minu billāhi wa yu'minu lil-mu'minīna wa raḥmatul lil-lażīna āmanū minkum, wal-lażīna yu'żūna rasūlallāhi lahum ‘ażābun alīm(un).",
    "translation_en": "And among them are those who abuse the Prophet and say, \"He is an ear.\" Say, \"[It is] an ear of goodness for you that believes in Allah and believes the believers and [is] a mercy to those who believe among you.\" And those who abuse the Messenger of Allah - for them is a painful punishment.",
    "translation_id": "Di antara mereka (kaum munafik) ada orang-orang yang menyakiti Nabi (Muhammad) dan mengatakan, “Dia adalah telinga (yang menampung dan memercayai semua apa yang didengarnya tanpa seleksi).” Katakanlah, “(Nabi Muhammad adalah) telinga yang baik bagi kamu, dia beriman kepada Allah, memercayai orang-orang mukmin, dan menjadi rahmat bagi orang-orang yang beriman di antara kamu.” Orang-orang yang menyakiti Rasulullah bagi mereka azab yang sangat pedih."
  },
  {
    "ayat": 62,
    "arabic": "يَحْلِفُوْنَ بِاللّٰهِ لَكُمْ لِيُرْضُوْكُمْ وَاللّٰهُ وَرَسُوْلُهٗٓ اَحَقُّ اَنْ يُّرْضُوْهُ اِنْ كَانُوْا مُؤْمِنِيْنَ",
    "transliteration_en": "yahlifoona billaahi lakum liyurdookum wallaahu wa Rasooluhoo ahaqqu ai yurdoohu in kaanoo mu'mineen",
    "transliteration_id": "Yaḥlifūna billāhi lakum liyurḍūkum wallāhu wa rasūluhū aḥaqqu ay yurḍūhu  in kānū mu'minīn(a).",
    "translation_en": "They swear by Allah to you [Muslims] to satisfy you. But Allah and His Messenger are more worthy for them to satisfy, if they should be believers.",
    "translation_id": "Mereka (orang-orang munafik) bersumpah kepadamu (kaum muslim) dengan (nama) Allah untuk membuat kamu rida, padahal Allah dan Rasul-Nya lebih pantas mereka (raih) keridaan-Nya jika mereka adalah orang-orang beriman."
  },
  {
    "ayat": 63,
    "arabic": "اَلَمْ يَعْلَمُوْٓا اَنَّهٗ مَنْ يُّحَادِدِ اللّٰهَ وَرَسُوْلَهٗ فَاَنَّ لَهٗ نَارَ جَهَنَّمَ خَالِدًا فِيْهَاۗ ذٰلِكَ الْخِزْيُ الْعَظِيْمُ",
    "transliteration_en": "Alam ya'lamooo annahoo mai yuhaadidillaaha wa Rasoolahoo faanna lahoo Naara jahannama khaalidan feehaa; zaalikal khizyul 'Azeem",
    "transliteration_id": "Alam ya‘lamū annahū may yuḥādidillāha wa rasūlahū fa anna lahū nāru jahannama khālidan fīhā, żālikal khizyul-‘aẓīm(u).",
    "translation_en": "Do they not know that whoever opposes Allah and His Messenger - that for him is the fire of Hell, wherein he will abide eternally? That is the great disgrace.",
    "translation_id": "Tidakkah mereka (orang-orang munafik) mengetahui bahwa siapa yang menentang Allah dan Rasul-Nya, maka sesungguhnya neraka Jahanamlah baginya. Dia kekal di dalamnya. Itulah kehinaan yang besar."
  },
  {
    "ayat": 64,
    "arabic": "يَحْذَرُ الْمُنٰفِقُوْنَ اَنْ تُنَزَّلَ عَلَيْهِمْ سُوْرَةٌ تُنَبِّئُهُمْ بِمَا فِيْ قُلُوْبِهِمْۗ قُلِ اسْتَهْزِءُوْاۚ اِنَّ اللّٰهَ مُخْرِجٌ مَّا تَحْذَرُوْنَ",
    "transliteration_en": "Yahzarul munaafiqoona an tunaz zala 'alaihim Sooratun tunabbi 'uhum bimaa feequloobihim; qulistahzi'oo innal laaha mukhrijum maa tahzaroon",
    "transliteration_id": "Yaḥżarul-munāfiqūna an tunazzala ‘alaihim sūratun tunabbi'uhum bimā fī qulūbihim, qulistahzi'ū, innallāha mukhrijum mā taḥżarūn(a).",
    "translation_en": "They hypocrites are apprehensive lest a surah be revealed about them, informing them of what is in their hearts. Say, \"Mock [as you wish]; indeed, Allah will expose that which you fear.\"",
    "translation_id": "Orang-orang munafik khawatir jika diturunkan suatu surah yang mengungkapkan apa yang ada dalam hati mereka. Katakanlah (kepada mereka), “Olok-oloklah (Allah, Rasul-Nya, dan orang beriman sesukamu). Sesungguhnya Allah pasti akan menampakkan apa yang kamu khawatirkan itu.”"
  },
  {
    "ayat": 65,
    "arabic": "وَلَىِٕنْ سَاَلْتَهُمْ لَيَقُوْلُنَّ اِنَّمَا كُنَّا نَخُوْضُ وَنَلْعَبُۗ  قُلْ اَبِاللّٰهِ وَاٰيٰتِهٖ وَرَسُوْلِهٖ كُنْتُمْ تَسْتَهْزِءُوْنَ",
    "transliteration_en": "Wala'in sa altahum layaqoolunna innamaa kunnaa nakhoodu wa nal'ab; qul abillaahi wa 'Aayaatihee wa Rasoolihee kuntum tastahzi'oon",
    "transliteration_id": "Wa la'in sa'altahum layaqūlunna innamā kunnā nakhūḍū wa nal‘ab(u), qul abillāhi wa āyātihī wa rasūlihī kuntum tastahzi'ūn(a).",
    "translation_en": "And if you ask them, they will surely say, \"We were only conversing and playing.\" Say, \"Is it Allah and His verses and His Messenger that you were mocking?\"",
    "translation_id": "Sesungguhnya jika kamu tanyakan kepada mereka, mereka pasti akan menjawab, “Sesungguhnya kami hanya bersenda gurau dan bermain-main saja.” Katakanlah, “Apakah terhadap Allah, ayat-ayat-Nya, dan Rasul-Nya kamu selalu berolok-olok?”"
  },
  {
    "ayat": 66,
    "arabic": "لَا تَعْتَذِرُوْا قَدْ كَفَرْتُمْ بَعْدَ اِيْمَانِكُمْ ۗ اِنْ نَّعْفُ عَنْ طَاۤىِٕفَةٍ مِّنْكُمْ نُعَذِّبْ طَاۤىِٕفَةً ۢ بِاَنَّهُمْ كَانُوْا مُجْرِمِيْنَ ࣖ",
    "transliteration_en": "Laa ta'taziroo qad kafartum ba'da eemaanikum; in na'fu 'an taaa'ifatim minkum nu'az zib taaa'ifatam bi annahum kaanoo mujrimeen",
    "transliteration_id": "Lā ta‘tażirū qad kafartum ba‘da īmānikum, in na‘fu ‘an ṭā'ifatim minkum nu‘ażżib ṭā'ifatam bi'annahum kānū mujrimīn(a).",
    "translation_en": "Make no excuse; you have disbelieved after your belief. If We pardon one faction of you - We will punish another faction because they were criminals.",
    "translation_id": "Tidak perlu kamu membuat-buat alasan karena kamu telah kufur sesudah beriman. Jika Kami memaafkan sebagian dari kamu (karena telah bertobat), niscaya Kami akan mengazab golongan (yang lain), karena sesungguhnya mereka adalah orang-orang yang berbuat dosa."
  },
  {
    "ayat": 67,
    "arabic": "اَلْمُنٰفِقُوْنَ وَالْمُنٰفِقٰتُ بَعْضُهُمْ مِّنْۢ بَعْضٍۘ يَأْمُرُوْنَ بِالْمُنْكَرِ وَيَنْهَوْنَ عَنِ الْمَعْرُوْفِ وَيَقْبِضُوْنَ اَيْدِيَهُمْۗ نَسُوا اللّٰهَ فَنَسِيَهُمْ ۗ اِنَّ الْمُنٰفِقِيْنَ هُمُ الْفٰسِقُوْنَ",
    "transliteration_en": "Almunaafiqoona wal munaafiqaatu ba'duhum mim ba'd; yaamuroona bilmunkari wa yanhawna 'anil ma'roofi wa yaqbidoona aidiyahum; nasul laaha fanasiyahum; innal munaafiqeena humul faasiqoon",
    "transliteration_id": "Al-munāfiqūna wal-munāfiqātu ba‘ḍuhum mim ba‘ḍ(in), ya'murūna bil-munkari wa yanhauna ‘anil-ma‘rūfi wa yaqbiḍūna aidiyahum, nasullāha fa nasiyahum, innal-munāfiqīna humul-fāsiqūn(a).",
    "translation_en": "The hypocrite men and hypocrite women are of one another. They enjoin what is wrong and forbid what is right and close their hands. They have forgotten Allah, so He has forgotten them [accordingly]. Indeed, the hypocrites - it is they who are the defiantly disobedient.",
    "translation_id": "Orang-orang munafik laki-laki dan perempuan, satu dengan yang lain (adalah sama saja). Mereka menyuruh (berbuat) mungkar dan mencegah (berbuat) makruf. Mereka pun menggenggam tangannya (kikir). Mereka telah melupakan Allah, maka Allah melupakan mereka. Sesungguhnya orang-orang munafik adalah orang-orang yang fasik."
  },
  {
    "ayat": 68,
    "arabic": "وَعَدَ اللّٰهُ الْمُنٰفِقِيْنَ وَالْمُنٰفِقٰتِ وَالْكُفَّارَ نَارَ جَهَنَّمَ خٰلِدِيْنَ فِيْهَاۗ هِيَ حَسْبُهُمْ ۚوَلَعَنَهُمُ اللّٰهُ ۚوَلَهُمْ عَذَابٌ مُّقِيْمٌۙ",
    "transliteration_en": "Wa'adal laahul munafiqeena wal munaafiqaati wal kuffaara naara jahannnamma khaalideena feehaa; hiya hasbuhum; wa la'annahumul laahu wa lahum 'azaabum muqeem",
    "transliteration_id": "Wa‘adallāhul-munāfiqīna wal-munāfiqāti wal-kuffāra nāra jahannama khālidīna fīhā, hiya ḥasbuhum, wa la‘anahumullāh(u), wa lahum ‘ażābum muqīm(un).",
    "translation_en": "Allah has promised the hypocrite men and hypocrite women and the disbelievers the fire of Hell, wherein they will abide eternally. It is sufficient for them. And Allah has cursed them, and for them is an enduring punishment.",
    "translation_id": "Allah telah mengancam orang-orang munafik laki-laki dan perempuan serta orang-orang kafir dengan neraka Jahanam. Mereka kekal di dalamnya. Cukuplah (neraka) itu bagi mereka. Allah melaknat mereka. Bagi mereka azab yang kekal."
  },
  {
    "ayat": 69,
    "arabic": "كَالَّذِيْنَ مِنْ قَبْلِكُمْ كَانُوْٓا اَشَدَّ مِنْكُمْ قُوَّةً وَّاَكْثَرَ اَمْوَالًا وَّاَوْلَادًاۗ فَاسْتَمْتَعُوْا بِخَلَاقِهِمْ فَاسْتَمْتَعْتُمْ بِخَلَاقِكُمْ كَمَا اسْتَمْتَعَ الَّذِيْنَ مِنْ قَبْلِكُمْ بِخَلَاقِهِمْ وَخُضْتُمْ كَالَّذِيْ خَاضُوْاۗ اُولٰۤىِٕكَ حَبِطَتْ اَعْمَالُهُمْ فِى الدُّنْيَا وَالْاٰخِرَةِ ۚوَاُولٰۤىِٕكَ هُمُ الْخٰسِرُوْنَ",
    "transliteration_en": "Kallazeena min qablikum kaanoo ashadda minkum quwwatanw wa aksara amwaalanw wa awlaadan fastamta'oo bikhalaaqihim fastamta'tum bikhalaaqikum kamas tamta'al lazeena min qablikum bikhalaa qihim wa khudtum kallazee khaadooo; ulaaa'ika habitat a'maaluhum fid dunyaa wal Aakhirati wa ulaaa'ika humul khaasiroon",
    "transliteration_id": "Kal-lażīna min qablikum kānū asyadda minkum quwwataw wa akṡara amwālaw wa aulādā(n), fastamta‘ū bikhalāqihim fastamta‘tum bikhalāqikum kamastamta‘al-lażīna min qablikum bikhalāqihim wa khuḍtum kal-lażī khāḍū, ulā'ika ḥabiṭat amāluhum fid-dun-yā wal-ākhirah(ti), ulā'ika humul-khāsirūn(a).",
    "translation_en": "[You disbelievers are] like those before you; they were stronger than you in power and more abundant in wealth and children. They enjoyed their portion [of worldly enjoyment], and you have enjoyed your portion as those before you enjoyed their portion, and you have engaged [in vanities] like that in which they engaged. [It is] those whose deeds have become worthless in this world and in the Hereafter, and it is they who are the losers.",
    "translation_id": "(Kamu, orang-orang munafik,) seperti orang-orang sebelummu. Mereka lebih kuat daripada kamu dan lebih banyak harta dan anak-anaknya. Mereka telah menikmati bagiannya dan kamu telah menikmati bagianmu sebagaimana orang-orang yang sebelummu menikmati bagiannya. Kamu mempercakapkan (hal-hal yang batil) sebagaimana mereka mempercakapkannya. Mereka itu sia-sia amalnya di dunia dan di akhirat. Mereka itulah orang-orang yang rugi."
  },
  {
    "ayat": 70,
    "arabic": "اَلَمْ يَأْتِهِمْ نَبَاُ الَّذِيْنَ مِنْ قَبْلِهِمْ قَوْمِ نُوْحٍ وَّعَادٍ وَّثَمُوْدَ ەۙ وَقَوْمِ اِبْرٰهِيْمَ وَاَصْحٰبِ مَدْيَنَ وَالْمُؤْتَفِكٰتِۗ اَتَتْهُمْ رُسُلُهُمْ بِالْبَيِّنٰتِۚ فَمَا كَانَ اللّٰهُ لِيَظْلِمَهُمْ وَلٰكِنْ كَانُوْٓا اَنْفُسَهُمْ يَظْلِمُوْنَ",
    "transliteration_en": "Alam yaatihim naba ul lazeena min qablihim qawmi Noohinw wa 'Aadinw wa Samooda wa qawmi Ibraaheema wa ashaabi adyana walmu'tafikaat; atathum Rusuluhum bilbaiyinaati famaa kaanal laahu liyazlimahum wa laakin kaanooo anfusahum yazlimoon",
    "transliteration_id": "Alam ya'tihim naba'ul-lażīna min qablihim qaumi nūḥiw wa ‘ādiw wa ṡamūd(a), wa qaumi ibrāhīma wa aṣḥābi madyana wal-mu'tafikāt(i), atathum rusuluhum bil-bayyināt(i), famā kānallāhu liyaẓlimahum wa lākin kānū anfusahum yaẓlimūn(a).",
    "translation_en": "Has there not reached them the news of those before them - the people of Noah and [the tribes of] 'Aad and Thamud and the people of Abraham and the companions of Madyan and the towns overturned? Their messengers came to them with clear proofs. And Allah would never have wronged them, but they were wronging themselves.",
    "translation_id": "Apakah tidak sampai kepada mereka berita (tentang) orang-orang sebelum mereka, (yaitu) kaum Nuh, ‘Ad, Samud, kaum Ibrahim, penduduk Madyan, dan (kaum Lut) yang kota-kotanya dijungkirbalikkan? Telah datang kepada mereka rasul-rasul dengan membawa bukti-bukti yang nyata. Allah tidak akan pernah menzalimi mereka, tetapi merekalah yang selalu menzalimi diri sendiri."
  },
  {
    "ayat": 71,
    "arabic": "وَالْمُؤْمِنُوْنَ وَالْمُؤْمِنٰتُ بَعْضُهُمْ اَوْلِيَاۤءُ بَعْضٍۘ يَأْمُرُوْنَ بِالْمَعْرُوْفِ وَيَنْهَوْنَ عَنِ الْمُنْكَرِ وَيُقِيْمُوْنَ الصَّلٰوةَ وَيُؤْتُوْنَ الزَّكٰوةَ وَيُطِيْعُوْنَ اللّٰهَ وَرَسُوْلَهٗ ۗاُولٰۤىِٕكَ سَيَرْحَمُهُمُ اللّٰهُ ۗاِنَّ اللّٰهَ عَزِيْزٌ حَكِيْمٌ",
    "transliteration_en": "Walmu'minoona wal mu'minaatu ba'duhum awliyaaa'u ba;d; yaamuroona bilma'roofi wa yanhawna 'anil munkari wa yuqeemoonas Salaata wa yu'toonaz Zakaata wa yutee'oonal laaha wa Rasoolah; ulaaa'ika sayarhamuhumul laah; innallaaha 'Azeezun Hakeem",
    "transliteration_id": "Wal-mu'minūna wal-mu'minātu ba‘ḍuhum auliyā'u ba‘ḍ(in), ya'murūna bil-ma‘rūfi wa yanhauna  ‘anil-munkari wa yuqīmūnaṣ-ṣalāta wa yu'tūnaz-zakāta wa yuṭī‘ūnallāha wa rasūlah(ū), ulā'ika sayarḥamuhumullāh(u), innallāha ‘azīzun ḥakīm(un).",
    "translation_en": "The believing men and believing women are allies of one another. They enjoin what is right and forbid what is wrong and establish prayer and give zakah and obey Allah and His Messenger. Those - Allah will have mercy upon them. Indeed, Allah is Exalted in Might and Wise.",
    "translation_id": "Orang-orang mukmin, laki-laki dan perempuan, sebagian mereka menjadi penolong bagi sebagian yang lain. Mereka menyuruh (berbuat) makruf dan mencegah (berbuat) mungkar, menegakkan salat, menunaikan zakat, dan taat kepada Allah dan Rasul-Nya. Mereka akan diberi rahmat oleh Allah. Sesungguhnya Allah Maha Perkasa lagi Maha Bijaksana."
  },
  {
    "ayat": 72,
    "arabic": "وَعَدَ اللّٰهُ الْمُؤْمِنِيْنَ وَالْمُؤْمِنٰتِ جَنّٰتٍ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُ خٰلِدِيْنَ فِيْهَا وَمَسٰكِنَ طَيِّبَةً فِيْ جَنّٰتِ عَدْنٍ ۗوَرِضْوَانٌ مِّنَ اللّٰهِ اَكْبَرُ ۗذٰلِكَ هُوَ الْفَوْزُ الْعَظِيْمُ ࣖ",
    "transliteration_en": "Wa'adal laahulmu' mineena walmu'minaati Jannaatin tajree min tahtihal anhaaru khaalideena feehaa wa masaakina taiyibatan fee Jannnaati 'adn; wa ridwaanum minal laahi akbar; zaalika hual fawzul 'azeem",
    "transliteration_id": "Wa‘adallāhul-mu'minīna wal-mu'mināti jannātin tajrī min taḥtihal-anhāru khālidīna fīhā wa masākina ṭayyibatan fī jannāti ‘adn(in), wa riḍwānum minallāhi akbar(u), żālika huwal-fauzul-‘aẓīm(u).",
    "translation_en": "Allah has promised the believing men and believing women gardens beneath which rivers flow, wherein they abide eternally, and pleasant dwellings in gardens of perpetual residence; but approval from Allah is greater. It is that which is the great attainment.",
    "translation_id": "Allah telah menjanjikan kepada orang-orang mukmin laki-laki dan perempuan, surga-surga yang sungai-sungai mengalir di bawahnya, mereka kekal di dalamnya, dan tempat-tempat yang baik di surga ‘Adn. Rida Allah lebih besar. Itulah kemenangan yang agung."
  },
  {
    "ayat": 73,
    "arabic": "يٰٓاَيُّهَا النَّبِيُّ جَاهِدِ الْكُفَّارَ وَالْمُنٰفِقِيْنَ وَاغْلُظْ عَلَيْهِمْ ۗوَمَأْوٰىهُمْ جَهَنَّمُ وَبِئْسَ الْمَصِيْرُ",
    "transliteration_en": "yaaa aiyuhan Nabiyyu jaahidil kuffaara walmunaafiqeena waghluz 'alaihim; wa maawaahum jahannnamu wa bi'sal maseer",
    "transliteration_id": "Yā ayyuhan-nabiyyu jāhidil-kuffāra wal-munāfiqīna wagluẓ ‘alaihim, wa ma'wāhum jahannamu wa bi'sal-maṣīr(u).",
    "translation_en": "O Prophet, fight against the disbelievers and the hypocrites and be harsh upon them. And their refuge is Hell, and wretched is the destination.",
    "translation_id": "Wahai Nabi, berjihadlah (melawan) orang-orang kafir dan orang-orang munafik dan bersikap keraslah terhadap mereka. Tempat mereka adalah (neraka) Jahanam. (Itulah) seburuk-buruk tempat kembali."
  },
  {
    "ayat": 74,
    "arabic": "يَحْلِفُوْنَ بِاللّٰهِ مَا قَالُوْا ۗوَلَقَدْ قَالُوْا كَلِمَةَ الْكُفْرِ وَكَفَرُوْا بَعْدَ اِسْلَامِهِمْ وَهَمُّوْا بِمَا لَمْ يَنَالُوْاۚ وَمَا نَقَمُوْٓا اِلَّآ اَنْ اَغْنٰىهُمُ اللّٰهُ وَرَسُوْلُهٗ مِنْ فَضْلِهٖ ۚفَاِنْ يَّتُوْبُوْا يَكُ خَيْرًا لَّهُمْ ۚوَاِنْ يَّتَوَلَّوْا يُعَذِّبْهُمُ اللّٰهُ عَذَابًا اَلِيْمًا فِى الدُّنْيَا وَالْاٰخِرَةِ ۚوَمَا لَهُمْ فِى الْاَرْضِ مِنْ وَّلِيٍّ وَّلَا نَصِيْرٍ",
    "transliteration_en": "Yahlifoona billaahi wa qaaloo wa laqad qaaloo kalimatal kufri wa kafaroo ba'da Islaamihim wa hammoo bimaa lam yanaaloo; wa maa naqamooo illaaa an aghnaa humullaahu wa Rasooluhoo min fadlih; fainy yatooboo yaku khairal lahum wa iny yatawal law yu'az zibhumullaahu 'azaaban aleeman fiddunyaa wal Aakhirah; wamaa lahum fil ardi minw waliyyinw wa laa naseer",
    "transliteration_id": "Yaḥlifūna billāhi mā qālū, wa laqad qālū kalimatal-kufri wa kafarū ba‘da islāmihim wa hammū bimā lam yanālū, wa mā naqamū illā an agnāhumullāhu wa rasūluhū min faḍlih(ī),  fa iy yatūbū yaku khairal lahum, wa iy yatawallau yu‘ażżibhumullāhu ‘ażāban alīman fid-dun-yā wal-ākhirah(ti), wa mā lahum fil-arḍi miw waliyyiw wa lā naṣīr(in).",
    "translation_en": "They swear by Allah that they did not say [anything against the Prophet] while they had said the word of disbelief and disbelieved after their [pretense of] Islam and planned that which they were not to attain. And they were not resentful except [for the fact] that Allah and His Messenger had enriched them of His bounty. So if they repent, it is better for them; but if they turn away, Allah will punish them with a painful punishment in this world and the Hereafter. And there will not be for them on earth any protector or helper.",
    "translation_id": "Mereka (orang-orang munafik) bersumpah dengan (nama) Allah bahwa mereka tidak mengatakan (sesuatu yang menyakiti Nabi Muhammad). Sungguh, mereka benar-benar telah mengucapkan perkataan kekafiran (dengan mencela Nabi Muhammad) dan (karenanya) menjadi kafir setelah berislam. Mereka menginginkan apa yang tidak dapat mereka capai. Mereka tidak mencela melainkan karena Allah dan Rasul-Nya telah melimpahkan karunia-Nya kepada mereka. Maka, jika mereka bertobat, itu lebih baik bagi mereka. Jika berpaling, niscaya Allah akan mengazab mereka dengan azab yang pedih di dunia dan akhirat. Mereka tidak mempunyai pelindung dan tidak (pula) penolong di bumi."
  },
  {
    "ayat": 75,
    "arabic": "۞ وَمِنْهُمْ مَّنْ عٰهَدَ اللّٰهَ لَىِٕنْ اٰتٰىنَا مِنْ فَضْلِهٖ لَنَصَّدَّقَنَّ وَلَنَكُوْنَنَّ مِنَ الصّٰلِحِيْنَ",
    "transliteration_en": "Wa minhum man 'aaha dal laaha la'in aataanaa min fadlihee lanas saddaqanna wa lanakoonanna minassaaliheen",
    "transliteration_id": "Wa minhum man ‘āhadallāha la'in ātānā min faḍlihī lanaṣṣaddaqanna wa lanakūnanna minaṣ-ṣāliḥīn(a).",
    "translation_en": "And among them are those who made a covenant with Allah, [saying], \"If He should give us from His bounty, we will surely spend in charity, and we will surely be among the righteous.\"",
    "translation_id": "Di antara mereka ada orang yang telah berjanji kepada Allah, “Sesungguhnya jika Dia memberikan sebagian dari karunia-Nya kepada kami, niscaya kami akan benar-benar bersedekah dan niscaya kami benar-benar termasuk orang-orang yang saleh.”"
  },
  {
    "ayat": 76,
    "arabic": "فَلَمَّآ اٰتٰىهُمْ مِّنْ فَضْلِهٖ بَخِلُوْا بِهٖ وَتَوَلَّوْا وَّهُمْ مُّعْرِضُوْنَ",
    "transliteration_en": "Falammaaa aataahum min fadlihee bakhiloo bihee wa tawallaw wa hum mu'ridoon",
    "transliteration_id": "Falammā ātāhum min faḍlihī bakhilū bihī wa tawallau wa hum mu‘riḍūn(a).",
    "translation_en": "But when he gave them from His bounty, they were stingy with it and turned away while they refused.",
    "translation_id": "Akan tetapi, ketika Allah menganugerahkan kepada mereka sebagian dari karunia-Nya, mereka menjadi kikir dan berpaling seraya menjadi penentang (kebenaran)."
  },
  {
    "ayat": 77,
    "arabic": "فَاَعْقَبَهُمْ نِفَاقًا فِيْ قُلُوْبِهِمْ اِلٰى يَوْمِ يَلْقَوْنَهٗ بِمَآ اَخْلَفُوا اللّٰهَ مَا وَعَدُوْهُ وَبِمَا كَانُوْا يَكْذِبُوْنَ",
    "transliteration_en": "Fa a'qabahum nifaaqan fee quloobihim ilaa Yawmi yalqaw nahoo bimaaa akhlaful laaha maa wa'adoohu wa bimaa kaanoo yakhziboon",
    "transliteration_id": "Fa a‘qabahum nifāqan fī qulūbihim ilā yaumi yalqaunahū bimā akhlafullāha mā wa‘adūhu wa bimā kānū yakżibūn(a).",
    "translation_en": "So He penalized them with hypocrisy in their hearts until the Day they will meet Him - because they failed Allah in what they promised Him and because they [habitually] used to lie.",
    "translation_id": "Maka, (akibat kekikiran itu) Dia menanamkan kemunafikan dalam hati mereka sampai pada hari mereka menemui-Nya karena mereka telah mengingkari janji yang telah mereka ikrarkan kepada-Nya dan (juga) karena mereka selalu berdusta."
  },
  {
    "ayat": 78,
    "arabic": "اَلَمْ يَعْلَمُوْٓا اَنَّ اللّٰهَ يَعْلَمُ سِرَّهُمْ وَنَجْوٰىهُمْ وَاَنَّ اللّٰهَ عَلَّامُ الْغُيُوْبِ",
    "transliteration_en": "Alam ya'lamooo annal laaha ya'lamu sirrahum wa najwaahum wa annal laaha 'Allaamul Ghuyoob",
    "transliteration_id": "Alam ya‘lamū annallāha ya‘lamu sirrahum wa najwāhum wa annallāha ‘allāmul-guyūb(i).",
    "translation_en": "Did they not know that Allah knows their secrets and their private conversations and that Allah is the Knower of the unseen?",
    "translation_id": "Tidakkah mereka mengetahui bahwa Allah mengetahui rahasia dan bisikan mereka dan bahwa sesungguhnya Allah Maha Mengetahui segala yang gaib?"
  },
  {
    "ayat": 79,
    "arabic": "اَلَّذِيْنَ يَلْمِزُوْنَ الْمُطَّوِّعِيْنَ مِنَ الْمُؤْمِنِيْنَ فِى الصَّدَقٰتِ وَالَّذِيْنَ لَا يَجِدُوْنَ اِلَّا جُهْدَهُمْ فَيَسْخَرُوْنَ مِنْهُمْ ۗسَخِرَ اللّٰهُ مِنْهُمْ ۖ وَلَهُمْ عَذَابٌ اَلِيْمٌ",
    "transliteration_en": "Allazeena yalmizoonal mut tawwi'eena minalmu'mineena fis sadaqaati wallazeena laa yajidoona illaa juhdahum fayaskharoona minhum sakhiral laahu minhum wa lahum azaabun aleem",
    "transliteration_id": "Allażīna yalmizūnal-muṭṭawwi‘īna minal-mu'minīna fiṣ-ṣadaqāti wal-lażīna lā yajidūna illā juhdahum fa yaskharūna minhum, sakhirallāhu minhum, wa lahum ‘ażābun alīm(un).",
    "translation_en": "Those who criticize the contributors among the believers concerning [their] charities and [criticize] the ones who find nothing [to spend] except their effort, so they ridicule them - Allah will ridicule them, and they will have a painful punishment.",
    "translation_id": "Orang-orang (munafik) yang mencela orang-orang beriman yang memberikan sedekah dengan sukarela, (mencela) orang-orang yang tidak mendapatkan (untuk disedekahkan) selain kesanggupannya, lalu mereka mengejeknya. Maka, Allah mengejek mereka dan bagi mereka azab yang sangat pedih."
  },
  {
    "ayat": 80,
    "arabic": "اِسْتَغْفِرْ لَهُمْ اَوْ لَا تَسْتَغْفِرْ لَهُمْۗ اِنْ تَسْتَغْفِرْ لَهُمْ سَبْعِيْنَ مَرَّةً فَلَنْ يَّغْفِرَ اللّٰهُ لَهُمْ ۗذٰلِكَ بِاَنَّهُمْ كَفَرُوْا بِاللّٰهِ وَرَسُوْلِهٖۗ وَاللّٰهُ لَا يَهْدِى الْقَوْمَ الْفٰسِقِيْنَ ࣖ",
    "transliteration_en": "istaghfir lahum aw laa tastaghfir lahum in tastaghfir lahum sab'eena marratan falany yaghfiral laahu lahum; zaalika bi annahum kafaroo billaahi wa Rasoolih; wallaahu laa yahdil qawmal faasiqeen",
    "transliteration_id": "Istagfir lahum au lā tastagfir lahum, in tastagfir lahum sab‘īna marratan falay yagfirallāhu lahum, żālika bi'annahum kafarū billāhi wa rasūlih(ī), wallāhu lā yahdil-qaumal-fāsiqīn(a).",
    "translation_en": "Ask forgiveness for them, [O Muhammad], or do not ask forgiveness for them. If you should ask forgiveness for them seventy times - never will Allah forgive them. That is because they disbelieved in Allah and His Messenger, and Allah does not guide the defiantly disobedient people.",
    "translation_id": "(Sama saja) engkau (Nabi Muhammad) memohonkan ampunan bagi mereka atau tidak memohonkan ampunan bagi mereka. Walaupun engkau memohonkan ampunan bagi mereka tujuh puluh kali, Allah tidak akan memberi ampunan kepada mereka. Demikian itu karena mereka kufur kepada Allah dan Rasul-Nya. Allah tidak akan memberi petunjuk kepada kaum yang fasik."
  },
  {
    "ayat": 81,
    "arabic": "فَرِحَ الْمُخَلَّفُوْنَ بِمَقْعَدِهِمْ خِلٰفَ رَسُوْلِ اللّٰهِ وَكَرِهُوْٓا اَنْ يُّجَاهِدُوْا بِاَمْوَالِهِمْ وَاَنْفُسِهِمْ فِيْ سَبِيْلِ اللّٰهِ وَقَالُوْا لَا تَنْفِرُوْا فِى الْحَرِّۗ قُلْ نَارُ جَهَنَّمَ اَشَدُّ حَرًّاۗ  لَوْ كَانُوْا يَفْقَهُوْنَ",
    "transliteration_en": "Farihal mukhallafoona bimaq'adihim khilaafa Rasoolil laahi wa karihooo ai yujaahidoo bi amwaalihim wa anfusihim fee sabeelil laahi wa qaaloo la tanfiroo fil harr; qul Naaru jahannama ashaddu harraa; law kaanoo yafqahoon",
    "transliteration_id": "Fariḥal-mukhallafūna bimaq‘adihim khilāfa rasūlillāhi wa karihū ay yujāhidū bi'amwālihim wa anfusihim fī sabīlillāhi wa qālū lā tanfirū fil-ḥarr(i), qul nāru jahannama  asyaddu ḥarrā(n), lau kānū yafqahūn(a).",
    "translation_en": "Those who remained behind rejoiced in their staying [at home] after [the departure of] the Messenger of Allah and disliked to strive with their wealth and their lives in the cause of Allah and said, \"Do not go forth in the heat.\" Say, \"The fire of Hell is more intensive in heat\" - if they would but understand.",
    "translation_id": "Orang-orang yang ditinggalkan (tidak ikut berperang) merasa gembira dengan duduk-duduk setelah kepergian Rasulullah (ke medan perang). Mereka tidak suka berjihad dengan harta dan jiwa mereka di jalan Allah dan mereka (justru) berkata, “Janganlah kamu berangkat (ke medan perang) di tengah panas terik.” Katakanlah (Nabi Muhammad), “Api neraka Jahanam lebih panas.” Seandainya saja selama ini mereka memahami."
  },
  {
    "ayat": 82,
    "arabic": "فَلْيَضْحَكُوْا قَلِيْلًا وَّلْيَبْكُوْا كَثِيْرًاۚ جَزَاۤءًۢ بِمَا كَانُوْا يَكْسِبُوْنَ",
    "transliteration_en": "Falyadhakoo qaleelanw walyabkoo kaseeran jazaaa'am bimaa kaanoo yaksiboon",
    "transliteration_id": "Falyaḍḥakū qalīlaw walyabkū kaṡīrā(n), jazā'am bimā kānū yaksibūn(a).",
    "translation_en": "So let them laugh a little and [then] weep much as recompense for what they used to earn.",
    "translation_id": "Maka, biarkanlah mereka tertawa sedikit (di dunia) dan menangis yang banyak (di akhirat) sebagai balasan terhadap apa yang selalu mereka perbuat."
  },
  {
    "ayat": 83,
    "arabic": "فَاِنْ رَّجَعَكَ اللّٰهُ اِلٰى طَاۤىِٕفَةٍ مِّنْهُمْ فَاسْتَأْذَنُوْكَ لِلْخُرُوْجِ فَقُلْ لَّنْ تَخْرُجُوْا مَعِيَ اَبَدًا وَّلَنْ تُقَاتِلُوْا مَعِيَ عَدُوًّاۗ اِنَّكُمْ رَضِيْتُمْ بِالْقُعُوْدِ اَوَّلَ مَرَّةٍۗ فَاقْعُدُوْا مَعَ الْخٰلِفِيْنَ",
    "transliteration_en": "Fa ir raja'akal laahu ilaa taaa'ifatim minhum fastaaa zanooka lilkhurooji faqul lan takhrujoo ma'iya abadanw a lan tuqaatiloo ma'iya 'aduwwan innakum radeetum bilqu'oodi awwala marratin faq'udoo ma'al khaalifeen",
    "transliteration_id": "Fa ir raja‘akallāhu ilā ṭā'ifatim minhum  fasta'żanūka lil-khurūji faqul lan takhrujū ma‘iya abadaw wa lan tuqātilū ma‘iya ‘aduwwā(n), innakum raḍītum bil-qu‘ūdi awwala marrah(tin), faq‘udū ma‘al-khālifīn(a).",
    "translation_en": "If Allah should return you to a faction of them [after the expedition] and then they ask your permission to go out [to battle], say, \"You will not go out with me, ever, and you will never fight with me an enemy. Indeed, you were satisfied with sitting [at home] the first time, so sit [now] with those who stay behind.\"",
    "translation_id": "Maka, jika Allah memulangkanmu (Nabi Muhammad) ke satu golongan dari mereka (orang-orang munafik), kemudian mereka meminta izin kepadamu untuk keluar (pergi berperang), katakanlah, “Kamu tidak boleh keluar bersamaku selama-lamanya dan tidak boleh memerangi musuh bersamaku. Sesungguhnya sejak semula kamu telah rida duduk (tidak berperang). Oleh karena itu, duduklah (tinggallah) bersama orang-orang yang tidak ikut (berperang).”"
  },
  {
    "ayat": 84,
    "arabic": "وَلَا تُصَلِّ عَلٰٓى اَحَدٍ مِّنْهُمْ مَّاتَ اَبَدًا وَّلَا تَقُمْ عَلٰى قَبْرِهٖۗ اِنَّهُمْ كَفَرُوْا بِاللّٰهِ وَرَسُوْلِهٖ وَمَاتُوْا وَهُمْ فٰسِقُوْنَ",
    "transliteration_en": "Wa laa tusalli 'alaaa ahadim minhum maata abadanw wa laa taqum 'alaa qabriheee innahum kafaroo billaahi wa Rasoolihee wa maatoo wa hum faasiqoon",
    "transliteration_id": "Wa lā tuṣalli ‘alā aḥadim minhum māta abadaw wa lā taqum ‘alā qabrih(ī), innahum kafarū billāhi wa rasūlihī wa mātū wa hum fāsiqūn(a).",
    "translation_en": "And do not pray [the funeral prayer, O Muhammad], over any of them who has died - ever - or stand at his grave. Indeed, they disbelieved in Allah and His Messenger and died while they were defiantly disobedient.",
    "translation_id": "Janganlah engkau (Nabi Muhammad) melaksanakan salat untuk seseorang yang mati di antara mereka (orang-orang munafik) selama-lamanya dan janganlah engkau berdiri (berdoa) di atas kuburnya. Sesungguhnya mereka ingkar kepada Allah dan Rasul-Nya dan mereka mati dalam keadaan fasik."
  },
  {
    "ayat": 85,
    "arabic": "وَلَا تُعْجِبْكَ اَمْوَالُهُمْ وَاَوْلَادُهُمْۗ اِنَّمَا يُرِيْدُ اللّٰهُ اَنْ يُّعَذِّبَهُمْ بِهَا فِى الدُّنْيَا وَتَزْهَقَ اَنْفُسُهُمْ وَهُمْ كٰفِرُوْنَ",
    "transliteration_en": "Wa laa tu'jibka amwaa luhum wa awlaaduhum; innamaa yureedul laahu ai yu'az zibahum bihaa fid dunyaa wa tazhaqa anfusuhum wa hum kaafiroon",
    "transliteration_id": "Wa lā tu‘jibka amwāluhum wa lā aulāduhum, innamā yurīdullāhu ay yu‘ażżibahum bihā fid-dun-yā wa tazhaqa anfusuhum wa hum kāfirūn(a).",
    "translation_en": "And let not their wealth and their children impress you. Allah only intends to punish them through them in this world and that their souls should depart [at death] while they are disbelievers.",
    "translation_id": "Janganlah harta dan anak-anak mereka membuatmu kagum. Sesungguhnya dengan (sebab harta dan anak) itu Allah berkehendak untuk menyiksa mereka di dunia dan (membiarkan) nyawa mereka melayang dalam keadaan kafir."
  },
  {
    "ayat": 86,
    "arabic": "وَاِذَآ اُنْزِلَتْ سُوْرَةٌ اَنْ اٰمِنُوْا بِاللّٰهِ وَجَاهِدُوْا مَعَ رَسُوْلِهِ اسْتَأْذَنَكَ اُولُوا الطَّوْلِ مِنْهُمْ وَقَالُوْا ذَرْنَا نَكُنْ مَّعَ الْقٰعِدِيْنَ",
    "transliteration_en": "Wa izaaa unzilat Sooratun an aaminoo billaahi wa jaahidoo ma'a Rasoolihis taazanaka uluttawli minhum wa qaaloo zarnaa nakum ma'alqaa 'ideen",
    "transliteration_id": "Wa iżā unzilat sūratun an āminū billāhi wa jāhidū ma‘a rasūlihista'żanaka uluṭ-ṭauli minhum wa qālū żarnā nakum ma‘al-qā‘idīn(a).",
    "translation_en": "And when a surah was revealed [enjoining them] to believe in Allah and to fight with His Messenger, those of wealth among them asked your permission [to stay back] and said, \"Leave us to be with them who sit [at home].\"",
    "translation_id": "Apabila diturunkan suatu surah (yang memerintahkan orang-orang munafik), “Berimanlah kepada Allah dan berjihadlah bersama Rasul-Nya,” niscaya orang-orang yang berkemampuan di antara mereka meminta izin kepadamu (untuk tidak berjihad) dan mereka berkata, “Biarkanlah kami berada bersama orang-orang yang duduk (tinggal di rumah).”"
  },
  {
    "ayat": 87,
    "arabic": "رَضُوْا بِاَنْ يَّكُوْنُوْا مَعَ الْخَوَالِفِ وَطُبِعَ عَلٰى قُلُوْبِهِمْ فَهُمْ لَا يَفْقَهُوْنَ",
    "transliteration_en": "Radoo bi ai yakoonoo ma'al khawaalifi wa tubi'a 'alaa quloobihim fahum laa yafqahoon",
    "transliteration_id": "Raḍū bi'ay yakūnū ma‘al-khawālifi wa ṭubi‘a ‘alā qulūbihim fahum lā yafqahūn(a).",
    "translation_en": "They were satisfied to be with those who stay behind, and their hearts were sealed over, so they do not understand.",
    "translation_id": "Mereka rida berada bersama orang-orang yang tidak pergi berperang. Hati mereka telah dikunci sehingga tidak memahami."
  },
  {
    "ayat": 88,
    "arabic": "لٰكِنِ الرَّسُوْلُ وَالَّذِيْنَ اٰمَنُوْا مَعَهٗ جَاهَدُوْا بِاَمْوَالِهِمْ وَاَنْفُسِهِمْۗ وَاُولٰۤىِٕكَ لَهُمُ الْخَيْرٰتُ ۖوَاُولٰۤىِٕكَ هُمُ الْمُفْلِحُوْنَ",
    "transliteration_en": "Laakinir Rasoolu wal lazeena aamanoo ma'ahoo jaahadoo bi amwaalihim wa anfusihim; wa ulaaa'ika lahumul khairaatu wa ulaaa'ika humul muflihoon",
    "transliteration_id": "Lākinir-rasūlu wal-lażīna āmanū ma‘ahū jāhadū bi'amwālihim wa anfusihim, wa ulā'ika lahumul-khairāt(u), wa ulā'ika humul-mufliḥūn(a).",
    "translation_en": "But the Messenger and those who believed with him fought with their wealth and their lives. Those will have [all that is] good, and it is those who are the successful.",
    "translation_id": "Akan tetapi, Rasul dan orang-orang yang beriman bersamanya berjihad dengan harta dan jiwanya. Mereka memperoleh berbagai kebaikan. Mereka (pula)-lah orang-orang yang beruntung."
  },
  {
    "ayat": 89,
    "arabic": "اَعَدَّ اللّٰهُ لَهُمْ جَنّٰتٍ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُ خٰلِدِيْنَ فِيْهَاۗ ذٰلِكَ الْفَوْزُ الْعَظِيْمُ ࣖ",
    "transliteration_en": "A'addal laahu lahum Jannaatin tajree min tahtihal anhaaru khaalideena feehaa; zaalikal fawzul 'azeem",
    "transliteration_id": "A‘addallāhu lahum jannātin tajrī min taḥtihal-anhāru khālidīna fīhā, żālikal-fauzul-‘aẓīm(u).",
    "translation_en": "Allah has prepared for them gardens beneath which rivers flow, wherein they will abide eternally. That is the great attainment.",
    "translation_id": "Allah telah menyediakan bagi mereka surga yang sungai-sungai mengalir di bawahnya. Mereka kekal di dalamnya. Itulah kemenangan yang agung."
  },
  {
    "ayat": 90,
    "arabic": "وَجَاۤءَ الْمُعَذِّرُوْنَ مِنَ الْاَعْرَابِ لِيُؤْذَنَ لَهُمْ وَقَعَدَ الَّذِيْنَ كَذَبُوا اللّٰهَ وَرَسُوْلَهٗ ۗسَيُصِيْبُ الَّذِيْنَ كَفَرُوْا مِنْهُمْ عَذَابٌ اَلِيْمٌ",
    "transliteration_en": "Wa jaaa'al mu'az ziroona minal A'raabi liyu'zana lahum wa qa'adal lazeena kazabul laaha wa Rasoolah; sayuseebul lazeena kafaroo minhum 'azaabun aleem",
    "transliteration_id": "Wa jā'al-mu‘ażżirūna minal-a‘rābi liyu'żana lahum wa qa‘adal-lażīna każabullāha wa rasūlah(ū), sayuṣībul-lażīna kafarū minhum ‘ażābun alīm(un).",
    "translation_en": "And those with excuses among the bedouins came to be permitted [to remain], and they who had lied to Allah and His Messenger sat [at home]. There will strike those who disbelieved among them a painful punishment.",
    "translation_id": "Orang-orang Arab Badui yang membuat-buat alasan datang (kepada Nabi) agar diberi izin (untuk tidak berperang). Adapun orang-orang yang mendustakan Allah dan Rasul-Nya duduk berdiam (tidak mengemukakan alasan). Kelak orang-orang yang kufur di antara mereka akan ditimpa azab yang sangat pedih."
  },
  {
    "ayat": 91,
    "arabic": "لَيْسَ عَلَى الضُّعَفَاۤءِ وَلَا عَلَى الْمَرْضٰى وَلَا عَلَى الَّذِيْنَ لَا يَجِدُوْنَ مَا يُنْفِقُوْنَ حَرَجٌ اِذَا نَصَحُوْا لِلّٰهِ وَرَسُوْلِهٖۗ مَا عَلَى الْمُحْسِنِيْنَ مِنْ سَبِيْلٍ ۗوَاللّٰهُ غَفُوْرٌ رَّحِيْمٌۙ",
    "transliteration_en": "Laisa 'alad du'aaaa'i wa laa 'alal mardaa wa laa 'alal lazeena laa yajidoona maa yunfiqoona harajun izaa nasahoo lillaahi wa Rasoolih; maa 'alal muhsineena min sabeel; wallaahu Ghafoorur Raheem",
    "transliteration_id": "Laisa ‘alaḍ-ḍu‘afā'i wa lā ‘alal-marḍā wa lā ‘alal-lażīna lā yajidūna mā yunfiqūna ḥarajun iżā naṣaḥū lillāhi wa rasūlih(ī), mā ‘alal-muḥsinīna min sabīl(in), wallāhu gafūrur raḥīm(un).",
    "translation_en": "There is not upon the weak or upon the ill or upon those who do not find anything to spend any discomfort when they are sincere to Allah and His Messenger. There is not upon the doers of good any cause [for blame]. And Allah is Forgiving and Merciful.",
    "translation_id": "Tidak ada dosa (karena tidak pergi berperang) bagi orang-orang yang lemah, sakit, dan yang tidak mendapatkan apa yang akan mereka infakkan, jika mereka ikhlas kepada Allah dan Rasul-Nya. Tidak ada jalan apa pun untuk (menyalahkan) orang-orang yang berbuat baik. Allah Maha Pengampun lagi Maha Penyayang."
  },
  {
    "ayat": 92,
    "arabic": "وَّلَا عَلَى الَّذِيْنَ اِذَا مَآ اَتَوْكَ لِتَحْمِلَهُمْ قُلْتَ لَآ اَجِدُ مَآ اَحْمِلُكُمْ عَلَيْهِ ۖتَوَلَّوْا وَّاَعْيُنُهُمْ تَفِيْضُ مِنَ الدَّمْعِ حَزَنًا اَلَّا يَجِدُوْا مَا يُنْفِقُوْنَۗ",
    "transliteration_en": "Wa laa 'alal lazeena izaa maaa atawka litahmilahum qulta laaa ajidu maaa ahmilukum 'alaihi tawallaw wa a'yunuhum tafeedu minaddam'i hazanan allaa yajidoo maa yunfiqoon",
    "transliteration_id": "Wa lā ‘alal-lażīna iżā mā atauka litaḥmilahum qulta lā ajidu mā aḥmilukum ‘alaih(i), tawallau wa a‘yunuhum tafīḍu minad dam‘i ḥazanan allā yajidū mā yunfiqūn(a).",
    "translation_en": "Nor [is there blame] upon those who, when they came to you that you might give them mounts, you said, \"I can find nothing for you to ride upon.\" They turned back while their eyes overflowed with tears out of grief that they could not find something to spend [for the cause of Allah].",
    "translation_id": "Tidak (ada dosa) pula bagi orang-orang yang ketika datang kepadamu (Nabi Muhammad) agar engkau menyediakan kendaraan kepada mereka, lalu engkau berkata, “Aku tidak mendapatkan kendaraan untuk membawamu.” Mereka pergi dengan bercucuran air mata karena sedih sebab tidak mendapatkan apa yang akan mereka infakkan (untuk ikut berperang)."
  },
  {
    "ayat": 93,
    "arabic": "۞ اِنَّمَا السَّبِيْلُ عَلَى الَّذِيْنَ يَسْتَأْذِنُوْنَكَ وَهُمْ اَغْنِيَاۤءُۚ رَضُوْا بِاَنْ يَّكُوْنُوْا مَعَ الْخَوَالِفِۙ وَطَبَعَ اللّٰهُ عَلٰى قُلُوْبِهِمْ فَهُمْ لَا يَعْلَمُوْنَ  ۔",
    "transliteration_en": "Innamas sabeelu 'alal lazeena yastaazinoonaka wa hum aghniyaaa'; radoo biany-yakoonoo ma'al khawaalifi wa taba'al laahu 'alaa quloobihim fahum laa ya'lamoon",
    "transliteration_id": "Innamas-sabīlu ‘alal-lażīna yasta'żinūnaka wa hum agniyā'(u), raḍū bi'ay yakūnū ma‘al-khawālif(i), wa ṭaba‘allāhu ‘alā qulūbihim fahum lā ya‘lamūn(a).",
    "translation_en": "The cause [for blame] is only upon those who ask permission of you while they are rich. They are satisfied to be with those who stay behind, and Allah has sealed over their hearts, so they do not know.",
    "translation_id": "Sesungguhnya satu-satunya celah (untuk menyalahkan) adalah kepada orang-orang yang meminta izin kepadamu (untuk tidak ikut berperang), padahal mereka orang mampu. Mereka rida berada bersama orang-orang yang tidak ikut berperang. Allah telah mengunci hati mereka sehingga mereka tidak mengetahui."
  },
  {
    "ayat": 94,
    "arabic": "يَعْتَذِرُوْنَ اِلَيْكُمْ اِذَا رَجَعْتُمْ اِلَيْهِمْ ۗ قُلْ لَّا تَعْتَذِرُوْا لَنْ نُّؤْمِنَ لَكُمْ قَدْ نَبَّاَنَا اللّٰهُ مِنْ اَخْبَارِكُمْ وَسَيَرَى اللّٰهُ عَمَلَكُمْ وَرَسُوْلُهٗ ثُمَّ تُرَدُّوْنَ اِلٰى عٰلِمِ الْغَيْبِ وَالشَّهَادَةِ فَيُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُوْنَ",
    "transliteration_en": "ya'taziroona ilaikum izaa raja'tum ilaihim; qul laa ta'taziroo lan nu'mina lakum qad nabba annal laahu min akhbaarikum; wa sa yaral laahu 'amalakum wa Rasooluhoo suma turaddoona ilaa 'Aalimil Ghaibi washshahaadati fa yunabbi'ukum bimaa kuntum ta'maloon",
    "transliteration_id": "Ya‘tażirūna ilaikum iżā raja‘tum ilaihim, qul lā ta‘tażirū lan nu'mina lakum qad nabba'anallāhu min akhbārikum wa sayarallāhu ‘amalakum wa rasūluhū ṡumma turaddūna ilā ‘ālimil-gaibi wasy-syahādati fa yunabbi'ukum bimā kuntum ta‘malūn(a).",
    "translation_en": "They will make excuses to you when you have returned to them. Say, \"Make no excuse - never will we believe you. Allah has already informed us of your news. And Allah will observe your deeds, and [so will] His Messenger; then you will be taken back to the Knower of the unseen and the witnessed, and He will inform you of what you used to do.\"",
    "translation_id": "Mereka (orang-orang munafik yang tidak ikut berperang) akan membuat-buat alasan kepadamu ketika kamu telah pulang kepada mereka. Katakanlah (Nabi Muhammad), “Janganlah kamu membuat-buat alasan. Kami tidak percaya lagi kepadamu. Sungguh, Allah telah memberitahukan kepada kami sebagian berita (tentang) kamu. Allah akan melihat pekerjaanmu, (demikian pula) Rasul-Nya. Kemudian, kamu dikembalikan kepada (Allah) Yang Maha Mengetahui segala yang gaib dan yang nyata, lalu Dia memberitakan kepadamu apa yang selama ini kamu kerjakan.”"
  },
  {
    "ayat": 95,
    "arabic": "سَيَحْلِفُوْنَ بِاللّٰهِ لَكُمْ اِذَا انْقَلَبْتُمْ اِلَيْهِمْ لِتُعْرِضُوْا عَنْهُمْ ۗ فَاَعْرِضُوْا عَنْهُمْ ۗ اِنَّهُمْ رِجْسٌۙ وَّمَأْوٰىهُمْ جَهَنَّمُ جَزَاۤءً ۢبِمَا كَانُوْا يَكْسِبُوْنَ",
    "transliteration_en": "Sa yahlifoona billaahi lakum izanqalabtum ilaihim litu'ridoo 'anhum fa a'ridoo 'anhum innahum rijsunw wa maawaahum jahannamu jazaaa 'ambimaa kaanoo yaksiboon",
    "transliteration_id": "Sayaḥlifūna billāhi lakum iżanqalabtum ilaihim litu‘riḍū ‘anhum, fa a‘riḍū ‘anhum, innahum rijs(un), wa ma'wāhum jahannamu jazā'am bimā kānū yaksibūn(a).",
    "translation_en": "They will swear by Allah to you when you return to them that you would leave them alone. So leave them alone; indeed they are evil; and their refuge is Hell as recompense for what they had been earning.",
    "translation_id": "Mereka akan bersumpah kepadamu dengan (nama) Allah ketika kamu kembali kepada mereka agar kamu berpaling dari mereka. Maka, berpalinglah dari mereka. Sesungguhnya mereka (berjiwa) kotor dan tempat mereka (neraka) Jahanam sebagai balasan atas apa yang selama ini mereka kerjakan."
  },
  {
    "ayat": 96,
    "arabic": "يَحْلِفُوْنَ لَكُمْ لِتَرْضَوْا عَنْهُمْ ۚفَاِنْ تَرْضَوْا عَنْهُمْ فَاِنَّ اللّٰهَ لَا يَرْضٰى عَنِ الْقَوْمِ الْفٰسِقِيْنَ",
    "transliteration_en": "Yahlifoona lakum litardaw 'anhum fa in tardaw 'anhum fa innal laaha laa yardaa 'anil qawmil faasiqeen",
    "transliteration_id": "Yaḥlifūna lakum litarḍau ‘anhum, fa in tarḍau ‘anhum fa innallāha lā yarḍā ‘anil-qaumil-fāsiqīn(a).",
    "translation_en": "They swear to you so that you might be satisfied with them. But if you should be satisfied with them - indeed, Allah is not satisfied with a defiantly disobedient people.",
    "translation_id": "Mereka akan bersumpah kepadamu agar kamu rida kepada mereka. Namun, sekalipun kamu rida kepada mereka, sesungguhnya Allah tidak akan rida kepada kaum yang fasik."
  },
  {
    "ayat": 97,
    "arabic": "اَلْاَعْرَابُ اَشَدُّ كُفْرًا وَّنِفَاقًا وَّاَجْدَرُ اَلَّا يَعْلَمُوْا حُدُوْدَ مَآ اَنْزَلَ اللّٰهُ عَلٰى رَسُوْلِهٖ ۗوَاللّٰهُ عَلِيْمٌ حَكِيْمٌ",
    "transliteration_en": "Al A'raabu ashaddu kufranw wa nifaaqanw wa ajdaru allaa ya'lamoo hudooda maaa anzalal laahu 'alaa Rasoolih; wallaahu 'Aleemun Hakeem",
    "transliteration_id": "Al-a‘rābu asyaddu kufraw wa nifāqaw wa ajdaru allā ya‘lamū ḥudūda mā anzalallāhu ‘alā rasūlih(ī), wallāhu ‘alīmun ḥakīm(un).",
    "translation_en": "The bedouins are stronger in disbelief and hypocrisy and more likely not to know the limits of what [laws] Allah has revealed to His Messenger. And Allah is Knowing and Wise.",
    "translation_id": "Orang-orang Arab Badui lebih kuat kekufuran dan kemunafikannya, serta sangat wajar tidak mengetahui batas-batas (ketentuan) yang diturunkan Allah kepada Rasul-Nya. Allah Maha Mengetahui lagi Maha Bijaksana."
  },
  {
    "ayat": 98,
    "arabic": "وَمِنَ الْاَعْرَابِ مَنْ يَّتَّخِذُ مَا يُنْفِقُ مَغْرَمًا وَّيَتَرَبَّصُ بِكُمُ الدَّوَاۤىِٕرَ ۗعَلَيْهِمْ دَاۤىِٕرَةُ السَّوْءِ ۗوَاللّٰهُ سَمِيْعٌ عَلِيْمٌ",
    "transliteration_en": "Wa minal A'raabi mai yattakhizu maa yunfiqu maghramanw wa yatarabbasu bikumud dawaaa'ir; alaihim daaa'iratus saw'; wallaahu Samee'un 'Aleem",
    "transliteration_id": "Wa minal-a‘rābi may yattakhiżu mā yunfiqu magramaw wa yatarabbaṣu bikumud-dawā'ir(a), ‘alaihim dā'iratus-sau'(i), wallāhu samī‘un ‘alīm(un).",
    "translation_en": "And among the bedouins are some who consider what they spend as a loss and await for you turns of misfortune. Upon them will be a misfortune of evil. And Allah is Hearing and Knowing.",
    "translation_id": "Di antara orang-orang Arab Badui ada yang memandang apa yang diinfakkannya (di jalan Allah) sebagai suatu kerugian dan menunggu mara bahaya menimpamu. Merekalah yang pasti akan ditimpa giliran (azab) yang buruk. Allah Maha Mendengar lagi Maha Mengetahui."
  },
  {
    "ayat": 99,
    "arabic": "وَمِنَ الْاَعْرَابِ مَنْ يُّؤْمِنُ بِاللّٰهِ وَالْيَوْمِ الْاٰخِرِ وَيَتَّخِذُ مَا يُنْفِقُ قُرُبٰتٍ عِنْدَ اللّٰهِ وَصَلَوٰتِ الرَّسُوْلِ ۗ اَلَآ اِنَّهَا قُرْبَةٌ لَّهُمْ ۗ سَيُدْخِلُهُمُ اللّٰهُ فِيْ رَحْمَتِهٖ ۗاِنَّ اللّٰهَ غَفُوْرٌ رَّحِيْمٌ ࣖ",
    "transliteration_en": "Wa minal A'raabi mai yu'minu billaahi wal yawmil AAkhiri wa yattakhizu maa yunfiqu qurubaatin 'indal laahi wa salawaatir Rasool; alaaa innahaa qurbatul lahum; sayudkhiluhumul laahu fee rahmatih; innal laaha Ghafoorur Raheem",
    "transliteration_id": "Wa minal-a‘rābi may yu'minu billāhi wal-yaumil-ākhiri wa yattakhiżu mā yunfiqu qurubātin ‘indallāhi wa ṣalawātir-rasūl(i), alā innahā qurbatul lahum, sayudkhiluhumullāhu fī raḥmatih(ī), innallāha gafūrur raḥīm(un).",
    "translation_en": "But among the bedouins are some who believe in Allah and the Last Day and consider what they spend as means of nearness to Allah and of [obtaining] invocations of the Messenger. Unquestionably, it is a means of nearness for them. Allah will admit them to His mercy. Indeed, Allah is Forgiving and Merciful.",
    "translation_id": "Di antara orang-orang Arab Badui ada yang beriman kepada Allah dan hari kemudian. Dia memandang apa yang diinfakkannya (di jalan Allah) sebagai (sarana) mendekatkan diri kepada Allah dan (sarana untuk memperoleh) doa-doa Rasul. Ketahuilah, sesungguhnya (infak) itu (suatu sarana) bagi mereka untuk mendekatkan diri (kepada Allah). Kelak Allah akan memasukkan mereka ke dalam rahmat (surga)-Nya. Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang."
  },
  {
    "ayat": 100,
    "arabic": "وَالسّٰبِقُوْنَ الْاَوَّلُوْنَ مِنَ الْمُهٰجِرِيْنَ وَالْاَنْصَارِ وَالَّذِيْنَ اتَّبَعُوْهُمْ بِاِحْسَانٍۙ رَّضِيَ اللّٰهُ عَنْهُمْ وَرَضُوْا عَنْهُ وَاَعَدَّ لَهُمْ جَنّٰتٍ تَجْرِيْ تَحْتَهَا الْاَنْهٰرُ خٰلِدِيْنَ فِيْهَآ اَبَدًا ۗذٰلِكَ الْفَوْزُ الْعَظِيْمُ",
    "transliteration_en": "Was saabiqoonal awwa loona minal Muhaajireena wal Ansaari wallazeenat taba'oo hum bi ihsaanir radiyal laahu 'anhum wa radoo 'anhu wa a'adda lahum jannnaatin tajree tahtahal anhaaru khaalideena feehaaa abadaa; zaalikal fawzul 'azeem",
    "transliteration_id": "Was-sābiqūnal-awwalūna minal-muhājirīna wal-anṣāri wal-lażīnattaba‘ūhum bi'iḥsān(in), raḍiyallāhu ‘anhum wa raḍū ‘anhu wa a‘adda lahum jannātin tajrī  taḥtahal-anhāru khālidīna fīhā abadā(n), żālikal-fauzul-‘aẓīm(u).",
    "translation_en": "And the first forerunners [in the faith] among the Muhajireen and the Ansar and those who followed them with good conduct - Allah is pleased with them and they are pleased with Him, and He has prepared for them gardens beneath which rivers flow, wherein they will abide forever. That is the great attainment.",
    "translation_id": "Orang-orang yang terdahulu lagi yang pertama-tama (masuk Islam) di antara orang-orang Muhajirin dan Ansar dan orang-orang yang mengikuti mereka dengan baik, Allah rida kepada mereka dan mereka pun rida kepada-Nya. Allah menyediakan bagi mereka surga-surga yang mengalir sungai-sungai di bawahnya. Mereka kekal di dalamnya selama-lamanya. Itulah kemenangan yang agung."
  }
]