[
  {
    "ayat": 1,
    "arabic": "طٰسۤمّۤ",
    "transliteration_en": "Taa-Seeen-Meeem",
    "transliteration_id": "Ṭā Sīm Mīm.",
    "translation_en": "Ta, Seen, Meem.",
    "translation_id": "Ṭā Sīn Mīm."
  },
  {
    "ayat": 2,
    "arabic": "تِلْكَ اٰيٰتُ الْكِتٰبِ الْمُبِيْنِ",
    "transliteration_en": "Tilka Aayaatul Kitaabil mubeen",
    "transliteration_id": "Tilka āyātul-kitābil-mubīn(i).",
    "translation_en": "These are the verses of the clear Book.",
    "translation_id": "Itulah ayat-ayat Kitab (Al-Qur’an) yang jelas."
  },
  {
    "ayat": 3,
    "arabic": "نَتْلُوْا عَلَيْكَ مِنْ نَّبَاِ مُوْسٰى وَفِرْعَوْنَ بِالْحَقِّ لِقَوْمٍ يُّؤْمِنُوْنَ",
    "transliteration_en": "Natloo 'alaika min naba-i Moosaa wa Fi'awna bilhaqqi liqawminy yu'miinoon",
    "transliteration_id": "Natlū ‘alaika min naba'i mūsā wa fir‘auna bil-ḥaqqi liqaumiy yu'minūn(a).",
    "translation_en": "We recite to you from the news of Moses and Pharaoh in truth for a people who believe.",
    "translation_id": "Kami membacakan kepadamu sebagian dari kisah Musa dan Firʻaun dengan sebenarnya untuk kaum beriman."
  },
  {
    "ayat": 4,
    "arabic": "اِنَّ فِرْعَوْنَ عَلَا فِى الْاَرْضِ وَجَعَلَ اَهْلَهَا شِيَعًا يَّسْتَضْعِفُ طَاۤىِٕفَةً مِّنْهُمْ يُذَبِّحُ اَبْنَاۤءَهُمْ وَيَسْتَحْيٖ نِسَاۤءَهُمْ ۗاِنَّهٗ كَانَ مِنَ الْمُفْسِدِيْنَ",
    "transliteration_en": "Inna Fir'awna 'alaa fil ardi wa ja'ala ahlahaa shiya'ai yastad'ifu taaa'ifatam minhum yuzabbihu abnaaa'ahum wa yastahyee nisaaa'ahum; innahoo kaana minal mufsideen",
    "transliteration_id": "Inna fir‘auna ‘alā fil-arḍi wa ja‘ala ahlahā syiya‘ay yastaḍ‘ifu ṭā'ifatam minhum yużabbiḥu abnā'ahum wa yastaḥyī nisā'ahum, innahū kāna minal-mufsidīn(a).",
    "translation_en": "Indeed, Pharaoh exalted himself in the land and made its people into factions, oppressing a sector among them, slaughtering their [newborn] sons and keeping their females alive. Indeed, he was of the corrupters.",
    "translation_id": "Sesungguhnya Firʻaun telah berbuat sewenang-wenang di bumi dan menjadikan penduduknya berpecah-belah. Dia menindas segolongan dari mereka (Bani Israil). Dia menyembelih anak laki-laki mereka dan membiarkan hidup anak perempuannya. Sesungguhnya dia (Firʻaun) termasuk orang-orang yang berbuat kerusakan."
  },
  {
    "ayat": 5,
    "arabic": "وَنُرِيْدُ اَنْ نَّمُنَّ عَلَى الَّذِيْنَ اسْتُضْعِفُوْا فِى الْاَرْضِ وَنَجْعَلَهُمْ اَىِٕمَّةً وَّنَجْعَلَهُمُ الْوٰرِثِيْنَ ۙ",
    "transliteration_en": "Wa nureedu an namunna 'alal lazeenas tud'ifoo fil ardi wa naj'alahum a'immatanw wa naj'alahumul waariseen",
    "transliteration_id": "Wa nurīdu an namunna ‘alal-lażīnastuḍ‘ifū fil-arḍi wa naj‘alahum a'immataw wa naj‘alahumul-wāriṡīn(a).",
    "translation_en": "And We wanted to confer favor upon those who were oppressed in the land and make them leaders and make them inheritors",
    "translation_id": "Kami berkehendak untuk memberi karunia kepada orang-orang yang tertindas di bumi (Mesir) itu, menjadikan mereka para pemimpin, dan menjadikan mereka orang-orang yang mewarisi (bumi)."
  },
  {
    "ayat": 6,
    "arabic": "وَنُمَكِّنَ لَهُمْ فِى الْاَرْضِ وَنُرِيَ فِرْعَوْنَ وَهَامٰنَ وَجُنُوْدَهُمَا مِنْهُمْ مَّا كَانُوْا يَحْذَرُوْنَ",
    "transliteration_en": "Wa numakkina lahum fil ardi wa nuriya Fir'awna wa Haamaana wa junoodahumaa minhum maa kaanoo yahzaroon",
    "transliteration_id": "Wa numakkina lahum fil-arḍi wa nuriya fir‘auna wa hāmāna wa junūdahumā minhum mā kānū yaḥżarūn(a).",
    "translation_en": "And establish them in the land and show Pharaoh and [his minister] Haman and their soldiers through them that which they had feared.",
    "translation_id": "Kami pun (berkehendak untuk) meneguhkan kedudukan mereka (Bani Israil) di bumi dan memperlihatkan kepada Firʻaun, Haman, dan bala tentaranya apa yang selalu mereka takutkan dari mereka (Bani Israil)."
  },
  {
    "ayat": 7,
    "arabic": "وَاَوْحَيْنَآ اِلٰٓى اُمِّ مُوْسٰٓى اَنْ اَرْضِعِيْهِۚ فَاِذَا خِفْتِ عَلَيْهِ فَاَلْقِيْهِ فِى الْيَمِّ وَلَا تَخَافِيْ وَلَا تَحْزَنِيْ ۚاِنَّا رَاۤدُّوْهُ اِلَيْكِ وَجَاعِلُوْهُ مِنَ الْمُرْسَلِيْنَ",
    "transliteration_en": "Wa awhainaaa ilaaa ummi Moosaaa an ardi'eehi faizaa khifti 'alaihi fa alqeehi filyammi wa laa takhaafee wa laa tahzaneee innaa raaaddoohu ilaiki wa jaa'iloohu minal mursaleen",
    "transliteration_id": "Wa auḥainā ilā mūsā an arḍi‘īh(i), fa'iżā khifti ‘alaihi fa'alqīhi fil yammi wa lā takhāfī wa lā taḥzanī, innā rāddūhu ilaiki wa jā‘ilūhu minal-mursalīn(a).",
    "translation_en": "And We inspired to the mother of Moses, \"Suckle him; but when you fear for him, cast him into the river and do not fear and do not grieve. Indeed, We will return him to you and will make him [one] of the messengers.\"",
    "translation_id": "Kami mengilhamkan kepada ibu Musa, “Susuilah dia (Musa). Jika engkau khawatir atas (keselamatan)-nya, hanyutkanlah dia ke sungai (Nil dalam sebuah peti yang mengapung). Janganlah engkau takut dan janganlah (pula) bersedih. Sesungguhnya Kami pasti mengembalikannya kepadamu dan menjadikannya sebagai salah seorang rasul.”"
  },
  {
    "ayat": 8,
    "arabic": "فَالْتَقَطَهٗٓ اٰلُ فِرْعَوْنَ لِيَكُوْنَ لَهُمْ عَدُوًّا وَّحَزَنًاۗ اِنَّ فِرْعَوْنَ وَهَامٰنَ وَجُنُوْدَهُمَا كَانُوْا خٰطِـِٕيْنَ",
    "transliteration_en": "Faltaqatahooo Aalu Fir'awna li yakoona lahum 'aduwwanw wa hazanaa; inna Fir'awna wa Haamaana wa junooda humaa kaanoo khaati'een",
    "transliteration_id": "Faltaqaṭahū ālu fir‘auna liyakūna lahum ‘aduwwaw wa ḥazanā(n), inna fir‘auna wa hāmāna wa junūdahumā kānū khāṭi'īn(a).",
    "translation_en": "And the family of Pharaoh picked him up [out of the river] so that he would become to them an enemy and a [cause of] grief. Indeed, Pharaoh and Haman and their soldiers were deliberate sinners.",
    "translation_id": "Kemudian, keluarga Firʻaun memungutnya agar (kelak) dia menjadi musuh dan (penyebab) kesedihan bagi mereka. Sesungguhnya Firʻaun, Haman, dan bala tentaranya adalah orang-orang salah."
  },
  {
    "ayat": 9,
    "arabic": "وَقَالَتِ امْرَاَتُ فِرْعَوْنَ قُرَّتُ عَيْنٍ لِّيْ وَلَكَۗ  لَا تَقْتُلُوْهُ ۖعَسٰٓى اَنْ يَّنْفَعَنَآ اَوْ نَتَّخِذَهٗ وَلَدًا وَّهُمْ لَا يَشْعُرُوْنَ",
    "transliteration_en": "Wa qaalatim ra atu Fir'awna qurratu 'aynil lee wa lak; laa taqtuloohu 'asaaa aiyanfa'anaa aw nattakhizahoo waladanw wa hum laa yash'uroon",
    "transliteration_id": "Wa qālatimra'atu fir‘auna qurratu ‘ainil lī wa lak(a), lā taqtulūh(u), ‘asā ay yanfa‘anā au nattakhiżahū waladaw wa hum lā yasy‘urūn(a).",
    "translation_en": "And the wife of Pharaoh said, \"[He will be] a comfort of the eye for me and for you. Do not kill him; perhaps he may benefit us, or we may adopt him as a son.\" And they perceived not.",
    "translation_id": "Istri Firʻaun berkata (kepadanya), “(Anak ini) adalah penyejuk hati bagiku dan bagimu. Janganlah kamu membunuhnya. Mudah-mudahan dia memberi manfaat bagi kita atau kita mengambilnya sebagai anak.” Mereka tidak menyadari (bahwa anak itulah, Musa, yang kelak menjadi sebab kebinasaan mereka)."
  },
  {
    "ayat": 10,
    "arabic": "وَاَصْبَحَ فُؤَادُ اُمِّ مُوْسٰى فٰرِغًاۗ اِنْ كَادَتْ لَتُبْدِيْ بِهٖ لَوْلَآ اَنْ رَّبَطْنَا عَلٰى قَلْبِهَا لِتَكُوْنَ مِنَ الْمُؤْمِنِيْنَ",
    "transliteration_en": "Wa asbaha fu'aadu ummi Moosaa faarighan in kaadat latubdee bihee law laaa arrabatnaa 'alaa qalbihaa litakoona minal mu'mineen",
    "transliteration_id": "Wa aṣbaḥa fu'ādu ummi mūsā fārigā(n), in kādat latubdī bihī lau lā ar rabaṭnā ‘alā qalbihā litakūna minal-mu'minīn(a).",
    "translation_en": "And the heart of Moses' mother became empty [of all else]. She was about to disclose [the matter concerning] him had We not bound fast her heart that she would be of the believers.",
    "translation_id": "Hati ibu Musa menjadi hampa. Sungguh, hampir saja dia mengungkapkan (bahwa bayi itu adalah anaknya), seandainya Kami tidak meneguhkan hatinya agar dia termasuk orang-orang yang beriman (kepada janji Allah)."
  },
  {
    "ayat": 11,
    "arabic": "وَقَالَتْ لِاُخْتِهٖ قُصِّيْهِۗ فَبَصُرَتْ بِهٖ عَنْ جُنُبٍ وَّهُمْ لَا يَشْعُرُوْنَ ۙ",
    "transliteration_en": "Wa qaalat li ukhtihee qusseehi fabasurat bihee 'an junubinw wahum laa yash'uroon",
    "transliteration_id": "Wa qālat li'ukhtihī quṣṣīh(i), fabaṣurat bihī ‘an junubiw wa hum lā yasy‘urūn(a).",
    "translation_en": "And she said to his sister, \"Follow him\"; so she watched him from a distance while they perceived not.",
    "translation_id": "Dia (ibu Musa) berkata kepada saudara perempuan Musa, “Ikutilah jejaknya.” Kemudian, dia melihatnya dari kejauhan, sedangkan mereka (pengikut Firʻaun) tidak menyadarinya."
  },
  {
    "ayat": 12,
    "arabic": "۞ وَحَرَّمْنَا عَلَيْهِ الْمَرَاضِعَ مِنْ قَبْلُ فَقَالَتْ هَلْ اَدُلُّكُمْ عَلٰٓى اَهْلِ بَيْتٍ يَّكْفُلُوْنَهٗ لَكُمْ وَهُمْ لَهٗ نٰصِحُوْنَ",
    "transliteration_en": "Wa harramnaa 'alaihil maraadi'a min qablu faqaalat hal adullukum 'alaaa ahli baitiny yakfuloonahoo lakum wa hum lahoo naasihoon",
    "transliteration_id": "Wa ḥarramnā ‘alaihil-marāḍi‘a min qablu faqālat hal adullukum ‘alā ahli baitiy yakfulūnahū lakum wa hum lahū nāṣiḥūn(a).",
    "translation_en": "And We had prevented from him [all] wet nurses before, so she said, \"Shall I direct you to a household that will be responsible for him for you while they are to him [for his upbringing] sincere?\"",
    "translation_id": "Kami mencegahnya (Musa) menyusu kepada perempuan-perempuan yang mau menyusui(-nya) sebelum (kembali ke pangkuan ibunya). Berkatalah dia (saudara perempuan Musa), “Maukah aku tunjukkan kepadamu keluarga yang akan memeliharanya untukmu dan mereka dapat berlaku baik kepadanya?”"
  },
  {
    "ayat": 13,
    "arabic": "فَرَدَدْنٰهُ اِلٰٓى اُمِّهٖ كَيْ تَقَرَّ عَيْنُهَا وَلَا تَحْزَنَ وَلِتَعْلَمَ اَنَّ وَعْدَ اللّٰهِ حَقٌّ وَّلٰكِنَّ اَكْثَرَهُمْ لَا يَعْلَمُوْنَ ࣖ",
    "transliteration_en": "Faradadnaahu ilaa ummihee kai taqarra 'ainuhaa wa laa tahzana wa lita'lama anna wa'dal laahi haqqunw wa laakinna aksarahum laa ya'lamoon",
    "transliteration_id": "Faradadnāhu ilā ummihī kai taqarra ‘ainuhā wa lā taḥzana wa lita‘lama anna wa‘dallāhi ḥaqquw wa lākinna akṡarahum lā ya‘lamūn(a).",
    "translation_en": "So We restored him to his mother that she might be content and not grieve and that she would know that the promise of Allah is true. But most of the people do not know.",
    "translation_id": "Lalu, Kami mengembalikan dia (Musa) kepada ibunya agar senang hatinya serta tidak bersedih, dan agar dia mengetahui bahwa janji Allah adalah benar, tetapi kebanyakan mereka tidak mengetahuinya."
  },
  {
    "ayat": 14,
    "arabic": "وَلَمَّا بَلَغَ اَشُدَّهٗ وَاسْتَوٰىٓ اٰتَيْنٰهُ حُكْمًا وَّعِلْمًاۗ وَكَذٰلِكَ نَجْزِى الْمُحْسِنِيْنَ",
    "transliteration_en": "Wa lammaa balagha ashuddahoo wastawaaa aatai naahu hukmanw wa 'ilmaa; wa kazaalika najzil muhsineen",
    "transliteration_id": "Wa lammā balaga asyuddahū wastawā ātaināhu ḥukmaw wa ‘ilmā(n), wa każālika najzil-muḥsinīn(a).",
    "translation_en": "And when he attained his full strength and was [mentally] mature, We bestowed upon him judgement and knowledge. And thus do We reward the doers of good.",
    "translation_id": "Setelah dia (Musa) dewasa dan sempurna akalnya, Kami menganugerahkan kepadanya hikmah dan pengetahuan. Demikianlah Kami memberi balasan kepada orang-orang yang berbuat kebajikan."
  },
  {
    "ayat": 15,
    "arabic": "وَدَخَلَ الْمَدِيْنَةَ عَلٰى حِيْنِ غَفْلَةٍ مِّنْ اَهْلِهَا فَوَجَدَ فِيْهَا رَجُلَيْنِ يَقْتَتِلٰنِۖ هٰذَا مِنْ شِيْعَتِهٖ وَهٰذَا مِنْ عَدُوِّهٖۚ فَاسْتَغَاثَهُ الَّذِيْ مِنْ شِيْعَتِهٖ عَلَى الَّذِيْ مِنْ عَدُوِّهٖ ۙفَوَكَزَهٗ مُوْسٰى فَقَضٰى عَلَيْهِۖ قَالَ هٰذَا مِنْ عَمَلِ الشَّيْطٰنِۗ اِنَّهٗ عَدُوٌّ مُّضِلٌّ مُّبِيْنٌ",
    "transliteration_en": "Wa dakhalal madeenata 'alaa heene ghaflatim min ahlihaa fawajada feeha raju laini yaqtatilaani haazaa min shee'atihee wa haaza min 'aduwwihee fastaghaasahul lazee min shee'atihee 'alal lazee min 'aduwwihee fawakazahoo Moosaa faqadaa 'alaihi qaala haaza min 'amalish Shaitaani innahoo 'aduwwum mmudillum mubeen",
    "transliteration_id": "Wa dakhalal-madīnata ‘alā ḥīni gaflatim min ahlihā fawajada fīhā rajulaini yaqtatilān(i), hāżā min syī‘atihī wa hāżā min ‘aduwwih(ī), fastagāṡahul-lażī min syī‘atihī ‘alal-lażī min ‘aduwwih(ī), fawakazahū mūsā faqaḍā ‘alaih(i), qāla hāżā min ‘amalisy-syaiṭān(i), innahū ‘aduwwum muḍillum mubīn(un).",
    "translation_en": "And he entered the city at a time of inattention by its people and found therein two men fighting: one from his faction and one from among his enemy. And the one from his faction called for help to him against the one from his enemy, so Moses struck him and [unintentionally] killed him. [Moses] said, \"This is from the work of Satan. Indeed, he is a manifest, misleading enemy.\"",
    "translation_id": "Dia (Musa) masuk ke kota ketika penduduknya sedang lengah. Dia mendapati di dalam kota itu dua orang laki-laki yang sedang berkelahi, seorang dari golongannya (Bani Israil) dan seorang (lagi) dari golongan musuhnya (kaum Firʻaun). Orang yang dari golongannya meminta pertolongan kepadanya untuk (mengalahkan) orang yang dari golongan musuhnya. Musa lalu memukulnya dan (tanpa sengaja) membunuhnya. Dia berkata, “Ini termasuk perbuatan setan. Sesungguhnya dia adalah musuh yang jelas-jelas menyesatkan.”"
  },
  {
    "ayat": 16,
    "arabic": "قَالَ رَبِّ اِنِّيْ ظَلَمْتُ نَفْسِيْ فَاغْفِرْ لِيْ فَغَفَرَ لَهٗ ۗاِنَّهٗ هُوَ الْغَفُوْرُ الرَّحِيْمُ",
    "transliteration_en": "Qaala Rabbi innee zalamtu nafsee faghfir lee faghafaralah; innahoo Huwal Ghafoorur Raheem",
    "transliteration_id": "Qāla rabbi innī ẓalamtu nafsī fagfir lī fagafara lah(ū), innahū huwal-gafūrur-raḥīm(u).",
    "translation_en": "He said, \"My Lord, indeed I have wronged myself, so forgive me,\" and He forgave him. Indeed, He is the Forgiving, the Merciful.",
    "translation_id": "Dia (Musa) berdoa, “Ya Tuhanku, sesungguhnya aku telah menzalimi diriku sendiri, maka ampunilah aku.” Dia (Allah) lalu mengampuninya. Sesungguhnya Dialah Yang Maha Pengampun lagi Maha Penyayang."
  },
  {
    "ayat": 17,
    "arabic": "قَالَ رَبِّ بِمَآ اَنْعَمْتَ عَلَيَّ فَلَنْ اَكُوْنَ ظَهِيْرًا لِّلْمُجْرِمِيْنَ",
    "transliteration_en": "Qaala Rabbi bimaaa an'amta 'alaiya falan akoona zaheeral lilmujrimeen",
    "transliteration_id": "Qāla rabbi bimā an‘amta ‘alayya falan akūna ẓahīral lil-mujrimīn(a).",
    "translation_en": "He said, \"My Lord, for the favor You bestowed upon me, I will never be an assistant to the criminals.\"",
    "translation_id": "Dia (Musa) berkata, “Ya Tuhanku, karena nikmat yang telah Engkau anugerahkan kepadaku, (tuntunlah aku) sehingga aku tidak akan menjadi penolong bagi orang-orang yang berbuat durhaka.”"
  },
  {
    "ayat": 18,
    "arabic": "فَاَصْبَحَ فِى الْمَدِيْنَةِ خَاۤىِٕفًا يَّتَرَقَّبُ فَاِذَا الَّذِى اسْتَنْصَرَهٗ بِالْاَمْسِ يَسْتَصْرِخُهٗ ۗقَالَ لَهٗ مُوْسٰٓى اِنَّكَ لَغَوِيٌّ مُّبِيْنٌ",
    "transliteration_en": "Fa asbaha fil madeenati khaaa'ifany yataraqqabu fa izal lazis tansarahoo bil amsi yastasrikhuh; qaala lahoo moosaaa innaka laghawiyyum mubeen",
    "transliteration_id": "Fa'aṣbaḥa fil-madīnati khā'ifay yataraqqabu fa'iżal-lażistanṣarahū bil-amsi yastaṣrikhuh(ū), qāla lahū mūsā innaka lagawiyyum mubīn(un).",
    "translation_en": "And he became inside the city fearful and anticipating [exposure], when suddenly the one who sought his help the previous day cried out to him [once again]. Moses said to him, \"Indeed, you are an evident, [persistent] deviator.\"",
    "translation_id": "Karena (peristiwa) itu, dia (Musa) menjadi ketakutan berada di kota sambil menunggu (akibat dari apa yang dilakukannya). Tiba-tiba orang yang kemarin meminta pertolongan berteriak-teriak meminta pertolongan lagi kepadanya. Musa berkata kepadanya, “Sesungguhnya engkau adalah orang yang jelas-jelas sesat.”"
  },
  {
    "ayat": 19,
    "arabic": "فَلَمَّآ اَنْ اَرَادَ اَنْ يَّبْطِشَ بِالَّذِيْ هُوَ عَدُوٌّ لَّهُمَاۙ قَالَ يٰمُوْسٰٓى اَتُرِيْدُ اَنْ تَقْتُلَنِيْ كَمَا قَتَلْتَ نَفْسًاۢ بِالْاَمْسِۖ اِنْ تُرِيْدُ اِلَّآ اَنْ تَكُوْنَ جَبَّارًا فِى الْاَرْضِ وَمَا تُرِيْدُ اَنْ تَكُوْنَ مِنَ الْمُصْلِحِيْنَ",
    "transliteration_en": "Falammaaa an araada ai yabtisha billazee huwa 'aduwwul lahumaa qaala yaa Moosaaa atureedu an taqtulanee kamaa qatalta nafsam bil amsi in tureedu illaaa an takoona jabbaaram fil ardi wa maa tureedu an takoona minal musliheen",
    "transliteration_id": "Falammā an arāda ay yabṭisya bil-lażī huwa ‘aduwwul lahumā, qāla yā mūsā aturīdu an taqtulanī kamā qatalta nafsam bil-ams(i), in turīdu illā an takūna jabbāran fil-arḍi wa mā turīdu an takūna minal-muṣliḥīn(a).",
    "translation_en": "And when he wanted to strike the one who was an enemy to both of them, he said, \"O Moses, do you intend to kill me as you killed someone yesterday? You only want to be a tyrant in the land and do not want to be of the amenders.\"",
    "translation_id": "Ketika dia (Musa) hendak memukul orang yang merupakan musuh mereka berdua, dia (musuhnya) berkata, “Wahai Musa, apakah engkau bermaksud membunuhku sebagaimana kemarin engkau membunuh seseorang? Engkau hanya bermaksud menjadi orang yang berbuat sewenang-wenang di negeri (ini) dan tidak bermaksud menjadi salah satu dari orang-orang yang mengadakan perdamaian.”"
  },
  {
    "ayat": 20,
    "arabic": "وَجَاۤءَ رَجُلٌ مِّنْ اَقْصَى الْمَدِيْنَةِ يَسْعٰىۖ قَالَ يٰمُوْسٰٓى اِنَّ الْمَلَاَ يَأْتَمِرُوْنَ بِكَ لِيَقْتُلُوْكَ فَاخْرُجْ اِنِّيْ لَكَ مِنَ النّٰصِحِيْنَ",
    "transliteration_en": "Wa jaaa'a rajulum min aqsal madeenati yas'aa qaala yaa Moosaaa innal mala a yaa tamiroona bika liyaqtulooka fakhruj innee laka minan naasiheen",
    "transliteration_id": "Wa jā'a rajulum min aqṣal-madīnati yas‘ā, qāla yā mūsā innal-mala'a ya'tamirūna bika liyaqtulūka fakhruj innī laka minan-nāṣiḥīn(a).",
    "translation_en": "And a man came from the farthest end of the city, running. He said, \"O Moses, indeed the eminent ones are conferring over you [intending] to kill you, so leave [the city]; indeed, I am to you of the sincere advisors.\"",
    "translation_id": "Seorang laki-laki datang bergegas dari ujung kota seraya berkata, “Wahai Musa, sesungguhnya para pembesar negeri sedang berunding tentang engkau untuk membunuhmu. Maka, (lekaslah engkau) keluar (dari kota ini). Sesungguhnya aku termasuk orang-orang yang memberi nasihat kepadamu.”"
  },
  {
    "ayat": 21,
    "arabic": "فَخَرَجَ مِنْهَا خَاۤىِٕفًا يَّتَرَقَّبُ ۖقَالَ رَبِّ نَجِّنِيْ مِنَ الْقَوْمِ الظّٰلِمِيْنَ ࣖ",
    "transliteration_en": "Fakharaja minhaa khaaa 'ifany-yataraqqab; qaala Rabbi najjinee minal qawmiz zaalimeen",
    "transliteration_id": "Fakharaja minhā khā'ifay yataraqqab(u), qāla rabbi najjinī minal-qaumiẓ-ẓālimīn(a).",
    "translation_en": "So he left it, fearful and anticipating [apprehension]. He said, \"My Lord, save me from the wrongdoing people.\"",
    "translation_id": "Maka, keluarlah dia (Musa) dari kota itu dengan rasa takut dan waspada. Dia berdoa, “Ya Tuhanku, selamatkanlah aku dari kaum yang zalim.”"
  },
  {
    "ayat": 22,
    "arabic": "وَلَمَّا تَوَجَّهَ تِلْقَاۤءَ مَدْيَنَ قَالَ عَسٰى رَبِّيْٓ اَنْ يَّهْدِيَنِيْ سَوَاۤءَ السَّبِيْلِ",
    "transliteration_en": "Wa lammaa tawajjaha tilqaaa'a Madyana qaala 'asaa Rabbeee ai yahdiyanee Sawaaa'as Sabeel",
    "transliteration_id": "Wa lammā tawajjaha tilqā'a madyana qāla ‘asā rabbī ay yahdiyanī sawā'as-sabīl(i).",
    "translation_en": "And when he directed himself toward Madyan, he said, \"Perhaps my Lord will guide me to the sound way.\"",
    "translation_id": "Ketika menuju ke arah negeri Madyan, dia (Musa) berdoa, “Semoga Tuhanku membimbingku ke jalan yang benar.”"
  },
  {
    "ayat": 23,
    "arabic": "وَلَمَّا وَرَدَ مَاۤءَ مَدْيَنَ وَجَدَ عَلَيْهِ اُمَّةً مِّنَ النَّاسِ يَسْقُوْنَ ەۖ وَوَجَدَ مِنْ دُوْنِهِمُ امْرَاَتَيْنِ تَذُوْدٰنِۚ قَالَ مَا خَطْبُكُمَا ۗقَالَتَا لَا نَسْقِيْ حَتّٰى يُصْدِرَ الرِّعَاۤءُ وَاَبُوْنَا شَيْخٌ كَبِيْرٌ",
    "transliteration_en": "Wa lammaa warada maaa'a Madyana wajada 'alaihi ummatam minannaasi yasqoona wa wajada min doonihimum ra ataini tazoodaani qaala maa khatubkumaa qaalataa laa nasqee hataa yusdirar ri'aaa'u wa aboonaa shaikhun kabeer",
    "transliteration_id": "Wa lammā warada mā'a madyana wajada ‘alaihi ummatam minan-nāsi yasqūn(a), wa wajada min dūnihimumra'ataini tażūdān(i), qāla mā khaṭbukumā, qālatā lā nasqī ḥattā yuṣdirar-ri‘ā'u wa abūnā syaikhun kabīr(un).",
    "translation_en": "And when he came to the well of Madyan, he found there a crowd of people watering [their flocks], and he found aside from them two women driving back [their flocks]. He said, \"What is your circumstance?\" They said, \"We do not water until the shepherds dispatch [their flocks]; and our father is an old man.\"",
    "translation_id": "Ketika sampai di sumber air negeri Madyan, dia menjumpai di sana sekumpulan orang yang sedang memberi minum (ternaknya) dan dia menjumpai di belakang mereka ada dua orang perempuan sedang menghalau (ternaknya dari sumber air). Dia (Musa) berkata, “Apa maksudmu (berbuat begitu)?” Kedua (perempuan) itu menjawab, “Kami tidak dapat memberi minum (ternak kami) sebelum para penggembala itu memulangkan (ternaknya), sedangkan ayah kami adalah orang tua yang telah lanjut usia.”"
  },
  {
    "ayat": 24,
    "arabic": "فَسَقٰى لَهُمَا ثُمَّ تَوَلّٰىٓ اِلَى الظِّلِّ فَقَالَ رَبِّ اِنِّيْ لِمَآ اَنْزَلْتَ اِلَيَّ مِنْ خَيْرٍ فَقِيْرٌ",
    "transliteration_en": "Fasaqaa lahumaa summa tawallaaa ilaz zilli faqaala Rabbi innee limaaa anzalta ilaiya min khairin faqeer",
    "transliteration_id": "Fasaqā lahumā ṡumma tawallā ilaẓ-ẓilli faqāla rabbi innī limā anzalta ilayya min khairin faqīr(un).",
    "translation_en": "So he watered [their flocks] for them; then he went back to the shade and said, \"My Lord, indeed I am, for whatever good You would send down to me, in need.\"",
    "translation_id": "Maka, dia (Musa) memberi minum (ternak) kedua perempuan itu. Dia kemudian berpindah ke tempat yang teduh, lalu berdoa, “Ya Tuhanku, sesungguhnya aku sangat memerlukan suatu kebaikan (rezeki) yang Engkau turunkan kepadaku.”"
  },
  {
    "ayat": 25,
    "arabic": "فَجَاۤءَتْهُ اِحْدٰىهُمَا تَمْشِيْ عَلَى اسْتِحْيَاۤءٍ  ۖقَالَتْ اِنَّ اَبِيْ يَدْعُوْكَ لِيَجْزِيَكَ اَجْرَ مَا سَقَيْتَ لَنَاۗ فَلَمَّا جَاۤءَهٗ وَقَصَّ عَلَيْهِ الْقَصَصَۙ  قَالَ لَا تَخَفْۗ نَجَوْتَ مِنَ الْقَوْمِ الظّٰلِمِيْنَ",
    "transliteration_en": "Fajaaa'at hu ihdaahumaa tamshee 'alas tihyaaa'in qaalat inna abee yad'ooka li yajziyaka ajra maa saqaita lanaa; falammaa jaaa'ahoo wa qassa 'alaihil qasasa qaala laa takhaf najawta minal qawmiz zaalimeen",
    "transliteration_id": "Fajā'athu iḥdāhumā tamsyī ‘alastiḥyā'(in), qālat inna abī yad‘ūka liyajziyaka ajra mā saqaita lanā, falammā jā'ahū wa qaṣṣa ‘alaihil-qaṣaṣ(a), qāla lā takhaf, najauta minal-qaumiẓ-ẓālimīn(a).",
    "translation_en": "Then one of the two women came to him walking with shyness. She said, \"Indeed, my father invites you that he may reward you for having watered for us.\" So when he came to him and related to him the story, he said, \"Fear not. You have escaped from the wrongdoing people.\"",
    "translation_id": "Lalu, datanglah kepada Musa salah seorang dari keduanya itu sambil berjalan dengan malu-malu. Dia berkata, “Sesungguhnya ayahku mengundangmu untuk memberi balasan sebagai imbalan atas (kebaikan)-mu memberi minum (ternak) kami.” Ketika (Musa) mendatanginya dan menceritakan kepadanya kisah (dirinya), dia berkata, “Janganlah engkau takut! Engkau telah selamat dari orang-orang yang zalim itu.”"
  },
  {
    "ayat": 26,
    "arabic": "قَالَتْ اِحْدٰىهُمَا يٰٓاَبَتِ اسْتَأْجِرْهُ ۖاِنَّ خَيْرَ مَنِ اسْتَأْجَرْتَ الْقَوِيُّ الْاَمِيْنُ",
    "transliteration_en": "Qaalat ihdaahumaa yaaa abatis taajirhu inna khaira manistaajartal qawiyyul ameen",
    "transliteration_id": "Qālat iḥdāhumā yā abatista'jirh(u), inna khaira manista'jartal-qawiyyul-amīn(u).",
    "translation_en": "One of the women said, \"O my father, hire him. Indeed, the best one you can hire is the strong and the trustworthy.\"",
    "translation_id": "Salah seorang dari kedua (perempuan) itu berkata, “Wahai ayahku, pekerjakanlah dia. Sesungguhnya sebaik-baik orang yang engkau pekerjakan adalah orang yang kuat lagi dapat dipercaya.”"
  },
  {
    "ayat": 27,
    "arabic": "قَالَ اِنِّيْٓ اُرِيْدُ اَنْ اُنْكِحَكَ اِحْدَى ابْنَتَيَّ هٰتَيْنِ عَلٰٓى اَنْ تَأْجُرَنِيْ ثَمٰنِيَ حِجَجٍۚ فَاِنْ اَتْمَمْتَ عَشْرًا فَمِنْ عِنْدِكَۚ وَمَآ اُرِيْدُ اَنْ اَشُقَّ عَلَيْكَۗ سَتَجِدُنِيْٓ اِنْ شَاۤءَ اللّٰهُ مِنَ الصّٰلِحِيْنَ",
    "transliteration_en": "Qaala innee ureedu an unkihaka ihdab nataiya haataini 'alaaa an taajuranee samaaniya hijaj; fa in atmamta 'ashran famin 'indika wa maaa ureedu an ashuqqa 'alaik; satajiduneee in shaaa'al laahu minas saaliheen",
    "transliteration_id": "Qāla innī urīdu an unkiḥaka iḥdabnatayya hātaini ‘alā an ta'juranī ṡamāniya ḥijaj(in), fa'in atmamta ‘asyran famin ‘indik(a), wa mā urīdu an asyuqqa ‘alaik(a), satajidunī in syā'allāhu minaṣ-ṣāliḥīn(a).",
    "translation_en": "He said, \"Indeed, I wish to wed you one of these, my two daughters, on [the condition] that you serve me for eight years; but if you complete ten, it will be [as a favor] from you. And I do not wish to put you in difficulty. You will find me, if Allah wills, from among the righteous.\"",
    "translation_id": "Dia (ayah kedua perempuan itu) berkata, “Sesungguhnya aku bermaksud menikahkanmu dengan salah seorang dari kedua anak perempuanku ini dengan ketentuan bahwa engkau bekerja padaku selama delapan tahun. Jika engkau menyempurnakannya sepuluh tahun, itu adalah (suatu kebaikan) darimu. Aku tidak bermaksud memberatkanmu. Insyaallah engkau akan mendapatiku termasuk orang-orang yang baik.”"
  },
  {
    "ayat": 28,
    "arabic": "قَالَ ذٰلِكَ بَيْنِيْ وَبَيْنَكَۗ اَيَّمَا الْاَجَلَيْنِ قَضَيْتُ فَلَا عُدْوَانَ عَلَيَّ ۗوَاللّٰهُ عَلٰى مَا نَقُوْلُ وَكِيْلٌ ࣖ",
    "transliteration_en": "Qaala zaalika bainee wa bainaka aiyamal ajalaini qadaitu falaa 'udwaana 'alaiya wallaahu 'alaa ma naqoolu Wakeel",
    "transliteration_id": "Qāla żālika bainī wa bainak(a), ayyamal-ajalaini qaḍaitu falā ‘udwāna ‘alayy(a), wallāhu ‘alā mā naqūlu wakīl(un).",
    "translation_en": "[Moses] said, \"That is [established] between me and you. Whichever of the two terms I complete - there is no injustice to me, and Allah, over what we say, is Witness.\"",
    "translation_id": "Dia (Musa) berkata, “Itu (perjanjian) antara aku dan engkau. Yang mana saja dari kedua waktu yang ditentukan itu yang aku sempurnakan, maka tidak ada tuntutan atas diriku (lagi). Allah menjadi saksi atas apa yang kita ucapkan.”"
  },
  {
    "ayat": 29,
    "arabic": "۞ فَلَمَّا قَضٰى مُوْسَى الْاَجَلَ وَسَارَ بِاَهْلِهٖٓ اٰنَسَ مِنْ جَانِبِ الطُّوْرِ نَارًاۗ قَالَ لِاَهْلِهِ امْكُثُوْٓا اِنِّيْٓ اٰنَسْتُ نَارًا لَّعَلِّيْٓ اٰتِيْكُمْ مِّنْهَا بِخَبَرٍ اَوْ جَذْوَةٍ مِّنَ النَّارِ لَعَلَّكُمْ تَصْطَلُوْنَ",
    "transliteration_en": "Falammmaa qadaa Moosal ajala wa saara bi ahliheee aanasa min jaanibit Toori naaran qaala li ahlihim kusooo inneee aanastu naaral la 'alleee aateekum minhaa bikhabarin aw jazwatim minan naari la 'allakum tastaloon",
    "transliteration_id": "Falammā qaḍā mūsal-ajala wa sāra bi'ahlihī ānasa min jānibiṭ-ṭūri nārā(n), qāla li'ahlihimkuṡū innī ānastu nāral la‘allī ātīkum minhā bikhabarin au jażwatim minan-nāri la‘allakum taṣṭalūn(a).",
    "translation_en": "And when Moses had completed the term and was traveling with his family, he perceived from the direction of the mount a fire. He said to his family, \"Stay here; indeed, I have perceived a fire. Perhaps I will bring you from there [some] information or burning wood from the fire that you may warm yourselves.\"",
    "translation_id": "Maka, ketika Musa telah menyelesaikan waktu yang ditentukan itu dan berangkat dengan istrinya, dia melihat api di lereng gunung. Dia berkata kepada keluarganya, “Tunggulah (di sini). Sesungguhnya aku melihat api. Mudah-mudahan aku dapat membawa suatu berita kepadamu dari (tempat) api itu atau (membawa) sepercik api agar kamu dapat menghangatkan badan (dekat api).”"
  },
  {
    "ayat": 30,
    "arabic": "فَلَمَّآ اَتٰىهَا نُوْدِيَ مِنْ شَاطِئِ الْوَادِ الْاَيْمَنِ فِى الْبُقْعَةِ الْمُبٰرَكَةِ مِنَ الشَّجَرَةِ اَنْ يّٰمُوْسٰىٓ اِنِّيْٓ اَنَا اللّٰهُ رَبُّ الْعٰلَمِيْنَ ۙ",
    "transliteration_en": "Falammaaa ataahaa noodiya min shaati'il waadil aimani fil buq'atil muubaarakati minash shajarati ai yaa Moosaaa inneee Anal laahu Rabbul 'aalameen",
    "transliteration_id": "Falammā atāhā nūdiya min syāṭi'il wādil aimani fil buq‘atil mubārakati minasy syajarati ay yā mūsā innī anallāhu rabbul-‘ālamīn(a).",
    "translation_en": "But when he came to it, he was called from the right side of the valley in a blessed spot - from the tree, \"O Moses, indeed I am Allah, Lord of the worlds.\"",
    "translation_id": "Maka, ketika dia (Musa) mendatangi (api) itu, dia dipanggil dari pinggir lembah di sebelah kanan (Musa) dari (arah) pohon di sebidang tanah yang diberkahi. “Wahai Musa, sesungguhnya Aku adalah Allah, Tuhan semesta alam."
  },
  {
    "ayat": 31,
    "arabic": "وَاَنْ اَلْقِ عَصَاكَ ۗفَلَمَّا رَاٰهَا تَهْتَزُّ كَاَنَّهَا جَاۤنٌّ وَّلّٰى مُدْبِرًا وَّلَمْ يُعَقِّبْۗ يٰمُوْسٰىٓ اَقْبِلْ وَلَا تَخَفْۗ اِنَّكَ مِنَ الْاٰمِنِيْنَ",
    "transliteration_en": "Wa an alqi 'asaaka falam maa ra aahaa tahtazzu ka annnahaa jaaannunw wallaa mudbiranw wa lam yu'aqqib; yaa Moosaa aqbil wa laa takhaf innaka minal aamineen",
    "transliteration_id": "Wa alqi ‘aṣāk(a), falammā ra'āhā tahtazzu ka'annahā jānnuw wallā mudbiraw wa lam yu‘aqqib, yā mūsā aqbil wa lā takhaf, innaka minal-āminīn(a).",
    "translation_en": "And [he was told], \"Throw down your staff.\" But when he saw it writhing as if it was a snake, he turned in flight and did not return. [Allah said], \"O Moses, approach and fear not. Indeed, you are of the secure.",
    "translation_id": "Lemparkanlah tongkatmu!” Maka, ketika dia (Musa) melihatnya bergerak-gerak seperti seekor ular kecil yang gesit, dia lari berbalik ke belakang tanpa menoleh. (Allah berfirman,) “Wahai Musa, kemarilah dan jangan takut! Sesungguhnya engkau termasuk orang-orang yang aman."
  },
  {
    "ayat": 32,
    "arabic": "اُسْلُكْ يَدَكَ فِيْ جَيْبِكَ تَخْرُجْ بَيْضَاۤءَ مِنْ غَيْرِ سُوْۤءٍ ۖوَّاضْمُمْ اِلَيْكَ جَنَاحَكَ مِنَ الرَّهْبِ  فَذٰنِكَ بُرْهَانٰنِ مِنْ رَّبِّكَ اِلٰى فِرْعَوْنَ وَمَلَا۟ىِٕهٖۗ اِنَّهُمْ كَانُوْا قَوْمًا فٰسِقِيْنَ",
    "transliteration_en": "Usluk yadaka fee jaibika takhruj baidaaa'a min ghairi sooo'inw wadmum ilaika janaahaka minar rahbi fazaanika burhaanaani mir Rabbika ilaa Fiw'awna wa mala'ih; innahum kaanoo qawman faasiqeen",
    "transliteration_id": "Usluk yadaka fī jaibika takhruj baiḍā'a min gairi sū'(in), waḍmum ilaika janāḥaka minar-rahbi fażānika burhānāni mir rabbika ilā fir‘auna wa mala'ih(ī), innahum kānū qauman fāsiqīn(a).",
    "translation_en": "Insert your hand into the opening of your garment; it will come out white, without disease. And draw in your arm close to you [as prevention] from fear, for those are two proofs from your Lord to Pharaoh and his establishment. Indeed, they have been a people defiantly disobedient.\"",
    "translation_id": "Masukkanlah tanganmu ke leher bajumu, ia akan keluar (dalam keadaan bercahaya) putih bukan karena cacat. Dekapkanlah kedua tanganmu jika engkau takut. Itulah dua mukjizat dari Tuhanmu (yang akan engkau tunjukkan) kepada Firʻaun dan para pembesarnya. Sesungguhnya mereka adalah kaum yang fasik.”"
  },
  {
    "ayat": 33,
    "arabic": "قَالَ رَبِّ اِنِّيْ قَتَلْتُ مِنْهُمْ نَفْسًا فَاَخَافُ اَنْ يَّقْتُلُوْنِ",
    "transliteration_en": "Qaala Rabbi innee qataltu minhum nafsan fa akhaafu ai yaqtuloon",
    "transliteration_id": "Qāla rabbi innī qataltu minhum nafsan fa'akhāfu ay yaqtulūn(i).",
    "translation_en": "He said, \"My Lord, indeed, I killed from among them someone, and I fear they will kill me.",
    "translation_id": "(Musa) berkata, “Ya Tuhanku, sesungguhnya aku telah membunuh seseorang dari mereka sehingga aku takut mereka akan membunuhku."
  },
  {
    "ayat": 34,
    "arabic": "وَاَخِيْ هٰرُوْنُ هُوَ اَفْصَحُ مِنِّيْ لِسَانًا فَاَرْسِلْهُ مَعِيَ رِدْءًا يُّصَدِّقُنِيْٓ  ۖاِنِّيْٓ اَخَافُ اَنْ يُّكَذِّبُوْنِ",
    "transliteration_en": "Wa akhee Haaroonu huwa afsahu minnee lisaanan fa arsilhu ma'iya rid ai yusaddiquneee innee akhaafu ai yukazziboon",
    "transliteration_id": "Wa akhī hārūnu huwa afṣaḥu minnī lisānan fa'arsilhu ma‘iya rid'ay yuṣaddiqunī, innī akhāfu ay yukażżibūn(i).",
    "translation_en": "And my brother Aaron is more fluent than me in tongue, so send him with me as support, verifying me. Indeed, I fear that they will deny me.\"",
    "translation_id": "Adapun saudaraku Harun, dia lebih fasih lidahnya daripadaku. Maka, utuslah dia bersamaku sebagai pembantuku untuk membenarkan (perkataan)-ku. Sesungguhnya aku takut mereka akan mendustakanku.”"
  },
  {
    "ayat": 35,
    "arabic": "قَالَ سَنَشُدُّ عَضُدَكَ بِاَخِيْكَ وَنَجْعَلُ لَكُمَا سُلْطٰنًا فَلَا يَصِلُوْنَ اِلَيْكُمَا  ۛبِاٰيٰتِنَا  ۛ اَنْتُمَا وَمَنِ اتَّبَعَكُمَا الْغٰلِبُوْنَ",
    "transliteration_en": "Qaala sanashuddu 'adudaka bi akheeka wa naj'alu lakumaa sultaanan falaa yasiloona ilaikumaa; bi Aayaatinaa antumaa wa manit taba'akumal ghaaliboon",
    "transliteration_id": "Qāla sanasyuddu ‘aḍudaka bi'akhīka wa naj‘alu lakumā sulṭānan falā yaṣilūna ilaikumā - bi'āyātinā - antumā wa manittaba‘akumal-gālibūn(a).",
    "translation_en": "[Allah] said, \"We will strengthen your arm through your brother and grant you both supremacy so they will not reach you. [It will be] through Our signs; you and those who follow you will be the predominant.\"",
    "translation_id": "Dia (Allah) berfirman, “Kami akan menguatkanmu dengan saudaramu dan Kami akan berikan kepadamu berdua hujah (mukjizat). Maka, mereka tidak akan dapat mencapaimu. (Berangkatlah kamu berdua) dengan membawa mukjizat Kami. Kamu berdua dan orang yang mengikutimu adalah para pemenang.”"
  },
  {
    "ayat": 36,
    "arabic": "فَلَمَّا جَاۤءَهُمْ مُّوْسٰى بِاٰيٰتِنَا بَيِّنٰتٍ قَالُوْا مَا هٰذَآ اِلَّا سِحْرٌ مُّفْتَرًىۙ وَّمَا سَمِعْنَا بِهٰذَا فِيْٓ اٰبَاۤىِٕنَا الْاَوَّلِيْنَ",
    "transliteration_en": "Falammaa jaaa'ahum Moosaa bi Aayaatinaa baiyinaatin qaaloo maa haazaaa illaa sihrum muftaranw wa maa sami'naa bihaazaa feee aabaaa'inal awwaleen",
    "transliteration_id": "Falammā jā'ahum mūsā bi'āyātinā bayyinātin qālū mā hāżā illā siḥrum muftarā(n), wa mā sami‘nā bihāżā fī ābā'inal-awwalīn(a).",
    "translation_en": "But when Moses came to them with Our signs as clear evidences, they said, \"This is not except invented magic, and we have not heard of this [religion] among our forefathers.\"",
    "translation_id": "Ketika Musa mendatangi mereka (Firʻaun dan pengikutnya) dengan (membawa) mukjizat Kami yang nyata, mereka berkata, “Ini hanyalah sihir yang dibuat-buat dan kami tidak pernah mendengar (ajakan) ini dari nenek moyang kami dahulu.”"
  },
  {
    "ayat": 37,
    "arabic": "وَقَالَ مُوْسٰى رَبِّيْٓ اَعْلَمُ بِمَنْ جَاۤءَ بِالْهُدٰى مِنْ عِنْدِهٖ وَمَنْ تَكُوْنُ لَهٗ عَاقِبَةُ الدَّارِۗ اِنَّهٗ لَا يُفْلِحُ الظّٰلِمُوْنَ",
    "transliteration_en": "Wa qaala Moosaa Rabbeee a'alamu biman jaaa'a bilhudaa min 'indihee wa man takoonu lahoo 'aaqibatud daari innahoo laa yuflihuz zaalimoon",
    "transliteration_id": "Wa qāla mūsā rabbī a‘lamu biman jā'a bil-hudā min ‘indihī wa man takūnu lahū ‘āqibatud-dār(i), innahū lā yufliḥuẓ-ẓālimūn(a).",
    "translation_en": "And Moses said, \"My Lord is more knowing [than we or you] of who has come with guidance from Him and to whom will be succession in the home. Indeed, wrongdoers do not succeed.\"",
    "translation_id": "Musa menjawab, “Tuhanku lebih mengetahui siapa yang (pantas) membawa petunjuk dari sisi-Nya dan siapa yang akan mendapat kesudahan (yang baik) di akhirat. Sesungguhnya orang-orang zalim itu tidak beruntung.”"
  },
  {
    "ayat": 38,
    "arabic": "وَقَالَ فِرْعَوْنُ يٰٓاَيُّهَا الْمَلَاُ مَا عَلِمْتُ لَكُمْ مِّنْ اِلٰهٍ غَيْرِيْۚ فَاَوْقِدْ لِيْ يٰهَامٰنُ عَلَى الطِّيْنِ فَاجْعَلْ لِّيْ صَرْحًا لَّعَلِّيْٓ اَطَّلِعُ اِلٰٓى اِلٰهِ مُوْسٰىۙ وَاِنِّيْ لَاَظُنُّهٗ مِنَ الْكٰذِبِيْنَ",
    "transliteration_en": "Wa qaala Fir'awnu yaaa aiyuhal mala-u maa 'alimtu lakum min ilaahin ghairee fa awqid lee yaa Haamaanu 'alatteeni faj'al lee sarhal la'alleee attali'u ilaaa ilaahi Moosaa wa innee la azunnuhoo minal kaazibeen",
    "transliteration_id": "Wa qāla fir‘aunu yā ayyuhal-mala'u mā ‘alimtu lakum min ilāhin gairī, fa'auqid lī yā hāmānu ‘alaṭ-ṭīni faj‘al lī ṣarḥal la‘allī aṭṭali‘u ilā ilāhi mūsā, wa innī la'aẓunnuhū minal-kāżibīn(a).",
    "translation_en": "And Pharaoh said, \"O eminent ones, I have not known you to have a god other than me. Then ignite for me, O Haman, [a fire] upon the clay and make for me a tower that I may look at the God of Moses. And indeed, I do think he is among the liars.\"",
    "translation_id": "Firʻaun berkata, “Wahai para pembesar, aku tidak mengetahui ada Tuhan bagimu selainku. Wahai Haman, bakarlah tanah liat untukku (untuk membuat batu bata), kemudian buatkanlah bangunan yang tinggi untukku agar aku dapat naik melihat Tuhannya Musa! Sesungguhnya aku yakin bahwa dia termasuk para pendusta.”"
  },
  {
    "ayat": 39,
    "arabic": "وَاسْتَكْبَرَ هُوَ وَجُنُوْدُهٗ فِى الْاَرْضِ بِغَيْرِ الْحَقِّ وَظَنُّوْٓا اَنَّهُمْ اِلَيْنَا لَا يُرْجَعُوْنَ",
    "transliteration_en": "Wastakbara huwa wa junooduhoo fil ardi bighairil haqqi wa zannooo annahum ilainaa laa yurja'oon",
    "transliteration_id": "Wastakbara huwa wa judūduhū fil-arḍi bigairil-ḥaqqi wa ẓannū annahum ilainā lā yurja‘ūn(a).",
    "translation_en": "And he was arrogant, he and his soldiers, in the land, without right, and they thought that they would not be returned to Us.",
    "translation_id": "Dia (Firʻaun) dan bala tentaranya bersikap sombong di bumi tanpa (alasan yang) benar. Mereka mengira bahwa sesungguhnya mereka tidak akan dikembalikan kepada Kami."
  },
  {
    "ayat": 40,
    "arabic": "فَاَخَذْنٰهُ وَجُنُوْدَهٗ فَنَبَذْنٰهُمْ فِى الْيَمِّ ۚفَانْظُرْ كَيْفَ كَانَ عَاقِبَةُ الظّٰلِمِيْنَ",
    "transliteration_en": "Fa akhaznaahu wa junoo dahoo fanabaznaahum fil yammi fanzur kaifa kaana 'aaqibatuz zaalimeen",
    "transliteration_id": "Fa'akhażnāhu wa junūdahū fanabażnāhum fil-yamm(i), fanẓur kaifa kāna ‘āqibatuẓ-ẓālimīn(a).",
    "translation_en": "So We took him and his soldiers and threw them into the sea. So see how was the end of the wrongdoers.",
    "translation_id": "Kami menghukum dia (Firʻaun) dan bala tentaranya. Kami menenggelamkan mereka ke dalam laut. Perhatikanlah bagaimana kesudahan orang-orang zalim."
  },
  {
    "ayat": 41,
    "arabic": "وَجَعَلْنٰهُمْ اَىِٕمَّةً يَّدْعُوْنَ اِلَى النَّارِۚ وَيَوْمَ الْقِيٰمَةِ لَا يُنْصَرُوْنَ",
    "transliteration_en": "Wa ja'alnaahum a'immatany yad'oona ilan Naari wa Yawmal Qiyaamati laa yunsaroon",
    "transliteration_id": "Wa ja‘alnāhum a'immatay yad‘ūna ilan-nār(i), wa yaumal-qiyāmati lā yunṣarūn(a).",
    "translation_en": "And We made them leaders inviting to the Fire, and on the Day of Resurrection they will not be helped.",
    "translation_id": "Kami menjadikan mereka (Firʻaun dan bala tentaranya) para pemimpin yang mengajak (manusia) ke neraka. Pada hari Kiamat mereka tidak akan ditolong."
  },
  {
    "ayat": 42,
    "arabic": "وَاَتْبَعْنٰهُمْ فِيْ هٰذِهِ الدُّنْيَا لَعْنَةً ۚوَيَوْمَ الْقِيٰمَةِ هُمْ مِّنَ الْمَقْبُوْحِيْنَ ࣖ",
    "transliteration_en": "Wa atba'naahum fee haazihid dunyaa la'natanw wa Yawmal Qiyaamati hum minal maqbooheen",
    "transliteration_id": "Wa atba‘nāhum fī hāżihid-dun-yā la‘nah(tan), wa yaumal-qiyāmati hum minal-maqbūḥīn(a).",
    "translation_en": "And We caused to overtake them in this world a curse, and on the Day of Resurrection they will be of the despised.",
    "translation_id": "Kami memperikutkan laknat kepada mereka di dunia ini dan pada hari Kiamat mereka termasuk orang-orang yang dijauhkan (dari rahmat Allah)."
  },
  {
    "ayat": 43,
    "arabic": "وَلَقَدْ اٰتَيْنَا مُوْسَى الْكِتٰبَ مِنْۢ بَعْدِ مَآ اَهْلَكْنَا الْقُرُوْنَ الْاُوْلٰى بَصَاۤىِٕرَ لِلنَّاسِ وَهُدًى وَّرَحْمَةً لَّعَلَّهُمْ يَتَذَكَّرُوْنَ",
    "transliteration_en": "Wa laqad aatainaa Moosal Kitaaba mim ba'di maaa ahlaknal quroonal oolaa basaaa'ira linnaasi wa hudanw wa rahmatal la'allahum yata zakkkaroon",
    "transliteration_id": "Wa laqad ātainā mūsal-kitāba mim ba‘di mā ahlaknal-qurūnal ūlā baṣā'ira lin-nāsi wa hudaw wa raḥmatal la‘allahum yatażakkarūn(a).",
    "translation_en": "And We gave Moses the Scripture, after We had destroyed the former generations, as enlightenment for the people and guidance and mercy that they might be reminded.",
    "translation_id": "Sungguh, Kami benar-benar menganugerahkan kepada Musa Kitab (Taurat) setelah Kami membinasakan generasi terdahulu sebagai penerang, petunjuk, dan rahmat bagi manusia agar mereka mendapat pelajaran."
  },
  {
    "ayat": 44,
    "arabic": "وَمَا كُنْتَ بِجَانِبِ الْغَرْبِيِّ اِذْ قَضَيْنَآ اِلٰى مُوْسَى الْاَمْرَ وَمَا كُنْتَ مِنَ الشّٰهِدِيْنَ ۙ",
    "transliteration_en": "Wa maa kunta bijaanibil gharbiyyi iz qadainaaa ilaa Moosal amra wa maa kunta minash shaahideen",
    "transliteration_id": "Wa mā kunta bijānibil-garbiyyi iż qaḍainā ilā mūsal-amra wa mā kunta minasy-syāhidīn(a).",
    "translation_en": "And you, [O Muhammad], were not on the western side [of the mount] when We revealed to Moses the command, and you were not among the witnesses [to that].",
    "translation_id": "Engkau (Nabi Muhammad) tidak berada di sebelah barat (lembah suci Tuwa) ketika Kami menyampaikan risalah kepada Musa. Engkau tidak (pula) termasuk orang-orang yang menyaksikan (kejadian itu)."
  },
  {
    "ayat": 45,
    "arabic": "وَلٰكِنَّآ اَنْشَأْنَا قُرُوْنًا فَتَطَاوَلَ عَلَيْهِمُ الْعُمُرُۚ وَمَا كُنْتَ ثَاوِيًا فِيْٓ اَهْلِ مَدْيَنَ تَتْلُوْا عَلَيْهِمْ اٰيٰتِنَاۙ وَلٰكِنَّا كُنَّا مُرْسِلِيْنَ",
    "transliteration_en": "Wa laakinnaa anshaanaa quroonan fatataawala 'alaihimul 'umur; wa maa kunta saawiyan feee ahli Madyana tatloo 'alaihim Aayaatinaa wa laakinnaa kunnaa mursileen",
    "transliteration_id": "Wa lākinnā ansya'nā qurūnan fataṭāwala ‘alaihimul-‘umur(u), wa mā kunta ṡāwiyan fī ahli madyana tatlū ‘alaihim āyātinā, wa lākinnā kunnā mursilīn(a).",
    "translation_en": "But We produced [many] generations [after Moses], and prolonged was their duration. And you were not a resident among the people of Madyan, reciting to them Our verses, but We were senders [of this message].",
    "translation_id": "Akan tetapi, Kami telah menciptakan beberapa umat dan telah berlalu atas mereka masa yang panjang. Engkau (Nabi Muhammad) tidak pula tinggal bersama-sama penduduk Madyan, (sehingga dapat) membacakan ayat-ayat Kami kepada mereka. Akan tetapi, Kamilah pengutus (para rasul)."
  },
  {
    "ayat": 46,
    "arabic": "وَمَا كُنْتَ بِجَانِبِ الطُّوْرِ اِذْ نَادَيْنَا وَلٰكِنْ رَّحْمَةً مِّنْ رَّبِّكَ لِتُنْذِرَ قَوْمًا مَّآ اَتٰىهُمْ مِّنْ نَّذِيْرٍ مِّنْ قَبْلِكَ لَعَلَّهُمْ يَتَذَكَّرُوْنَ",
    "transliteration_en": "Wa maa kunta bijaanibit Toori iz naadainaa wa laakir rahmatam mir Rabbika litunzira qawmam maaa ataahum min nazeerim min qablika la'allahum yatazakkaroon",
    "transliteration_id": "Wa mā kunta bijānibiṭ-ṭūri iż nādainā wa lākir raḥmatam mir rabbika litunżira qaumam mā atāhum min nażīrim min qablika la‘allahum yatażakkarūn(a).",
    "translation_en": "And you were not at the side of the mount when We called [Moses] but [were sent] as a mercy from your Lord to warn a people to whom no warner had come before you that they might be reminded.",
    "translation_id": "Engkau (Nabi Muhammad) tidak pula berada di dekat gunung (Sinai) ketika Kami memanggil (Musa). Akan tetapi, (engkau mengetahuinya) semata-mata karena rahmat dari Tuhanmu agar engkau memberi peringatan kepada kaum yang belum didatangi oleh seorang pun pemberi peringatan sebelum engkau agar mereka mendapat pelajaran."
  },
  {
    "ayat": 47,
    "arabic": "وَلَوْلَآ اَنْ تُصِيْبَهُمْ مُّصِيْبَةٌ ۢبِمَا قَدَّمَتْ اَيْدِيْهِمْ فَيَقُوْلُوْا رَبَّنَا لَوْلَآ اَرْسَلْتَ اِلَيْنَا رَسُوْلًا فَنَتَّبِعَ اٰيٰتِكَ وَنَكُوْنَ مِنَ الْمُؤْمِنِيْنَ",
    "transliteration_en": "Wa law laaa an tuseebahum museebatum bimaa qaddamat aideehim fa yaqooloo Rabbanaa law laaa arsalta ilainaa Rasoolan fanattabi'a Aayaatika wa nakoona minal mu'mineen",
    "transliteration_id": "Wa lau lā an tuṣībahum muṣībatum bimā qaddamat aidīhim fayaqūlū rabbanā lau lā arsalta ilainā rasūlan fanattabi‘a āyātika wa nakūna minal-mu'minīn(a).",
    "translation_en": "And if not that a disaster should strike them for what their hands put forth [of sins] and they would say, \"Our Lord, why did You not send us a messenger so we could have followed Your verses and been among the believers?\"...",
    "translation_id": "Seandainya saja saat ditimpa azab karena apa yang mereka kerjakan mereka tidak berdalih dengan mengatakan, “Ya Tuhan kami, mengapa Engkau tidak mengutus seorang rasul kepada kami agar kami mengikuti ayat-ayat-Mu dan termasuk orang-orang mukmin?” (Maka, tidak akan ada rasul yang diutus.)"
  },
  {
    "ayat": 48,
    "arabic": "فَلَمَّا جَاۤءَهُمُ الْحَقُّ مِنْ عِنْدِنَا قَالُوْا لَوْلَآ اُوْتِيَ مِثْلَ مَآ اُوْتِيَ مُوْسٰىۗ اَوَلَمْ يَكْفُرُوْا بِمَآ اُوْتِيَ مُوْسٰى مِنْ قَبْلُۚ قَالُوْا سِحْرٰنِ تَظٰهَرَاۗ وَقَالُوْٓا اِنَّا بِكُلٍّ كٰفِرُوْنَ",
    "transliteration_en": "Falammaa jaaa'ahumul haqqu min 'indinaa qaaloo law laa ootiya misla maaa ootiyaa Moosaa; awalam yakfuroo bimaaa ootiya Moosaa min qablu qaaloo sihraani tazaaharaa wa qaalooo innaa bikullin kaafiroon",
    "transliteration_id": "Falammā jā'ahumul-ḥaqqu min ‘indinā qālū lau lā ūtiya miṡla mā ūtiya mūsā, awalam yakfurū bimā ūtiya mūsā min qabl(u), qālū siḥrāni taẓāharā, wa qālū innā bikullin kāfirūn(a).",
    "translation_en": "But when the truth came to them from Us, they said, \"Why was he not given like that which was given to Moses?\" Did they not disbelieve in that which was given to Moses before? They said, \"[They are but] two works of magic supporting each other, and indeed we are, in both, disbelievers.\"",
    "translation_id": "Ketika telah datang kepada mereka kebenaran (Al-Qur’an) dari sisi Kami, mereka berkata, “Mengapa tidak diberikan kepadanya (Nabi Muhammad mukjizat) seperti apa yang telah diberikan kepada Musa?” Bukankah mereka itu telah ingkar kepada apa yang diberikan kepada Musa dahulu? Mereka berkata, “(Al-Qur’an dan Taurat adalah) dua (kitab) sihir yang saling menguatkan.” Mereka (juga) berkata, “Sesungguhnya kami mengingkari keduanya.”"
  },
  {
    "ayat": 49,
    "arabic": "قُلْ فَأْتُوْا بِكِتٰبٍ مِّنْ عِنْدِ اللّٰهِ هُوَ اَهْدٰى مِنْهُمَآ اَتَّبِعْهُ اِنْ كُنْتُمْ صٰدِقِيْنَ",
    "transliteration_en": "Qul faatoo bi Kitaabim min 'indil laahi huwa ahdaa minhu maaa attabi'hu in kuntum saadiqeen",
    "transliteration_id": "Qul fa'tū bikitābim min ‘indillāhi huwa ahdā minhumā attabi‘hu in kuntum ṣādiqīn(a).",
    "translation_en": "Say, \"Then bring a scripture from Allah which is more guiding than either of them that I may follow it, if you should be truthful.\"",
    "translation_id": "Katakanlah (Nabi Muhammad), “Datangkanlah sebuah kitab dari sisi Allah yang lebih banyak memberi petunjuk daripada keduanya (Taurat dan Al-Qur’an), niscaya aku mengikutinya, jika kamu orang-orang benar.”"
  },
  {
    "ayat": 50,
    "arabic": "فَاِنْ لَّمْ يَسْتَجِيْبُوْا لَكَ فَاعْلَمْ اَنَّمَا يَتَّبِعُوْنَ اَهْوَاۤءَهُمْۗ وَمَنْ اَضَلُّ مِمَّنِ اتَّبَعَ هَوٰىهُ بِغَيْرِ هُدًى مِّنَ اللّٰهِ ۗاِنَّ اللّٰهَ لَا يَهْدِى الْقَوْمَ الظّٰلِمِيْنَ ࣖ",
    "transliteration_en": "Fa il lam yastajeeboo laka fa'lam annamaa yattabi'oona ahwaaa'ahum; w aman adallu mimmanit taba'a hawaahu bighari hudam minal laah; innal laaha laa yahdil qawmaz zaalimeen",
    "transliteration_id": "Fa illam yastajībū laka fa‘lam annamā yattabi‘ūna ahwā'ahum, wa man aḍallu mimmanittaba‘a hawāhu bigairi hudam minallāh(i), innallāha lā yahdil-qaumaẓ-ẓālimīn(a).",
    "translation_en": "But if they do not respond to you - then know that they only follow their [own] desires. And who is more astray than one who follows his desire without guidance from Allah? Indeed, Allah does not guide the wrongdoing people.",
    "translation_id": "Jika mereka tidak menjawab (tantanganmu), ketahuilah bahwa mereka hanyalah mengikuti hawa nafsu mereka. Siapakah yang lebih sesat daripada orang yang mengikuti keinginannya tanpa mendapat petunjuk dari Allah? Sesungguhnya Allah tidak memberi petunjuk kepada kaum yang zalim."
  }
]