[
  {
    "ayat": 1,
    "arabic": "يَسْـَٔلُوْنَكَ عَنِ الْاَنْفَالِۗ قُلِ الْاَنْفَالُ لِلّٰهِ وَالرَّسُوْلِۚ فَاتَّقُوا اللّٰهَ وَاَصْلِحُوْا ذَاتَ بَيْنِكُمْ ۖوَاَطِيْعُوا اللّٰهَ وَرَسُوْلَهٗٓ اِنْ كُنْتُمْ مُّؤْمِنِيْنَ",
    "transliteration_en": "Yas'aloonaka 'anil anfaali qulil anfaalu lillaahi war Rasooli fattaqul laaha wa ahlihoo zaata bainikum wa atee'ul laaha wa Rasoolahooo in kuntum mu'mineen",
    "transliteration_id": "Yas'alūnaka ‘anil-anfāl(i), qulil-anfālu lillāhi war-rasūl(i), fattaqullāha wa aṣliḥū żāta bainikum, wa aṭī‘ullāha wa rasūlahū in kuntum mu'minīn(a).",
    "translation_en": "They ask you, [O Muhammad], about the bounties [of war]. Say, \"The [decision concerning] bounties is for Allah and the Messenger.\" So fear Allah and amend that which is between you and obey Allah and His Messenger, if you should be believers.",
    "translation_id": "Mereka bertanya kepadamu (Nabi Muhammad) tentang (pembagian) harta rampasan perang. Katakanlah, “Harta rampasan perang itu milik Allah dan Rasul (menurut ketentuan Allah dan Rasul-Nya). Maka, bertakwalah kepada Allah dan perbaikilah hubungan di antara sesamamu dan taatlah kepada Allah dan Rasul-Nya jika kamu orang-orang mukmin.”"
  },
  {
    "ayat": 2,
    "arabic": "اِنَّمَا الْمُؤْمِنُوْنَ الَّذِيْنَ اِذَا ذُكِرَ اللّٰهُ وَجِلَتْ قُلُوْبُهُمْ وَاِذَا تُلِيَتْ عَلَيْهِمْ اٰيٰتُهٗ زَادَتْهُمْ اِيْمَانًا وَّعَلٰى رَبِّهِمْ يَتَوَكَّلُوْنَۙ",
    "transliteration_en": "Innamal mu'minoonal lazeena izaa zukiral laahu wajilat quloobuhum wa izaa tuliyat 'alaihim Aayaatuhoo zaadat hum eemaananw wa 'alaa Rabbihim yatawakkaloon",
    "transliteration_id": "Innamal-mu'minūnal-lażīna iżā żukirallāhu wajilat qulūbuhum wa iżā tuliyat ‘alaihim āyātuhū zādathum īmānaw wa ‘alā rabbihim yatawakkalūn(a).",
    "translation_en": "The believers are only those who, when Allah is mentioned, their hearts become fearful, and when His verses are recited to them, it increases them in faith; and upon their Lord they rely -",
    "translation_id": "Sesungguhnya orang-orang mukmin adalah mereka yang jika disebut nama Allah, gemetar hatinya dan jika dibacakan ayat-ayat-Nya kepada mereka, bertambah (kuat) imannya dan hanya kepada Tuhannya mereka bertawakal,"
  },
  {
    "ayat": 3,
    "arabic": "الَّذِيْنَ يُقِيْمُوْنَ الصَّلٰوةَ وَمِمَّا رَزَقْنٰهُمْ يُنْفِقُوْنَۗ",
    "transliteration_en": "Allazeena yuqeemoonas Salaata wa mimmaa razaqnaahum yunfiqoon",
    "transliteration_id": "Al-lażīna yuqīmūnaṣ-ṣalāta wa mimmā razaqnāhum yunfiqūn(a).",
    "translation_en": "The ones who establish prayer, and from what We have provided them, they spend.",
    "translation_id": "(yaitu) orang-orang yang melaksanakan salat dan menginfakkan sebagian rezeki yang Kami anugerahkan kepada mereka."
  },
  {
    "ayat": 4,
    "arabic": "اُولٰۤىِٕكَ هُمُ الْمُؤْمِنُوْنَ حَقًّاۗ  لَهُمْ دَرَجٰتٌ عِنْدَ رَبِّهِمْ وَمَغْفِرَةٌ وَّرِزْقٌ كَرِيْمٌۚ",
    "transliteration_en": "Ulaaa'ika humul mu'minoona haqqaa; lahum darajaatun 'inda Rabbihim wa magh firatunw wa rizqun kareem",
    "transliteration_id": "Ulā'ika humul-mu'minūna ḥaqqā(n), lahum darajātun ‘inda rabbihim wa magfiratuw wa rizqun karīm(un).",
    "translation_en": "Those are the believers, truly. For them are degrees [of high position] with their Lord and forgiveness and noble provision.",
    "translation_id": "Mereka itulah orang-orang yang benar-benar beriman. Bagi mereka derajat (tinggi) di sisi Tuhannya dan ampunan serta rezeki yang mulia."
  },
  {
    "ayat": 5,
    "arabic": "كَمَآ اَخْرَجَكَ رَبُّكَ مِنْۢ بَيْتِكَ بِالْحَقِّۖ وَاِنَّ فَرِيْقًا مِّنَ الْمُؤْمِنِيْنَ لَكٰرِهُوْنَ",
    "transliteration_en": "Kaamaaa akhrajaka Rabbuka mim baitika bilhaqq; wa inna fareeqam minal mu'mineena lakaarihoon",
    "transliteration_id": "Kamā akhrajaka rabbuka mim baitika bil-ḥaqq(i), wa inna farīqam minal-mu'minīna lakārihūn(a).",
    "translation_en": "[It is] just as when your Lord brought you out of your home [for the battle of Badr] in truth, while indeed, a party among the believers were unwilling,",
    "translation_id": "(Peristiwa itu) sebagaimana Tuhanmu menyuruhmu pergi dari rumahmu dengan (berdasar) kebenaran meskipun sesungguhnya sebagian orang-orang yang beriman, itu tidak menyukainya."
  },
  {
    "ayat": 6,
    "arabic": "يُجَادِلُوْنَكَ فِى الْحَقِّ بَعْدَمَا تَبَيَّنَ كَاَنَّمَا يُسَاقُوْنَ اِلَى الْمَوْتِ وَهُمْ يَنْظُرُوْنَ ۗ",
    "transliteration_en": "Yujaadiloonaka fil haqqi ba'da maa tabaiyana kaannamaa yasaaqoona ilal mawti wa hum uanzuroon",
    "transliteration_id": "Yujādilūnaka fil-ḥaqqi ba‘da mā tabayyana ka'annamā yusāqūna ilal-mauti wa hum yanẓurūn(a).",
    "translation_en": "Arguing with you concerning the truth after it had become clear, as if they were being driven toward death while they were looking on.",
    "translation_id": "Mereka membantahmu (Nabi Muhammad) tentang kebenaran (Perang Badar) setelah nyata (bahwa mereka pasti menang) seakan-akan mereka dihalau pada kematian dan melihat (sebab kematian itu)."
  },
  {
    "ayat": 7,
    "arabic": "وَاِذْ يَعِدُكُمُ اللّٰهُ اِحْدَى الطَّاۤىِٕفَتَيْنِ اَنَّهَا لَكُمْ وَتَوَدُّوْنَ اَنَّ غَيْرَ ذَاتِ الشَّوْكَةِ تَكُوْنُ لَكُمْ وَيُرِيْدُ اللّٰهُ اَنْ يُّحِقَّ الْحَقَّ بِكَلِمٰتِهٖ وَيَقْطَعَ دَابِرَ الْكٰفِرِيْنَۙ",
    "transliteration_en": "Wa iz ya'idukumul laahu ihdat taaa'ifataini annahaa lakum wa tawaddoona anna ghaira zaatish shawkati takoonu lakum wa yureedul laahu ai yuhiqqal haqqa bikalimaatihee wa taqta'a daabiral kaafireen",
    "transliteration_id": "Wa iż ya‘idukumullāhu iḥdaṭ-ṭā'ifataini annahā lakum wa tawaddūna anna gaira żātisy-syaukati takūnu lakum wa yurīdullāhu ay yuḥiqqal-ḥaqqa bikalimātihī wa yaqṭa‘a dābiral-kāfirīn(a).",
    "translation_en": "[Remember, O believers], when Allah promised you one of the two groups - that it would be yours - and you wished that the unarmed one would be yours. But Allah intended to establish the truth by His words and to eliminate the disbelievers",
    "translation_id": "(Ingatlah) ketika Allah menjanjikan kepadamu bahwa salah satu dari dua golongan (yang kamu hadapi) adalah milikmu, sedangkan kamu menginginkan bahwa yang tidak mempunyai kekuatan senjatalah milikmu. Akan tetapi, Allah hendak menetapkan yang benar (Islam) dengan ketentuan-Nya dan memusnahkan orang-orang kafir sampai ke akar-akarnya"
  },
  {
    "ayat": 8,
    "arabic": "لِيُحِقَّ الْحَقَّ وَيُبْطِلَ الْبَاطِلَ وَلَوْ كَرِهَ الْمُجْرِمُوْنَۚ",
    "transliteration_en": "Liyuhiqqal haqqa wa tubtilal baatila wa law karihal mujrimoon",
    "transliteration_id": "Liyuḥiqqal-ḥaqqa wa yubṭilal-bāṭila wa lau karihal-mujrimūn(a).",
    "translation_en": "That He should establish the truth and abolish falsehood, even if the criminals disliked it.",
    "translation_id": "agar Allah menetapkan yang benar (Islam) dan menghilangkan yang batil (syirik), walaupun para pendosa (musyrik) itu tidak menyukai(-nya)."
  },
  {
    "ayat": 9,
    "arabic": "اِذْ تَسْتَغِيْثُوْنَ رَبَّكُمْ فَاسْتَجَابَ لَكُمْ اَنِّيْ مُمِدُّكُمْ بِاَلْفٍ مِّنَ الْمَلٰۤىِٕكَةِ مُرْدِفِيْنَ",
    "transliteration_en": "Iz tastagheesoona Rabbakum fastajaaba lakum annee mumiddukum bi alfim minal malaaa'ikati murdifeen",
    "transliteration_id": "Iż tastagīṡūna rabbakum fastajāba lakum annī mumiddukum bi'alfim minal-malā'ikati murdifīn(a).",
    "translation_en": "[Remember] when you asked help of your Lord, and He answered you, \"Indeed, I will reinforce you with a thousand from the angels, following one another.\"",
    "translation_id": "(Ingatlah) ketika kamu memohon pertolongan kepada Tuhanmu, lalu Dia mengabulkan(-nya) bagimu (seraya berfirman), “Sesungguhnya Aku akan mendatangkan bala bantuan kepadamu berupa seribu malaikat yang datang berturut-turut.”"
  },
  {
    "ayat": 10,
    "arabic": "وَمَا جَعَلَهُ اللّٰهُ اِلَّا بُشْرٰى وَلِتَطْمَىِٕنَّ بِهٖ قُلُوْبُكُمْۗ وَمَا النَّصْرُ اِلَّا مِنْ عِنْدِ اللّٰهِ ۗاِنَّ اللّٰهَ عَزِيْزٌ حَكِيْمٌ ࣖ",
    "transliteration_en": "Wa maa ja'alahul laahu illaa bushraa wa litatma'inna bihee quloobukum; wa man nasru illaa min 'indil laah; innal laaha Azeezun Hakeem",
    "transliteration_id": "Wa mā ja‘alahullāhu illā busyrā wa litaṭma'inna bihī qulūbukum, wa man-naṡru illā min ‘indillāh(i), innallāha ‘azīzun ḥakīm(un).",
    "translation_en": "And Allah made it not but good tidings and so that your hearts would be assured thereby. And victory is not but from Allah. Indeed, Allah is Exalted in Might and Wise.",
    "translation_id": "Allah tidak menjadikannya (bala bantuan itu), melainkan sebagai kabar gembira dan agar hatimu menjadi tenteram karenanya. Kemenangan itu hanyalah dari sisi Allah. Sesungguhnya Allah Maha Perkasa lagi Maha Bijaksana."
  },
  {
    "ayat": 11,
    "arabic": "اِذْ يُغَشِّيْكُمُ النُّعَاسَ اَمَنَةً مِّنْهُ وَيُنَزِّلُ عَلَيْكُمْ مِّنَ السَّمَاۤءِ مَاۤءً لِّيُطَهِّرَكُمْ بِهٖ وَيُذْهِبَ عَنْكُمْ رِجْزَ الشَّيْطٰنِ وَلِيَرْبِطَ عَلٰى قُلُوْبِكُمْ وَيُثَبِّتَ بِهِ الْاَقْدَامَۗ",
    "transliteration_en": "Iz yughashsheekumun nu'assa amanatam minhu wa yunazzilu 'alaikum minas samaaa'i maaa'al liyutah hirakum bihee wa yuzhiba 'ankum rijzash Shaitaani wa liyarbita 'ala quloobikum wa yusabbita bihil aqdaam",
    "transliteration_id": "Iż yugasysyīkumun-nu‘āsa amanatam minhu wa yunazzilu ‘alaikum minas-samā'i mā'al liyuṭahhirakum bihī wa yużhiba ‘ankum rijzasy-syaiṭāni wa liyarbiṭa ‘alā qulūbikum wa yuṡabbita bihil-aqdām(a).",
    "translation_en": "[Remember] when He overwhelmed you with drowsiness [giving] security from Him and sent down upon you from the sky, rain by which to purify you and remove from you the evil [suggestions] of Satan and to make steadfast your hearts and plant firmly thereby your feet.",
    "translation_id": "(Ingatlah) ketika Allah membuat kamu mengantuk sebagai penenteraman dari-Nya dan menurunkan air (hujan) dari langit kepadamu untuk menyucikan kamu dengan (hujan) itu, menghilangkan gangguan-gangguan setan dari dirimu, dan menguatkan hatimu serta memperteguh telapak kakimu."
  },
  {
    "ayat": 12,
    "arabic": "اِذْ يُوْحِيْ رَبُّكَ اِلَى الْمَلٰۤىِٕكَةِ اَنِّيْ مَعَكُمْ فَثَبِّتُوا الَّذِيْنَ اٰمَنُوْاۗ سَاُلْقِيْ فِيْ قُلُوْبِ الَّذِيْنَ كَفَرُوا الرُّعْبَ فَاضْرِبُوْا فَوْقَ الْاَعْنَاقِ وَاضْرِبُوْا مِنْهُمْ كُلَّ بَنَانٍۗ",
    "transliteration_en": "Iz yoohee Rabbuka ilal malaaa'ikati annee ma'akum fasabbitul lazeena aamanoo; sa ulqee fee quloobil lazeena kafarur ru'ba fadriboo fawqal a'naaqi wadriboo minhum kulla banaan",
    "transliteration_id": "Iż yūḥī rabbuka ilal-malā'ikati annī ma‘akum fa ṡabbitul-lażīna āmanū, sa'ulqī fī qulūbil-lażīna kafarur-ru‘ba faḍribū fauqal-a‘nāqi waḍribū minhum kulla banān(in).",
    "translation_en": "[Remember] when your Lord inspired to the angels, \"I am with you, so strengthen those who have believed. I will cast terror into the hearts of those who disbelieved, so strike [them] upon the necks and strike from them every fingertip.\"",
    "translation_id": "(Ingatlah) ketika Tuhanmu mewahyukan kepada para malaikat, “Sesungguhnya Aku bersamamu. Maka, teguhkanlah (pendirian) orang-orang yang beriman. Kelak Aku akan menimpakan rasa takut ke dalam hati orang-orang yang kufur. Maka, tebaslah bagian atas leher mereka dan potonglah tiap-tiap ujung jari mereka."
  },
  {
    "ayat": 13,
    "arabic": "ذٰلِكَ بِاَنَّهُمْ شَاۤقُّوا اللّٰهَ وَرَسُوْلَهٗۚ وَمَنْ يُّشَاقِقِ اللّٰهَ وَرَسُوْلَهٗ فَاِنَّ اللّٰهَ شَدِيْدُ الْعِقَابِ",
    "transliteration_en": "Zaalika bi annahum shaaaqqul laaha wa Rasoolah; wa mai yushaqiqil laaha wa Rasoolahoo fa innal laaha shadeedul 'iqaab",
    "transliteration_id": "Żālika bi'annahum syāqqullāha wa rasūlah(ū), wa may yusyāqiqillāha wa rasūlahū fa innallāha syadīdul-‘iqāb(i).",
    "translation_en": "That is because they opposed Allah and His Messenger. And whoever opposes Allah and His Messenger - indeed, Allah is severe in penalty.",
    "translation_id": "(Ketentuan) yang demikian itu adalah karena sesungguhnya mereka menentang Allah dan Rasul-Nya. Siapa yang menentang Allah dan Rasul-Nya, sesungguhnya Allah sangat keras hukuman-Nya."
  },
  {
    "ayat": 14,
    "arabic": "ذٰلِكُمْ فَذُوْقُوْهُ وَاَنَّ لِلْكٰفِرِيْنَ عَذَابَ النَّارِ",
    "transliteration_en": "Zaalikum fazooqoohu wa anna lilkaafireena 'azaaban Naar",
    "transliteration_id": "Żālikum fa żūqūhu wa anna lil-kāfirīna ‘ażāban-nār(i).",
    "translation_en": "\"That [is yours], so taste it.\" And indeed for the disbelievers is the punishment of the Fire.",
    "translation_id": "Demikian itu (hukuman dunia yang ditimpakan atasmu). Maka, rasakanlah hukuman itu, dan (di hari Kiamat) sesungguhnya bagi orang-orang kafir ada azab neraka."
  },
  {
    "ayat": 15,
    "arabic": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْٓا اِذَا لَقِيْتُمُ الَّذِيْنَ كَفَرُوْا زَحْفًا فَلَا تُوَلُّوْهُمُ الْاَدْبَارَۚ",
    "transliteration_en": "Yaaa aiyuhal lazeena aamanoo izaa laqeetumul lazeena kafaroo zahfan falaa tuwalloohumul adbaar",
    "transliteration_id": "Yā ayyuhal-lażīna āmanū iżā laqītumul-lażīna kafarū zaḥfan falā tuwallūhumul-adbār(a).",
    "translation_en": "O you who have believed, when you meet those who disbelieve advancing [for battle], do not turn to them your backs [in flight].",
    "translation_id": "Wahai orang-orang yang beriman, jika kamu bertemu orang-orang kafir yang akan menyerangmu, janganlah kamu berbalik membelakangi mereka (mundur)."
  },
  {
    "ayat": 16,
    "arabic": "وَمَنْ يُّوَلِّهِمْ يَوْمَىِٕذٍ دُبُرَهٗٓ اِلَّا مُتَحَرِّفًا لِّقِتَالٍ اَوْ مُتَحَيِّزًا اِلٰى فِئَةٍ فَقَدْ بَاۤءَ بِغَضَبٍ مِّنَ اللّٰهِ وَمَأْوٰىهُ جَهَنَّمُ ۗ وَبِئْسَ الْمَصِيْرُ",
    "transliteration_en": "Wa mai yuwallihim yawma'izin duburahooo illaa mutaharrifal liqitaalin aw mutahaiyizan ilaa fi'atin faqad baaa'a bighadabim minal laahi wa maawaahu Jahannamu wa bi'sal maseer",
    "transliteration_id": "Wa may yuwallihim yauma'iżin duburahū illā mutaḥarrifal liqitālin au mutaḥayyizan ilā fi'atin faqad bā'a bigaḍabim minallāhi wa ma'wāhu jahannam(u), wa bi'sal-maṣīr(u).",
    "translation_en": "And whoever turns his back to them on such a day, unless swerving [as a strategy] for war or joining [another] company, has certainly returned with anger [upon him] from Allah, and his refuge is Hell - and wretched is the destination.",
    "translation_id": "Siapa yang mundur pada waktu itu, kecuali berbelok untuk (siasat) perang atau hendak menggabungkan diri dengan pasukan yang lain, dia pasti akan kembali dengan membawa kemurkaan Allah. Tempatnya adalah (neraka) Jahanam dan (itulah) seburuk-buruk tempat kembali."
  },
  {
    "ayat": 17,
    "arabic": "فَلَمْ تَقْتُلُوْهُمْ وَلٰكِنَّ اللّٰهَ قَتَلَهُمْۖ وَمَا رَمَيْتَ اِذْ رَمَيْتَ وَلٰكِنَّ اللّٰهَ رَمٰىۚ وَلِيُبْلِيَ الْمُؤْمِنِيْنَ مِنْهُ بَلَاۤءً حَسَنًاۗ اِنَّ اللّٰهَ سَمِيْعٌ عَلِيْمٌ",
    "transliteration_en": "Falam taqtuloohum wa laakinnal laaha qatalahum; wa maa ramaita iz ramaita wa laakinnal laaha ramaa; wa liyubliyal mu'mineena minhu balaaa'an hasanaa; innal laaha Samee'un Aleem",
    "transliteration_id": "Falam taqtulūhum wa lākinnallāha qatalahum, wa mā ramaita iż ramaita wa lākinallāha ramā, wa liyubliyal-mu'minīna minhu balā'an ḥasanā(n), innallāha samī‘un ‘alīm(un).",
    "translation_en": "And you did not kill them, but it was Allah who killed them. And you threw not, [O Muhammad], when you threw, but it was Allah who threw that He might test the believers with a good test. Indeed, Allah is Hearing and Knowing.",
    "translation_id": "Maka, (sebenarnya) bukan kamu yang membunuh mereka, melainkan Allah yang membunuh mereka dan bukan engkau yang melempar ketika engkau melempar, melainkan Allah yang melempar. (Allah berbuat demikian untuk membinasakan mereka) dan untuk memberi kemenangan kepada orang-orang mukmin dengan kemenangan yang baik. Sesungguhnya Allah Maha Mendengar lagi Maha Mengetahui."
  },
  {
    "ayat": 18,
    "arabic": "ذٰلِكُمْ وَاَنَّ اللّٰهَ مُوْهِنُ كَيْدِ الْكٰفِرِيْنَ",
    "transliteration_en": "Zaalikum wa annal laaha moohinu kaidil kaafireen",
    "transliteration_id": "Żālikum wa annallāha mūhinu kaidil-kāfirīn(a).",
    "translation_en": "That [is so], and [also] that Allah will weaken the plot of the disbelievers.",
    "translation_id": "Demikian itu (adalah kemenangan yang besar) dan sesungguhnya Allah melemahkan tipu daya orang-orang kafir."
  },
  {
    "ayat": 19,
    "arabic": "اِنْ تَسْتَفْتِحُوْا فَقَدْ جَاۤءَكُمُ الْفَتْحُۚ وَاِنْ تَنْتَهُوْا فَهُوَ خَيْرٌ لَّكُمْۚ وَاِنْ تَعُوْدُوْا نَعُدْۚ وَلَنْ تُغْنِيَ عَنْكُمْ فِئَتُكُمْ شَيْـًٔا وَّلَوْ كَثُرَتْۙ وَاَنَّ اللّٰهَ مَعَ الْمُؤْمِنِيْنَ ࣖ",
    "transliteration_en": "In tastaftihoo faqad jaaa'akumul fathu wa in tantahoo fahuwa khairul lakum wa in ta'oodoo na'ud wa lan tughniya 'ankum fi'atukum shai'anw wa law kasurat wa annal laaha ma'al mu'mineen",
    "transliteration_id": "In tastaftiḥū faqad jā'akumul-fatḥ(u), wa in tantahū fa huwa khairul lakum, wa in ta‘ūdū na‘ud, wa lan tugniya ‘ankum fi'atukum syai'aw wa lau kaṡurat, wa anallāha ma‘al-mu'minīn(a).",
    "translation_en": "If you [disbelievers] seek the victory - the defeat has come to you. And if you desist [from hostilities], it is best for you; but if you return [to war], We will return, and never will you be availed by your [large] company at all, even if it should increase; and [that is] because Allah is with the believers.",
    "translation_id": "Jika kamu (kaum kafir) meminta putusan (tentang pihak mana yang benar), sungguh putusan itu telah datang kepadamu (kemenangan kaum muslim pada Perang Badar). Jika kamu berhenti (memusuhi Rasul), itulah yang lebih baik bagimu. Jika kamu kembali (melakukan kezaliman serupa), niscaya Kami akan kembali (mengalahkan kamu). Pasukanmu sedikit pun tidak akan dapat menolak bahaya darimu biarpun (banyak jumlahnya). Sesungguhnya Allah beserta orang-orang yang beriman."
  },
  {
    "ayat": 20,
    "arabic": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْٓا اَطِيْعُوا اللّٰهَ وَرَسُوْلَهٗ وَلَا تَوَلَّوْا عَنْهُ وَاَنْتُمْ تَسْمَعُوْنَ",
    "transliteration_en": "Yaaa aiyuhal lazeena aamanoo atee'ul laaha wa Rasoolahoo wa laa tawallaw 'anhu wa antum tasm'oon",
    "transliteration_id": "Yā ayyuhal-lażīna āmanū aṭī‘ullāha wa rasūlahū wa lā tawallau ‘anhu wa antum tasma‘ūn(a).",
    "translation_en": "O you who have believed, obey Allah and His Messenger and do not turn from him while you hear [his order].",
    "translation_id": "Wahai orang-orang yang beriman, taatlah kepada Allah dan Rasul-Nya dan janganlah kamu berpaling dari-Nya, padahal kamu mendengar (perintah dan larangan-Nya)."
  },
  {
    "ayat": 21,
    "arabic": "وَلَا تَكُوْنُوْا كَالَّذِيْنَ قَالُوْا سَمِعْنَا وَهُمْ لَا يَسْمَعُوْنَۚ",
    "transliteration_en": "Wa laa takoonoo kallazeena qaaloo sami'naa wa hum laa yasma'oon",
    "transliteration_id": "Wa lā takūnū kal-lażīna qālū sami‘nā wa hum lā yasma‘ūn(a).",
    "translation_en": "And do not be like those who say, \"We have heard,\" while they do not hear.",
    "translation_id": "Janganlah kamu menjadi seperti orang-orang (munafik dan musyrik) yang berkata, “Kami mendengarkan.” Padahal, mereka tidak mendengarkan (tidak mengamalkannya)."
  },
  {
    "ayat": 22,
    "arabic": "۞ اِنَّ شَرَّ الدَّوَاۤبِّ عِنْدَ اللّٰهِ الصُّمُّ الْبُكْمُ الَّذِيْنَ لَا يَعْقِلُوْنَ",
    "transliteration_en": "Inna sharrad dawaaabbi 'indal laahis summul bukmul lazeena laa ya'qiloon",
    "transliteration_id": "Inna syarrad-dawābbi ‘indallāhiṣ-ṣummul-bukmul-lażīna lā ya‘qilūn(a).",
    "translation_en": "Indeed, the worst of living creatures in the sight of Allah are the deaf and dumb who do not use reason.",
    "translation_id": "Sesungguhnya seburuk-buruk makhluk yang bergerak di atas bumi dalam pandangan Allah ialah mereka yang tuli dan bisu (tidak mau mendengar dan tidak mau mengatakan kebenaran), yaitu orang-orang yang tidak mengerti."
  },
  {
    "ayat": 23,
    "arabic": "وَلَوْ عَلِمَ اللّٰهُ فِيْهِمْ خَيْرًا لَّاَسْمَعَهُمْۗ وَلَوْ اَسْمَعَهُمْ لَتَوَلَّوْا وَّهُمْ مُّعْرِضُوْنَ",
    "transliteration_en": "Wa law 'alimal laahu feehim khairal la asma'ahum; wa law asma'ahum latawallaw wa hum mu'ridoon",
    "transliteration_id": "Wa lau ‘alimallāhu fīhim khairal la'asma‘ahum, wa lau asma‘ahum latawallau wa hum mu‘riḍūn(a).",
    "translation_en": "Had Allah known any good in them, He would have made them hear. And if He had made them hear, they would [still] have turned away, while they were refusing.",
    "translation_id": "Seandainya Allah mengetahui ada kebaikan pada diri mereka, pasti Dia jadikan mereka dapat mendengar. Seandainya Allah menjadikan mereka dapat mendengar, niscaya mereka berpaling dan memang memalingkan diri."
  },
  {
    "ayat": 24,
    "arabic": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوا اسْتَجِيْبُوْا لِلّٰهِ وَلِلرَّسُوْلِ اِذَا دَعَاكُمْ لِمَا يُحْيِيْكُمْۚ وَاعْلَمُوْٓا اَنَّ اللّٰهَ يَحُوْلُ بَيْنَ الْمَرْءِ وَقَلْبِهٖ وَاَنَّهٗٓ اِلَيْهِ تُحْشَرُوْنَ",
    "transliteration_en": "Yaaa aiyuhal lazeena aamanus tajeeboo lillaahi wa lir Rasooli izaa da'aakum limaa yuhyeekum wa'lamooo annal laaha yahoolu bainal mar'i wa qalbihee wa anahooo ilaihi tuhsharoon",
    "transliteration_id": "Yā ayyuhal-lażīna āmanustajībū lillāhi wa lir-rasūli iżā da‘ākum limā yuḥyīkum, wa‘lamū annallāha yaḥūlu bainal-mar'i wa qalbihī wa annahū ilaihi tuḥsyarūn(a).",
    "translation_en": "O you who have believed, respond to Allah and to the Messenger when he calls you to that which gives you life. And know that Allah intervenes between a man and his heart and that to Him you will be gathered.",
    "translation_id": "Wahai orang-orang yang beriman, penuhilah seruan Allah dan Rasul (Nabi Muhammad) apabila dia menyerumu pada sesuatu yang memberi kehidupan kepadamu! Ketahuilah bahwa sesungguhnya Allah membatasi antara manusia dengan hatinya dan sesungguhnya kepada-Nyalah kamu akan dikumpulkan."
  },
  {
    "ayat": 25,
    "arabic": "وَاتَّقُوْا فِتْنَةً لَّا تُصِيْبَنَّ الَّذِيْنَ ظَلَمُوْا مِنْكُمْ خَاۤصَّةً ۚوَاعْلَمُوْٓا اَنَّ اللّٰهَ شَدِيْدُ الْعِقَابِ",
    "transliteration_en": "Wattaqoo fitnatal laa tuseebannal lazeena zalamoo minkum khaaaassatanw wa'lamooo annal laaha shadeedul 'iqaab",
    "transliteration_id": "Wattaqū fitnatal lā tuṣībannal-lażīna ẓalamū minkum khāṣṣah(tan), wa‘lamū annallāha syadīdul-‘iqāb(i).",
    "translation_en": "And fear a trial which will not strike those who have wronged among you exclusively, and know that Allah is severe in penalty.",
    "translation_id": "Peliharalah dirimu dari siksaan yang tidak hanya menimpa orang-orang yang zalim saja di antara kamu. Ketahuilah bahwa Allah Maha Keras hukuman-Nya."
  },
  {
    "ayat": 26,
    "arabic": "وَاذْكُرُوْٓا اِذْ اَنْتُمْ قَلِيْلٌ مُّسْتَضْعَفُوْنَ فِى الْاَرْضِ تَخَافُوْنَ اَنْ يَّتَخَطَّفَكُمُ النَّاسُ فَاٰوٰىكُمْ وَاَيَّدَكُمْ بِنَصْرِهٖ وَرَزَقَكُمْ مِّنَ الطَّيِّبٰتِ لَعَلَّكُمْ تَشْكُرُوْنَ",
    "transliteration_en": "Wazkurooo iz antum qaleelum mustad 'afoona filardi takhaafoona ai yatakhat tafakumun naasu fa aawaakum wa aiyadakum binasrihee wa razaqakum minat taiyibaati la'allakum tashkuroon",
    "transliteration_id": "Ważkurū iż antum qalīlum mustaḍ‘afūna fil-arḍi takhāfūna ay yatakhaṭṭafakumun-nāsu fa āwākum wa ayyadakum binaṣrihī wa razaqakum minaṭ-ṭayyibāti la‘allakum tasykurūn(a).",
    "translation_en": "And remember when you were few and oppressed in the land, fearing that people might abduct you, but He sheltered you, supported you with His victory, and provided you with good things - that you might be grateful.",
    "translation_id": "Ingatlah ketika kamu (umat Islam) masih (berjumlah) sedikit lagi tertindas di bumi (Makkah). (Saat itu) kamu takut bahwa orang-orang akan menculikmu, lalu Dia memberimu tempat menetap (Madinah), menjadikanmu kuat dengan pertolongan-Nya, dan memberimu rezeki yang baik agar kamu bersyukur."
  },
  {
    "ayat": 27,
    "arabic": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا تَخُوْنُوا اللّٰهَ وَالرَّسُوْلَ وَتَخُوْنُوْٓا اَمٰنٰتِكُمْ وَاَنْتُمْ تَعْلَمُوْنَ",
    "transliteration_en": "Yaaa aiyuhal lazeena aamanoo laa takhoonal laaha war Rasoola wa takhoonooo amaanaatikum wa antum ta'lamoon",
    "transliteration_id": "Yā ayyuhal-lażīna āmanū lā takhūnullāha war-rasūla wa takhūnū amānātikum wa antum ta‘lamūn(a).",
    "translation_en": "O you who have believed, do not betray Allah and the Messenger or betray your trusts while you know [the consequence].",
    "translation_id": "Wahai orang-orang yang beriman, janganlah kamu mengkhianati Allah dan Rasul serta janganlah kamu mengkhianati amanat yang dipercayakan kepadamu, sedangkan kamu mengetahui."
  },
  {
    "ayat": 28,
    "arabic": "وَاعْلَمُوْٓا اَنَّمَآ اَمْوَالُكُمْ وَاَوْلَادُكُمْ فِتْنَةٌ  ۙوَّاَنَّ اللّٰهَ عِنْدَهٗٓ اَجْرٌ عَظِيْمٌ ࣖ",
    "transliteration_en": "Wa'lamooo annamaaa amwaalukum wa awlaadukum fitnatunw wa annal laaha 'indahooo ajrun azeem",
    "transliteration_id": "Wa‘lamū annamā amwālukum wa aulādukum fitnah(tun), wa annallāha ‘indahū ajrun ‘aẓīm(un).",
    "translation_en": "And know that your properties and your children are but a trial and that Allah has with Him a great reward.",
    "translation_id": "Ketahuilah bahwa hartamu dan anak-anakmu itu hanyalah sebagai ujian dan sesungguhnya di sisi Allah ada pahala yang besar."
  },
  {
    "ayat": 29,
    "arabic": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْٓا اِنْ تَتَّقُوا اللّٰهَ يَجْعَلْ لَّكُمْ فُرْقَانًا وَّيُكَفِّرْ عَنْكُمْ سَيِّاٰتِكُمْ وَيَغْفِرْ لَكُمْۗ وَاللّٰهُ ذُو الْفَضْلِ الْعَظِيْمِ",
    "transliteration_en": "Yaaa aiyuhal lazeena aamanooo in tattaqul laaha yaj'al lakum furqaananw wa yukaffir 'ankum saiyi aatikum wa yaghfir lakum; wallaahu zul fadlil 'azeem",
    "transliteration_id": "Yā ayyuhal-lażīna āmanū in tattaqullāha yaj‘al lakum furqānaw wa yukaffir ‘ankum sayyi'ātikum wa yagfir lakum, wallāhu żul-faḍlil-‘aẓīm(i).",
    "translation_en": "O you who have believed, if you fear Allah, He will grant you a criterion and will remove from you your misdeeds and forgive you. And Allah is the possessor of great bounty.",
    "translation_id": "Wahai orang-orang yang beriman, jika kamu bertakwa kepada Allah, niscaya Dia akan memberikan furqan (kemampuan membedakan antara yang hak dan batil) kepadamu, menghapus segala kesalahanmu, dan mengampuni (dosa-dosa)-mu. Allah memiliki karunia yang besar."
  },
  {
    "ayat": 30,
    "arabic": "وَاِذْ يَمْكُرُ بِكَ الَّذِيْنَ كَفَرُوْا لِيُثْبِتُوْكَ اَوْ يَقْتُلُوْكَ اَوْ يُخْرِجُوْكَۗ وَيَمْكُرُوْنَ وَيَمْكُرُ اللّٰهُ ۗوَاللّٰهُ خَيْرُ الْمٰكِرِيْنَ",
    "transliteration_en": "Wa iz yamkuru bikal lazeena kafaroo liyusbitooka aw yaqtulooka aw yukhrijook; wa yamkuroona wa yamkurul laahu wallaahu khairul maakireen",
    "transliteration_id": "Wa iż yamkuru bikal-lażīna kafarū liyuṡbitūka au yaqtulūka au yukhrijūk(a), wa yamkurūna wa yamkurullāh(u), wallāhu khairul-mākirīn(a).",
    "translation_en": "And [remember, O Muhammad], when those who disbelieved plotted against you to restrain you or kill you or evict you [from Makkah]. But they plan, and Allah plans. And Allah is the best of planners.",
    "translation_id": "(Ingatlah) ketika orang-orang yang kufur merencanakan tipu daya terhadapmu (Nabi Muhammad) untuk menahan, membunuh, atau mengusirmu. Mereka membuat tipu daya dan Allah membalas tipu daya itu. Allah adalah sebaik-baik pembalas tipu daya."
  },
  {
    "ayat": 31,
    "arabic": "وَاِذَا تُتْلٰى عَلَيْهِمْ اٰيٰتُنَا قَالُوْا قَدْ سَمِعْنَا لَوْ نَشَاۤءُ لَقُلْنَا مِثْلَ هٰذَآ  ۙاِنْ هٰذَآ اِلَّآ اَسَاطِيْرُ الْاَوَّلِيْنَ",
    "transliteration_en": "Wa izaa tutlaa 'alaihim Aayaatunaa qaaloo qad sami'naa law nashaaa'u laqulnaa misla haazaaa in haazaaa illaaa asaateerul awwaleen",
    "transliteration_id": "Wa iżā tutlā ‘alaihim āyātunā qālū qad sami‘nā lau nasyā'u laqulnā miṡla hāżā, in hāżā illā asāṭīrul-awwalīn(a).",
    "translation_en": "And when Our verses are recited to them, they say, \"We have heard. If we willed, we could say [something] like this. This is not but legends of the former peoples.\"",
    "translation_id": "Apabila ayat-ayat Kami dibacakan kepada mereka, mereka berkata, “Sungguh, kami telah mendengar (yang seperti ini). Jika kami menghendaki, niscaya kami dapat mengucapkan yang seperti ini juga. (Al-Qur’an) ini tidak lain hanyalah dongeng orang-orang terdahulu.”"
  },
  {
    "ayat": 32,
    "arabic": "وَاِذْ قَالُوا اللّٰهُمَّ اِنْ كَانَ هٰذَا هُوَ الْحَقَّ مِنْ عِنْدِكَ فَاَمْطِرْ عَلَيْنَا حِجَارَةً مِّنَ السَّمَاۤءِ اَوِ ائْتِنَا بِعَذَابٍ اَلِيْمٍ",
    "transliteration_en": "Wa iz qaalul laahumma in kaana haazaa huwal haqqa min 'indika fa amtir 'alainaa hijaaratam minas samaaa'i awi'tinaa bi 'azaabin alaeem",
    "transliteration_id": "Wa iż qālullāhumma in kāna hāżā huwal-ḥaqqa min ‘indika fa amṭir ‘alainā ḥijāratam minas-samā'i awi'tinā bi‘ażābin alīm(in).",
    "translation_en": "And [remember] when they said, \"O Allah, if this should be the truth from You, then rain down upon us stones from the sky or bring us a painful punishment.\"",
    "translation_id": "(Ingatlah) ketika mereka (orang-orang musyrik) berkata, “Ya Allah, jika (Al-Qur’an) ini adalah kebenaran dari sisi-Mu, hujanilah kami dengan batu dari langit atau datangkanlah kepada kami azab yang sangat pedih.”"
  },
  {
    "ayat": 33,
    "arabic": "وَمَا كَانَ اللّٰهُ لِيُعَذِّبَهُمْ وَاَنْتَ فِيْهِمْۚ وَمَا كَانَ اللّٰهُ مُعَذِّبَهُمْ وَهُمْ يَسْتَغْفِرُوْنَ",
    "transliteration_en": "Wa maa kanal laahu liyu'az zibahum wa anta feehim; wa maa kaanal laahu mu'az zibahum wa hum yastaghfiroon",
    "transliteration_id": "Wa mā kānallāhu liyu‘ażżibahum wa anta fīhim, wa mā kānallāhu mu‘ażżibahum wa hum yastagfirūn(a).",
    "translation_en": "But Allah would not punish them while you, [O Muhammad], are among them, and Allah would not punish them while they seek forgiveness.",
    "translation_id": "Allah sekali-kali tidak akan mengazab mereka selama engkau (Nabi Muhammad) berada di antara mereka dan Allah sekali-kali tidak akan mengazab mereka selama mereka memohon ampunan."
  },
  {
    "ayat": 34,
    "arabic": "وَمَا لَهُمْ اَلَّا يُعَذِّبَهُمُ اللّٰهُ وَهُمْ يَصُدُّوْنَ عَنِ الْمَسْجِدِ الْحَرَامِ وَمَا كَانُوْٓا اَوْلِيَاۤءَهٗۗ اِنْ اَوْلِيَاۤؤُهٗٓ اِلَّا الْمُتَّقُوْنَ وَلٰكِنَّ اَكْثَرَهُمْ لَا يَعْلَمُوْنَ",
    "transliteration_en": "Wa maa lahum allaa yu'az zibahumul laahu wa hum yasuddoona 'anil Masjidil-Haraami wa maa kaanooo awliyaaa'ah; in awliyaaa' uhooo illal muttaqoona wa laakinna aksarahum laa ya'lamoon",
    "transliteration_id": "Wa mā lahum allā yu‘ażżibahumullāhu wa hum yaṣuddūna ‘anil-masjidil-ḥarāmi wa mā kānū auliyā'ah(ū), in auliyā'uhū illal-muttaqūna wa lākinna akṡarahum lā ya‘lamūn(a).",
    "translation_en": "But why should Allah not punish them while they obstruct [people] from al-Masjid al- Haram and they were not [fit to be] its guardians? Its [true] guardians are not but the righteous, but most of them do not know.",
    "translation_id": "Mengapa Allah tidak mengazab mereka, sedangkan mereka menghalang-halangi (orang) untuk (beribadah di) Masjidilharam? Mereka bukanlah orang-orang yang berhak menjadi pengurusnya. Orang yang berhak menjadi pengurusnya hanyalah orang-orang yang bertakwa, tetapi kebanyakan mereka tidak mengetahui."
  },
  {
    "ayat": 35,
    "arabic": "وَمَا كَانَ صَلَاتُهُمْ عِنْدَ الْبَيْتِ اِلَّا مُكَاۤءً وَّتَصْدِيَةًۗ فَذُوْقُوا الْعَذَابَ بِمَا كُنْتُمْ تَكْفُرُوْنَ",
    "transliteration_en": "Wa maa kaana Salaatuhum 'indal Baiti illa mukaaa anw-wa tasdiyah; fazooqul 'azaaba bimaa kuntum takfuroon",
    "transliteration_id": "Wa mā kāna ṣalātuhum ‘indal-baiti illā mukā'aw wa taṣdiyah(tan), fa żūqul-‘ażāba bimā kuntum takfurūn(a).",
    "translation_en": "And their prayer at the House was not except whistling and handclapping. So taste the punishment for what you disbelieved.",
    "translation_id": "Salat mereka di sekitar Baitullah tidak lain hanyalah siulan dan tepuk tangan. Maka, rasakanlah azab ini karena kamu selalu kufur."
  },
  {
    "ayat": 36,
    "arabic": "اِنَّ الَّذِيْنَ كَفَرُوْا يُنْفِقُوْنَ اَمْوَالَهُمْ لِيَصُدُّوْا عَنْ سَبِيْلِ اللّٰهِ ۗفَسَيُنْفِقُوْنَهَا ثُمَّ تَكُوْنُ عَلَيْهِمْ حَسْرَةً ثُمَّ يُغْلَبُوْنَ ەۗ وَالَّذِيْنَ كَفَرُوْٓا اِلٰى جَهَنَّمَ يُحْشَرُوْنَۙ",
    "transliteration_en": "Innal lazeena kafaroo yunfiqoona amwaalahum liyasuddoo 'an sabeelil laah; fasayunfiqoonahaa summa takoonu 'alaihim hasratan summa yughlaboon; wal lazeena kafarooo ilaa Jahannnama yuhsharoona",
    "transliteration_id": "Innal-lażīna kafarū yunfiqūna amwālahum liyaṣuddū ‘an sabīlillāh(i), fa sayunfiqūnahā ṡumma takūnu ‘alaihim ḥasratan ṡumma yuglabūn(a), wal-lażīna kafarū ilā jahannama yuḥsyarūn(a).",
    "translation_en": "Indeed, those who disbelieve spend their wealth to avert [people] from the way of Allah. So they will spend it; then it will be for them a [source of] regret; then they will be overcome. And those who have disbelieved - unto Hell they will be gathered.",
    "translation_id": "Sesungguhnya orang-orang yang kufur menginfakkan harta mereka untuk menghalang-halangi (orang) dari jalan Allah. Mereka akan (terus) menginfakkan harta itu, kemudian (hal itu) menjadi (sebab) penyesalan yang besar bagi mereka. Akhirnya, mereka akan dikalahkan. Ke (neraka) Jahanamlah orang-orang yang kufur itu akan dikumpulkan"
  },
  {
    "ayat": 37,
    "arabic": "لِيَمِيْزَ اللّٰهُ الْخَبِيْثَ مِنَ الطَّيِّبِ وَيَجْعَلَ الْخَبِيْثَ بَعْضَهٗ عَلٰى بَعْضٍ فَيَرْكُمَهٗ جَمِيْعًا فَيَجْعَلَهٗ فِيْ جَهَنَّمَۗ  اُولٰۤىِٕكَ هُمُ الْخٰسِرُوْنَ ࣖ",
    "transliteration_en": "Liyameezal laahul khabeesa minat taiyibi wa yaj'alal khabeesa ba'dahoo 'ala ba'din fayarkumahoo jamee'an fayaj'alahoo fee Jahannnam; ulaaa'ika humul khaasiroon",
    "transliteration_id": "Liyamīzallāhul-khabīṡa minaṭ-ṭayyibi wa yaj‘alal-khabīṡa ba‘ḍahū ‘alā ba‘ḍin fa yarkumahū jamī‘an fa yaj‘alahū fī jahannam(a), ulā'ika humul-khāsirūn(a).",
    "translation_en": "[This is] so that Allah may distinguish the wicked from the good and place the wicked some of them upon others and heap them all together and put them into Hell. It is those who are the losers.",
    "translation_id": "agar Allah memisahkan (golongan) yang buruk dari yang baik dan menjadikan (golongan) yang buruk itu sebagiannya di atas yang lain, lalu Dia menumpukkan semuanya. Kemudian, Dia menjadikannya ke dalam (neraka) Jahanam. Mereka itulah orang-orang yang rugi."
  },
  {
    "ayat": 38,
    "arabic": "قُلْ لِّلَّذِيْنَ كَفَرُوْٓا اِنْ يَّنْتَهُوْا يُغْفَرْ لَهُمْ مَّا قَدْ سَلَفَۚ وَاِنْ يَّعُوْدُوْا فَقَدْ مَضَتْ سُنَّتُ الْاَوَّلِيْنَ",
    "transliteration_en": "Qul lillazeena kafarooo iny yantahoo yughfar lahum maa qad salafa wa iny ya'oodoo faqad madat sunnatul awwaleen",
    "transliteration_id": "Qul lil-lażīna kafarū in yantahū yugfar lahum mā qad salaf(a), wa iy ya‘ūdū faqad maḍat sunnatul-awwalīn(a).",
    "translation_en": "Say to those who have disbelieved [that] if they cease, what has previously occurred will be forgiven for them. But if they return [to hostility] - then the precedent of the former [rebellious] peoples has already taken place.",
    "translation_id": "Katakanlah (Nabi Muhammad) kepada orang-orang yang kufur itu, “Jika mereka berhenti (dari kekufurannya dan masuk Islam), niscaya akan diampuni dosa-dosa mereka yang telah lalu. Jika mereka kembali lagi (memerangi Nabi), sungguh berlaku (kepada mereka) sunah (aturan Allah untuk menjatuhkan sanksi atas) orang-orang terdahulu.”"
  },
  {
    "ayat": 39,
    "arabic": "وَقَاتِلُوْهُمْ حَتّٰى لَا تَكُوْنَ فِتْنَةٌ وَّيَكُوْنَ الدِّيْنُ كُلُّهٗ لِلّٰهِۚ فَاِنِ انْتَهَوْا فَاِنَّ اللّٰهَ بِمَا يَعْمَلُوْنَ بَصِيْرٌ",
    "transliteration_en": "Wa qaatiloohum hattaa laa takoona fitnatunw wa yakoonaddeenu kulluhoo lillaah; fainin tahaw fa innallaaha bimaa ya'maloona Baseer",
    "transliteration_id": "Wa qātilūhum ḥattā lā takūna fitnatuw wa yakunad-dīnu kulluhū lillāh(i),fa inintahau fa innallāha bimā ya‘malūna baṣīr(un).",
    "translation_en": "And fight them until there is no fitnah and [until] the religion, all of it, is for Allah. And if they cease - then indeed, Allah is Seeing of what they do.",
    "translation_id": "Perangilah mereka sampai tidak ada lagi fitnah (penganiayaan atau syirik) dan agama seutuhnya hanya bagi Allah. Jika mereka berhenti (dari kekufuran), sesungguhnya Allah Maha Melihat apa yang mereka kerjakan."
  },
  {
    "ayat": 40,
    "arabic": "وَاِنْ تَوَلَّوْا فَاعْلَمُوْٓا اَنَّ اللّٰهَ مَوْلٰىكُمْ ۗنِعْمَ الْمَوْلٰى وَنِعْمَ النَّصِيْرُ  ۔",
    "transliteration_en": "Wa in tawallaw fa'lamooo annal laaha mawlaakum; ni'mal mawlaa wa ni'man naseer",
    "transliteration_id": "Wa in tawallau fa‘lamū annallāha maulākum, ni‘mal-maulā wa ni‘man-naṣīr(u).",
    "translation_en": "But if they turn away - then know that Allah is your protector. Excellent is the protector, and Excellent is the helper.",
    "translation_id": "Jika mereka berpaling, ketahuilah bahwa sesungguhnya Allah pelindungmu. Dia adalah sebaik-baik pelindung dan sebaik-baik penolong."
  },
  {
    "ayat": 41,
    "arabic": "۞ وَاعْلَمُوْٓا اَنَّمَا غَنِمْتُمْ مِّنْ شَيْءٍ فَاَنَّ لِلّٰهِ خُمُسَهٗ وَلِلرَّسُوْلِ وَلِذِى الْقُرْبٰى وَالْيَتٰمٰى وَالْمَسٰكِيْنِ وَابْنِ السَّبِيْلِ اِنْ كُنْتُمْ اٰمَنْتُمْ بِاللّٰهِ وَمَآ اَنْزَلْنَا عَلٰى عَبْدِنَا يَوْمَ الْفُرْقَانِ يَوْمَ الْتَقَى الْجَمْعٰنِۗ وَاللّٰهُ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ",
    "transliteration_en": "Wa'lamooo annamaa ghanimtum min sha'in fa anna lillaahi khumusahoo wa lir Rasooli wa lizil qurba walyataamaa walmasaakeeni wabnis sabeeli in kuntum aamantum billaahi wa maaa anzalnaa 'ala 'abdinaa yawmal Furqaani yawmaltaqal jam'aan; wal laahu 'alaa kulli shai'in Qadeer",
    "transliteration_id": "Wa‘lamū annamā ganimtum min syai'in fa anna lillāhi khumusahū wa lir-rasūli wa liżil-qurbā wal-yatāmā wal-masākīni wabnis-sabīli in kuntum āmantum billāhi wa mā anzalnā ‘alā ‘abdinā yaumal-furqāni yaumal-taqal-jam‘ān(i), wallāhu ‘alā kulli syai'in qadīr(un).",
    "translation_en": "And know that anything you obtain of war booty - then indeed, for Allah is one fifth of it and for the Messenger and for [his] near relatives and the orphans, the needy, and the [stranded] traveler, if you have believed in Allah and in that which We sent down to Our Servant on the day of criterion - the day when the two armies met. And Allah, over all things, is competent.",
    "translation_id": "Ketahuilah, sesungguhnya apa pun yang kamu peroleh sebagai rampasan perang, maka seperlimanya untuk Allah, Rasul, kerabat (Rasul), anak-anak yatim, orang-orang miskin, dan ibnusabil, jika kamu beriman kepada Allah dan kepada apa yang Kami turunkan kepada hamba Kami (Nabi Muhammad) pada hari al-furqān (pembeda), yaitu pada hari bertemunya dua pasukan. Allah Maha Kuasa atas segala sesuatu."
  },
  {
    "ayat": 42,
    "arabic": "اِذْ اَنْتُمْ بِالْعُدْوَةِ الدُّنْيَا وَهُمْ بِالْعُدْوَةِ الْقُصْوٰى وَالرَّكْبُ اَسْفَلَ مِنْكُمْۗ وَلَوْ تَوَاعَدْتُّمْ لَاخْتَلَفْتُمْ فِى الْمِيْعٰدِۙ وَلٰكِنْ لِّيَقْضِيَ اللّٰهُ اَمْرًا كَانَ مَفْعُوْلًا ەۙ لِّيَهْلِكَ مَنْ هَلَكَ عَنْۢ بَيِّنَةٍ وَّيَحْيٰى مَنْ حَيَّ عَنْۢ بَيِّنَةٍۗ وَاِنَّ اللّٰهَ لَسَمِيْعٌ عَلِيْمٌۙ",
    "transliteration_en": "Iz antum bil'udwatid dunyaa wa hum bil'udwatil quswaa warrakbu asfala minkum; wa law tawaa'attum lakhtalaftum fil mee'aadi wa laakil liyaqdiyal laahu amran kaana maf'oolal liyahlika man halaka 'am baiyinatinw wa yahyaa man haiya 'am baiyinah; wa innal laaha la Samee'un 'Aleem",
    "transliteration_id": "Iż antum bil-‘udwatid-dun-yā wa hum bil-‘udwatil-quṣwā war-rakbu asfala minkum, wa lau tawā‘attum lakhtalaftum fil-mī‘ād(i), wa lākil liyaqḍiyallāhu amran kāna maf‘ūlā(n), liyahlika man halaka  ‘am bayyinatiw wa yaḥyā may ḥayya ‘am bayyinah(tin), wa innallāha lasamī‘un ‘alīm(un).",
    "translation_en": "[Remember] when you were on the near side of the valley, and they were on the farther side, and the caravan was lower [in position] than you. If you had made an appointment [to meet], you would have missed the appointment. But [it was] so that Allah might accomplish a matter already destined - that those who perished [through disbelief] would perish upon evidence and those who lived [in faith] would live upon evidence; and indeed, Allah is Hearing and Knowing.",
    "translation_id": "(Yaitu,) ketika kamu berada di pinggir lembah yang dekat (kota Madinah) dan mereka berada di pinggir lembah yang jauh (dari kota Madinah), sedangkan kafilah itu berada lebih rendah daripada kamu (menelusuri pantai). Seandainya kamu mengadakan perjanjian (untuk menentukan hari pertempuran), niscaya kamu berbeda pendapat dalam menentukan hari pertempuran itu, tetapi (pertempuran itu terjadi) supaya Allah melaksanakan suatu urusan yang harus terjadi, yaitu agar orang yang binasa itu binasa dengan bukti yang nyata dan agar orang yang hidup itu hidup dengan bukti yang nyata (pula). Sesungguhnya Allah Maha Mendengar lagi Maha Mengetahui."
  },
  {
    "ayat": 43,
    "arabic": "اِذْ يُرِيْكَهُمُ اللّٰهُ فِيْ مَنَامِكَ قَلِيْلًاۗ وَلَوْ اَرٰىكَهُمْ كَثِيْرًا لَّفَشِلْتُمْ وَلَتَنَازَعْتُمْ فِى الْاَمْرِ وَلٰكِنَّ اللّٰهَ سَلَّمَۗ اِنَّهٗ عَلِيْمٌۢ بِذَاتِ الصُّدُوْرِ",
    "transliteration_en": "Iz yureekahumul laahu fee manaamika qaleela; wa law araakahum kaseeral lafashiltum wa latanaaza'tum fil amri wa laakinnal laaha sallam; innahoo 'aleemum bizaatis sudoor",
    "transliteration_id": "Iż yurīkahumullāhu fī manāmika qalīlā(n), wa lau arākahum kaṡīral lafasyiltum wa latanāza‘tum fil-amri wa lākinnallāha sallam(a), innahū ‘alīmum biżātiṣ-ṣudūr(i).",
    "translation_en": "[Remember, O Muhammad], when Allah showed them to you in your dream as few; and if He had shown them to you as many, you [believers] would have lost courage and would have disputed in the matter [of whether to fight], but Allah saved [you from that]. Indeed, He is Knowing of that within the breasts.",
    "translation_id": "(Ingatlah) ketika Allah memperlihatkan mereka kepadamu (Nabi Muhammad) di dalam mimpimu (dalam jumlah) sedikit. Seandainya Allah memperlihatkan mereka kepadamu (dalam jumlah) banyak, niscaya kamu gentar dan kamu akan berbantah-bantahan dalam urusan itu, tetapi Allah telah menyelamatkan (kamu). Sesungguhnya Dia Maha Mengetahui apa yang ada dalam hati."
  },
  {
    "ayat": 44,
    "arabic": "وَاِذْ يُرِيْكُمُوْهُمْ اِذِ الْتَقَيْتُمْ فِيْٓ اَعْيُنِكُمْ قَلِيْلًا وَّيُقَلِّلُكُمْ فِيْٓ اَعْيُنِهِمْ لِيَقْضِيَ اللّٰهُ اَمْرًا كَانَ مَفْعُوْلًا ۗوَاِلَى اللّٰهِ تُرْجَعُ الْاُمُوْرُ ࣖ",
    "transliteration_en": "Wa iz yureekumoohum izil taqaitum feee a'yunikum qaleelanw wa yuqallilukum feee a'yunihim liyaqdiyal laahu amran kaana maf'oolaa; wa ilal laahi turja'ul umoor",
    "transliteration_id": "Wa iż yurīkumūhum iżil-taqaitum fī a‘yunikum qalīlaw wa yuqallilukum fī a‘yunihim liyaqḍiyallāhu amran kāna maf‘ūlā(n), wa ilallāhi turja‘ul-umūr(u).",
    "translation_en": "And [remember] when He showed them to you, when you met, as few in your eyes, and He made you [appear] as few in their eyes so that Allah might accomplish a matter already destined. And to Allah are [all] matters returned.",
    "translation_id": "(Ingatlah) ketika Dia memperlihatkan mereka kepada kamu (orang-orang beriman), ketika kamu berjumpa dengan mereka (berjumlah) sedikit menurut penglihatan matamu dan Dia memperlihatkan kamu (berjumlah) sedikit dalam penglihatan mereka supaya Allah melaksanakan suatu urusan yang harus terjadi. Hanya kepada Allah segala urusan dikembalikan."
  },
  {
    "ayat": 45,
    "arabic": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْٓا اِذَا لَقِيْتُمْ فِئَةً فَاثْبُتُوْا وَاذْكُرُوا اللّٰهَ كَثِيْرًا لَّعَلَّكُمْ تُفْلِحُوْنَۚ",
    "transliteration_en": "Yaaa aiyuhal lazeena aamanooo izaa laqeetum fi'atan fasbutoo wazkurul laaha kaseeral la'allakum tuflihoon",
    "transliteration_id": "Yā ayyuhal-lażīna āmanū iżā laqītum fi'atan faṡbutū ważkurullāha kaṡīral la‘allakum tufliḥūn(a).",
    "translation_en": "O you who have believed, when you encounter a company [from the enemy forces], stand firm and remember Allah much that you may be successful.",
    "translation_id": "Wahai orang-orang yang beriman, apabila kamu bertemu dengan pasukan (musuh), maka berteguh hatilah dan sebutlah (nama) Allah sebanyak-banyaknya agar kamu beruntung."
  },
  {
    "ayat": 46,
    "arabic": "وَاَطِيْعُوا اللّٰهَ وَرَسُوْلَهٗ وَلَا تَنَازَعُوْا فَتَفْشَلُوْا وَتَذْهَبَ رِيْحُكُمْ وَاصْبِرُوْاۗ اِنَّ اللّٰهَ مَعَ الصّٰبِرِيْنَۚ",
    "transliteration_en": "Wa atee'ul laaha wa Rasoolahoo wa laa tanaaza'oo fatafshaloo wa tazhaba reehukum wasbiroo; innal laaha ma'as saabireen",
    "transliteration_id": "Wa aṭī‘ullāha wa rasūlahū wa lā tanāza‘ū fa tafsyalū wa tażhaba rīḥukum waṣbirū, innallāha ma‘aṣ-ṣābirīn(a).",
    "translation_en": "And obey Allah and His Messenger, and do not dispute and [thus] lose courage and [then] your strength would depart; and be patient. Indeed, Allah is with the patient.",
    "translation_id": "Taatilah Allah dan Rasul-Nya, janganlah kamu berbantah-bantahan yang menyebabkan kamu menjadi gentar dan kekuatanmu hilang, serta bersabarlah. Sesungguhnya Allah bersama orang-orang yang sabar."
  },
  {
    "ayat": 47,
    "arabic": "وَلَا تَكُوْنُوْا كَالَّذِيْنَ خَرَجُوْا مِنْ دِيَارِهِمْ بَطَرًا وَّرِئَاۤءَ النَّاسِ وَيَصُدُّوْنَ عَنْ سَبِيْلِ اللّٰهِ ۗوَاللّٰهُ بِمَايَعْمَلُوْنَ مُحِيْطٌ",
    "transliteration_en": "Wa laa takoonoo kallazeena kharajoo min diyaarihim bataranw wa ri'aaa'an naasi wa yasuddoona 'an sabeelil laah; wallaahu bimaa ya'maloona muheet",
    "transliteration_id": "Wa lā takūnū kal-lażīna kharajū min diyārihim baṭaraw wa ri'ā'an-nāsi wa yaṣuddūna ‘an sabīlillāh(i), wallāhu bimā ya‘malūna muḥīṭ(un).",
    "translation_en": "And do not be like those who came forth from their homes insolently and to be seen by people and avert [them] from the way of Allah. And Allah is encompassing of what they do.",
    "translation_id": "Janganlah kamu menjadi seperti orang-orang yang keluar dari kampung halamannya dengan rasa angkuh dan ingin dipuji orang (riya) serta menghalang-halangi (orang) dari jalan Allah. Allah Maha Meliputi apa yang mereka kerjakan."
  },
  {
    "ayat": 48,
    "arabic": "وَاِذْ زَيَّنَ لَهُمُ الشَّيْطٰنُ اَعْمَالَهُمْ وَقَالَ لَا غَالِبَ لَكُمُ الْيَوْمَ مِنَ النَّاسِ وَاِنِّيْ جَارٌ لَّكُمْۚ فَلَمَّا تَرَاۤءَتِ الْفِئَتٰنِ نَكَصَ عَلٰى عَقِبَيْهِ وَقَالَ اِنِّيْ بَرِيْۤءٌ مِّنْكُمْ اِنِّيْٓ اَرٰى مَا لَا تَرَوْنَ اِنِّيْٓ اَخَافُ اللّٰهَ ۗوَاللّٰهُ شَدِيْدُ الْعِقَابِ ࣖ",
    "transliteration_en": "Wa iz zaiyana lahumush shaitaanu a'ma alahum wa qaala laa ghaaliba lakumul yawma minan naasi wa innee jaarul lakum falammaa taraaa'atil fi'ataani nakasa 'alaa aqibaihi wa qaala innee bareee'um minkum innee araa maa laa tarawna inneee akhaaful laah; wallaahu shadeedul 'iqaab",
    "transliteration_id": "Wa iż zayyana lahumusy-syaiṭānu a‘mālahum wa qāla lā gāliba lakumul-yauma minan-nāsi wa innī jārul lakum, falammā tarā'atil-fi'atāni nakaṣa ‘alā ‘aqibaihi wa qāla innī barī'um minkum innī arā mā lā tarauna innī akhāfullāh(a), wallāhu syadīdul-‘iqāb(i).",
    "translation_en": "And [remember] when Satan made their deeds pleasing to them and said, \"No one can overcome you today from among the people, and indeed, I am your protector.\" But when the two armies sighted each other, he turned on his heels and said, \"Indeed, I am disassociated from you. Indeed, I see what you do not see; indeed I fear Allah. And Allah is severe in penalty.\"",
    "translation_id": "(Ingatlah) ketika setan menjadikan terasa indah bagi mereka perbuatan-perbuatan (dosa) mereka dan mengatakan, “Tidak ada (seorang pun) yang dapat mengalahkan kamu pada hari ini dan sesungguhnya aku adalah penolongmu.” Maka, ketika kedua pasukan itu telah saling melihat (berhadapan), ia (setan) berbalik ke belakang seraya berkata, “Sesungguhnya aku berlepas diri dari kamu, sesungguhnya aku melihat apa (para malaikat) yang tidak kamu lihat. Sesungguhnya aku takut kepada Allah.” Allah sangat keras hukuman-Nya."
  },
  {
    "ayat": 49,
    "arabic": "اِذْ يَقُوْلُ الْمُنٰفِقُوْنَ وَالَّذِيْنَ فِيْ قُلُوْبِهِمْ مَّرَضٌ غَرَّ هٰٓؤُلَاۤءِ دِيْنُهُمْۗ وَمَنْ يَّتَوَكَّلْ عَلَى اللّٰهِ فَاِنَّ اللّٰهَ عَزِيْزٌ حَكِيْمٌ",
    "transliteration_en": "Iz yaqoolul munaafiqoona wallazeena fee quloobihim maradun gharra haaa'ulaaa'i deenuhum; wa mai yatawakkal 'alal laahi fa innal laaha 'azee zun Hakeem",
    "transliteration_id": "Iż yaqūlul-munāfiqūna wal-lażīna fī qulūbihim maraḍun garra hā'ulā'i dīnuhum, wa may yatawakkal ‘alallāhi fa innallāha ‘azīzun ḥakīm(un).",
    "translation_en": "[Remember] when the hypocrites and those in whose hearts was disease said, \"Their religion has deluded those [Muslims].\" But whoever relies upon Allah - then indeed, Allah is Exalted in Might and Wise.",
    "translation_id": "(Ingatlah) ketika orang-orang munafik dan orang-orang yang ada penyakit dalam hatinya berkata, “Mereka itu (orang-orang mukmin) ditipu oleh agamanya.” (Allah berfirman,) “Siapa pun yang bertawakal kepada Allah, sesungguhnya Allah Maha Perkasa lagi Maha Bijaksana.”"
  },
  {
    "ayat": 50,
    "arabic": "وَلَوْ تَرٰٓى اِذْ يَتَوَفَّى الَّذِيْنَ كَفَرُوا الْمَلٰۤىِٕكَةُ يَضْرِبُوْنَ وُجُوْهَهُمْ وَاَدْبَارَهُمْۚ وَذُوْقُوْا عَذَابَ الْحَرِيْقِ",
    "transliteration_en": "Wa law taraaa iz yatawaf fal lazeena kafarul malaaa'ikatu yadriboona wujoohahum wa adbaarahum wa zooqoo 'azaabal hareeq",
    "transliteration_id": "Wa lau tarā iż yatawaffal-lażīna kafarul-malā'ikatu yaḍribūna wujūhahum wa adbārahum, wa żūqū ‘ażābal-ḥarīq(i).",
    "translation_en": "And if you could but see when the angels take the souls of those who disbelieved... They are striking their faces and their backs and [saying], \"Taste the punishment of the Burning Fire.",
    "translation_id": "Seandainya engkau melihat ketika para malaikat mencabut nyawa orang-orang yang kafir sambil memukul wajah-wajah dan punggung-punggung mereka (dan berkata), “Rasakanlah olehmu siksa yang membakar,” (niscaya engkau saksikan sesuatu yang sangat dahsyat)."
  }
]