[
  {
    "ayat": 51,
    "arabic": "ذٰلِكَ بِمَا قَدَّمَتْ اَيْدِيْكُمْ وَاَنَّ اللّٰهَ لَيْسَ بِظَلَّامٍ لِّلْعَبِيْدِۙ",
    "transliteration_en": "Zaalika bimaa qaddamat aideekum wa anal laaha laisa bizallaamil lil 'abeed",
    "transliteration_id": "Żālika bimā qaddamat aidīkum wa annallāha laisa biẓallāmil lil-‘abīd(i).",
    "translation_en": "That is for what your hands have put forth [of evil] and because Allah is not ever unjust to His servants.\"",
    "translation_id": "Yang demikian itu disebabkan oleh perbuatan tanganmu (sendiri) dan sesungguhnya Allah (sama sekali) tidak menzalimi hamba-hamba-Nya."
  },
  {
    "ayat": 52,
    "arabic": "كَدَأْبِ اٰلِ فِرْعَوْنَۙ وَالَّذِيْنَ مِنْ قَبْلِهِمْۗ  كَفَرُوْا بِاٰيٰتِ اللّٰهِ فَاَخَذَهُمُ اللّٰهُ بِذُنُوْبِهِمْۗ اِنَّ اللّٰهَ قَوِيٌّ شَدِيْدُ الْعِقَابِ",
    "transliteration_en": "Kadaabi Aali Fir'awna wal lazeena min qablihim; kafaroo bi Aayaatil laahi fa akhazahu mul laahu bizunoobihim; innal laaha qawiyyun shadeedul 'iqaab",
    "transliteration_id": "Kada'bi āli fir‘aun(a), wal-lażīna min qablihim, kafarū bi'āyātillāhi fa akhażahumullāhu biżunūbihim, innallāha qawiyyun syadīdul-‘iqāb(i).",
    "translation_en": "[Theirs is] like the custom of the people of Pharaoh and of those before them. They disbelieved in the signs of Allah, so Allah seized them for their sins. Indeed, Allah is Powerful and severe in penalty.",
    "translation_id": "(Keadaan mereka) serupa dengan keadaan pengikut Fir‘aun dan orang-orang yang sebelum mereka. Mereka mengingkari ayat-ayat Allah, maka Allah menyiksa mereka disebabkan dosa-dosanya. Sesungguhnya Allah Maha Kuat lagi sangat keras hukuman-Nya."
  },
  {
    "ayat": 53,
    "arabic": "ذٰلِكَ بِاَنَّ اللّٰهَ لَمْ يَكُ مُغَيِّرًا نِّعْمَةً اَنْعَمَهَا عَلٰى قَوْمٍ حَتّٰى يُغَيِّرُوْا مَا بِاَنْفُسِهِمْۙ وَاَنَّ اللّٰهَ سَمِيْعٌ عَلِيْمٌۙ",
    "transliteration_en": "Zaalika bi annal laaha lam yaku mughaiyiran ni matan an'amahaa 'alaa qawmin hattaa yughaiyiroo maa bianfusihim wa annallaaha samee un 'Aleem",
    "transliteration_id": "Żālika bi'annallāha lam yaku mugayyiran ni‘matan an‘amahā ‘alā qaumin ḥattā yugayyirū mā bi'anfusihim, wa annallāha samī‘un ‘alīm(un).",
    "translation_en": "That is because Allah would not change a favor which He had bestowed upon a people until they change what is within themselves. And indeed, Allah is Hearing and Knowing.",
    "translation_id": "Yang demikian itu karena sesungguhnya Allah tidak akan mengubah suatu nikmat yang telah dianugerahkan-Nya kepada suatu kaum sehingga mereka mengubah apa yang ada pada diri mereka. Sesungguhnya Allah Maha Mendengar lagi Maha Mengetahui."
  },
  {
    "ayat": 54,
    "arabic": "كَدَأْبِ اٰلِ فِرْعَوْنَۙ وَالَّذِيْنَ مِنْ قَبْلِهِمْۚ  كَذَّبُوْا بِاٰيٰتِ رَبِّهِمْ فَاَهْلَكْنٰهُمْ بِذُنُوْبِهِمْ وَاَغْرَقْنَآ اٰلَ فِرْعَوْنَۚ وَكُلٌّ كَانُوْا ظٰلِمِيْنَ",
    "transliteration_en": "Kadaabi Aali Fir'awna wallazeena min qablihim; kazzaboo bi Aayaati Rabbihim faahlaknaahum bizunoobihim wa aghraqnaa Aala Fir'awn; wa kullun kaanoo zaalimeen",
    "transliteration_id": "Kada'bi āli fir‘aun(a), wal-lażīna min qablihim, każżabū bi'āyāti rabbihim fa ahlaknāhum biżunūbihim wa agraqnā āla fir‘aun(a), wa kullun kānū ẓālimīn(a).",
    "translation_en": "[Theirs is] like the custom of the people of Pharaoh and of those before them. They denied the signs of their Lord, so We destroyed them for their sins, and We drowned the people of Pharaoh. And all [of them] were wrongdoers.",
    "translation_id": "(Keadaan mereka) serupa dengan keadaan pengikut Fir‘aun dan orang-orang yang sebelum mereka. Mereka mendustakan ayat-ayat Tuhannya. Maka, Kami membinasakan mereka disebabkan oleh dosa-dosanya dan Kami tenggelamkan pengikut Fir‘aun (bersamanya). Semuanya adalah orang-orang zalim."
  },
  {
    "ayat": 55,
    "arabic": "اِنَّ شَرَّ الدَّوَاۤبِّ عِنْدَ اللّٰهِ الَّذِيْنَ كَفَرُوْا فَهُمْ لَا يُؤْمِنُوْنَۖ",
    "transliteration_en": "Inna sharrad dawaaabbi 'indal laahil lazeena kafaroo fahum laa yu'minoon",
    "transliteration_id": "Inna syarrad-dawābbi ‘indallāhil-lażīna kafarū fahum lā yu'minūn(a).",
    "translation_en": "Indeed, the worst of living creatures in the sight of Allah are those who have disbelieved, and they will not [ever] believe -",
    "translation_id": "Sesungguhnya seburuk-buruk makhluk melata dalam pandangan Allah ialah orang-orang yang kufur karena mereka tidak beriman."
  },
  {
    "ayat": 56,
    "arabic": "الَّذِيْنَ عَاهَدْتَّ مِنْهُمْ ثُمَّ يَنْقُضُوْنَ عَهْدَهُمْ فِيْ كُلِّ مَرَّةٍ وَّهُمْ لَا يَتَّقُوْنَ",
    "transliteration_en": "Allazeena'aahatta min hum summa yanqudoona 'ahdahum fee kulli marratinw wa hum laa yattaqoon",
    "transliteration_id": "Allażīna ‘āhatta minhum ṡumma yanquḍūna ‘ahdahum fī kulli marratiw wa hum lā yattaqūn(a).",
    "translation_en": "The ones with whom you made a treaty but then they break their pledge every time, and they do not fear Allah.",
    "translation_id": "(Yaitu,) orang-orang yang engkau telah mengikat perjanjian dengan mereka, kemudian setiap kali berjanji mereka mengkhianati janjinya sedangkan mereka tidak bertakwa."
  },
  {
    "ayat": 57,
    "arabic": "فَاِمَّا تَثْقَفَنَّهُمْ فِى الْحَرْبِ فَشَرِّدْ بِهِمْ مَّنْ خَلْفَهُمْ لَعَلَّهُمْ يَذَّكَّرُوْنَ",
    "transliteration_en": "Fa immaa tasqafannahum fil harbi fasharrid bihim man khalfahum la'allahum yazzakkaroon",
    "transliteration_id": "Fa immā taṡqafannahum fil-ḥarbi fa syarrid bihim man khalfahum la‘allahum yażżakkarūn(a).",
    "translation_en": "So if you, [O Muhammad], gain dominance over them in war, disperse by [means of] them those behind them that perhaps they will be reminded.",
    "translation_id": "Maka, jika engkau (Nabi Muhammad) benar-benar mendapati mereka dalam peperangan, cerai-beraikanlah orang-orang yang di belakang mereka dengan (menumpas) mereka agar mereka mengambil pelajaran."
  },
  {
    "ayat": 58,
    "arabic": "وَاِمَّا تَخَافَنَّ مِنْ قَوْمٍ خِيَانَةً فَانْۢبِذْ اِلَيْهِمْ عَلٰى سَوَاۤءٍۗ اِنَّ اللّٰهَ لَا يُحِبُّ الْخَاۤىِٕنِيْنَ ࣖ",
    "transliteration_en": "Wa immaa takhaafana min qawmin khiyaanatan fambiz ilaihim 'alaa sawaaa'; innal laaha laayuhibbul khaaa'ineen",
    "transliteration_id": "Wa immā takhāfanna min qaumin khiyānatan fambiż  ilaihim ‘alā sawā'(in), innallāha lā yuḥibbul-khā'inīn(a).",
    "translation_en": "If you [have reason to] fear from a people betrayal, throw [their treaty] back to them, [putting you] on equal terms. Indeed, Allah does not like traitors.",
    "translation_id": "Jika engkau (Nabi Muhammad) benar-benar khawatir (akan terjadi) pengkhianatan dari suatu kaum, kembalikanlah (perjanjian itu) kepada mereka dengan cara seimbang (adil dan jujur). Sesungguhnya Allah tidak menyukai para pengkhianat."
  },
  {
    "ayat": 59,
    "arabic": "وَلَا يَحْسَبَنَّ الَّذِيْنَ كَفَرُوْا سَبَقُوْاۗ اِنَّهُمْ لَا يُعْجِزُوْنَ",
    "transliteration_en": "Wa laa yahsabannal lazeena kafaroo sabaqooo; innahum laa yu'jizoon",
    "transliteration_id": "Wa lā yaḥsabannal-lażīna kafarū sabaqū, innahum lā yu‘jizūn(a).",
    "translation_en": "And let not those who disbelieve think they will escape. Indeed, they will not cause failure [to Allah].",
    "translation_id": "Janganlah sekali-kali orang-orang kafir itu mengira (bahwa) mereka dapat lolos (dari kekuasaan Allah). Sesungguhnya mereka tidak dapat melemahkan (Allah)."
  },
  {
    "ayat": 60,
    "arabic": "وَاَعِدُّوْا لَهُمْ مَّا اسْتَطَعْتُمْ مِّنْ قُوَّةٍ وَّمِنْ رِّبَاطِ الْخَيْلِ تُرْهِبُوْنَ بِهٖ عَدُوَّ اللّٰهِ وَعَدُوَّكُمْ وَاٰخَرِيْنَ مِنْ دُوْنِهِمْۚ  لَا تَعْلَمُوْنَهُمْۚ  اَللّٰهُ يَعْلَمُهُمْۗ وَمَا تُنْفِقُوْا مِنْ شَيْءٍ فِيْ سَبِيْلِ اللّٰهِ يُوَفَّ اِلَيْكُمْ وَاَنْتُمْ لَا تُظْلَمُوْنَ",
    "transliteration_en": "Wa a'iddoo lahum mastata'tum min quwwatinw wa mirribaatil khaili turhiboona bihee 'aduwwal laahi wa 'aduwwakum wa aakhareena min doonihim laa ta'lamoo nahum Allaahu ya'lamuhum; wa maa tunfiqoo min shai'in fee sabeelil laahi yuwaf failaikum wa antum laa tuzlamoon",
    "transliteration_id": "Wa a‘iddū lahum mastaṭa‘tum min quwwatiw wa mir ribāṭil-khaili turhibūna bihī ‘aduwwallāhi wa ‘aduwwakum wa ākharīna min dūnihim, lā ta‘lamūnahum, allāhu ya‘lamuhum, wa mā tunfiqū min syai'in fī sabīlillāhi yuwaffa ilaikum wa antum lā tuẓlamūn(a).",
    "translation_en": "And prepare against them whatever you are able of power and of steeds of war by which you may terrify the enemy of Allah and your enemy and others besides them whom you do not know [but] whom Allah knows. And whatever you spend in the cause of Allah will be fully repaid to you, and you will not be wronged.",
    "translation_id": "Persiapkanlah untuk (menghadapi) mereka apa yang kamu mampu, berupa kekuatan (yang kamu miliki) dan pasukan berkuda. Dengannya (persiapan itu) kamu membuat gentar musuh Allah, musuh kamu dan orang-orang selain mereka yang kamu tidak mengetahuinya, (tetapi) Allah mengetahuinya. Apa pun yang kamu infakkan di jalan Allah niscaya akan dibalas secara penuh kepadamu, sedangkan kamu tidak akan dizalimi."
  },
  {
    "ayat": 61,
    "arabic": "۞ وَاِنْ جَنَحُوْا لِلسَّلْمِ فَاجْنَحْ لَهَا وَتَوَكَّلْ عَلَى اللّٰهِ ۗاِنَّهٗ هُوَ السَّمِيْعُ الْعَلِيْمُ",
    "transliteration_en": "Wa in janahoo lissalmi fajnah lahaa wa tawakkal 'alal laah; innahoo Huwas Samee'ul 'Aleem",
    "transliteration_id": "Wa in janaḥū lis-salmi fajnaḥ lahā wa tawakkal ‘alallāh(i), innahū huwas-samī‘ul-‘alīm(u).",
    "translation_en": "And if they incline to peace, then incline to it [also] and rely upon Allah. Indeed, it is He who is the Hearing, the Knowing.",
    "translation_id": "(Akan tetapi,) jika mereka condong pada perdamaian, condonglah engkau (Nabi Muhammad) padanya dan bertawakallah kepada Allah. Sesungguhnya hanya Dialah Yang Maha Mendengar lagi Maha Mengetahui."
  },
  {
    "ayat": 62,
    "arabic": "وَاِنْ يُّرِيْدُوْٓا اَنْ يَّخْدَعُوْكَ فَاِنَّ حَسْبَكَ اللّٰهُ ۗهُوَ الَّذِيْٓ اَيَّدَكَ بِنَصْرِهٖ وَبِالْمُؤْمِنِيْنَۙ",
    "transliteration_en": "Wa iny yureedooo any-yakhda'ooka fainna hasbakal laah; Huwal lazeee aiyadaka binasrihee wa bilmu'mineen",
    "transliteration_id": "Wa iy yurīdū ay yakhda‘ūka fa inna ḥasbakallāh(u), huwal-lażī ayyadaka binaṣrihī wa bil-mu'minīn(a).",
    "translation_en": "But if they intend to deceive you - then sufficient for you is Allah. It is He who supported you with His help and with the believers",
    "translation_id": "Jika mereka hendak menipumu, sesungguhnya cukuplah Allah (menjadi Pelindung) bagimu. Dialah yang memperkuat kamu dengan pertolongan-Nya dan dengan (dukungan) orang-orang mukmin."
  },
  {
    "ayat": 63,
    "arabic": "وَاَلَّفَ بَيْنَ قُلُوْبِهِمْۗ  لَوْاَنْفَقْتَ مَا فِى الْاَرْضِ جَمِيْعًا مَّآ اَلَّفْتَ بَيْنَ قُلُوْبِهِمْ وَلٰكِنَّ اللّٰهَ اَلَّفَ بَيْنَهُمْۗ اِنَّهٗ عَزِيْزٌ حَكِيْمٌ",
    "transliteration_en": "Wa allafa baina quloobihim; law anfaqta maa fil ardi jamee'am maaa allafta baina quloobihim wa laakinnallaaha allafa bainahum; innaahoo 'Azeezun Hakeem",
    "transliteration_id": "Wa allafa baina qulūbihim, lau anfaqta mā fil-arḍi jamī‘am mā allafta baina qulūbihim wa lākinnallāha allafa bainahum, innahū ‘azīzun ḥakīm(un).",
    "translation_en": "And brought together their hearts. If you had spent all that is in the earth, you could not have brought their hearts together; but Allah brought them together. Indeed, He is Exalted in Might and Wise.",
    "translation_id": "Dia (Allah) mempersatukan hati mereka (orang yang beriman). Seandainya engkau (Nabi Muhammad) menginfakkan semua (kekayaan) yang berada di bumi, niscaya engkau tidak dapat mempersatukan hati mereka, tetapi Allah telah mempersatukan hati mereka. Sesungguhnya Dia Maha Perkasa lagi Maha Bijaksana."
  },
  {
    "ayat": 64,
    "arabic": "يٰٓاَيُّهَا النَّبِيُّ حَسْبُكَ اللّٰهُ وَمَنِ اتَّبَعَكَ مِنَ الْمُؤْمِنِيْنَ ࣖ",
    "transliteration_en": "Yaaa aiyuhan Nabiyyu hasbukal laahu wa manittaba 'aka minal mu'mineen",
    "transliteration_id": "Yā ayyuhan-nabiyyu ḥasbukallāhu wa manittaba‘aka minal-mu'minīn(a).",
    "translation_en": "O Prophet, sufficient for you is Allah and for whoever follows you of the believers.",
    "translation_id": "Wahai Nabi (Muhammad), cukuplah Allah (menjadi pelindung) bagi engkau dan bagi orang-orang mukmin yang mengikutimu."
  },
  {
    "ayat": 65,
    "arabic": "يٰٓاَيُّهَا النَّبِيُّ حَرِّضِ الْمُؤْمِنِيْنَ عَلَى الْقِتَالِۗ اِنْ يَّكُنْ مِّنْكُمْ عِشْرُوْنَ صٰبِرُوْنَ يَغْلِبُوْا مِائَتَيْنِۚ وَاِنْ يَّكُنْ مِّنْكُمْ مِّائَةٌ يَّغْلِبُوْٓا اَلْفًا مِّنَ الَّذِيْنَ كَفَرُوْا بِاَنَّهُمْ قَوْمٌ لَّا يَفْقَهُوْنَ",
    "transliteration_en": "Yaaa aiyuhan Nabiyyu harridil mu'mineena 'alal qitaal; iny-yakum minkum 'ishroona saabiroona yaghliboo mi'atayn; wa iny-yakum minkum min'atuny yaghlibooo alfam minal lazeena kafaroo bi anahum qawmul laa yafqahoon",
    "transliteration_id": "Yā ayyuhan-nabiyyu ḥarriḍil-mu'minīna ‘alal-qitāl(i), iy yakum minkum ‘isyrūna ṣabirūna yaglibū mi'atain(i), wa iy yakum minkum mi'atuy yaglibū alfam minal-lażīna kafarū bi'annahum qaumul lā yafqahūn(a).",
    "translation_en": "O Prophet, urge the believers to battle. If there are among you twenty [who are] steadfast, they will overcome two hundred. And if there are among you one hundred [who are] steadfast, they will overcome a thousand of those who have disbelieved because they are a people who do not understand.",
    "translation_id": "Wahai Nabi (Muhammad), kobarkanlah semangat orang-orang mukmin untuk berperang. Jika ada dua puluh orang yang sabar di antara kamu, niscaya mereka dapat mengalahkan dua ratus (orang musuh); dan jika ada seratus orang (yang sabar) di antara kamu, niscaya mereka dapat mengalahkan seribu orang kafir karena mereka (orang-orang kafir itu) adalah kaum yang tidak memahami."
  },
  {
    "ayat": 66,
    "arabic": "اَلْـٰٔنَ خَفَّفَ اللّٰهُ عَنْكُمْ وَعَلِمَ اَنَّ فِيْكُمْ ضَعْفًاۗ فَاِنْ يَّكُنْ مِّنْكُمْ مِّائَةٌ صَابِرَةٌ يَّغْلِبُوْا مِائَتَيْنِۚ وَاِنْ يَّكُنْ مِّنْكُمْ اَلْفٌ يَّغْلِبُوْٓا اَلْفَيْنِ بِاِذْنِ اللّٰهِ ۗوَاللّٰهُ مَعَ الصّٰبِرِيْنَ",
    "transliteration_en": "Al'aana khaffafal laahu 'ankum wa 'alima anna feekum da'faa; fa-iny yakum minkum mi'atun saabiratuny yaghliboo mi'atayn; wa iny-yakum minkum alfuny yaghlibooo alfaini bi iznil laah; wallaahu ma'as saabireen",
    "transliteration_id": "Al'āna khaffafallāhu ‘ankum wa ‘alima anna fīkum ḍa‘fā(n), fa iy yakum minkum mi'atun ṣābiratuy yaglibū mi'atain(i), wa iy yakum minkum alfuy yaglibū alfaini bi'iżnillāh(i), wallāhu ma‘aṣ-ṣābirīn(a).",
    "translation_en": "Now, Allah has lightened [the hardship] for you, and He knows that among you is weakness. So if there are from you one hundred [who are] steadfast, they will overcome two hundred. And if there are among you a thousand, they will overcome two thousand by permission of Allah. And Allah is with the steadfast.",
    "translation_id": "Sekarang (saat turunnya ayat ini) Allah telah meringankan kamu karena Dia mengetahui sesungguhnya ada kelemahan padamu. Jika di antara kamu ada seratus orang yang sabar, niscaya mereka dapat mengalahkan dua ratus (orang musuh) dan jika di antara kamu ada seribu orang (yang sabar), niscaya mereka dapat mengalahkan dua ribu orang dengan seizin Allah. Allah beserta orang-orang yang sabar."
  },
  {
    "ayat": 67,
    "arabic": "مَاكَانَ لِنَبِيٍّ اَنْ يَّكُوْنَ لَهٗٓ اَسْرٰى حَتّٰى يُثْخِنَ فِى الْاَرْضِۗ تُرِيْدُوْنَ عَرَضَ الدُّنْيَاۖ وَاللّٰهُ يُرِيْدُ الْاٰخِرَةَۗ وَاللّٰهُ عَزِيْزٌحَكِيْمٌ",
    "transliteration_en": "Maa kaana li Nabiyyin ai yakoona lahooo asraa hatta yuskhina fil ard; tureedoona aradad dunyaa wallaahu yureedul Aakhirah; wallaahu 'Azeezun Hakeem",
    "transliteration_id": "Mā kāna linabiyyin ay yakūna lahū asrā ḥattā yuṡkhina fil-arḍ(i), turīdūna ‘araḍad-dun-yā, wallāhu yurīdul-ākhirah(ta), wallāhu ‘azīzun ḥakīm(un).",
    "translation_en": "It is not for a prophet to have captives [of war] until he inflicts a massacre [upon Allah 's enemies] in the land. Some Muslims desire the commodities of this world, but Allah desires [for you] the Hereafter. And Allah is Exalted in Might and Wise.",
    "translation_id": "Tidaklah (sepatutnya) bagi seorang nabi mempunyai tawanan sebelum dia dapat melumpuhkan musuhnya di bumi. Kamu menghendaki harta benda duniawi, sedangkan Allah menghendaki (pahala) akhirat (untukmu). Allah Maha Perkasa lagi Maha Bijaksana."
  },
  {
    "ayat": 68,
    "arabic": "لَوْلَاكِتٰبٌ مِّنَ اللّٰهِ سَبَقَ لَمَسَّكُمْ فِيْمَآ اَخَذْتُمْ عَذَابٌ عَظِيْمٌ",
    "transliteration_en": "Law laa Kitaabum minal laahi sabaqa lamassakum fee maaa akhaztum 'azaabun 'azeem",
    "transliteration_id": "Lau lā kitābum minallāhi sabaqa lamassakum fīmā akhażtum ‘ażābun ‘aẓīm(un).",
    "translation_en": "If not for a decree from Allah that preceded, you would have been touched for what you took by a great punishment.",
    "translation_id": "Seandainya tidak ada ketetapan terdahulu dari Allah, niscaya kamu ditimpa siksaan yang besar karena (tebusan) yang kamu ambil."
  },
  {
    "ayat": 69,
    "arabic": "فَكُلُوْا مِمَّاغَنِمْتُمْ حَلٰلًا طَيِّبًاۖ وَّاتَّقُوا اللّٰهَ ۗاِنَّ اللّٰهَ غَفُوْرٌ رَّحِيْمٌ",
    "transliteration_en": "Fakuloo mimaa ghanimtum halaalan taiyibaa; watta qullaah; innal laaha Ghafoorur Raheem",
    "transliteration_id": "Fa kulū mimmā ganimtum ḥalālan ṭayyibā(n), wattaqullāh(a), innallāha gafūrur raḥīm(un).",
    "translation_en": "So consume what you have taken of war booty [as being] lawful and good, and fear Allah. Indeed, Allah is Forgiving and Merciful.",
    "translation_id": "(Jika demikian halnya ketetapan Allah,) makanlah (dan manfaatkanlah) sebagian rampasan perang yang telah kamu peroleh itu sebagai makanan yang halal lagi baik dan bertakwalah kepada Allah. Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang."
  },
  {
    "ayat": 70,
    "arabic": "يٰٓاَيُّهَا النَّبِيُّ قُلْ لِّمَنْ فِيْٓ اَيْدِيْكُمْ مِّنَ الْاَسْرٰٓىۙ اِنْ يَّعْلَمِ اللّٰهُ فِيْ قُلُوْبِكُمْ خَيْرًا يُّؤْتِكُمْ خَيْرًا مِّمَّآ اُخِذَ مِنْكُمْ وَيَغْفِرْ لَكُمْۗ وَاللّٰهُ غَفُوْرٌ رَّحِيْمٌ ࣖ",
    "transliteration_en": "Yaaa aiyuhan Nabiyyu qul liman feee aideekum minal asraaa iny-ya lamillaahu fee quloobikum khairany yu'tikum khayram mimmaaa ukhiza minkum wa yaghfir lakum; wallaahu Ghafoorur Raheem",
    "transliteration_id": "Yā ayyuhan-nabiyyu qul liman fī aidīkum minal-asrā, iy ya‘lamillāhu fī qulūbikum khairay yu'tikum khairam mimmā ukhiża minkum wa yagfir lakum, wallāhu gafūrur raḥīm(un).",
    "translation_en": "O Prophet, say to whoever is in your hands of the captives, \"If Allah knows [any] good in your hearts, He will give you [something] better than what was taken from you, and He will forgive you; and Allah is Forgiving and Merciful.\"",
    "translation_id": "Wahai Nabi (Muhammad), katakanlah kepada para tawanan perang yang ada di tanganmu, “Jika Allah mengetahui ada kebaikan di dalam hatimu, niscaya Dia akan menganugerahkan kepada kamu yang lebih baik daripada apa (tebusan) yang telah diambil dari kamu dan Dia akan mengampuni kamu.” Allah Maha Pengampun lagi Maha Penyayang."
  },
  {
    "ayat": 71,
    "arabic": "وَاِنْ يُّرِيْدُوْا خِيَانَتَكَ فَقَدْ خَانُوا اللّٰهَ مِنْ قَبْلُ فَاَمْكَنَ مِنْهُمْ وَاللّٰهُ عَلِيْمٌ حَكِيْمٌ",
    "transliteration_en": "Wa iny-yureedoo khiyaa nataka faqad khaanullaaha min qablu fa amkana minhum; wallaahu 'aleemum Hakeem",
    "transliteration_id": "Wa iy yurīdū khiyānataka faqad khānullāha min qablu fa amkana minhum wallāhu ‘alīmun ḥakim(un).",
    "translation_en": "But if they intend to betray you - then they have already betrayed Allah before, and He empowered [you] over them. And Allah is Knowing and Wise.",
    "translation_id": "Akan tetapi, jika mereka (para tawanan itu) hendak mengkhianatimu (Nabi Muhammad), sungguh sebelumnya mereka telah berkhianat kepada Allah. Lalu, Dia menjadikanmu menguasai mereka (pada perang Badar). Allah Maha Mengetahui lagi Maha Bijaksana."
  },
  {
    "ayat": 72,
    "arabic": "اِنَّ الَّذِيْنَ اٰمَنُوْا وَهَاجَرُوْا وَجَاهَدُوْا بِاَمْوَالِهِمْ وَاَنْفُسِهِمْ فِيْ سَبِيْلِ اللّٰهِ وَالَّذِيْنَ اٰوَوْا وَّنَصَرُوْٓا اُولٰۤىِٕكَ بَعْضُهُمْ اَوْلِيَاۤءُ بَعْضٍۗ وَالَّذِيْنَ اٰمَنُوْا وَلَمْ يُهَاجِرُوْا مَا لَكُمْ مِّنْ وَّلَايَتِهِمْ مِّنْ شَيْءٍ حَتّٰى يُهَاجِرُوْاۚ وَاِنِ اسْتَنْصَرُوْكُمْ فِى الدِّيْنِ فَعَلَيْكُمُ النَّصْرُ اِلَّا عَلٰى قَوْمٍۢ بَيْنَكُمْ وَبَيْنَهُمْ مِّيْثَاقٌۗ وَاللّٰهُ بِمَا تَعْمَلُوْنَ بَصِيْرٌ",
    "transliteration_en": "Innal lazeena aamanoo wa haajaroo wa jaahadoo bi amwaalihim wa anfusihim fee sabeelil laahi wallazeena aawaw wa nasarooo ulaaa'ika ba'duhum awliyaaa'u ba'd; wallazeena aamanoo wa lam yuhaajiroo maa lakum minw walaayatihim min shai'in hatta yuhaajiroo; wa inistan sarookum fid deeni fa'alaiku munnasru illaa 'alaa qawmim bainakum wa bainahum meesaaq; wallaahu bimaa ta'maloona Baseer",
    "transliteration_id": "Innal-lażīna āmanū wa hājarū wa jāhadū bi'amwālihim wa anfusihim fī sabīlillāhi wal-lażīna āwaw wa naṣarū ulā'ika ba‘ḍuhum auliyā'u ba‘ḍ(in), wal-lażīna āmanū wa lam yuhājirū mā lakum miw walāyatihim min syai'in ḥattā yuhājirū, wa inistanṣarūkum fid-dīni fa ‘alaikumun naṣru illā ‘alā qaumim bainakum wa bainahum mīṡāq(un), wallāhu bimā ta‘malūna baṣīr(un).",
    "translation_en": "Indeed, those who have believed and emigrated and fought with their wealth and lives in the cause of Allah and those who gave shelter and aided - they are allies of one another. But those who believed and did not emigrate - for you there is no guardianship of them until they emigrate. And if they seek help of you for the religion, then you must help, except against a people between yourselves and whom is a treaty. And Allah is Seeing of what you do.",
    "translation_id": "Sesungguhnya orang-orang yang beriman, berhijrah, dan berjihad dengan harta dan jiwanya pada jalan Allah, serta orang-orang yang memberikan tempat kediaman dan memberi pertolongan (kepada Muhajirin), mereka itu sebagiannya merupakan pelindung bagi sebagian yang lain. Orang-orang yang beriman tetapi belum berhijrah, maka tidak ada kewajiban sedikit pun atas kamu untuk melindungi mereka sehingga mereka berhijrah. (Akan tetapi,) jika mereka meminta pertolongan kepadamu dalam (urusan pembelaan) agama (Islam), wajib atas kamu memberikan pertolongan, kecuali dalam menghadapi kaum yang telah terikat perjanjian antara kamu dengan mereka. Allah Maha Melihat apa yang kamu kerjakan."
  },
  {
    "ayat": 73,
    "arabic": "وَالَّذِيْنَ كَفَرُوْا بَعْضُهُمْ اَوْلِيَاۤءُ بَعْضٍۗ اِلَّا تَفْعَلُوْهُ تَكُنْ فِتْنَةٌ فِى الْاَرْضِ وَفَسَادٌ كَبِيْرٌۗ",
    "transliteration_en": "Wallazeena kafaroo ba'duhum awliyaaa'u ba'd; illaa taf'aloohu takun fitnatun fil ardi wa fasaadun kabeer",
    "transliteration_id": "Wal-lażīna kafarū ba‘ḍuhum auliyā'u ba‘ḍ(in), illā taf‘alūhu takun fitnatun fil-arḍi wa fasādun kabīr(un).",
    "translation_en": "And those who disbelieved are allies of one another. If you do not do so, there will be fitnah on earth and great corruption.",
    "translation_id": "Orang-orang yang kufur, sebagian mereka menjadi penolong bagi sebagian yang lain. Jika kamu tidak melaksanakan apa yang telah diperintahkan Allah (untuk saling melindungi), niscaya akan terjadi kekacauan di bumi dan kerusakan yang besar."
  },
  {
    "ayat": 74,
    "arabic": "وَالَّذِيْنَ اٰمَنُوْا وَهَاجَرُوْا وَجَاهَدُوْا فِيْ سَبِيْلِ اللّٰهِ وَالَّذِيْنَ اٰوَوْا وَّنَصَرُوْٓا اُولٰۤىِٕكَ هُمُ الْمُؤْمِنُوْنَ حَقًّاۗ  لَهُمْ مَّغْفِرَةٌ وَّرِزْقٌ كَرِيْمٌ",
    "transliteration_en": "Wallazeena aamanoo wa haajaroo wa jaahadoo fee sabeelil laahi wallazeena aawaw wa nasarooo ulaaa'ika humul mu'minoona haqqaa; lahum maghfiratunw wa rizqun kareem",
    "transliteration_id": "Wal-lażīna āmanū wa hājarū wa jāhadū fī sabīlillāhi wal-lażīna āwaw wa naṣarū ulā'ika humul-mu'minūna ḥaqqā(n), lahum magfirtuw wa rizqun karīm(un).",
    "translation_en": "But those who have believed and emigrated and fought in the cause of Allah and those who gave shelter and aided - it is they who are the believers, truly. For them is forgiveness and noble provision.",
    "translation_id": "Orang-orang yang beriman, berhijrah, dan berjihad di jalan Allah, serta orang-orang yang memberi tempat kediaman dan memberi pertolongan (kepada orang Muhajirin), mereka itulah orang-orang mukmin yang sebenarnya. Bagi mereka ampunan (yang besar) dan rezeki yang mulia."
  },
  {
    "ayat": 75,
    "arabic": "وَالَّذِيْنَ اٰمَنُوْا مِنْۢ بَعْدُ وَهَاجَرُوْا وَجَاهَدُوْا مَعَكُمْ فَاُولٰۤىِٕكَ مِنْكُمْۗ وَاُولُوا الْاَرْحَامِ بَعْضُهُمْ اَوْلٰى بِبَعْضٍ فِيْ كِتٰبِ اللّٰهِ ۗاِنَّ اللّٰهَ بِكُلِّ شَيْءٍ عَلِيْمٌ ࣖ",
    "transliteration_en": "Wallazeena aamanoo mim ba'du wa haajaroo wa jaahadoo ma;akum faulaaa'ika minkum; wa ulul arhaami baduhum awlaa biba'din fee Kitaabil laah; innal laaha bikulli shai'in 'Aleem",
    "transliteration_id": "Wal-lażīna āmanū mim ba‘du wa hājarū wa jāhadū ma‘akum fa ulā'ika minkum, wa ulul-arḥāmi ba‘ḍuhum aulā biba‘ḍin fī kitābillāh(i), innallāha bikulli syai'in ‘alīm(un).",
    "translation_en": "And those who believed after [the initial emigration] and emigrated and fought with you - they are of you. But those of [blood] relationship are more entitled [to inheritance] in the decree of Allah. Indeed, Allah is Knowing of all things.",
    "translation_id": "Orang-orang yang beriman setelah itu, berhijrah, dan berjihad bersamamu, maka mereka itu termasuk (golongan) kamu. Orang-orang yang mempunyai hubungan kerabat itu sebagiannya lebih berhak bagi sebagian yang lain menurut Kitab Allah. Sesungguhnya Allah Maha Mengetahui segala sesuatu."
  }
]