[
  {
    "ayat": 1,
    "arabic": "اِنَّآ اَرْسَلْنَا نُوْحًا اِلٰى قَوْمِهٖٓ اَنْ اَنْذِرْ قَوْمَكَ مِنْ قَبْلِ اَنْ يَّأْتِيَهُمْ عَذَابٌ اَلِيْمٌ",
    "transliteration_en": "Innaaa arsalnaa Noohan ilaa qawmihee an anzir qawmaka min qabli any yaatiyahum 'azaabun aleem",
    "transliteration_id": "Innā arsalnā nūḥan ilā qaumihī an anżir qaumaka min qabli ay ya'tiyahum ‘ażābun alīm(un).",
    "translation_en": "Indeed, We sent Noah to his people, [saying], \"Warn your people before there comes to them a painful punishment.\"",
    "translation_id": "Sesungguhnya Kami telah mengutus Nuh kepada kaumnya (dengan perintah), “Berilah peringatan kepada kaummu sebelum datang azab yang pedih kepadanya!”"
  },
  {
    "ayat": 2,
    "arabic": "قَالَ يٰقَوْمِ اِنِّيْ لَكُمْ نَذِيْرٌ مُّبِيْنٌۙ",
    "transliteration_en": "Qaala yaa qawmi innee lakum nazeerum mubeen",
    "transliteration_id": "Qāla yā qaumi innī lakum nażīrum mubīn(un).",
    "translation_en": "He said, \"O my people, indeed I am to you a clear warner,",
    "translation_id": "Dia (Nuh) berkata, “Wahai kaumku, sesungguhnya aku ini adalah seorang pemberi peringatan yang menjelaskan kepadamu,"
  },
  {
    "ayat": 3,
    "arabic": "اَنِ اعْبُدُوا اللّٰهَ وَاتَّقُوْهُ وَاَطِيْعُوْنِۙ",
    "transliteration_en": "Ani'udul laaha watta qoohu wa atee'oon",
    "transliteration_id": "Ani‘budullāha wattaqūhu wa aṭī‘ūn(i).",
    "translation_en": "[Saying], 'Worship Allah, fear Him and obey me.",
    "translation_id": "(yaitu) sembahlah Allah, bertakwalah kepada-Nya, dan taatlah kepadaku,"
  },
  {
    "ayat": 4,
    "arabic": "يَغْفِرْ لَكُمْ مِّنْ ذُنُوْبِكُمْ وَيُؤَخِّرْكُمْ اِلٰٓى اَجَلٍ مُّسَمًّىۗ اِنَّ اَجَلَ اللّٰهِ اِذَا جَاۤءَ لَا يُؤَخَّرُۘ لَوْ كُنْتُمْ تَعْلَمُوْنَ",
    "transliteration_en": "Yaghfir lakum min zunoobikum wa yu'akhkhirkum ilaaa ajalim musammaa; innaa ajalal laahi izaa jaaa'a laa yu'akhkhar; law kuntum ta'lamoon",
    "transliteration_id": "Yagfir lakum min żunūbikum wa yu'akhkhirkum ilā ajalim musammā(n), inna ajalallāhi iżā jā'a lā yu'akhkhar(u), lau kuntum ta‘lamūn(a).",
    "translation_en": "Allah will forgive you of your sins and delay you for a specified term. Indeed, the time [set by] Allah, when it comes, will not be delayed, if you only knew.' \"",
    "translation_id": "niscaya Dia akan mengampuni sebagian dosa-dosamu dan menangguhkanmu (memanjangkan umurmu) sampai pada batas waktu yang ditentukan. Sesungguhnya ketetapan Allah itu, apabila telah datang, tidak dapat ditunda. Seandainya kamu mengetahui(-nya).”"
  },
  {
    "ayat": 5,
    "arabic": "قَالَ رَبِّ اِنِّيْ دَعَوْتُ قَوْمِيْ لَيْلًا وَّنَهَارًاۙ",
    "transliteration_en": "Qaala rabbi innee da'awtu qawmee lailanw wa naharaa",
    "transliteration_id": "Qāla rabbi innī da‘atu qaumī lailaw wa nahārā(n).",
    "translation_en": "He said, \"My Lord, indeed I invited my people [to truth] night and day.",
    "translation_id": "Dia (Nuh) berkata, “Ya Tuhanku, sesungguhnya aku telah menyeru kaumku siang dan malam,"
  },
  {
    "ayat": 6,
    "arabic": "فَلَمْ يَزِدْهُمْ دُعَاۤءِيْٓ اِلَّا فِرَارًا",
    "transliteration_en": "Falam yazid hum du'aaa 'eee illaa firaaraa",
    "transliteration_id": "Falam yazidhum du‘ā'ī illā firārā(n).",
    "translation_en": "But my invitation increased them not except in flight.",
    "translation_id": "tetapi seruanku itu tidak menambah (iman) mereka, melainkan mereka (makin) lari (dari kebenaran)."
  },
  {
    "ayat": 7,
    "arabic": "وَاِنِّيْ كُلَّمَا دَعَوْتُهُمْ لِتَغْفِرَ لَهُمْ جَعَلُوْٓا اَصَابِعَهُمْ فِيْٓ اٰذَانِهِمْ وَاسْتَغْشَوْا ثِيَابَهُمْ وَاَصَرُّوْا وَاسْتَكْبَرُوا اسْتِكْبَارًاۚ",
    "transliteration_en": "Wa inee kullamaa da'awtuhum litaghfira lahum ja'alooo asaabi'ahum fee aazaanihim wastaghshaw siyaabahum wa asaarroo wastakbarus tikbaaraa",
    "transliteration_id": "Wa innī kullamā da‘autuhum litagfira lahum ja‘alū aṣābi‘ahum fī āżānihim wastagsyau ṡiyābahum wa aṣarrū wastakbarustikbārā(n).",
    "translation_en": "And indeed, every time I invited them that You may forgive them, they put their fingers in their ears, covered themselves with their garments, persisted, and were arrogant with [great] arrogance.",
    "translation_id": "Sesungguhnya setiap kali aku menyeru mereka (untuk beriman) agar Engkau mengampuni mereka, mereka memasukkan anak jarinya ke telinganya dan menutupkan bajunya (ke wajahnya). Mereka pun tetap (mengingkari) dan sangat menyombongkan diri."
  },
  {
    "ayat": 8,
    "arabic": "ثُمَّ اِنِّيْ دَعَوْتُهُمْ جِهَارًاۙ",
    "transliteration_en": "Summa innee da'aw tuhum jihaara",
    "transliteration_id": "Ṡumma innī da‘autuhum jihārā(n).",
    "translation_en": "Then I invited them publicly.",
    "translation_id": "Kemudian, sesungguhnya aku menyeru mereka dengan cara terang-terangan."
  },
  {
    "ayat": 9,
    "arabic": "ثُمَّ اِنِّيْٓ اَعْلَنْتُ لَهُمْ وَاَسْرَرْتُ لَهُمْ اِسْرَارًاۙ",
    "transliteration_en": "Summaa inneee a'lantu lahum wa asrartu lahum israaraa",
    "transliteration_id": "Ṡumma innī a‘lantu lahum wa asrartu lahum isrārā(n).",
    "translation_en": "Then I announced to them and [also] confided to them secretly",
    "translation_id": "Lalu, aku menyeru mereka secara terbuka dan diam-diam."
  },
  {
    "ayat": 10,
    "arabic": "فَقُلْتُ اسْتَغْفِرُوْا رَبَّكُمْ اِنَّهٗ كَانَ غَفَّارًاۙ",
    "transliteration_en": "Faqultus taghfiroo Rabakam innahoo kaana Ghaffaaraa",
    "transliteration_id": "Faqultustagfirū rabbakum innahū kāna gaffārā(n).",
    "translation_en": "And said, 'Ask forgiveness of your Lord. Indeed, He is ever a Perpetual Forgiver.",
    "translation_id": "Lalu, aku berkata (kepada mereka), “Mohonlah ampun kepada Tuhanmu. Sesungguhnya Dia Maha Pengampun."
  },
  {
    "ayat": 11,
    "arabic": "يُّرْسِلِ السَّمَاۤءَ عَلَيْكُمْ مِّدْرَارًاۙ",
    "transliteration_en": "Yursilis samaaa'a 'alaikum midraaraa",
    "transliteration_id": "Yursilis-samā'a ‘alaikum midrārā(n).",
    "translation_en": "He will send [rain from] the sky upon you in [continuing] showers",
    "translation_id": "(Jika kamu memohon ampun,) niscaya Dia akan menurunkan hujan yang lebat dari langit kepadamu,"
  },
  {
    "ayat": 12,
    "arabic": "وَّيُمْدِدْكُمْ بِاَمْوَالٍ وَّبَنِيْنَ وَيَجْعَلْ لَّكُمْ جَنّٰتٍ وَّيَجْعَلْ لَّكُمْ اَنْهٰرًاۗ",
    "transliteration_en": "Wa yumdidkum bi am waalinw wa baneena wa yaj'al lakum Jannaatinw wa yaj'al lakum anhaaraa",
    "transliteration_id": "Wa yumdidkum bi'amwāliw wa banīna wa yaj‘al lakum jannātiw wa yaj‘al lakum anhārā(n).",
    "translation_en": "And give you increase in wealth and children and provide for you gardens and provide for you rivers.",
    "translation_id": "memperbanyak harta dan anak-anakmu, serta mengadakan kebun-kebun dan sungai-sungai untukmu.”"
  },
  {
    "ayat": 13,
    "arabic": "مَا لَكُمْ لَا تَرْجُوْنَ لِلّٰهِ وَقَارًاۚ",
    "transliteration_en": "Maa lakum laa tarjoona lillaahi waqaaraa",
    "transliteration_id": "Mā lakum lā tarjūna lillāhi waqārā(n).",
    "translation_en": "What is [the matter] with you that you do not attribute to Allah [due] grandeur",
    "translation_id": "Mengapa kamu tidak takut akan kebesaran Allah?"
  },
  {
    "ayat": 14,
    "arabic": "وَقَدْ خَلَقَكُمْ اَطْوَارًا",
    "transliteration_en": "Wa qad khalaqakum at waaraa",
    "transliteration_id": "Wa qad khalaqakum aṭwārā(n).",
    "translation_en": "While He has created you in stages?",
    "translation_id": "Padahal, sungguh, Dia telah menciptakanmu dalam beberapa tahapan (penciptaan)."
  },
  {
    "ayat": 15,
    "arabic": "اَلَمْ تَرَوْا كَيْفَ خَلَقَ اللّٰهُ سَبْعَ سَمٰوٰتٍ طِبَاقًاۙ",
    "transliteration_en": "Alam taraw kaifa khalaqal laahu sab'a samaawaatin tibaaqaa",
    "transliteration_id": "Alam tara kaifa khalaqallāhu sab‘a samāwātin ṭibāqā(n).",
    "translation_en": "Do you not consider how Allah has created seven heavens in layers",
    "translation_id": "Tidakkah kamu memperhatikan bagaimana Allah telah menciptakan tujuh langit berlapis-lapis?"
  },
  {
    "ayat": 16,
    "arabic": "وَّجَعَلَ الْقَمَرَ فِيْهِنَّ نُوْرًا وَّجَعَلَ الشَّمْسَ سِرَاجًا",
    "transliteration_en": "Wa ja'alal qamara feehinna nooranw wa ja'alash shamsa siraajaa",
    "transliteration_id": "Wa ja‘alal-qamara fīhinna nūraw wa ja‘alasy-syamsa sirājā(n).",
    "translation_en": "And made the moon therein a [reflected] light and made the sun a burning lamp?",
    "translation_id": "Di sana Dia menjadikan bulan bercahaya dan matahari sebagai pelita (yang cemerlang)."
  },
  {
    "ayat": 17,
    "arabic": "وَاللّٰهُ اَنْۢبَتَكُمْ مِّنَ الْاَرْضِ نَبَاتًاۙ",
    "transliteration_en": "Wallaahu ambatakum minal ardi nabaataa",
    "transliteration_id": "Wallāhu ambatakum minal-arḍi nabātā(n).",
    "translation_en": "And Allah has caused you to grow from the earth a [progressive] growth.",
    "translation_id": "Allah benar-benar menciptakanmu dari tanah."
  },
  {
    "ayat": 18,
    "arabic": "ثُمَّ يُعِيْدُكُمْ فِيْهَا وَيُخْرِجُكُمْ اِخْرَاجًا",
    "transliteration_en": "Summa yu'eedukum feehaa wa ukhrijukum ikhraajaa",
    "transliteration_id": "Ṡumma yu‘īdukum fīhā wa yukhrijukum ikhrājā(n).",
    "translation_en": "Then He will return you into it and extract you [another] extraction.",
    "translation_id": "Kemudian, dia akan mengembalikanmu ke dalamnya (tanah) dan mengeluarkanmu (pada hari Kiamat) dengan pasti."
  },
  {
    "ayat": 19,
    "arabic": "وَاللّٰهُ جَعَلَ لَكُمُ الْاَرْضَ بِسَاطًاۙ",
    "transliteration_en": "Wallaahu ja'ala lakumul arda bisaataa",
    "transliteration_id": "Wallāhu ja‘ala lakumul-arḍa bisāṭā(n).",
    "translation_en": "And Allah has made for you the earth an expanse",
    "translation_id": "Allah menjadikan bumi untukmu sebagai hamparan"
  },
  {
    "ayat": 20,
    "arabic": "لِّتَسْلُكُوْا مِنْهَا سُبُلًا فِجَاجًا ࣖ",
    "transliteration_en": "Litaslukoo minhaa subulan fijaajaa",
    "transliteration_id": "Litaslukū minhā subulan fijājā(n).",
    "translation_en": "That you may follow therein roads of passage.' \"",
    "translation_id": "agar kamu dapat pergi dengan leluasa di jalan-jalan yang luas."
  },
  {
    "ayat": 21,
    "arabic": "قَالَ نُوْحٌ رَّبِّ اِنَّهُمْ عَصَوْنِيْ وَاتَّبَعُوْا مَنْ لَّمْ يَزِدْهُ مَالُهٗ وَوَلَدُهٗٓ اِلَّا خَسَارًاۚ",
    "transliteration_en": "Qaala Noohur Robbi innahum 'asawnee wattaba'oo mal lam yazid hu maaluhoo wa waladuhooo illaa khasaara",
    "transliteration_id": "Qāla nūḥur rabbi innahum ‘aṣaunī wattaba‘ū mal lam yazidhu māluhū wa waladuhū illā khasārā(n).",
    "translation_en": "Noah said, \"My Lord, indeed they have disobeyed me and followed him whose wealth and children will not increase him except in loss.",
    "translation_id": "Nuh berkata, “Ya Tuhanku, sesungguhnya mereka durhaka kepadaku dan mengikuti orang-orang yang harta dan anak-anaknya hanya menambah kerugian baginya."
  },
  {
    "ayat": 22,
    "arabic": "وَمَكَرُوْا مَكْرًا كُبَّارًاۚ",
    "transliteration_en": "Wa makaroo makran kubbaaraa",
    "transliteration_id": "Wa makarū makran kubbārā(n).",
    "translation_en": "And they conspired an immense conspiracy.",
    "translation_id": "Mereka pun melakukan tipu daya yang sangat besar."
  },
  {
    "ayat": 23,
    "arabic": "وَقَالُوْا لَا تَذَرُنَّ اٰلِهَتَكُمْ وَلَا تَذَرُنَّ وَدًّا وَّلَا سُوَاعًا ەۙ وَّلَا يَغُوْثَ وَيَعُوْقَ وَنَسْرًاۚ",
    "transliteration_en": "Wa qaaloo laa tazarunna aalihatakum wa laa tazarunna Waddanw wa laa Suwaa'anw wa laa Yaghoosa wa Ya'ooqa wa Nasraa",
    "transliteration_id": "Wa qālū lā tażarunna ālihatakum wa lā tażarunna waddaw wa lā suwā‘ā(n), wa lā yagūṡa wa ya‘ūqa wa nasrā(n).",
    "translation_en": "And said, 'Never leave your gods and never leave Wadd or Suwa' or Yaghuth and Ya'uq and Nasr.",
    "translation_id": "Mereka berkata, ‘Jangan sekali-kali kamu meninggalkan tuhan-tuhanmu dan jangan pula sekali-kali kamu meninggalkan Wadd, Suwā‘, Yagūṡ, Ya‘ūq, dan Nasr.’"
  },
  {
    "ayat": 24,
    "arabic": "وَقَدْ اَضَلُّوْا كَثِيْرًا ەۚ وَلَا تَزِدِ الظّٰلِمِيْنَ اِلَّا ضَلٰلًا",
    "transliteration_en": "Wa qad adalloo kasee ranw wa laa tazidiz zaalimeena illaa dalaalaa",
    "transliteration_id": "Wa qad aḍallū kaṡīrā(n), wa lā tazidiẓ-ẓālimīna illā ḍalālā(n).",
    "translation_en": "And already they have misled many. And, [my Lord], do not increase the wrongdoers except in error.\"",
    "translation_id": "Sungguh, mereka telah menyesatkan banyak orang. Janganlah Engkau tambahkan bagi orang-orang zalim itu selain kesesatan.”"
  },
  {
    "ayat": 25,
    "arabic": "مِمَّا خَطِيْۤـٰٔتِهِمْ اُغْرِقُوْا فَاُدْخِلُوْا نَارًا ەۙ فَلَمْ يَجِدُوْا لَهُمْ مِّنْ دُوْنِ اللّٰهِ اَنْصَارًا",
    "transliteration_en": "Mimmaa khateee' aatihim ughriqoo fa udkhiloo Naaran falam yajidoo lahum min doonil laahi ansaaraa",
    "transliteration_id": "Mimmā khaṭī'ātihim ugriqū fa'udkhilū nārā(n), falam yajidū lahum min dūnillāhi anṣārā(n).",
    "translation_en": "Because of their sins they were drowned and put into the Fire, and they found not for themselves besides Allah [any] helpers.",
    "translation_id": "Disebabkan kesalahan-kesalahan mereka, mereka ditenggelamkan, lalu dimasukkan ke neraka. Mereka tidak mendapat penolong selain Allah."
  },
  {
    "ayat": 26,
    "arabic": "وَقَالَ نُوْحٌ رَّبِّ لَا تَذَرْ عَلَى الْاَرْضِ مِنَ الْكٰفِرِيْنَ دَيَّارًا",
    "transliteration_en": "Wa qaala Noohur Rabbi laa tazar 'alal ardi minal kaafireena daiyaaraa",
    "transliteration_id": "Wa qāla nūḥur rabbi lā tażar ‘alal-arḍi minal-kāfirīna dayyārā(n).",
    "translation_en": "And Noah said, \"My Lord, do not leave upon the earth from among the disbelievers an inhabitant.",
    "translation_id": "Nuh berkata, “Ya Tuhanku, janganlah Engkau biarkan seorang pun di antara orang-orang kafir itu tinggal di atas bumi."
  },
  {
    "ayat": 27,
    "arabic": "اِنَّكَ اِنْ تَذَرْهُمْ يُضِلُّوْا عِبَادَكَ وَلَا يَلِدُوْٓا اِلَّا فَاجِرًا كَفَّارًا",
    "transliteration_en": "Innaka in tazarhum yudil loo 'ibaadaka wa laa yalidooo illaa faajiran kaffaaraa",
    "transliteration_id": "Innaka in tażarhum yuḍillū ‘ibādaka wa lā yalidū illā fājiran kaffārā(n).",
    "translation_en": "Indeed, if You leave them, they will mislead Your servants and not beget except [every] wicked one and [confirmed] disbeliever.",
    "translation_id": "Sesungguhnya jika Engkau biarkan mereka tinggal, niscaya mereka akan menyesatkan hamba-hamba-Mu. Mereka pun hanya akan melahirkan anak-anak yang jahat dan tidak tahu bersyukur."
  },
  {
    "ayat": 28,
    "arabic": "رَبِّ اغْفِرْ لِيْ وَلِوَالِدَيَّ وَلِمَنْ دَخَلَ بَيْتِيَ مُؤْمِنًا وَّلِلْمُؤْمِنِيْنَ وَالْمُؤْمِنٰتِۗ وَلَا تَزِدِ الظّٰلِمِيْنَ اِلَّا تَبَارًا ࣖ",
    "transliteration_en": "Rabbigh fir lee wa liwaa lidaiya wa liman dakhala baitiya mu'minanw wa lil mu'mineena wal mu'minaati wa laa tazidiz zaalimeena illaa tabaaraa",
    "transliteration_id": "Rabbigfir lī wa liwālidayya wa liman dakhala baitiya  mu'minaw wa lil-mu'minīna wal-mu'mināt(i), wa lā tazidiẓ-ẓālimīna illā tabārā(n).",
    "translation_en": "My Lord, forgive me and my parents and whoever enters my house a believer and the believing men and believing women. And do not increase the wrongdoers except in destruction.\"",
    "translation_id": "Ya Tuhanku, ampunilah aku, ibu bapakku, dan siapa pun yang memasuki rumahku dengan beriman dan semua orang yang beriman laki-laki dan perempuan. Janganlah Engkau tambahkan bagi orang-orang zalim itu selain kehancuran.”"
  }
]