[
  {
    "ayat": 1,
    "arabic": "الۤرٰ ۗ تِلْكَ اٰيٰتُ الْكِتٰبِ الْمُبِيْنِۗ",
    "transliteration_en": "Alif-Laaam-Raa; tilka Aayaatul Kitaabil Mubeen",
    "transliteration_id": "Alif lām rā, tilka āyātul-kitābil-mubīn(i).",
    "translation_en": "Alif, Lam, Ra. These are the verses of the clear Book.",
    "translation_id": "Alif Lām Rā. Itulah ayat-ayat Kitab (Al-Qur’an) yang jelas (arti dan petunjuknya)."
  },
  {
    "ayat": 2,
    "arabic": "اِنَّآ اَنْزَلْنٰهُ قُرْاٰنًا عَرَبِيًّا لَّعَلَّكُمْ تَعْقِلُوْنَ",
    "transliteration_en": "Innaaa anzalnaahu quraanan 'Arabiyyal la 'allakum ta'qiloon",
    "transliteration_id": "Innā anzalnāhu qur'ānan ‘arabiyyal la‘allakum ta‘qilūn(a).",
    "translation_en": "Indeed, We have sent it down as an Arabic Qur'an that you might understand.",
    "translation_id": "Sesungguhnya Kami menurunkannya (Kitab Suci) berupa Al-Qur’an berbahasa Arab agar kamu mengerti."
  },
  {
    "ayat": 3,
    "arabic": "نَحْنُ نَقُصُّ عَلَيْكَ اَحْسَنَ الْقَصَصِ بِمَآ اَوْحَيْنَآ اِلَيْكَ هٰذَا الْقُرْاٰنَۖ وَاِنْ كُنْتَ مِنْ قَبْلِهٖ لَمِنَ الْغٰفِلِيْنَ",
    "transliteration_en": "Nahnu naqussu 'alaika ahsanal qasasi bimaaa awhainaaa ilaika haazal quraana wa in kunta min qablihee laminal ghaafileen",
    "transliteration_id": "Naḥnu naquṣṣu ‘alaika aḥsanal-qaṣaṣi bimā auḥainā ilaika hāżal-qur'ān(a), wa in kunta min qablihī laminal-gāfilīn(a).",
    "translation_en": "We relate to you, [O Muhammad], the best of stories in what We have revealed to you of this Qur'an although you were, before it, among the unaware.",
    "translation_id": "Kami menceritakan kepadamu (Nabi Muhammad) kisah yang paling baik dengan mewahyukan Al-Qur’an ini kepadamu. Sesungguhnya engkau sebelum itu termasuk orang-orang yang tidak mengetahui."
  },
  {
    "ayat": 4,
    "arabic": "اِذْ قَالَ يُوْسُفُ لِاَبِيْهِ يٰٓاَبَتِ اِنِّيْ رَاَيْتُ اَحَدَ عَشَرَ كَوْكَبًا وَّالشَّمْسَ وَالْقَمَرَ رَاَيْتُهُمْ لِيْ سٰجِدِيْنَ",
    "transliteration_en": "Iz qaala Yoosufu li abeehi yaaa abati innee ra aytu ahada 'ashara kawkabanw wash shamsa walqamara ra aytuhum lee saajideen",
    "transliteration_id": "Iż qāla yūsufu li'abīhi yā abati innī ra'aitu aḥada ‘asyara kaukabaw wasy-syamsa wal-qamara ra'aituhum lī sājidīn(a).",
    "translation_en": "[Of these stories mention] when Joseph said to his father, \"O my father, indeed I have seen [in a dream] eleven stars and the sun and the moon; I saw them prostrating to me.\"",
    "translation_id": "(Ingatlah) ketika Yusuf berkata kepada ayahnya (Ya‘qub), “Wahai ayahku, sesungguhnya aku telah (bermimpi) melihat sebelas bintang, matahari, dan bulan. Aku melihat semuanya sujud kepadaku.”"
  },
  {
    "ayat": 5,
    "arabic": "قَالَ يٰبُنَيَّ لَا تَقْصُصْ رُءْيَاكَ عَلٰٓى اِخْوَتِكَ فَيَكِيْدُوْا لَكَ كَيْدًا ۗاِنَّ الشَّيْطٰنَ لِلْاِنْسَانِ عَدُوٌّ مُّبِيْنٌ",
    "transliteration_en": "Qaala yaa bunaiya laa taqsus ru'yaaka 'alaaa ikhwatika fayakeedoo laka kaidaa; innash Shaitaana lil insaani 'aduwwum mubeen",
    "transliteration_id": "Qāla yā bunayya lā taqṣuṣ ru'yāka ‘alā ikhwatika fa yakīdū laka kaidā(n), innasy-syaiṭāna lil-insāni ‘aduwwum mubīn(un).",
    "translation_en": "He said, \"O my son, do not relate your vision to your brothers or they will contrive against you a plan. Indeed Satan, to man, is a manifest enemy.",
    "translation_id": "Dia (ayahnya) berkata, “Wahai anakku, janganlah engkau ceritakan mimpimu kepada saudara-saudaramu karena mereka akan membuat tipu daya yang sungguh-sungguh kepadamu. Sesungguhnya setan adalah musuh yang jelas bagi manusia.”"
  },
  {
    "ayat": 6,
    "arabic": "وَكَذٰلِكَ يَجْتَبِيْكَ رَبُّكَ وَيُعَلِّمُكَ مِنْ تَأْوِيْلِ الْاَحَادِيْثِ وَيُتِمُّ نِعْمَتَهٗ عَلَيْكَ وَعَلٰٓى اٰلِ يَعْقُوْبَ كَمَآ اَتَمَّهَا عَلٰٓى اَبَوَيْكَ مِنْ قَبْلُ اِبْرٰهِيْمَ وَاِسْحٰقَۗ اِنَّ رَبَّكَ عَلِيْمٌ حَكِيْمٌ ࣖ",
    "transliteration_en": "Wa kazaalika yajtabeeka rabbuka wa yu'allimuka min taaweelil ahaadeesi wa yutimmu ni'matahoo 'alaika wa 'alaaa Aali Ya'qooba kamaaa atammahaa 'alaaa abawaika min qablu Ibraaheema wa Ishaaq; inna Rabbaka 'Aleemun hakeem",
    "transliteration_id": "Wa każālika yajtabīka rabbuka wa yu‘allimuka min ta'wīlil-aḥādīṡi wa yutimmu ni‘matahū ‘alaika wa ‘alā āli ya‘qūba kamā atammahā ‘alā abawaika min qablu ibrāhīma wa isḥāq(a), inna rabbaka ‘alīmun ḥakīm(un).",
    "translation_en": "And thus will your Lord choose you and teach you the interpretation of narratives and complete His favor upon you and upon the family of Jacob, as He completed it upon your fathers before, Abraham and Isaac. Indeed, your Lord is Knowing and Wise.\"",
    "translation_id": "Demikianlah, Tuhan memilihmu (untuk menjadi nabi), mengajarkan kepadamu sebagian dari takwil mimpi, serta menyempurnakan nikmat-Nya kepadamu dan kepada keluarga Ya‘qub, sebagaimana Dia telah menyempurnakannya kepada kedua kakekmu sebelumnya, (yaitu) Ibrahim dan Ishaq. Sesungguhnya Tuhanmu Maha Mengetahui lagi Maha Bijaksana."
  },
  {
    "ayat": 7,
    "arabic": "۞ لَقَدْ كَانَ فِيْ يُوْسُفَ وَاِخْوَتِهٖٓ اٰيٰتٌ لِّلسَّاۤىِٕلِيْنَ",
    "transliteration_en": "Laqad kaana fee Yoosufa wa ikhwatiheee Aayaatul lissaaa'ileen",
    "transliteration_id": "Laqad kāna fī yūsufa wa ikhwatihī āyātul lis-sā'ilīn(a).",
    "translation_en": "Certainly were there in Joseph and his brothers signs for those who ask,",
    "translation_id": "Sungguh, dalam (kisah) Yusuf dan saudara-saudaranya benar-benar terdapat tanda-tanda (kekuasaan Allah) bagi para penanya."
  },
  {
    "ayat": 8,
    "arabic": "اِذْ قَالُوْا لَيُوْسُفُ وَاَخُوْهُ اَحَبُّ اِلٰٓى اَبِيْنَا مِنَّا وَنَحْنُ عُصْبَةٌ  ۗاِنَّ اَبَانَا لَفِيْ ضَلٰلٍ مُّبِيْنٍۙ",
    "transliteration_en": "Iz qaaloo la Yoosufu wa akhoohu ahabbu ilaaa Abeenaa minnaa wa nahnu 'usbah; inna abaanaa lafee dalaalim mubeen",
    "transliteration_id": "Iż qālū layūsufu wa akhūhu aḥabbu ilā abīnā minnā wa naḥnu ‘uṣbah(tun), inna abānā lafī ḍalālim mubīn(in).",
    "translation_en": "When they said, \"Joseph and his brother are more beloved to our father than we, while we are a clan. Indeed, our father is in clear error.",
    "translation_id": "(Ingatlah) ketika mereka berkata, “Sesungguhnya Yusuf dan saudara (kandung)-nya lebih dicintai Ayah daripada kita, padahal kita adalah kumpulan (yang banyak). Sesungguhnya ayah kita dalam kekeliruan yang nyata."
  },
  {
    "ayat": 9,
    "arabic": "ۨاقْتُلُوْا يُوْسُفَ اَوِ اطْرَحُوْهُ اَرْضًا يَّخْلُ لَكُمْ وَجْهُ اَبِيْكُمْ وَتَكُوْنُوْا مِنْۢ بَعْدِهٖ قَوْمًا صٰلِحِيْنَ",
    "transliteration_en": "Uqtuloo Yoosufa awitra hoohu ardany yakhlu lakum wajhu abeekum wa takoonoo mim ba'dihee qawman saaliheen",
    "transliteration_id": "Uqtulū yūsufa awiṭraḥūhu arḍay yakhlu lakum wajhu abīkum wa takūnū mim ba‘dihī qauman  ṣāliḥīn(a).",
    "translation_en": "Kill Joseph or cast him out to [another] land; the countenance of your father will [then] be only for you, and you will be after that a righteous people.\"",
    "translation_id": "Bunuhlah Yusuf atau buanglah dia ke suatu tempat agar perhatian Ayah tertumpah kepadamu dan setelah itu (bertobatlah sehingga) kamu akan menjadi kaum yang saleh.”"
  },
  {
    "ayat": 10,
    "arabic": "قَالَ قَاۤىِٕلٌ مِّنْهُمْ لَا تَقْتُلُوْا يُوْسُفَ وَاَلْقُوْهُ فِيْ غَيٰبَتِ الْجُبِّ يَلْتَقِطْهُ بَعْضُ السَّيَّارَةِ اِنْ كُنْتُمْ فٰعِلِيْنَ",
    "transliteration_en": "Qaalaa qaaa'ilum minhum laa taqtuloo Yoosufa wa alqoohu fee ghayaabatil jubbi yaltaqithu badus sai yaarati in kuntum faa 'ileen",
    "transliteration_id": "Qāla qā'ilum minhum lā taqtulū yūsufa wa alqūhu fī gayābatil-jubbi yaltaqiṭhu ba‘ḍus-sayyārati in kuntum fā‘ilīn(a).",
    "translation_en": "Said a speaker among them, \"Do not kill Joseph but throw him into the bottom of the well; some travelers will pick him up - if you would do [something].\"",
    "translation_id": "Salah seorang di antara mereka berkata, “Janganlah kamu membunuh Yusuf, tetapi masukkan saja dia ke dasar sumur agar dia dipungut oleh sebagian musafir jika kamu hendak berbuat.”"
  },
  {
    "ayat": 11,
    "arabic": "قَالُوْا يٰٓاَبَانَا مَا لَكَ لَا تَأْمَنَّ۫ا عَلٰى يُوْسُفَ وَاِنَّا لَهٗ لَنٰصِحُوْنَ",
    "transliteration_en": "Qaaloo yaaa abaanaa maa laka laa taamannaa 'alaa Yoosufa wa innaa lahoo lanaa sihoon",
    "transliteration_id": "Qālū yā abānā mā laka lā ta'mannā ‘alā yūsufa wa innā lahū lanāṣiḥūn(a).",
    "translation_en": "They said, \"O our father, why do you not entrust us with Joseph while indeed, we are to him sincere counselors?",
    "translation_id": "Mereka berkata, “Wahai ayah kami, mengapa engkau tidak memercayai kami atas Yusuf, padahal sesungguhnya kami benar-benar menginginkan kebaikan baginya?"
  },
  {
    "ayat": 12,
    "arabic": "اَرْسِلْهُ مَعَنَا غَدًا يَّرْتَعْ وَيَلْعَبْ وَاِنَّا لَهٗ لَحٰفِظُوْنَ",
    "transliteration_en": "Arilhu ma'anaa ghadany yarta'wa yal'ab wa innaa lahoo lahaafizoon",
    "transliteration_id": "Arsilhu ma‘anā gaday yarta‘ wa yal‘ab wa innā lahū laḥāfiẓūn(a).",
    "translation_en": "Send him with us tomorrow that he may eat well and play. And indeed, we will be his guardians.",
    "translation_id": "Biarkanlah dia pergi bersama kami besok pagi agar dia bersenang-senang dan bermain-main. Sesungguhnya kami benar-benar akan menjaganya.”"
  },
  {
    "ayat": 13,
    "arabic": "قَالَ اِنِّيْ لَيَحْزُنُنِيْٓ اَنْ تَذْهَبُوْا بِهٖ وَاَخَافُ اَنْ يَّأْكُلَهُ الذِّئْبُ وَاَنْتُمْ عَنْهُ غٰفِلُوْنَ",
    "transliteration_en": "Qaala innee la yahzununeee an tazhaboo bihee wa akhaafu anyyaakulahuz zi'bu wa antum 'anhu ghaafiloon",
    "transliteration_id": "Qāla innī layaḥzununī an tażhabū bihī wa akhāfu ay ya'kulahuż-żi'bu wa antum ‘anhu gāfilūn(a).",
    "translation_en": "[Jacob] said, \"Indeed, it saddens me that you should take him, and I fear that a wolf would eat him while you are of him unaware.\"",
    "translation_id": "Dia (Ya‘qub) berkata, “Sesungguhnya kepergian kamu bersama dia (Yusuf) sangat menyedihkanku dan aku khawatir serigala akan memangsanya, sedangkan kamu lengah darinya.”"
  },
  {
    "ayat": 14,
    "arabic": "قَالُوْا لَىِٕنْ اَكَلَهُ الذِّئْبُ وَنَحْنُ عُصْبَةٌ اِنَّآ اِذًا لَّخٰسِرُوْنَ",
    "transliteration_en": "Qaaloo la in akalahuzzi'bu wa nahnu 'usbatun innaaa izal lakhaasiroon",
    "transliteration_id": "Qālū la'in akalahuż-żi'bu wa naḥnu ‘uṣbatun innā iżal lakhāsirūn(a).",
    "translation_en": "They said, \"If a wolf should eat him while we are a [strong] clan, indeed, we would then be losers.\"",
    "translation_id": "Mereka berkata, “Sungguh, jika serigala memangsanya, padahal kami kelompok (yang kuat), kami benar-benar orang-orang yang merugi.”"
  },
  {
    "ayat": 15,
    "arabic": "فَلَمَّا ذَهَبُوْا بِهٖ وَاَجْمَعُوْٓا اَنْ يَّجْعَلُوْهُ فِيْ غَيٰبَتِ الْجُبِّۚ وَاَوْحَيْنَآ اِلَيْهِ لَتُنَبِّئَنَّهُمْ بِاَمْرِهِمْ هٰذَا وَهُمْ لَا يَشْعُرُوْنَ",
    "transliteration_en": "Falammaa zahaboo bihee wa ajma'ooo anyyaj'aloohu fee ghayaabatil jubb; wa awyainaaa ilaihi latunabbi 'annahum bi amrihim haaza wa hum laa yash'uroon",
    "transliteration_id": "Falammā żahabū bihī wa ajma‘ū ay yaj‘alūhu fī gayābatil-jubb(i), wa auḥainā ilaihi latunabbi'annahum bi'amrihim hāżā wa hum lā yasy‘urūn(a).",
    "translation_en": "So when they took him [out] and agreed to put him into the bottom of the well... But We inspired to him, \"You will surely inform them [someday] about this affair of theirs while they do not perceive [your identity].\"",
    "translation_id": "Maka, ketika mereka membawanya serta sepakat memasukkannya ke dasar sumur, (mereka pun melaksanakan kesepakatan itu). Kami wahyukan kepadanya, “Engkau kelak pasti akan menceritakan perbuatan mereka ini kepada mereka, sedangkan mereka tidak menyadari.”"
  },
  {
    "ayat": 16,
    "arabic": "وَجَاۤءُوْٓ اَبَاهُمْ عِشَاۤءً يَّبْكُوْنَۗ",
    "transliteration_en": "Wa jaaa'ooo abaahum 'ishaaa 'any yabkoon",
    "transliteration_id": "Wa jā'ū abāhum ‘isyā'ay yabkūn(a).",
    "translation_en": "And they came to their father at night, weeping.",
    "translation_id": "(Kemudian,) mereka datang kepada ayahnya pada petang hari sambil menangis."
  },
  {
    "ayat": 17,
    "arabic": "قَالُوْا يٰٓاَبَانَآ اِنَّا ذَهَبْنَا نَسْتَبِقُ وَتَرَكْنَا يُوْسُفَ عِنْدَ مَتَاعِنَا فَاَكَلَهُ الذِّئْبُۚ وَمَآ اَنْتَ بِمُؤْمِنٍ لَّنَا وَلَوْ كُنَّا صٰدِقِيْنَ",
    "transliteration_en": "Qaaloo yaaa abaanaaa innaa zahabnaa nastabiqu wa taraknaa Yoosufa 'inda mataa'inaa fa akhalahuz zi'b, wa maaa anta bimu'minil lanaa wa law kunnaa saadiqeen",
    "transliteration_id": "Qālū yā abānā innā żahabnā nastabiqu wa taraknā yūsufa ‘inda matā‘inā fa akalahuż-żi'b(u), wa mā anta bimu'minil lanā wa lau kunnā ṣādiqīn(a).",
    "translation_en": "They said, \"O our father, indeed we went racing each other and left Joseph with our possessions, and a wolf ate him. But you would not believe us, even if we were truthful.\"",
    "translation_id": "Mereka berkata, “Wahai ayah kami, sesungguhnya kami pergi berlomba dan kami tinggalkan Yusuf di dekat barang-barang kami, lalu serigala memangsanya. Engkau tentu tidak akan percaya kepada kami, sekalipun kami berkata benar.”"
  },
  {
    "ayat": 18,
    "arabic": "وَجَاۤءُوْ عَلٰى قَمِيْصِهٖ بِدَمٍ كَذِبٍۗ قَالَ بَلْ سَوَّلَتْ لَكُمْ اَنْفُسُكُمْ اَمْرًاۗ فَصَبْرٌ جَمِيْلٌ  ۗوَاللّٰهُ الْمُسْتَعَانُ عَلٰى مَا تَصِفُوْنَ",
    "transliteration_en": "Wa jaaa'oo 'alaa qamee shihee bidamin kazi' qaala bal sawwalat lakum anfusukum amraa; fasabrun jameel; wallaahul musta'aanu 'alaa man tasifoon",
    "transliteration_id": "Wa jā'ū ‘alā qamīṣihī bidamin każib(in), qāla bal sawwalat lakum anfusukum amrā(n), fa ṣabrun jamīl(un), wallāhul musta‘ānu ‘alā mā taṣifūn(a).",
    "translation_en": "And they brought upon his shirt false blood. [Jacob] said, \"Rather, your souls have enticed you to something, so patience is most fitting. And Allah is the one sought for help against that which you describe.\"",
    "translation_id": "Mereka datang membawa bajunya (yang dilumuri) darah palsu. Dia (Ya‘qub) berkata, “Justru hanya dirimu sendirilah yang memandang baik urusan (yang buruk) itu, maka hanya bersabar itulah yang terbaik (bagiku). Allah sajalah Zat yang dimohonkan pertolongan terhadap apa yang kamu ceritakan.”"
  },
  {
    "ayat": 19,
    "arabic": "وَجَاۤءَتْ سَيَّارَةٌ فَاَرْسَلُوْا وَارِدَهُمْ فَاَدْلٰى دَلْوَهٗ ۗقَالَ يٰبُشْرٰى هٰذَا غُلٰمٌ ۗوَاَسَرُّوْهُ بِضَاعَةً ۗوَاللّٰهُ عَلِيْمٌ ۢبِمَا يَعْمَلُوْنَ",
    "transliteration_en": "Wa jaaa'at saiyaaratun fa-arsaloo waaridahum fa adlaa dalwah; qaala yaa bushraa haaza ghulaam; wa asarroohu bi-daa'ah; wallaahu 'aleemum bimaa ya'maloon",
    "transliteration_id": "Wa jā'at sayyāratun fa arsalū wāridahum fa adlā dalwah(ū), qāla yā busyrā hāżā gulām(un), wa asarrūhu biḍā‘ah(tan), wallāhu ‘alīmum bimā ya‘malūn(a).",
    "translation_en": "And there came a company of travelers; then they sent their water drawer, and he let down his bucket. He said, \"Good news! Here is a boy.\" And they concealed him, [taking him] as merchandise; and Allah was knowing of what they did.",
    "translation_id": "Datanglah sekelompok musafir. Mereka menyuruh seorang pengambil air, lalu dia menurunkan timbanya. Dia berkata, “Oh, senangnya! Ini ada seorang anak muda.” Kemudian mereka menyembunyikannya sebagai barang dagangan. Allah Maha Mengetahui apa yang mereka kerjakan."
  },
  {
    "ayat": 20,
    "arabic": "وَشَرَوْهُ بِثَمَنٍۢ بَخْسٍ دَرَاهِمَ مَعْدُوْدَةٍ ۚوَكَانُوْا فِيْهِ مِنَ الزّٰهِدِيْنَ ࣖ",
    "transliteration_en": "Wa sharawhu bisamanim bakhsin daraahima ma'doo datinw wa kaanoo feehi minaz zaahideen",
    "transliteration_id": "Wa syarauhu biṡamanim bakhsin darāhima ma‘dūdah(tin), wa kānū fīhi minaz-zāhidīn(a).",
    "translation_en": "And they sold him for a reduced price - a few dirhams - and they were, concerning him, of those content with little.",
    "translation_id": "Mereka menjualnya (Yusuf) dengan harga murah, (yaitu) beberapa dirham saja sebab mereka tidak tertarik kepadanya."
  },
  {
    "ayat": 21,
    "arabic": "وَقَالَ الَّذِى اشْتَرٰىهُ مِنْ مِّصْرَ لِامْرَاَتِهٖٓ اَكْرِمِيْ مَثْوٰىهُ عَسٰىٓ اَنْ يَّنْفَعَنَآ اَوْ نَتَّخِذَهٗ وَلَدًا ۗوَكَذٰلِكَ مَكَّنَّا لِيُوْسُفَ فِى الْاَرْضِۖ وَلِنُعَلِّمَهٗ مِنْ تَأْوِيْلِ الْاَحَادِيْثِۗ وَاللّٰهُ غَالِبٌ عَلٰٓى اَمْرِهٖ وَلٰكِنَّ اَكْثَرَ النَّاسِ لَا يَعْلَمُوْنَ",
    "transliteration_en": "Wa qaalal lazish taraahu mim Misra limra atiheee akrimee maswaahu 'asaaa any-yanfa'anaaa aw nattakhizahoo waladaa; wa kazaalika mak-kannaa li-Yoosufa fil ardi wa linu'allimahoo min taaweelil ahaadees; wallaahu ghaalibun 'alaaa amrihee wa laakinna aksaran naasi laa ya'lamoon",
    "transliteration_id": "Wa qālal-lażisytarāhu mim miṣra limra'atihī akrimī maṡwāhu ‘asā ay yanfa‘anā au nattakhiżahū waladā(n), wa każālika makkannā liyūsufa fil-arḍ(i), wa linu‘allimahū min ta'wīlil-aḥādīṡ(i), wallāhu gālibun ‘alā amrihī wa lākinna akṡaran-nāsi lā ya‘lamūn(a).",
    "translation_en": "And the one from Egypt who bought him said to his wife, \"Make his residence comfortable. Perhaps he will benefit us, or we will adopt him as a son.\" And thus, We established Joseph in the land that We might teach him the interpretation of events. And Allah is predominant over His affair, but most of the people do not know.",
    "translation_id": "Orang Mesir yang membelinya berkata kepada istrinya, “Berikanlah kepadanya tempat (dan layanan) yang baik. Mudah-mudahan dia bermanfaat bagi kita atau kita pungut dia sebagai anak.” Demikianlah, (kelak setelah dewasa,) Kami memberikan kedudukan yang baik kepada Yusuf di negeri (Mesir) dan agar Kami mengajarkan kepadanya takwil mimpi. Allah berkuasa terhadap urusan-Nya, tetapi kebanyakan manusia tidak mengerti."
  },
  {
    "ayat": 22,
    "arabic": "وَلَمَّا بَلَغَ اَشُدَّهٗٓ اٰتَيْنٰهُ حُكْمًا وَّعِلْمًا ۗوَكَذٰلِكَ نَجْزِى الْمُحْسِنِيْنَ",
    "transliteration_en": "Wa lammaa balagha ashuddahooo aatainaahu bukmanw wa 'ilmaa; wa kazaa lika najzil muhsineen",
    "transliteration_id": "Wa lammā balaga asyuddahū ātaināhu ḥukmaw wa ‘ilmā(n), wa każālika najzil-muḥsinīn(a).",
    "translation_en": "And when Joseph reached maturity, We gave him judgment and knowledge. And thus We reward the doers of good.",
    "translation_id": "Ketika dia telah cukup dewasa, Kami berikan kepadanya kearifan dan ilmu. Demikianlah, Kami memberi balasan kepada orang-orang yang berbuat baik."
  },
  {
    "ayat": 23,
    "arabic": "وَرَاوَدَتْهُ الَّتِيْ هُوَ فِيْ بَيْتِهَا عَنْ نَّفْسِهٖ وَغَلَّقَتِ الْاَبْوَابَ وَقَالَتْ هَيْتَ لَكَ ۗقَالَ مَعَاذَ اللّٰهِ اِنَّهٗ رَبِّيْٓ اَحْسَنَ مَثْوَايَۗ اِنَّهٗ لَا يُفْلِحُ الظّٰلِمُوْنَ",
    "transliteration_en": "Wa raawadat hul latee huwa fee baitihaa 'an nafsihee wa ghallaqatil abwaaba wa qaalat haita lak; qaala ma'aazal laahi innahoo rabbeee ahsana maswaay; innahoo laa yuflihuz-zaalimoon",
    "transliteration_id": "Wa rāwadathul-latī huwa fī baitihā ‘an nafsihī wa gallaqatil-abwāba wa qālat haita lak(a), qāla ma‘āżallāhi innahū rabbī aḥsana maṡwāy(a), innahū lā yuflihuẓ-ẓālimūn(a).",
    "translation_en": "And she, in whose house he was, sought to seduce him. She closed the doors and said, \"Come, you.\" He said, \"[I seek] the refuge of Allah. Indeed, he is my master, who has made good my residence. Indeed, wrongdoers will not succeed.\"",
    "translation_id": "Perempuan, yang dia (Yusuf) tinggal di rumahnya, menggodanya. Dia menutup rapat semua pintu, lalu berkata, “Marilah mendekat kepadaku.” Yusuf berkata, “Aku berlindung kepada Allah. Sesungguhnya dia (suamimu) adalah tuanku. Dia telah memperlakukanku dengan baik. Sesungguhnya orang-orang zalim tidak akan beruntung.”"
  },
  {
    "ayat": 24,
    "arabic": "وَلَقَدْ هَمَّتْ بِهٖۙ وَهَمَّ بِهَا ۚ لَوْلَآ اَنْ رَّاٰ بُرْهَانَ رَبِّهٖۗ  كَذٰلِكَ لِنَصْرِفَ عَنْهُ السُّوْۤءَ وَالْفَحْشَاۤءَۗ اِنَّهٗ مِنْ عِبَادِنَا الْمُخْلَصِيْنَ",
    "transliteration_en": "Wa laqad hammat bihee wa hamma bihaa law laaa ar ra-aa burhaana rabbih;; kazaalika linasrifa 'anhu sooo'a walfa hshaaa'; innahoo min 'ibaadi nal mukhlaseen",
    "transliteration_id": "Wa laqad hammat bihī wa hamma bihā lau lā ar ra'ā burhāna rabbih(ī), każālika linaṣrifa ‘anhus-sū'a wal-faḥsyā'(a), innahū min ‘ibādinal-mukhlaṣīn(a).",
    "translation_en": "And she certainly determined [to seduce] him, and he would have inclined to her had he not seen the proof of his Lord. And thus [it was] that We should avert from him evil and immorality. Indeed, he was of Our chosen servants.",
    "translation_id": "Sungguh, perempuan itu benar-benar telah berkehendak kepadanya (Yusuf). Yusuf pun berkehendak kepadanya sekiranya dia tidak melihat tanda (dari) Tuhannya. Demikianlah, Kami memalingkan darinya keburukan dan kekejian. Sesungguhnya dia (Yusuf) termasuk hamba-hamba Kami yang terpilih."
  },
  {
    "ayat": 25,
    "arabic": "وَاسْتَبَقَا الْبَابَ وَقَدَّتْ قَمِيْصَهٗ مِنْ دُبُرٍ وَّاَلْفَيَا سَيِّدَهَا لَدَا الْبَابِۗ قَالَتْ مَا جَزَاۤءُ مَنْ اَرَادَ بِاَهْلِكَ سُوْۤءًا اِلَّآ اَنْ يُّسْجَنَ اَوْ عَذَابٌ اَلِيْمٌ",
    "transliteration_en": "Wastabaqal baaba wa qaddat qameesahoo min dubu rinw wa alfayaa saiyidahaa ladal baab; qaalat maa jazaaa'u man araada bi ahlika sooo'an illaaa any-yusjana aw azaabun aleem",
    "transliteration_id": "Wastabaqal-bāba wa qaddat qamīṣahū min duburiw wa alfayā sayyidahā ladal-bāb(i), qālat mā jazā'u man arāda bi'ahlika sū'an illā ay yusjana au ‘ażābun alīm(un).",
    "translation_en": "And they both raced to the door, and she tore his shirt from the back, and they found her husband at the door. She said, \"What is the recompense of one who intended evil for your wife but that he be imprisoned or a painful punishment?\"",
    "translation_id": "Keduanya berlomba menuju pintu dan perempuan itu menarik bajunya (Yusuf) dari belakang hingga koyak dan keduanya mendapati suami perempuan itu di depan pintu. Dia (perempuan itu) berkata, “Apakah balasan terhadap orang yang bermaksud buruk terhadap istrimu selain dipenjarakan atau (dihukum dengan) siksa yang pedih?”"
  },
  {
    "ayat": 26,
    "arabic": "قَالَ هِيَ رَاوَدَتْنِيْ عَنْ نَّفْسِيْ وَشَهِدَ شَاهِدٌ مِّنْ اَهْلِهَاۚ اِنْ كَانَ قَمِيْصُهٗ قُدَّ مِنْ قُبُلٍ فَصَدَقَتْ وَهُوَ مِنَ الْكٰذِبِيْنَ",
    "transliteration_en": "Qaala hiya raawadatnee 'an nafsee wa shahida shaahidum min ahlihaa in kaana qameesuhoo qudda min qubulin fasadaqat wa huwa minal kaazibeen",
    "transliteration_id": "Qāla hiya rāwadatnī ‘an nafsī wa syahida syāhidum min ahlihā, in kāna qamīṣuhū qudda min qubulin fa ṣadaqat wa huwa minal-kāżibīn(a).",
    "translation_en": "[Joseph] said, \"It was she who sought to seduce me.\" And a witness from her family testified. \"If his shirt is torn from the front, then she has told the truth, and he is of the liars.",
    "translation_id": "Dia (Yusuf) berkata, “Dia yang menggoda diriku.” Seorang saksi dari keluarga perempuan itu memberikan kesaksian, “Jika bajunya koyak di bagian depan, perempuan itu benar dan dia (Yusuf) termasuk orang-orang yang berdusta."
  },
  {
    "ayat": 27,
    "arabic": "وَاِنْ كَانَ قَمِيْصُهٗ قُدَّ مِنْ دُبُرٍ فَكَذَبَتْ وَهُوَ مِنَ الصّٰدِقِيْنَ",
    "transliteration_en": "Wa in kaana qameesuhoo qudda min duburin fakazabat wa huwa minas saadiqeen",
    "transliteration_id": "Wa in kāna qamīṣuhū qudda min duburin fa każabat wa huwa minaṣ-ṣādiqīn(a).",
    "translation_en": "But if his shirt is torn from the back, then she has lied, and he is of the truthful.\"",
    "translation_id": "Jika bajunya koyak di bagian belakang, perempuan itulah yang berdusta dan dia (Yusuf) termasuk orang-orang yang jujur.”"
  },
  {
    "ayat": 28,
    "arabic": "فَلَمَّا رَاٰ قَمِيْصَهٗ قُدَّ مِنْ دُبُرٍ قَالَ اِنَّهٗ مِنْ كَيْدِكُنَّ ۗاِنَّ كَيْدَكُنَّ عَظِيْمٌ",
    "transliteration_en": "Falammaa ra-aa qamee sahoo qudda min duburin qaala innahoo min kaidikunna inna kaidakunna 'azeem",
    "transliteration_id": "Falammā ra'ā qamīṣahū qudda min duburin qāla innahū min kaidikunn(a), inna kaidakunna ‘aẓīm(un).",
    "translation_en": "So when her husband saw his shirt torn from the back, he said, \"Indeed, it is of the women's plan. Indeed, your plan is great.",
    "translation_id": "Maka, ketika melihat bajunya (Yusuf) koyak di bagian belakang, dia (suami perempuan itu) berkata, “Sesungguhnya ini adalah tipu dayamu (hai kaum wanita). Tipu dayamu benar-benar hebat."
  },
  {
    "ayat": 29,
    "arabic": "يُوْسُفُ اَعْرِضْ عَنْ هٰذَا وَاسْتَغْفِرِيْ لِذَنْۢبِكِۖ اِنَّكِ كُنْتِ مِنَ الْخٰطِـِٕيْنَ ࣖ",
    "transliteration_en": "Yoosofu a'rid 'an haaza wastaghfiree lizambiki innaki kunti minal khaati'een",
    "transliteration_id": "Yūsufu a‘riḍ ‘an hāżā wastagfirī liżambik(i), innaki kunti  minal-khāṭi'īn(a).",
    "translation_en": "Joseph, ignore this. And, [my wife], ask forgiveness for your sin. Indeed, you were of the sinful.\"",
    "translation_id": "Wahai Yusuf, lupakanlah ini dan (wahai istriku,) mohonlah ampunan atas dosamu karena sesungguhnya engkau termasuk orang-orang yang bersalah.”"
  },
  {
    "ayat": 30,
    "arabic": "۞ وَقَالَ نِسْوَةٌ فِى الْمَدِيْنَةِ امْرَاَتُ الْعَزِيْزِ تُرَاوِدُ فَتٰىهَا عَنْ نَّفْسِهٖۚ قَدْ شَغَفَهَا حُبًّاۗ اِنَّا لَنَرٰىهَا فِيْ ضَلٰلٍ مُّبِيْنٍ",
    "transliteration_en": "Wa qaala niswatun filma deenatim ra atul'Azeezi turaawidu fataahaa 'an nafsihee qad shaghafahaa bubbaa; innaa lana raahaa fee dalaalim mubeen",
    "transliteration_id": "Wa qāla niswatun fil-madīnatimra'atul-‘azīzi turāwidu fatāhā ‘an nafsih(ī), qad syagafahā ḥubbā(n), innā lanarāhā fī ḍalālim mubīn(in).",
    "translation_en": "And women in the city said, \"The wife of al-'Azeez is seeking to seduce her slave boy; he has impassioned her with love. Indeed, we see her [to be] in clear error.\"",
    "translation_id": "Para wanita di kota itu berkata, “Istri al-Aziz menggoda pelayannya untuk menaklukkannya. Pelayannya benar-benar membuatnya mabuk cinta. Kami benar-benar memandangnya dalam kesesatan yang nyata.”"
  },
  {
    "ayat": 31,
    "arabic": "فَلَمَّا سَمِعَتْ بِمَكْرِهِنَّ اَرْسَلَتْ اِلَيْهِنَّ وَاَعْتَدَتْ لَهُنَّ مُتَّكَاً وَّاٰتَتْ كُلَّ وَاحِدَةٍ مِّنْهُنَّ سِكِّيْنًا وَّقَالَتِ اخْرُجْ عَلَيْهِنَّ ۚ فَلَمَّا رَاَيْنَهٗٓ اَكْبَرْنَهٗ وَقَطَّعْنَ اَيْدِيَهُنَّۖ وَقُلْنَ حَاشَ لِلّٰهِ مَا هٰذَا بَشَرًاۗ اِنْ هٰذَآ اِلَّا مَلَكٌ كَرِيْمٌ",
    "transliteration_en": "Falammaa sami'at bimak rihinna arsalat ilaihinna wa a'tadat lahunna muttaka anw wa aatat kulla waahidatim min hunna sikkeenanw wa qaala tikh ruj 'alaihinna falammaa ra aynahooo akbarnahoo wa qatta'na aydiyahunna wa qulna haasha lillaahi maa haaza basharaa; in haazaaa illaa malakun kareem",
    "transliteration_id": "Falammā sami‘at bimakrihinna arsalat ilaihinna wa a‘tadat lahunna muttaka'aw wa ātat kulla wāḥidim minhunna sikkīnaw wa qālatikhruj ‘alaihinn(a), falammā ra'ainahū akbarnahū wa qaṭṭa‘na aidiyahunn(a), wa qulna ḥāsya lillāhi mā hāżā illā basyarā(n), in hāżā illā malakun karīm(un).",
    "translation_en": "So when she heard of their scheming, she sent for them and prepared for them a banquet and gave each one of them a knife and said [to Joseph], \"Come out before them.\" And when they saw him, they greatly admired him and cut their hands and said, \"Perfect is Allah! This is not a man; this is none but a noble angel.\"",
    "translation_id": "Maka, ketika dia (istri al-Aziz) mendengar cercaan mereka, dia mengundang wanita-wanita itu dan menyediakan tempat duduk bagi mereka. Dia memberikan sebuah pisau kepada setiap wanita (untuk memotong-motong makanan). Dia berkata (kepada Yusuf), “Keluarlah (tampakkanlah dirimu) kepada mereka.” Ketika wanita-wanita itu melihatnya, mereka sangat terpesona (dengan ketampanannya) dan mereka (tanpa sadar) melukai tangannya sendiri seraya berkata, “Maha Sempurna Allah. Ini bukanlah manusia. Ini benar-benar seorang malaikat yang mulia.”"
  },
  {
    "ayat": 32,
    "arabic": "قَالَتْ فَذٰلِكُنَّ الَّذِيْ لُمْتُنَّنِيْ فِيْهِ ۗوَلَقَدْ رَاوَدْتُّهٗ عَنْ نَّفْسِهٖ فَاسْتَعْصَمَ ۗوَلَىِٕنْ لَّمْ يَفْعَلْ مَآ اٰمُرُهٗ لَيُسْجَنَنَّ وَلَيَكُوْنًا مِّنَ الصّٰغِرِيْنَ",
    "transliteration_en": "Qaalat fazaalikunnal lazee lumtunnanee feeh; wa laqad raawattuhoo 'an nafsihee fasta'sam; wa la'il lam yaf'al maaa aamuruhoo la yusjananna wa la yakoonam minas saaghireen",
    "transliteration_id": "Qālat fa żālikunnal-lażī lumtunnanī fīh(i), wa laqad rāwattuhū ‘an nafsihī fasta‘ṣam(a), wa la'il lam yaf‘al mā āmuruhū layusjananna wa layakūnam minaṣ-ṣāgirīn(a).",
    "translation_en": "She said, \"That is the one about whom you blamed me. And I certainly sought to seduce him, but he firmly refused; and if he will not do what I order him, he will surely be imprisoned and will be of those debased.\"",
    "translation_id": "Dia (istri al-Aziz) berkata, “Itulah orangnya yang menyebabkan kamu mencela aku karena (aku tertarik) kepadanya. Sungguh, aku benar-benar telah menggoda untuk menaklukkan dirinya, tetapi dia menolak. Jika tidak melakukan apa yang aku perintahkan kepadanya, niscaya dia akan dipenjarakan dan benar-benar akan termasuk orang yang hina.”"
  },
  {
    "ayat": 33,
    "arabic": "قَالَ رَبِّ السِّجْنُ اَحَبُّ اِلَيَّ مِمَّا يَدْعُوْنَنِيْٓ اِلَيْهِ ۚوَاِلَّا تَصْرِفْ عَنِّيْ كَيْدَهُنَّ اَصْبُ اِلَيْهِنَّ وَاَكُنْ مِّنَ الْجٰهِلِيْنَ",
    "transliteration_en": "Qaala rabbis sijnu ahabbu ilaiya mimma yad'oo naneee 'ilaihi wa illaa tasrif 'annee kaidahunna asbu ilaihinna wa akum minal jaahileen",
    "transliteration_id": "Qāla rabbis-sijnu aḥabbu ilayya mimmā yad‘ūnanī ilaih(i), wa illā taṣrif ‘annī kaidahunna aṣbu ilaihinna wa akum minal-jāhilīn(a).",
    "translation_en": "He said, \"My Lord, prison is more to my liking than that to which they invite me. And if You do not avert from me their plan, I might incline toward them and [thus] be of the ignorant.\"",
    "translation_id": "(Yusuf) berkata, “Wahai Tuhanku, penjara lebih aku sukai daripada memenuhi ajakan mereka. Jika Engkau tidak menghindarkan tipu daya mereka dariku, niscaya aku akan cenderung untuk (memenuhi keinginan mereka) dan tentu aku termasuk orang-orang yang bodoh.”"
  },
  {
    "ayat": 34,
    "arabic": "فَاسْتَجَابَ لَهٗ رَبُّهٗ فَصَرَفَ عَنْهُ كَيْدَهُنَّ ۗاِنَّهٗ هُوَ السَّمِيْعُ الْعَلِيْمُ",
    "transliteration_en": "Fastajaaba lahoo rabbuhoo fasarafa 'anhu kaidahunn; innahoo Huswas_Samee'ul 'Aleem",
    "transliteration_id": "Fastajāba lahū rabbuhū fa ṣarafa ‘anhu kaidahunn(a), innahū huwas-samī‘ul-‘alīm(u).",
    "translation_en": "So his Lord responded to him and averted from him their plan. Indeed, He is the Hearing, the Knowing.",
    "translation_id": "Maka, Tuhannya memperkenankan (doa)-nya dan menghindarkannya dari tipu daya mereka. Sesungguhnya Dialah yang Maha Mendengar lagi Maha Mengetahui."
  },
  {
    "ayat": 35,
    "arabic": "ثُمَّ بَدَا لَهُمْ مِّنْۢ بَعْدِ مَا رَاَوُا الْاٰيٰتِ لَيَسْجُنُنَّهٗ حَتّٰى حِيْنٍ ࣖ",
    "transliteration_en": "Summa badaa lahum mim ba'di maa ra-awul Aayaati layasjununnahoo hatta heen",
    "transliteration_id": "Ṡumma badā lahum mim ba‘di mā ra'awul-āyāti layasjununnahū ḥattā ḥīn(in).",
    "translation_en": "Then it appeared to them after they had seen the signs that al-'Azeez should surely imprison him for a time.",
    "translation_id": "Kemudian timbul pikiran pada mereka setelah melihat tanda-tanda (kebenaran Yusuf) bahwa mereka harus memenjarakannya sampai waktu tertentu."
  },
  {
    "ayat": 36,
    "arabic": "وَدَخَلَ مَعَهُ السِّجْنَ فَتَيٰنِ ۗقَالَ اَحَدُهُمَآ اِنِّيْٓ اَرٰىنِيْٓ اَعْصِرُ خَمْرًا ۚوَقَالَ الْاٰخَرُ اِنِّيْٓ اَرٰىنِيْٓ اَحْمِلُ فَوْقَ رَأْسِيْ خُبْزًا تَأْكُلُ الطَّيْرُ مِنْهُ ۗنَبِّئْنَا بِتَأْوِيْلِهٖ ۚاِنَّا نَرٰىكَ مِنَ الْمُحْسِنِيْنَ",
    "transliteration_en": "Wa dakhala ma'ahussijna fata yaan; qaala ahaduhumaaa inneee araaneee a'siru khamranw wa qaalal aakharu inneee khubzan taakulut tairu minh; nabbi 'naa bitaaweelihee innaa naraaka minal muhsineen",
    "transliteration_id": "Wa dakhala ma‘ahus-sijna fatayān(i), qāla aḥaduhumā innī arānī a‘ṣiru khamrā(n), wa qālal-ākharu innī arānī aḥmilu fauqa ra'sī khubzan ta'kuluṭ-ṭairu minh(u), nabbi'nā bita'wīlih(ī), innā narāka minal-muḥsinīn(a).",
    "translation_en": "And there entered the prison with him two young men. One of them said, \"Indeed, I have seen myself [in a dream] pressing wine.\" The other said, \"Indeed, I have seen myself carrying upon my head [some] bread, from which the birds were eating. Inform us of its interpretation; indeed, we see you to be of those who do good.\"",
    "translation_id": "Bersama dia (Yusuf) masuk pula dua orang pemuda ke dalam penjara. Salah satunya berkata, “Sesungguhnya aku bermimpi memeras anggur,” dan yang lainnya berkata, “Aku bermimpi membawa roti di atas kepalaku. Sebagiannya dimakan burung.” (Keduanya berkata,) “Jelaskanlah kepada kami takwilnya! Sesungguhnya kami memandangmu termasuk orang-orang yang berbuat baik.”"
  },
  {
    "ayat": 37,
    "arabic": "قَالَ لَا يَأْتِيْكُمَا طَعَامٌ تُرْزَقٰنِهٖٓ اِلَّا نَبَّأْتُكُمَا بِتَأْوِيْلِهٖ قَبْلَ اَنْ يَّأْتِيَكُمَا ۗذٰلِكُمَا مِمَّا عَلَّمَنِيْ رَبِّيْۗ اِنِّيْ تَرَكْتُ مِلَّةَ قَوْمٍ لَّا يُؤْمِنُوْنَ بِاللّٰهِ وَهُمْ بِالْاٰخِرَةِ هُمْ كٰفِرُوْنَۙ",
    "transliteration_en": "Qaala laa yaateekumaa ta'aamun turzaqaaniheee illaa nabbaatukumaa bitaaweelihee qabla any yaatiyakumaa; zaali kumaa mimmaa 'allamanee rabbee; innee taraktu millata qawmil laa yu'minoona billaahi wahum bil aakhirati hum kaafiroon",
    "transliteration_id": "Qāla lā ya'tīkumā ṭa‘āmun turzaqānihī illā nabba'tukumā bita'wīlihī qabla ay ya'tiyakumā, żālikumā mimmā ‘allamanī rabbī, innī taraktu millata qaumil lā yu'minūna billāhi wa hum bil-ākhirati hum kāfirūn(a).",
    "translation_en": "He said, \"You will not receive food that is provided to you except that I will inform you of its interpretation before it comes to you. That is from what my Lord has taught me. Indeed, I have left the religion of a people who do not believe in Allah, and they, in the Hereafter, are disbelievers.",
    "translation_id": "(Yusuf) berkata, “Tidak ada makanan apa pun yang akan diberikan kepadamu berdua, kecuali aku telah menjelaskan takwilnya sebelum (makanan) itu sampai kepadamu. Itu sebagian dari yang diajarkan Tuhan kepadaku. Sesungguhnya aku telah meninggalkan agama kaum yang tidak beriman kepada Allah, bahkan kepada akhirat pun mereka ingkar."
  },
  {
    "ayat": 38,
    "arabic": "وَاتَّبَعْتُ مِلَّةَ اٰبَاۤءِيْٓ اِبْرٰهِيْمَ وَاِسْحٰقَ وَيَعْقُوْبَۗ مَا كَانَ لَنَآ اَنْ نُّشْرِكَ بِاللّٰهِ مِنْ شَيْءٍۗ ذٰلِكَ مِنْ فَضْلِ اللّٰهِ عَلَيْنَا وَعَلَى النَّاسِ وَلٰكِنَّ اَكْثَرَ النَّاسِ لَا يَشْكُرُوْنَ",
    "transliteration_en": "Wattab'tu millata aabaaa'eee Ibraaheema wa Ishaaqa wa Ya'qoob; maa kaana lanaaa an nushrika billaahi min shai' zaalikamin fadlil laahi 'alainaa wa 'alan naasi wa laakinna aksaran naasi laa yashkuroon",
    "transliteration_id": "Wattaba‘tu millata ābā'ī ibrāhīma wa isḥāqa wa ya‘qūb(a), mā kāna lanā an nusyrika  billāhi min syai'(in), żālika min faḍlillāhi ‘alainā wa ‘alan-nāsi wa lākinna akṡaran-nāsi lā yasykurūn(a).",
    "translation_en": "And I have followed the religion of my fathers, Abraham, Isaac and Jacob. And it was not for us to associate anything with Allah. That is from the favor of Allah upon us and upon the people, but most of the people are not grateful.",
    "translation_id": "Aku mengikuti agama nenek moyangku, (yaitu) Ibrahim, Ishaq, dan Ya‘qub. Tidak pantas bagi kami mempersekutukan suatu apa pun dengan Allah. Itu adalah bagian dari karunia Allah kepada kami dan kepada manusia (semuanya), tetapi kebanyakan manusia tidak bersyukur."
  },
  {
    "ayat": 39,
    "arabic": "يٰصَاحِبَيِ السِّجْنِ ءَاَرْبَابٌ مُّتَفَرِّقُوْنَ خَيْرٌ اَمِ اللّٰهُ الْوَاحِدُ الْقَهَّارُۗ",
    "transliteration_en": "Yaa saahibayis sijni 'a-arbaabum mutafarriqoona khayrun amil laahul waahidul qahhaar",
    "transliteration_id": "Yā ṣāḥibayis-sijni a'arbābum mutafarriqūna khairun amillāhul-wāḥidul-qahhār(u).",
    "translation_en": "O [my] two companions of prison, are separate lords better or Allah, the One, the Prevailing?",
    "translation_id": "Wahai dua penghuni penjara, manakah yang lebih baik, tuhan-tuhan yang bermacam-macam itu ataukah Allah Yang Maha Esa lagi Maha Perkasa?"
  },
  {
    "ayat": 40,
    "arabic": "مَا تَعْبُدُوْنَ مِنْ دُوْنِهٖٓ اِلَّآ اَسْمَاۤءً سَمَّيْتُمُوْهَآ اَنْتُمْ وَاٰبَاۤؤُكُمْ مَّآ اَنْزَلَ اللّٰهُ بِهَا مِنْ سُلْطٰنٍۗ اِنِ الْحُكْمُ اِلَّا لِلّٰهِ ۗاَمَرَ اَلَّا تَعْبُدُوْٓا اِلَّآ اِيَّاهُ ۗذٰلِكَ الدِّيْنُ الْقَيِّمُ وَلٰكِنَّ اَكْثَرَ النَّاسِ لَا يَعْلَمُوْنَ",
    "transliteration_en": "Maa ta'budoona min doonihee illaaa asmaaa'an sam maitumoohaaa antum wa aabaaa'ukum maaa anzalal laahu bihaa min sultan; inilhukmu illaa lillaah; amara allaa ta'budooo illaaa iyyaah; zaalikad deenul qaiyimu wa laakinna aksaran naasi laa ya'lamoon",
    "transliteration_id": "Mā ta‘budūna min dūnihī illā asmā'an sammaitumūhā antum wa ābā'ukum mā anzalallāhu bihā min sulṭān(in), inil-ḥukmu illā lillāh(i), amara allā ta‘budū illā iyyāh(u), żālikad-dīnul-qayyimu wa lākinna akṡaran-nāsi lā ya‘lamūn(a).",
    "translation_en": "You worship not besides Him except [mere] names you have named them, you and your fathers, for which Allah has sent down no authority. Legislation is not but for Allah. He has commanded that you worship not except Him. That is the correct religion, but most of the people do not know.",
    "translation_id": "Apa yang kamu sembah selain Dia hanyalah nama-nama (berhala) yang kamu dan nenek moyangmu buat sendiri. Allah tidak menurunkan suatu keterangan apa pun yang pasti tentang hal (nama-nama) itu. Ketetapan (yang pasti benar) itu hanyalah milik Allah. Dia telah memerintahkan agar kamu tidak menyembah selain Dia. Itulah agama yang lurus, tetapi kebanyakan manusia tidak mengetahui."
  },
  {
    "ayat": 41,
    "arabic": "يٰصَاحِبَيِ السِّجْنِ اَمَّآ اَحَدُكُمَا فَيَسْقِيْ رَبَّهٗ خَمْرًا ۗوَاَمَّا الْاٰخَرُ فَيُصْلَبُ فَتَأْكُلُ الطَّيْرُ مِنْ رَّأْسِهٖ ۗ قُضِيَ الْاَمْرُ الَّذِيْ فِيْهِ تَسْتَفْتِيٰنِۗ",
    "transliteration_en": "Yaa saahibayis sijni ammaaa ahadukumaa fa yasqee rabbahoo khamranw wa ammal aakharu fa yuslabu fataakulut tairu mir raasih; qudiyal amrul lazee feehi tastaftiyaan",
    "transliteration_id": "Yā ṣāḥibayis-sijni ammā aḥadukumā fa yasqī rabbahū khamrā(n), wa ammal-ākharu fa yuṣlabu fa ta'kuluṭ-ṭairu mir ra'sih(ī), quḍiyal-amrul-lażī fīhi tastaftiyān(i).",
    "translation_en": "O two companions of prison, as for one of you, he will give drink to his master of wine; but as for the other, he will be crucified, and the birds will eat from his head. The matter has been decreed about which you both inquire.\"",
    "translation_id": "Wahai dua penghuni penjara, salah seorang di antara kamu akan bertugas menyediakan minuman khamar bagi tuannya, sedangkan yang lain akan disalib. Lalu, burung akan memakan sebagian kepalanya. Telah terjawab perkara yang kamu berdua tanyakan (kepadaku).”"
  },
  {
    "ayat": 42,
    "arabic": "وَقَالَ لِلَّذِيْ ظَنَّ اَنَّهٗ نَاجٍ مِّنْهُمَا اذْكُرْنِيْ عِنْدَ رَبِّكَۖ فَاَنْسٰىهُ الشَّيْطٰنُ ذِكْرَ رَبِّهٖ فَلَبِثَ فِى السِّجْنِ بِضْعَ سِنِيْنَ ࣖ",
    "transliteration_en": "Wa qaala lillazee zanna annahoo najim minhumaz kurnee 'inda rabbika fa-ansaahush Shaitaanu zikra Rabbihee falabisa fis sijni bad'a sineen",
    "transliteration_id": "Wa qāla lil-lażī ẓanna annahū nājim minhumażkurnī ‘inda rabbik(a), fa ansāhusy-syaiṭānu żikra rabbihī fa labiṡa fis-sijni biḍ‘a sinīn(a).",
    "translation_en": "And he said to the one whom he knew would go free, \"Mention me before your master.\" But Satan made him forget the mention [to] his master, and Joseph remained in prison several years.",
    "translation_id": "Dia (Yusuf) berkata kepada orang yang diketahuinya akan selamat di antara mereka berdua, “Jelaskanlah keadaanku kepada tuanmu.” Kemudian, setan menjadikan dia lupa untuk menjelaskan (keadaan Yusuf) kepada tuannya. Karena itu, dia (Yusuf) tetap dalam penjara beberapa tahun lamanya."
  },
  {
    "ayat": 43,
    "arabic": "وَقَالَ الْمَلِكُ اِنِّيْٓ اَرٰى سَبْعَ بَقَرٰتٍ سِمَانٍ يَّأْكُلُهُنَّ سَبْعٌ عِجَافٌ وَّسَبْعَ سُنْۢبُلٰتٍ خُضْرٍ وَّاُخَرَ يٰبِسٰتٍۗ  يٰٓاَيُّهَا الْمَلَاُ اَفْتُوْنِيْ فِيْ رُءْيَايَ اِنْ كُنْتُمْ لِلرُّءْيَا تَعْبُرُوْنَ",
    "transliteration_en": "Wa qaalal maliku inneee araa sab'a baqaraatin simaaniny yaakuluhunna sab'un 'ijaafunw wa sab'a sumbulaatinkhudrinw wa ukhara yaabisaat; yaaa ayuhal mala-u aftoonee fee nu'yaaya in kuntum lirru'yaa ta'buroon",
    "transliteration_id": "Wa qālal-maliku innī arā sab‘a baqarātin simāniy ya'kuluhunna sab‘un ‘ijāfuw wa sab‘a sumbulātin khuḍriw wa ukhara yābisāt(in), yā ayyuhal-mala'u aftūnī fī ru'yāya in kuntum lir-ru'yā ta‘burūn(a).",
    "translation_en": "And [subsequently] the king said, \"Indeed, I have seen [in a dream] seven fat cows being eaten by seven [that were] lean, and seven green spikes [of grain] and others [that were] dry. O eminent ones, explain to me my vision, if you should interpret visions.\"",
    "translation_id": "Raja berkata (kepada para pemuka kaumnya), “Sesungguhnya aku bermimpi melihat tujuh ekor sapi yang gemuk dimakan oleh tujuh ekor sapi yang kurus serta tujuh tangkai (gandum) yang hijau (dan tujuh tangkai) lainnya yang kering. Wahai para pemuka kaum, jelaskanlah kepadaku tentang mimpiku itu jika kamu dapat menakwilkannya!”"
  },
  {
    "ayat": 44,
    "arabic": "قَالُوْٓا اَضْغَاثُ اَحْلَامٍ ۚوَمَا نَحْنُ بِتَأْوِيْلِ الْاَحْلَامِ بِعٰلِمِيْنَ",
    "transliteration_en": "Qaalooo adghaasu ahlaa minw wa maa nahnu bitaaweelil ahlaami bi'aalimeen",
    "transliteration_id": "Qālū aḍgāṡu aḥlām(in), wa mā naḥnu bita'wīlil-aḥlāmi bi‘ālimīn(a).",
    "translation_en": "They said, \"[It is but] a mixture of false dreams, and we are not learned in the interpretation of dreams.\"",
    "translation_id": "Mereka menjawab, “(Itu) mimpi-mimpi yang kosong dan kami sekali-kali tidak mampu menakwilkan mimpi itu.”"
  },
  {
    "ayat": 45,
    "arabic": "وَقَالَ الَّذِيْ نَجَا مِنْهُمَا وَادَّكَرَ بَعْدَ اُمَّةٍ اَنَا۠ اُنَبِّئُكُمْ بِتَأْوِيْلِهٖ فَاَرْسِلُوْنِ",
    "transliteration_en": "Wa qaalal lazee najaa minhumaa waddakara ba'da ummatin ana unabbi'ukum bitalweelihee fa-arsiloon",
    "transliteration_id": "Wa qālal-lażī najā minhumā waddakara  ba‘da ummatin ana unabbi'ukum bita'wīlihī fa arsilūn(i).",
    "translation_en": "But the one who was freed and remembered after a time said, \"I will inform you of its interpretation, so send me forth.\"",
    "translation_id": "Orang yang selamat di antara mereka berdua berkata dan teringat (perihal Yusuf) setelah beberapa waktu lamanya, “Aku akan memberitahukan kepadamu tentang (orang yang pandai) menakwilkan mimpi itu. Maka, utuslah aku (kepadanya).”"
  },
  {
    "ayat": 46,
    "arabic": "يُوْسُفُ اَيُّهَا الصِّدِّيْقُ اَفْتِنَا فِيْ سَبْعِ بَقَرٰتٍ سِمَانٍ يَّأْكُلُهُنَّ سَبْعٌ عِجَافٌ وَّسَبْعِ سُنْۢبُلٰتٍ خُضْرٍ وَّاُخَرَ يٰبِسٰتٍۙ  لَّعَلِّيْٓ اَرْجِعُ اِلَى النَّاسِ لَعَلَّهُمْ يَعْلَمُوْنَ",
    "transliteration_en": "Yoosufu ayyuhas siddee qu aftinaa fee sab'i baqaraatin simaaniny yaakuluhunna sab'un 'ijaafunw wa sabi'i sumbulaatin khudrinw wa ukhara yaabisaatil la'alleee arj'u ilan naasi la'allahum ya'lamoon",
    "transliteration_id": "Yūsufu ayyuhaṣ-ṣiddīqu aftinā fī sab‘i baqarātin simāniy ya'kuluhunna sab‘un ‘ijāfuw wa sab‘i sumbulātin khuḍriw wa ukhara yābisāt(in), la‘allī arji‘u ilan-nāsi la‘allahum ya‘lamūn(a).",
    "translation_en": "[He said], \"Joseph, O man of truth, explain to us about seven fat cows eaten by seven [that were] lean, and seven green spikes [of grain] and others [that were] dry - that I may return to the people; perhaps they will know [about you].\"",
    "translation_id": "(Dia berkata,) “Wahai Yusuf, orang yang sangat dipercaya, jelaskanlah kepada kami (takwil mimpiku) tentang tujuh ekor sapi gemuk yang dimakan oleh tujuh (ekor sapi) kurus dan tujuh tangkai (gandum) hijau yang (meliputi tujuh tangkai) lainnya yang kering agar aku kembali kepada orang-orang itu supaya mereka mengetahuinya.”"
  },
  {
    "ayat": 47,
    "arabic": "قَالَ تَزْرَعُوْنَ سَبْعَ سِنِيْنَ دَاَبًاۚ فَمَا حَصَدْتُّمْ فَذَرُوْهُ فِيْ سُنْۢبُلِهٖٓ اِلَّا قَلِيْلًا مِّمَّا تَأْكُلُوْنَ",
    "transliteration_en": "Qaala tazra'oona sab'a sineena da aban famaa basattum fazaroohu fee sumbu liheee illaa qaleelam mimmaa taakuloon",
    "transliteration_id": "Qāla tazra‘ūna sab‘a sinīna da'abā(n), famā ḥaṣattum fa żarūhu fī sumbulihī illā qalīlam mimmā ta'kulūn(a).",
    "translation_en": "[Joseph] said, \"You will plant for seven years consecutively; and what you harvest leave in its spikes, except a little from which you will eat.",
    "translation_id": "(Yusuf) berkata, “Bercocoktanamlah kamu tujuh tahun berturut-turut! Kemudian apa yang kamu tuai, biarkanlah di tangkainya, kecuali sedikit untuk kamu makan."
  },
  {
    "ayat": 48,
    "arabic": "ثُمَّ يَأْتِيْ مِنْۢ بَعْدِ ذٰلِكَ سَبْعٌ شِدَادٌ يَّأْكُلْنَ مَا قَدَّمْتُمْ لَهُنَّ اِلَّا قَلِيْلًا مِّمَّا تُحْصِنُوْنَ",
    "transliteration_en": "Summa yaatee mim ba'di zaalika sab'un shidaaduny yaa kulna maa qaddamtum lahunna illaa qaleelam mimma tuhsinoon",
    "transliteration_id": "Ṡumma ya'tī mim ba‘di żālika sab‘un syidāduy ya'kulna mā qaddamtum lahunna illā qalīlam mimmā tuḥṣinūn(a).",
    "translation_en": "Then will come after that seven difficult [years] which will consume what you saved for them, except a little from which you will store.",
    "translation_id": "Kemudian, sesudah itu akan datang tujuh (tahun) yang sangat sulit (paceklik) yang menghabiskan apa yang kamu simpan untuk menghadapinya, kecuali sedikit dari apa (bibit gandum) yang kamu simpan."
  },
  {
    "ayat": 49,
    "arabic": "ثُمَّ يَأْتِيْ مِنْۢ بَعْدِ ذٰلِكَ عَامٌ فِيْهِ يُغَاثُ النَّاسُ وَفِيْهِ يَعْصِرُوْنَ ࣖ",
    "transliteration_en": "Summa yadtee mim ba'di zaalika 'aamun feehi yughaa sun naasu wa feehi ya'siroon",
    "transliteration_id": "Ṡumma ya'tī mim ba‘di żālika ‘āmun fīhi yugāṡun-nāsu wa fīhi ya‘ṣirūn(a).",
    "translation_en": "Then will come after that a year in which the people will be given rain and in which they will press [olives and grapes].\"",
    "translation_id": "Setelah itu akan datang tahun, ketika manusia diberi hujan (dengan cukup) dan pada masa itu mereka memeras (anggur).”"
  },
  {
    "ayat": 50,
    "arabic": "وَقَالَ الْمَلِكُ ائْتُوْنِيْ بِهٖ ۚفَلَمَّا جَاۤءَهُ الرَّسُوْلُ قَالَ ارْجِعْ اِلٰى رَبِّكَ فَسْـَٔلْهُ مَا بَالُ النِّسْوَةِ الّٰتِيْ قَطَّعْنَ اَيْدِيَهُنَّ ۗاِنَّ رَبِّيْ بِكَيْدِهِنَّ عَلِيْمٌ",
    "transliteration_en": "Wa qaalal maliku'toonee bihee falammaa jaaa'ahur rasoolu qaalar-ji ilaa rabbika fas'alhu maa baalun niswatil laatee qatta'na aydiyahunn; inna Rabbee bikaidihinna 'Aleem",
    "transliteration_id": "Wa qālal-maliku'tūnī bih(ī), falammā jā'ahur-rasūlu qālarji‘ ilā rabbika fas'alhu mā bālun-niswatil-lātī qaṭṭa‘na aidiyahunn(a), inna rabbī bikaidihinna ‘alīm(un).",
    "translation_en": "And the king said, \"Bring him to me.\" But when the messenger came to him, [Joseph] said, \"Return to your master and ask him what is the case of the women who cut their hands. Indeed, my Lord is Knowing of their plan.\"",
    "translation_id": "Raja berkata, “Bawalah dia kepadaku!” Ketika utusan itu datang kepadanya, dia (Yusuf) berkata, “Kembalilah kepada tuanmu dan tanyakan kepadanya bagaimana perihal wanita-wanita yang telah melukai tangannya. Sesungguhnya Tuhanku Maha Mengetahui tipu daya mereka.”"
  }
]