[
  {
    "ayat": 51,
    "arabic": "قَالَ مَا خَطْبُكُنَّ اِذْ رَاوَدْتُّنَّ يُوْسُفَ عَنْ نَّفْسِهٖۗ  قُلْنَ حَاشَ لِلّٰهِ مَا عَلِمْنَا عَلَيْهِ مِنْ سُوْۤءٍ ۗقَالَتِ امْرَاَتُ الْعَزِيْزِ الْـٰٔنَ حَصْحَصَ الْحَقُّۖ اَنَا۠ رَاوَدْتُّهٗ عَنْ نَّفْسِهٖ وَاِنَّهٗ لَمِنَ الصّٰدِقِيْنَ",
    "transliteration_en": "Qaala maa khatbukunna iz raawattunna Yoosufa 'annafsih; qulna haasha lillaahi maa 'alimnaa 'alaihi min sooo'; qaalatim ra atul 'Azeezil 'aana hashasal haqq, ana raawat tuhoo 'an nafsihee wa innahoo laminas saadiqeen",
    "transliteration_id": "Qāla mā khaṭbukunna iż rāwattunna yūsufa ‘an nafsih(ī), qulna ḥāsya lillāhi mā ‘alimnā ‘alaihi min sū'(in), qālatimra'atul-‘azīzil-āna ḥaṣḥaṣal-ḥaqq(u), ana rāwattuhū ‘an nafsihī wa innahū laminaṣ-ṣādiqīn(a).",
    "translation_en": "Said [the king to the women], \"What was your condition when you sought to seduce Joseph?\" They said, \"Perfect is Allah! We know about him no evil.\" The wife of al-'Azeez said, \"Now the truth has become evident. It was I who sought to seduce him, and indeed, he is of the truthful.",
    "translation_id": "Dia (raja) berkata (kepada wanita-wanita itu), “Bagaimana keadaanmu ketika kamu menggoda Yusuf untuk menundukkan dirinya?” Mereka berkata, “Maha Sempurna Allah. Kami tidak mengetahui sesuatu keburukan darinya.” Istri al-Aziz berkata, “Sekarang jelaslah kebenaran itu. Akulah yang menggodanya dan sesungguhnya dia termasuk orang-orang yang benar.”"
  },
  {
    "ayat": 52,
    "arabic": "ذٰلِكَ لِيَعْلَمَ اَنِّيْ لَمْ اَخُنْهُ بِالْغَيْبِ وَاَنَّ اللّٰهَ لَا يَهْدِيْ كَيْدَ الْخَاۤىِٕنِيْنَ  ۔",
    "transliteration_en": "Zaalika liya'lama annee lam akhunhu bilghaibi wa annal laaha laa yahdee kaidal khaaa'ineen",
    "transliteration_id": "Żālika liya‘lama annī lam akhunhu bil-gaibi wa annallāha lā yahdī kaidal-khā'inīn(a).",
    "translation_en": "That is so al-'Azeez will know that I did not betray him in [his] absence and that Allah does not guide the plan of betrayers.",
    "translation_id": "(Yusuf berkata,) “Yang demikian itu agar dia (al-Aziz) mengetahui bahwa aku benar-benar tidak mengkhianatinya ketika dia tidak ada (di rumah) dan bahwa sesungguhnya Allah tidak meridai tipu daya orang-orang yang berkhianat."
  },
  {
    "ayat": 53,
    "arabic": "۞ وَمَآ اُبَرِّئُ نَفْسِيْۚ اِنَّ النَّفْسَ لَاَمَّارَةٌ ۢ بِالسُّوْۤءِ اِلَّا مَا رَحِمَ رَبِّيْۗ اِنَّ رَبِّيْ غَفُوْرٌ رَّحِيْمٌ",
    "transliteration_en": "Wa maa ubarri'u nafsee; innan nafsa la ammaaratum bissooo'i illaa maa rahima Rabbee; inna Rabbee Ghafoorur Raheem",
    "transliteration_id": "Wa mā ubarri'u nafsī, innan-nafsa la'ammāratum bis-sū'i illā mā raḥima rabbī, inna rabbī gafūrur raḥīm(un).",
    "translation_en": "And I do not acquit myself. Indeed, the soul is a persistent enjoiner of evil, except those upon which my Lord has mercy. Indeed, my Lord is Forgiving and Merciful.\"",
    "translation_id": "Aku tidak (menyatakan) diriku bebas (dari kesalahan) karena sesungguhnya nafsu itu selalu mendorong kepada kejahatan, kecuali (nafsu) yang diberi rahmat oleh Tuhanku. Sesungguhnya Tuhanku Maha Pengampun lagi Maha Penyayang.”"
  },
  {
    "ayat": 54,
    "arabic": "وَقَالَ الْمَلِكُ ائْتُوْنِيْ بِهٖٓ اَسْتَخْلِصْهُ لِنَفْسِيْۚ فَلَمَّا كَلَّمَهٗ قَالَ اِنَّكَ الْيَوْمَ لَدَيْنَا مَكِيْنٌ اَمِيْنٌ",
    "transliteration_en": "Wa qaalal maliku' toonee biheee astakhlishu linafsee falammaa kallamahoo qaala innakal yawma ladainaa makeenun ameen",
    "transliteration_id": "Wa qālal-maliku'tūnī bihī astakhliṣhu linafsī, falammā kallamahū qāla innakal-yauma ladainā makīnun amīn(un).",
    "translation_en": "And the king said, \"Bring him to me; I will appoint him exclusively for myself.\" And when he spoke to him, he said, \"Indeed, you are today established [in position] and trusted.\"",
    "translation_id": "Raja berkata, “Bawalah dia (Yusuf) kepadaku agar aku memilih dia (sebagai orang yang dekat) kepadaku.” Ketika dia (raja) telah berbicara kepadanya, dia (raja) berkata, “Sesungguhnya (mulai) hari ini engkau menjadi seorang yang berkedudukan tinggi di lingkungan kami lagi sangat dipercaya.”"
  },
  {
    "ayat": 55,
    "arabic": "قَالَ اجْعَلْنِيْ عَلٰى خَزَاۤىِٕنِ الْاَرْضِۚ اِنِّيْ حَفِيْظٌ عَلِيْمٌ",
    "transliteration_en": "Qaalaj 'alnee 'alaa khazaaa'inil ardi innee hafeezun 'aleem",
    "transliteration_id": "Qālaj‘alnī ‘alā khazā'inil-arḍ(i), innī ḥafīẓun ‘alīm(un).",
    "translation_en": "[Joseph] said, \"Appoint me over the storehouses of the land. Indeed, I will be a knowing guardian.\"",
    "translation_id": "Dia (Yusuf) berkata, “Jadikanlah aku pengelola perbendaharaan negeri (Mesir). Sesungguhnya aku adalah orang yang pandai menjaga (amanah) lagi sangat berpengetahuan.”"
  },
  {
    "ayat": 56,
    "arabic": "وَكَذٰلِكَ مَكَّنَّا لِيُوْسُفَ فِى الْاَرْضِ يَتَبَوَّاُ مِنْهَا حَيْثُ يَشَاۤءُۗ نُصِيْبُ بِرَحْمَتِنَا مَنْ نَّشَاۤءُ وَلَا نُضِيْعُ اَجْرَ الْمُحْسِنِيْنَ",
    "transliteration_en": "Wa kazaalika makkannaa li Yoosufa fil ardi yatabawwa'u minhaa haisu yashaaaa'; nuseebu birahmatinaa man nashaaa'u wa laa nudee'u ajral muhsineen",
    "transliteration_id": "Wa każālika makkannā liyūsufa  fil-arḍi yatabawwa'u minhā ḥaiṡu yasyā'(u), nuṣību biraḥmatinā man nasyā'u wa lā nuḍī‘u ajral-muḥsinīn(a).",
    "translation_en": "And thus We established Joseph in the land to settle therein wherever he willed. We touch with Our mercy whom We will, and We do not allow to be lost the reward of those who do good.",
    "translation_id": "Demikianlah Kami memberi kedudukan kepada Yusuf di negeri ini (Mesir) untuk tinggal di mana saja yang dia kehendaki. Kami melimpahkan rahmat Kami kepada siapa yang Kami kehendaki dan Kami tidak menyia-nyiakan pahala orang-orang yang berbuat baik."
  },
  {
    "ayat": 57,
    "arabic": "وَلَاَجْرُ الْاٰخِرَةِ خَيْرٌ لِّلَّذِيْنَ اٰمَنُوْا وَكَانُوْا يَتَّقُوْنَ ࣖ",
    "transliteration_en": "Wa la ajrul Aakhirati khairul lillazeena aamanoo wa kaanoo yattaqoon",
    "transliteration_id": "Wa la'ajrul-ākhirati khairul lil-lażīna āmanū wa kānū yattaqūn(a).",
    "translation_en": "And the reward of the Hereafter is better for those who believed and were fearing Allah.",
    "translation_id": "Sungguh, pahala akhirat itu (pasti) lebih baik bagi orang-orang yang beriman dan selalu bertakwa."
  },
  {
    "ayat": 58,
    "arabic": "وَجَاۤءَ اِخْوَةُ يُوْسُفَ فَدَخَلُوْا عَلَيْهِ فَعَرَفَهُمْ وَهُمْ لَهٗ مُنْكِرُوْنَ",
    "transliteration_en": "Wa jaaa'a ikhwatu Yoosufa fadakhaloo 'alaihi fa'arafahum wa hum lahoo munkiroon",
    "transliteration_id": "Wa jā'a ikhwatu yūsufa fa dakhalū ‘alaihi fa ‘arafahum wa hum lahū munkirūn(a).",
    "translation_en": "And the brothers of Joseph came [seeking food], and they entered upon him; and he recognized them, but he was to them unknown.",
    "translation_id": "Saudara-saudara Yusuf datang (ke Mesir), lalu mereka masuk ke (tempat)-nya. Maka, dia (Yusuf) mengenali mereka, sedangkan mereka benar-benar tidak mengenalinya."
  },
  {
    "ayat": 59,
    "arabic": "وَلَمَّا جَهَّزَهُمْ بِجَهَازِهِمْ قَالَ ائْتُوْنِيْ بِاَخٍ لَّكُمْ مِّنْ اَبِيْكُمْ ۚ اَلَا تَرَوْنَ اَنِّيْٓ اُوْفِى الْكَيْلَ وَاَنَا۠ خَيْرُ الْمُنْزِلِيْنَ",
    "transliteration_en": "Wa lammaa jahhazahum bijahaazihim qaala' toonee bi akhil lakum min abeekum; alaa tarawna anneee oofil kaila wa ana khairul munzileen",
    "transliteration_id": "Wa lammā jahhazahum bijahāzihim qāla'tūnī bi'akhil lakum min abīkum, alā tarauna annī ūfil-kaila wa ana khairul-munzilīn(a).",
    "translation_en": "And when he had furnished them with their supplies, he said, \"Bring me a brother of yours from your father. Do not you see that I give full measure and that I am the best of accommodators?",
    "translation_id": "Ketika dia (Yusuf) menyiapkan perbekalan (bahan makanan) untuk mereka, dia berkata, “Bawalah kepadaku saudaramu yang seayah denganmu (Bunyamin). Tidakkah kamu melihat bahwa aku menyempurnakan takaran (gandum) dan aku adalah sebaik-baiknya penerima tamu?"
  },
  {
    "ayat": 60,
    "arabic": "فَاِنْ لَّمْ تَأْتُوْنِيْ بِهٖ فَلَا كَيْلَ لَكُمْ عِنْدِيْ وَلَا تَقْرَبُوْنِ",
    "transliteration_en": "Fa il lam taatoonee bihee falaa kaila lakum 'indee wa laa taqraboon",
    "transliteration_id": "Fa illam ta'tūnī bihī falā kaila lakum ‘indī wa lā taqrabūn(i).",
    "translation_en": "But if you do not bring him to me, no measure will there be [hereafter] for you from me, nor will you approach me.\"",
    "translation_id": "Jika kamu tidak membawanya kepadaku, kamu tidak akan mendapat jatah (gandum) lagi dariku dan jangan kamu mendekatiku.”"
  },
  {
    "ayat": 61,
    "arabic": "قَالُوْا سَنُرَاوِدُ عَنْهُ اَبَاهُ وَاِنَّا لَفٰعِلُوْنَ",
    "transliteration_en": "Qaaloo sanuraawidu 'anhu abaahu wa innaa lafaa'iloon",
    "transliteration_id": "Qālū sanurāwidu ‘anhu abāhu wa innā lafā‘ilūn(a).",
    "translation_en": "They said, \"We will attempt to dissuade his father from [keeping] him, and indeed, we will do [it].\"",
    "translation_id": "Mereka berkata, “Kami akan membujuk ayahnya agar mengizinkan kami membawanya dan sesungguhnya kami benar-benar akan melaksanakannya.”"
  },
  {
    "ayat": 62,
    "arabic": "وَقَالَ لِفِتْيٰنِهِ اجْعَلُوْا بِضَاعَتَهُمْ فِيْ رِحَالِهِمْ لَعَلَّهُمْ يَعْرِفُوْنَهَآ اِذَا انْقَلَبُوْٓا اِلٰٓى اَهْلِهِمْ لَعَلَّهُمْ يَرْجِعُوْنَ",
    "transliteration_en": "Wa qaala lifityaanihij 'aloo bidaa'atahum fee rihaalihim la'allahum ya'rifoonahaaa izan qalabooo ilaaa ahlihim la'allahum yarji'oon",
    "transliteration_id": "Wa qāla lifityānihij‘alū biḍā‘atahum fī riḥālihim la‘allahum ya‘rifūnahā iżanqalabū ilā ahlihim la‘allahum yarji‘ūn(a).",
    "translation_en": "And [Joseph] said to his servants, \"Put their merchandise into their saddlebags so they might recognize it when they have gone back to their people that perhaps they will [again] return.\"",
    "translation_id": "Dia (Yusuf) berkata kepada para pembantunya, “Masukkanlah (kembali) barang-barang mereka (yang mereka jadikan alat tukar) ke dalam karung-karung mereka. (Hal itu dilakukan) agar mereka mengetahuinya apabila telah kembali kepada keluarga mereka. Mudah-mudahan mereka kembali lagi.”"
  },
  {
    "ayat": 63,
    "arabic": "فَلَمَّا رَجَعُوْٓا اِلٰٓى اَبِيْهِمْ قَالُوْا يٰٓاَبَانَا مُنِعَ مِنَّا الْكَيْلُ فَاَرْسِلْ مَعَنَآ اَخَانَا نَكْتَلْ وَاِنَّا لَهٗ لَحٰفِظُوْنَ",
    "transliteration_en": "Falammaa raja'ooo ilaaa abeehim qaaloo yaaa abaanaa muni'a minnal kailu fa arsil ma'anaaa akhaanaa naktal wa innaa lahoo lahaafizoon",
    "transliteration_id": "Falammā raja‘ū ilā abīhim qālū yā abānā muni‘a minnal-kailu fa arsil ma‘anā akhānā naktal wa innā lahū laḥāfiẓūn(a).",
    "translation_en": "So when they returned to their father, they said, \"O our father, [further] measure has been denied to us, so send with us our brother [that] we will be given measure. And indeed, we will be his guardians.\"",
    "translation_id": "Maka, ketika mereka telah kembali kepada ayah mereka (Ya‘qub), mereka berkata, “Wahai ayah kami, kita tidak akan mendapat jatah (gandum) lagi (jika tidak membawa saudara kami). Oleh karena itu, biarkanlah saudara kami pergi bersama kami agar kami mendapat jatah. Sesungguhnya kami benar-benar akan menjaganya.”"
  },
  {
    "ayat": 64,
    "arabic": "قَالَ هَلْ اٰمَنُكُمْ عَلَيْهِ اِلَّا كَمَآ اَمِنْتُكُمْ عَلٰٓى اَخِيْهِ مِنْ قَبْلُۗ فَاللّٰهُ خَيْرٌ حٰفِظًا وَّهُوَ اَرْحَمُ الرّٰحِمِيْنَ",
    "transliteration_en": "Qaala hal aamanukum 'alihi illaa kamaa amintukum 'alaaa akheehimin qabl; fal laahu khairun haafizanw wa Huwa arhamur Raahimeen",
    "transliteration_id": "Qāla hal āmanukum ‘alaihi illā kamā amintukum ‘alā akhīhi min qabl(u), fallāhu khairun ḥāfiẓaw wa huwa arḥamur-rāḥimīn(a).",
    "translation_en": "He said, \"Should I entrust you with him except [under coercion] as I entrusted you with his brother before? But Allah is the best guardian, and He is the most merciful of the merciful.\"",
    "translation_id": "Dia (Ya‘qub) berkata, “Bagaimana aku akan memercayakannya (Bunyamin) kepadamu, seperti halnya dahulu aku telah memercayakan saudaranya (Yusuf) kepada kamu? Allah adalah penjaga yang terbaik dan Dia Maha Penyayang di antara para penyayang.”"
  },
  {
    "ayat": 65,
    "arabic": "وَلَمَّا فَتَحُوْا مَتَاعَهُمْ وَجَدُوْا بِضَاعَتَهُمْ رُدَّتْ اِلَيْهِمْۗ قَالُوْا يٰٓاَبَانَا مَا نَبْغِيْۗ هٰذِهٖ بِضَاعَتُنَا رُدَّتْ اِلَيْنَا وَنَمِيْرُ اَهْلَنَا وَنَحْفَظُ اَخَانَا وَنَزْدَادُ كَيْلَ بَعِيْرٍۗ ذٰلِكَ كَيْلٌ يَّسِيْرٌ",
    "transliteration_en": "Wa lammaa fatahoo mataa 'ahum wajadoo bidaa'atahum ruddat ilaihim qaaloo yaaa abaanaa maa nabghee; haazihee bida 'atunaa ruddat ilainaa wa nameeru ahlanaa wa nahfazu akhaanaa wa nazdaadu kaila ba'eer; zaalika kailuny yaseer",
    "transliteration_id": "Wa lammā fataḥū matā‘ahum wajadū biḍā‘atahum ruddat ilaihim, qālū yā abānā mā nabgī, hāżihī biḍā‘atunā ruddat ilainā wa namīru ahlanā wa naḥfaẓu akhānā wa nazdādu kaila ba‘īr(in), żālika kailuy yasīr(un).",
    "translation_en": "And when they opened their baggage, they found their merchandise returned to them. They said, \"O our father, what [more] could we desire? This is our merchandise returned to us. And we will obtain supplies for our family and protect our brother and obtain an increase of a camel's load; that is an easy measurement.\"",
    "translation_id": "Ketika mereka membuka barang-barang mereka, mereka menemukan barang-barang (penukar) mereka dikembalikan kepada mereka. Mereka berkata, “Wahai ayah kami, apa (lagi) yang kita inginkan? Ini barang-barang kita dikembalikan kepada kita, kita akan dapat mendatangkan bahan makanan untuk keluarga kita, dan kami akan menjaga saudara kami, serta kita akan mendapat tambahan jatah (gandum) seberat beban seekor unta. Itu adalah suatu (tambahan) jatah yang mudah (bagi raja Mesir).”"
  },
  {
    "ayat": 66,
    "arabic": "قَالَ لَنْ اُرْسِلَهٗ مَعَكُمْ حَتّٰى تُؤْتُوْنِ مَوْثِقًا مِّنَ اللّٰهِ لَتَأْتُنَّنِيْ بِهٖٓ اِلَّآ اَنْ يُّحَاطَ بِكُمْۚ فَلَمَّآ اٰتَوْهُ مَوْثِقَهُمْ قَالَ اللّٰهُ عَلٰى مَا نَقُوْلُ وَكِيْلٌ",
    "transliteration_en": "Qaala lan ursilahoo ma'akum hattaa tu'tooni mawsiqam minal laahis lataa tunnanee biheee illaaa nay yuhaata bikum falammaaa aatawhu mawsiqahum qaalal laahu 'alaa maa naqoolu Wakeel",
    "transliteration_id": "Qāla lan ursilahū ma‘akum ḥattā tu'tūni mauṡiqam minallāhi lata'tunnanī bihī illā ayyuḥāṭa bikum, falammā ātauhu mauṡiqahum qālallāhu ‘alā mā naqūlu wakīl(un).",
    "translation_en": "[Jacob] said, \"Never will I send him with you until you give me a promise by Allah that you will bring him [back] to me, unless you should be surrounded by enemies.\" And when they had given their promise, he said, \"Allah, over what we say, is Witness.\"",
    "translation_id": "Dia (Ya‘qub) berkata, “Aku tidak akan melepaskannya (pergi) bersama kamu, sebelum kamu bersumpah kepadaku atas (nama) Allah, bahwa kamu pasti akan membawanya kembali kepadaku, kecuali jika kamu dikepung (oleh musuh).” Setelah mereka memberikan janji kepadanya, dia (Ya‘qub) berkata, “Allah adalah saksi terhadap apa yang kita ucapkan.”"
  },
  {
    "ayat": 67,
    "arabic": "وَقَالَ يٰبَنِيَّ لَا تَدْخُلُوْا مِنْۢ بَابٍ وَّاحِدٍ وَّادْخُلُوْا مِنْ اَبْوَابٍ مُّتَفَرِّقَةٍۗ وَمَآ اُغْنِيْ عَنْكُمْ مِّنَ اللّٰهِ مِنْ شَيْءٍۗ اِنِ الْحُكْمُ اِلَّا لِلّٰهِ ۗعَلَيْهِ تَوَكَّلْتُ وَعَلَيْهِ فَلْيَتَوَكَّلِ الْمُتَوَكِّلُوْنَ",
    "transliteration_en": "Wa qaala yaa baniyya laa tadkhuloo mim baabinw waa hidinw wadkhuloo min abwaabim mutafarriqah; wa maaa ughnee 'ankum minal laahi min shai'in; inil hukmu illaa lillaahi 'alaihi tawakkaltu wa 'alaihi fal yatawakkalil Mutawakkiloon",
    "transliteration_id": "Wa qāla yā baniyya lā tadkhulū mim bābiw wāḥidiw wadkhulū min abwābim mutafarriqah(tin), wa mā ugnī ‘ankum minallāhi min syai'(in), inil-ḥukmu illā lillāh(i), ‘alaihi tawakkaltu wa ‘alaihi  falyatawakkalil-mutawakkilūn(a).",
    "translation_en": "And he said, \"O my sons, do not enter from one gate but enter from different gates; and I cannot avail you against [the decree of] Allah at all. The decision is only for Allah; upon Him I have relied, and upon Him let those who would rely [indeed] rely.\"",
    "translation_id": "Dia (Ya‘qub) berkata, “Wahai anak-anakku, janganlah kamu masuk dari satu pintu gerbang, dan masuklah dari pintu-pintu gerbang yang berbeda-beda. (Namun,) aku tidak dapat mencegah (takdir) Allah dari kamu sedikit pun. (Penetapan) hukum itu hanyalah hak Allah. Kepada-Nyalah aku bertawakal dan hendaklah kepada-Nya (saja) orang-orang yang bertawakal (meningkatkan) tawakal(-nya).”"
  },
  {
    "ayat": 68,
    "arabic": "وَلَمَّا دَخَلُوْا مِنْ حَيْثُ اَمَرَهُمْ اَبُوْهُمْۗ مَا كَانَ يُغْنِيْ عَنْهُمْ مِّنَ اللّٰهِ مِنْ شَيْءٍ اِلَّا حَاجَةً فِيْ نَفْسِ يَعْقُوْبَ قَضٰىهَاۗ وَاِنَّهٗ لَذُوْ عِلْمٍ لِّمَا عَلَّمْنٰهُ وَلٰكِنَّ اَكْثَرَ النَّاسِ لَا يَعْلَمُوْنَ ࣖ",
    "transliteration_en": "Wa lammaa dakhaloo min haisu amarahum aboohum maa kaana yughnee 'anhum minal laahi min shai'in illaa haajatan fee nafsi Ya'qooba qadaahaa; wa innahoo lazoo 'ilmil limaa 'allamnaahu wa laakinna aksaran naasi laa ya'lamoon",
    "transliteration_id": "Wa lammā dakhalū min ḥaiṡu amarahum abūhum, mā kāna yugnī ‘anhum minallāhi min syai'in illā ḥājatan fī nafsi ya‘qūba qaḍāhā, wa innahū lażū ‘ilmil limā ‘allamnāhu wa lākinna akṡaran-nāsi lā ya‘lamūn(a).",
    "translation_en": "And when they entered from where their father had ordered them, it did not avail them against Allah at all except [it was] a need within the soul of Jacob, which he satisfied. And indeed, he was a possessor of knowledge because of what We had taught him, but most of the people do not know.",
    "translation_id": "Ketika mereka masuk dari arah yang sesuai dengan perintah ayahnya, (hal itu) tidak dapat mencegah sedikit pun keputusan Allah, tetapi (itu) hanya suatu keinginan pada diri Ya‘qub (yaitu kasih sayang kepada anak-anaknya) yang telah dipenuhinya. Sesungguhnya dia benar-benar mempunyai pengetahuan karena Kami telah mengajarkan kepadanya, tetapi kebanyakan manusia tidak mengetahui."
  },
  {
    "ayat": 69,
    "arabic": "وَلَمَّا دَخَلُوْا عَلٰى يُوْسُفَ اٰوٰٓى اِلَيْهِ اَخَاهُ قَالَ اِنِّيْٓ اَنَا۠ اَخُوْكَ فَلَا تَبْتَىِٕسْ بِمَا كَانُوْا يَعْمَلُوْنَ",
    "transliteration_en": "Wa lammaa dakhaloo 'alaa Yoosufa aawaaa ilaihi akhaahu qaala inneee ana akhooka falaa tabta'is bimaa kaanoo ya'maloon",
    "transliteration_id": "Wa lammā dakhalū ‘alā yūsufa  āwā ilaihi akhāhu qāla innī akhūka falā tabta'is bimā kānū ya‘malūn(a).",
    "translation_en": "And when they entered upon Joseph, he took his brother to himself; he said, \"Indeed, I am your brother, so do not despair over what they used to do [to me].\"",
    "translation_id": "Ketika mereka masuk ke (tempat) Yusuf, dia menempatkan saudaranya (Bunyamin) di tempatnya, dia (Yusuf) berkata, “Sesungguhnya aku adalah saudaramu, jangan engkau bersedih terhadap apa yang selalu mereka kerjakan.”"
  },
  {
    "ayat": 70,
    "arabic": "فَلَمَّا جَهَّزَهُمْ بِجَهَازِهِمْ جَعَلَ السِّقَايَةَ فِيْ رَحْلِ اَخِيْهِ ثُمَّ اَذَّنَ مُؤَذِّنٌ اَيَّتُهَا الْعِيْرُ اِنَّكُمْ لَسٰرِقُوْنَ",
    "transliteration_en": "Falammaa jahhazahum bijahaazihim ja'alas siqaayata fee rahli akheehi summa azzana mu'azzinun ayyatuhal'eeru innakum lasaariqoon",
    "transliteration_id": "Falammā jahhazahum bijahāzihim ja‘las-siqāyata fī raḥli akhīhi ṡumma ażżana mu'ażżinun ayyatuhal-‘īru innakum lasāriqūn(a).",
    "translation_en": "So when he had furnished them with their supplies, he put the [gold measuring] bowl into the bag of his brother. Then an announcer called out, \"O caravan, indeed you are thieves.\"",
    "translation_id": "Maka, ketika telah disiapkan bahan makanan untuk mereka, dia (Yusuf) memasukkan cawan ke dalam karung saudaranya (Bunyamin). Kemudian berteriaklah seorang penyeru, “Wahai kafilah, sesungguhnya kamu benar-benar para pencuri.”"
  },
  {
    "ayat": 71,
    "arabic": "قَالُوْا وَاَقْبَلُوْا عَلَيْهِمْ مَّاذَا تَفْقِدُوْنَ",
    "transliteration_en": "Qaaloo wa aqbaloo 'alaihim maazaa tafqidoon",
    "transliteration_id": "Qālū wa aqbalū ‘alaihim māżā tafqidūn(a).",
    "translation_en": "They said while approaching them, \"What is it you are missing?\"",
    "translation_id": "Mereka bertanya, sambil menghadap kepada mereka (yang menuduh), “Apa yang hilang darimu?”"
  },
  {
    "ayat": 72,
    "arabic": "قَالُوْا نَفْقِدُ صُوَاعَ الْمَلِكِ وَلِمَنْ جَاۤءَ بِهٖ حِمْلُ بَعِيْرٍ وَّاَنَا۠ بِهٖ زَعِيْمٌ",
    "transliteration_en": "Qaaloo nafqidu suwaa'al maliki wa liman jaaa'a bihee himlu ba'eerinw wa ana bihee za'eem",
    "transliteration_id": "Qālū nafqidu ṣuwā‘al-maliki wa liman jā'a bihī ḥimlu ba‘īriw wa ana bihī za‘īm(un).",
    "translation_en": "They said, \"We are missing the measure of the king. And for he who produces it is [the reward of] a camel's load, and I am responsible for it.\"",
    "translation_id": "Mereka menjawab, “Kami kehilangan cawan raja, dan siapa yang dapat mengembalikannya akan memperoleh (bahan makanan seberat) beban unta dan aku jamin itu.”"
  },
  {
    "ayat": 73,
    "arabic": "قَالُوْا تَاللّٰهِ لَقَدْ عَلِمْتُمْ مَّا جِئْنَا لِنُفْسِدَ فِى الْاَرْضِ وَمَا كُنَّا سٰرِقِيْنَ",
    "transliteration_en": "Qaaloo tallaahi laqad 'alimtum maa ji'na linufsida fil ardi wa maa kunnaa saariqeen",
    "transliteration_id": "Qālū tallāhi laqad ‘alimtum  mā ji'tanā linufsida fil-arḍi wa mā kunnā sāriqīn(a).",
    "translation_en": "They said, \"By Allah, you have certainly known that we did not come to cause corruption in the land, and we have not been thieves.\"",
    "translation_id": "Mereka (saudara-saudara Yusuf) menjawab, “Demi Allah, sungguh kamu mengetahui bahwa kami datang bukan untuk berbuat kerusakan di negeri ini dan kami bukanlah para pencuri.”"
  },
  {
    "ayat": 74,
    "arabic": "قَالُوْا فَمَا جَزَاۤؤُهٗٓ اِنْ كُنْتُمْ كٰذِبِيْنَ",
    "transliteration_en": "Qaaloo famaa jazaaa'u hooo in kuntum kaazibeen",
    "transliteration_id": "Qālū famā jazā'uhū in kuntum kāżibīn(a).",
    "translation_en": "The accusers said, \"Then what would be its recompense if you should be liars?\"",
    "translation_id": "Mereka berkata, “Kalau demikian, apa hukumannya jika kamu berdusta?”"
  },
  {
    "ayat": 75,
    "arabic": "قَالُوْا جَزَاۤؤُهٗ مَنْ وُّجِدَ فِيْ رَحْلِهٖ فَهُوَ جَزَاۤؤُهٗ ۗ كَذٰلِكَ نَجْزِى الظّٰلِمِيْنَ",
    "transliteration_en": "Qaaloo jazaaa'uhoo manw wujida fee rahlihee fahuwa jazaaa'uh; kazaalika najziz zaalimeen",
    "transliteration_id": "Qālū jazā'uhū maw wujida fī raḥlihī fa huwa jazā'uh(ū), każālika najziẓ-ẓālimīn(a).",
    "translation_en": "[The brothers] said, \"Its recompense is that he in whose bag it is found - he [himself] will be its recompense. Thus do we recompense the wrongdoers.\"",
    "translation_id": "Mereka (saudara-saudara Yusuf) menjawab, “Hukumannya ialah siapa yang ditemukan dalam karungnya (barang yang hilang itu), maka dialah sendiri balasannya (dijadikan hamba sahaya). Demikianlah kami memberikan hukuman kepada orang-orang zalim.”"
  },
  {
    "ayat": 76,
    "arabic": "فَبَدَاَ بِاَوْعِيَتِهِمْ قَبْلَ وِعَاۤءِ اَخِيْهِ ثُمَّ اسْتَخْرَجَهَا مِنْ وِّعَاۤءِ اَخِيْهِۗ  كَذٰلِكَ كِدْنَا لِيُوْسُفَۗ مَا كَانَ لِيَأْخُذَ اَخَاهُ فِيْ دِيْنِ الْمَلِكِ اِلَّآ اَنْ يَّشَاۤءَ اللّٰهُ ۗنَرْفَعُ دَرَجٰتٍ مَّنْ نَّشَاۤءُۗ وَفَوْقَ كُلِّ ذِيْ عِلْمٍ عَلِيْمٌ",
    "transliteration_en": "Fabada-a bi-aw'iyatihim qabla wi'aaa'i akheehi summas takhrajahaa minw wi 'aaa'i akheeh; kazaalika kidnaa li Yoosuf; maa kaana liyaakhuza akhaahu fee deenil maliki illaaa any yashaaa'al laah; narfa'u darajaatim man nashaaa'; wa fawqa kulli zee 'ilmin 'Aleem",
    "transliteration_id": "Fa bada'a bi'au‘iyatihim qabla wi‘ā'i akhīhi ṡummastakhrajahā miw wi‘ā'i akhīh(i), każālika kidnā liyūsuf(a), mā kāna liya'khuża akhāhu fī dīnil-maliki illā ay yasyā'allāh(u), narfa‘u darajātim man nasyā'(u), wa fauqa kulli żī ‘ilmin ‘alīm(un).",
    "translation_en": "So he began [the search] with their bags before the bag of his brother; then he extracted it from the bag of his brother. Thus did We plan for Joseph. He could not have taken his brother within the religion of the king except that Allah willed. We raise in degrees whom We will, but over every possessor of knowledge is one [more] knowing.",
    "translation_id": "Maka, mulailah dia (memeriksa) karung-karung mereka sebelum (memeriksa) karung saudaranya sendiri (Bunyamin), kemudian dia mengeluarkannya (cawan raja itu) dari karung saudaranya. Demikianlah Kami mengatur (rencana) untuk Yusuf. Dia tidak dapat menghukum saudaranya menurut hukum raja, kecuali Allah menghendakinya. Kami angkat derajat orang yang Kami kehendaki; dan di atas setiap orang yang berpengetahuan ada yang lebih mengetahui."
  },
  {
    "ayat": 77,
    "arabic": "۞ قَالُوْٓا اِنْ يَّسْرِقْ فَقَدْ سَرَقَ اَخٌ لَّهٗ مِنْ قَبْلُۚ فَاَسَرَّهَا يُوْسُفُ فِيْ نَفْسِهٖ وَلَمْ يُبْدِهَا لَهُمْۚ قَالَ اَنْتُمْ شَرٌّ مَّكَانًا ۚوَاللّٰهُ اَعْلَمُ بِمَا تَصِفُوْنَ",
    "transliteration_en": "Qaaloo iny yasriq faqad saraqa akhul lahoo min qabl; fa asarrahaa Yoosufu fee nafsihee wa lam yubdihaa lahum; qaala antum sharrum makaananw wallaahu a'lamu bimaa tasifoon",
    "transliteration_id": "Qālū iy yasriq faqad saraqa akhul lahū min qabl(u), fa asarrahā yūsufu fī nafsihī wa lam yubdihā lahum, qāla antum syarrum makānā(n), wallāhu a‘lamu bimā taṣifūn(a).",
    "translation_en": "They said, \"If he steals - a brother of his has stolen before.\" But Joseph kept it within himself and did not reveal it to them. He said, \"You are worse in position, and Allah is most knowing of what you describe.\"",
    "translation_id": "Mereka (saudara-saudara Yusuf) berkata, “Jika dia (Bunyamin) mencuri, sungguh sebelum ini saudaranya pun (Yusuf) pernah mencuri.” Maka Yusuf menyembunyikan (kekesalan) dalam hatinya dan tidak menampakkannya kepada mereka. Dia berkata (dalam hatinya), “Kamu lebih buruk kedudukan (yakni sifat-sifat kamu). Allah Maha Mengetahui apa yang kamu terangkan.”"
  },
  {
    "ayat": 78,
    "arabic": "قَالُوْا يٰٓاَيُّهَا الْعَزِيْزُ اِنَّ لَهٗٓ اَبًا شَيْخًا كَبِيْرًا فَخُذْ اَحَدَنَا مَكَانَهٗ ۚاِنَّا نَرٰىكَ مِنَ الْمُحْسِنِيْنَ",
    "transliteration_en": "Qaaloo yaaa ayyuhal 'Azeezu inna lahooo aban shaikhan kabeeran fakhuz ahadanaa makaanahoo innaa naraaka minal muhsineen",
    "transliteration_id": "Qālū yā ayyuhal-‘azīzu inna lahū aban syaikhan kabīran fa khuż aḥadanā makānah(ū), innā narāka minal-muḥsinīn(a).",
    "translation_en": "They said, \"O 'Azeez, indeed he has a father [who is] an old man, so take one of us in place of him. Indeed, we see you as a doer of good.\"",
    "translation_id": "Mereka berkata, “Wahai al-Aziz, sesungguhnya dia (Bunyamin) mempunyai ayah yang sudah lanjut usia karena itu ambillah salah seorang di antara kami sebagai gantinya. Sesungguhnya kami melihat engkau termasuk orang-orang yang selalu berbuat lebih baik.”"
  },
  {
    "ayat": 79,
    "arabic": "قَالَ مَعَاذَ اللّٰهِ اَنْ نَّأْخُذَ اِلَّا مَنْ وَّجَدْنَا مَتَاعَنَا عِنْدَهٗٓ  ۙاِنَّآ اِذًا لَّظٰلِمُوْنَ ࣖ",
    "transliteration_en": "Qaala ma'aazal laahi an naakhuza illaa manw wajadnaa mataa'anaa 'indahoo innaaa izal lazaalimoon",
    "transliteration_id": "Qāla ma‘āżallāhi an na'khuża illā maw wajadnā matā‘anā ‘indah(ū), innā iżal laẓālimūn(a).",
    "translation_en": "He said, \"[I seek] the refuge of Allah [to prevent] that we take except him with whom we found our possession. Indeed, we would then be unjust.\"",
    "translation_id": "Dia (Yusuf) berkata, “Kami memohon pelindungan kepada Allah dari menahan (seseorang), kecuali siapa yang kami temukan harta kami padanya. Jika kami (berbuat) demikian, sesungguhnya kami benar-benar orang-orang zalim.”"
  },
  {
    "ayat": 80,
    "arabic": "فَلَمَّا اسْتَيْـَٔسُوْا مِنْهُ خَلَصُوْا نَجِيًّاۗ قَالَ كَبِيْرُهُمْ اَلَمْ تَعْلَمُوْٓا اَنَّ اَبَاكُمْ قَدْ اَخَذَ عَلَيْكُمْ مَّوْثِقًا مِّنَ اللّٰهِ وَمِنْ قَبْلُ مَا فَرَّطْتُّمْ فِيْ يُوْسُفَ فَلَنْ اَبْرَحَ الْاَرْضَ حَتّٰى يَأْذَنَ لِيْٓ اَبِيْٓ اَوْ يَحْكُمَ اللّٰهُ لِيْۚ وَهُوَ خَيْرُ الْحٰكِمِيْنَ",
    "transliteration_en": "Falammas tay'asoo minhu khalasoo najiyyan qaala kabeeruhum alam ta'lamoon anna abaakum qad akhaza 'alaikum mawsiqam minal laahi wa min qablu maa farrattum fee Yoosufa falan abrahal arda hattaa yaazana leee abeee aw yahkumal laahu lee wa huwa khairul lhaakimeen",
    "transliteration_id": "Falammastai'asū minhu khalaṣū najiyyā(n), qāla kabīruhum alam ta‘lamū anna abākum qad akhaża ‘alaikum mauṡiqam minallāhi wa min qablu mā farrattum fī yūsufa falan abraḥal-arḍa ḥattā ya'żana lī abī au yaḥkumallāhu lī, wa huwa khairul-ḥākimīn(a).",
    "translation_en": "So when they had despaired of him, they secluded themselves in private consultation. The eldest of them said, \"Do you not know that your father has taken upon you an oath by Allah and [that] before you failed in [your duty to] Joseph? So I will never leave [this] land until my father permits me or Allah decides for me, and He is the best of judges.",
    "translation_id": "Maka, ketika mereka telah berputus asa darinya (putusan Yusuf terhadap permintaan mereka membebaskan adiknya) mereka menyendiri (sambil berunding) dengan berbisik-bisik. Yang tertua di antara mereka berkata, “Tidakkah kamu ketahui bahwa ayah kamu telah mengambil sumpah dari kamu dengan (nama) Allah dan sebelum ini kamu telah menyia-nyiakan Yusuf? Oleh karena itu, aku tidak akan meninggalkan negeri ini (Mesir) sampai ayahku mengizinkanku (untuk kembali) atau Allah memberi putusan terhadapku. Dia adalah pemberi putusan yang terbaik."
  },
  {
    "ayat": 81,
    "arabic": "اِرْجِعُوْٓا اِلٰٓى اَبِيْكُمْ فَقُوْلُوْا يٰٓاَبَانَآ اِنَّ ابْنَكَ سَرَقَۚ وَمَا شَهِدْنَآ اِلَّا بِمَا عَلِمْنَا وَمَا كُنَّا لِلْغَيْبِ حٰفِظِيْنَ",
    "transliteration_en": "Irji'ooo ilaaa abeekum faqooloo yaaa abaanaaa innab naka saraq; wa maa shahidnaaa illaa bimaa 'alimnaa wa maa kunnaa lilghaibi haafizeen",
    "transliteration_id": "Irji‘ū ilā abīkum fa qūlū yā abānā innabnaka saraq(a), wa mā syahidnā illā bimā ‘alimnā wa mā kunnā lil-gaibi ḥāfiẓīn(a).",
    "translation_en": "Return to your father and say, \"O our father, indeed your son has stolen, and we did not testify except to what we knew. And we were not witnesses of the unseen,",
    "translation_id": "Kembalilah kepada ayahmu, lalu katakanlah, ‘Wahai ayah kami, sesungguhnya anakmu (Bunyamin) telah mencuri dan kami tidak bersaksi kecuali apa yang kami ketahui dan kami bukanlah orang-orang yang menjaga (mengetahui) apa yang gaib (yang di balik) itu."
  },
  {
    "ayat": 82,
    "arabic": "وَسْـَٔلِ الْقَرْيَةَ الَّتِيْ كُنَّا فِيْهَا وَالْعِيْرَ الَّتِيْٓ اَقْبَلْنَا فِيْهَاۗ وَاِنَّا لَصٰدِقُوْنَ",
    "transliteration_en": "Was'alil qaryatal latee kunnaa feehaa wal'eeral lateee aqbalnaa feehaa wa innaa lasaadiqoon",
    "transliteration_id": "Was'alil-qaryatal-latī kunnā fīhā wal-‘īral-latī aqbalnā fīhā, wa innā laṣādiqūn(a).",
    "translation_en": "And ask the city in which we were and the caravan in which we came - and indeed, we are truthful,\"",
    "translation_id": "Tanyalah (penduduk) negeri tempat kami berada dan kafilah yang datang bersama kami. Sesungguhnya kami betul-betul orang yang benar.’”"
  },
  {
    "ayat": 83,
    "arabic": "قَالَ بَلْ سَوَّلَتْ لَكُمْ اَنْفُسُكُمْ اَمْرًاۗ فَصَبْرٌ جَمِيْلٌ  ۗعَسَى اللّٰهُ اَنْ يَّأْتِيَنِيْ بِهِمْ جَمِيْعًاۗ اِنَّهٗ هُوَ الْعَلِيْمُ الْحَكِيْمُ",
    "transliteration_en": "Qaala bal sawwalat lakum anfusukum amran fasabrun jameelun 'asal laahu any yaa tiyanee bihim jamee'aa; innahoo Huwal 'Aleemul Hakeem",
    "transliteration_id": "Qāla bal sawwalat lakum anfusukum amrā(n), fa ṣabrun jamīl(un), ‘asallāhu ay ya'tiyanī bihim jamī‘ā(n), innahū huwal-‘alīmul-ḥakīm(u).",
    "translation_en": "[Jacob] said, \"Rather, your souls have enticed you to something, so patience is most fitting. Perhaps Allah will bring them to me all together. Indeed it is He who is the Knowing, the Wise.\"",
    "translation_id": "Dia (Ya‘qub) berkata, “Sebenarnya hanya dirimu sendiri yang memandang baik urusan (yang buruk) itu. (Kesabaranku) adalah kesabaran yang baik. Mudah-mudahan Allah mendatangkan mereka semua kepadaku. Sesungguhnya hanya Dialah Yang Maha Mengetahui lagi Maha Bijaksana.”"
  },
  {
    "ayat": 84,
    "arabic": "وَتَوَلّٰى عَنْهُمْ وَقَالَ يٰٓاَسَفٰى عَلٰى يُوْسُفَ وَابْيَضَّتْ عَيْنٰهُ مِنَ الْحُزْنِ فَهُوَ كَظِيْمٌ",
    "transliteration_en": "Wa tawallaa 'anhum wa qaala yaaa asafaa 'alaa Yoosufa wabyaddat 'aynaahu minal huzni fahuwa kazeem",
    "transliteration_id": "Wa tawallā ‘anhum wa qāla yā asafā ‘alā yūsufa wabyaḍḍat ‘aināhu minal-ḥuzni fa huwa kaẓīm(un).",
    "translation_en": "And he turned away from them and said, \"Oh, my sorrow over Joseph,\" and his eyes became white from grief, for he was [of that] a suppressor.",
    "translation_id": "Dia (Ya‘qub) berpaling dari mereka (anak-anaknya) seraya berkata, “Alangkah kasihan Yusuf,” dan kedua matanya menjadi putih karena sedih. Dia adalah orang yang sungguh-sungguh menahan (amarah dan kepedihan)."
  },
  {
    "ayat": 85,
    "arabic": "قَالُوْا تَاللّٰهِ تَفْتَؤُا تَذْكُرُ يُوْسُفَ حَتّٰى تَكُوْنَ حَرَضًا اَوْ تَكُوْنَ مِنَ الْهٰلِكِيْنَ",
    "transliteration_en": "Qaaloo tallaahi tafta'u tazkuru Yoosufa hattaa takoona haradan aw takoona minal haalikeen",
    "transliteration_id": "Qālū tallāhi tafta'u tażkuru yūsufa ḥattā takūna ḥaraḍan au takūna minal-hālikīn(a).",
    "translation_en": "They said, \"By Allah, you will not cease remembering Joseph until you become fatally ill or become of those who perish.\"",
    "translation_id": "Mereka berkata, “Demi Allah, engkau tidak henti-hentinya mengingat Yusuf sehingga engkau (mengidap) penyakit berat atau engkau termasuk orang-orang yang akan binasa (wafat).”"
  },
  {
    "ayat": 86,
    "arabic": "قَالَ اِنَّمَآ اَشْكُوْا بَثِّيْ وَحُزْنِيْٓ اِلَى اللّٰهِ وَاَعْلَمُ مِنَ اللّٰهِ مَا لَا تَعْلَمُوْنَ",
    "transliteration_en": "Qaala innamaaa ashkoo bassee wa huzneee ilal laahi wa a'lamu minal laahi maa laa ta'lamoon",
    "transliteration_id": "Qāla innamā asykū baṡṡī wa ḥuznī ilallāhi wa a‘lamu minallāhi mā lā ta‘lamūn(a).",
    "translation_en": "He said, \"I only complain of my suffering and my grief to Allah, and I know from Allah that which you do not know.",
    "translation_id": "Dia (Ya‘qub) menjawab, “Hanya kepada Allah aku mengadukan kesusahan dan kesedihanku. Aku mengetahui dari Allah apa yang tidak kamu ketahui."
  },
  {
    "ayat": 87,
    "arabic": "يٰبَنِيَّ اذْهَبُوْا فَتَحَسَّسُوْا مِنْ يُّوْسُفَ وَاَخِيْهِ وَلَا تَا۟يْـَٔسُوْا مِنْ رَّوْحِ اللّٰهِ ۗاِنَّهٗ لَا يَا۟يْـَٔسُ مِنْ رَّوْحِ اللّٰهِ اِلَّا الْقَوْمُ الْكٰفِرُوْنَ",
    "transliteration_en": "Yaa baniyyaz haboo fatahassasoo miny Yoosufa wa akheehi wa laa tai'asoo mir rawhil laahi innahoo laa yai'asu mir rawhil laahi illal qawmul kaafiroon",
    "transliteration_id": "Yā baniyyażhabū fa taḥassasū miy yūsufa wa akhīhi wa lā tai'asū mir rauḥillāh(i), innahū lā yai'asu mir rauḥillāhi illal-qaumul-kāfirūn(a).",
    "translation_en": "O my sons, go and find out about Joseph and his brother and despair not of relief from Allah. Indeed, no one despairs of relief from Allah except the disbelieving people.\"",
    "translation_id": "Wahai anak-anakku, pergi dan carilah berita tentang Yusuf beserta saudaranya. Janganlah kamu berputus asa dari rahmat Allah. Sesungguhnya tidak ada yang berputus asa dari rahmat Allah, kecuali kaum yang kafir.”"
  },
  {
    "ayat": 88,
    "arabic": "فَلَمَّا دَخَلُوْا عَلَيْهِ قَالُوْا يٰٓاَيُّهَا الْعَزِيْزُ مَسَّنَا وَاَهْلَنَا الضُّرُّ وَجِئْنَا بِبِضَاعَةٍ مُّزْجٰىةٍ فَاَوْفِ لَنَا الْكَيْلَ وَتَصَدَّقْ عَلَيْنَاۗ اِنَّ اللّٰهَ يَجْزِى الْمُتَصَدِّقِيْنَ",
    "transliteration_en": "Falammaa dakhaloo 'alaihi qaaloo yaaa ayyuhal 'Azeezu massanaa wa ahlanad durru wa ji'naa bibidaa 'timmuzjaatin fa awfi lanal kaila wa tasaddaq 'alainaa innal laaha yajzil mutasaddiqeen",
    "transliteration_id": "Falammā dakhalū ‘alaihi qālū yā ayyuhal-‘azīzu massanā wa ahlanaḍ-ḍurru wa ji'nā bibiḍā‘atim muzjātin fa aufi lanal-kaila wa taṣaddaq ‘alainā, innallāha yajzil-mutaṣaddiqīn(a).",
    "translation_en": "So when they entered upon Joseph, they said, \"O 'Azeez, adversity has touched us and our family, and we have come with goods poor in quality, but give us full measure and be charitable to us. Indeed, Allah rewards the charitable.\"",
    "translation_id": "Ketika mereka masuk ke (tempat)-nya (Yusuf), mereka berkata, “Wahai yang mulia, kami dan keluarga kami telah ditimpa kesengsaraan dan kami datang membawa barang-barang yang tidak berharga, maka penuhilah takaran (gandum) untuk kami, dan bersedekahlah kepada kami. Sesungguhnya Allah memberi balasan kepada orang-orang yang bersedekah.”"
  },
  {
    "ayat": 89,
    "arabic": "قَالَ هَلْ عَلِمْتُمْ مَّا فَعَلْتُمْ بِيُوْسُفَ وَاَخِيْهِ اِذْ اَنْتُمْ جٰهِلُوْنَ",
    "transliteration_en": "Qaala hal 'alimtum maa fa'altum bi Yoosufa wa akheehi iz antum jaahiloon",
    "transliteration_id": "Qāla hal ‘alimtum mā fa‘altum biyūsufa wa akhīhi iż antum jāhilūn(a).",
    "translation_en": "He said, \"Do you know what you did with Joseph and his brother when you were ignorant?\"",
    "translation_id": "Dia (Yusuf) berkata, “Tahukah kamu (kejelekan) apa yang telah kamu perbuat terhadap Yusuf dan saudaranya karena kamu tidak mengetahui (akibat) perbuatanmu itu?”"
  },
  {
    "ayat": 90,
    "arabic": "قَالُوْٓا ءَاِنَّكَ لَاَنْتَ يُوْسُفُۗ قَالَ اَنَا۠ يُوْسُفُ وَهٰذَآ اَخِيْ قَدْ مَنَّ اللّٰهُ عَلَيْنَاۗ اِنَّهٗ مَنْ يَّتَّقِ وَيَصْبِرْ فَاِنَّ اللّٰهَ لَا يُضِيْعُ اَجْرَ الْمُحْسِنِيْنَ",
    "transliteration_en": "Qaaloo 'a innaka la anta Yoosufu qaala ana Yoosufu wa haazaaa akhee qad mannal laahu 'alainaa innahoo mai yattaqi wa yasbir fa innal laaha laa yudee'u ajral muhsineen",
    "transliteration_id": "Qālū a'innaka la'anta yūsuf(u), qāla ana yūsufu wa hāżā akhī qad mannallāhu ‘alainā, innahū may yataqqi wa yaṣbir fa innallāha lā yuḍī‘u ajral-muḥsinīn(a).",
    "translation_en": "They said, \"Are you indeed Joseph?\" He said \"I am Joseph, and this is my brother. Allah has certainly favored us. Indeed, he who fears Allah and is patient, then indeed, Allah does not allow to be lost the reward of those who do good.\"",
    "translation_id": "Mereka berkata, “Apakah engkau benar-benar Yusuf?” Dia (Yusuf) menjawab, “Aku Yusuf dan ini saudaraku. Sungguh, Allah telah melimpahkan karunia-Nya kepada kami. Siapa yang bertakwa dan bersabar, sesungguhnya Allah tidak menyia-nyiakan pahala orang-orang yang muhsin.”"
  },
  {
    "ayat": 91,
    "arabic": "قَالُوْا تَاللّٰهِ لَقَدْ اٰثَرَكَ اللّٰهُ عَلَيْنَا وَاِنْ كُنَّا لَخٰطِـِٕيْنَ",
    "transliteration_en": "Qaaloo tallaahi laqad aasarakal laahu 'alainaa wa in kunnaa lakhaati'een",
    "transliteration_id": "Qālū tallāhi laqad āṡarakallāhu ‘alainā wa in kunnā lakhāṭi'īn(a).",
    "translation_en": "They said, \"By Allah, certainly has Allah preferred you over us, and indeed, we have been sinners.\"",
    "translation_id": "Mereka berkata, “Demi Allah, Allah benar-benar telah melebihkan engkau di atas kami dan sesungguhnya kami benar-benar orang-orang yang bersalah.”"
  },
  {
    "ayat": 92,
    "arabic": "قَالَ لَا تَثْرِيْبَ عَلَيْكُمُ الْيَوْمَۗ يَغْفِرُ اللّٰهُ لَكُمْ ۖوَهُوَ اَرْحَمُ الرّٰحِمِيْنَ",
    "transliteration_en": "Qaala laa tasreeba 'alaikumul yawma yaghfirul laahu lakum wa Huwa arhamur raahimeen",
    "transliteration_id": "Qāla lā taṡrība ‘alaikumul-yaum(a), wa yagfirullāhu lakum, wa huwa arḥamur-rāḥimīn(a).",
    "translation_en": "He said, \"No blame will there be upon you today. Allah will forgive you; and He is the most merciful of the merciful.\"",
    "translation_id": "Dia (Yusuf) berkata, “Pada hari ini tidak ada cercaan terhadap kamu, mudah-mudahan Allah mengampuni kamu. Dia Maha Penyayang di antara para penyayang."
  },
  {
    "ayat": 93,
    "arabic": "اِذْهَبُوْا بِقَمِيْصِيْ هٰذَا فَاَلْقُوْهُ عَلٰى وَجْهِ اَبِيْ يَأْتِ بَصِيْرًا ۚوَأْتُوْنِيْ بِاَهْلِكُمْ اَجْمَعِيْنَ ࣖ",
    "transliteration_en": "Izhaboo biqameesee haazaa fa alqoohu 'alaa wajhi abee yaati baseeranw waatoonee bi ahlikum ajma'een",
    "transliteration_id": "Iżhabū biqamīṣī hāżā fa alqūhu ‘alā wajhi abī ya'ti baṣīrā(n), wa'tūnī bi'ahlikum ajma‘īn(a).",
    "translation_en": "Take this, my shirt, and cast it over the face of my father; he will become seeing. And bring me your family, all together.\"",
    "translation_id": "Pergilah kamu dengan membawa bajuku ini, lalu usapkan ke wajah ayahku, nanti dia akan melihat (kembali); dan bawalah seluruh keluargamu kepadaku.”"
  },
  {
    "ayat": 94,
    "arabic": "وَلَمَّا فَصَلَتِ الْعِيْرُ قَالَ اَبُوْهُمْ اِنِّيْ لَاَجِدُ رِيْحَ يُوْسُفَ لَوْلَآ اَنْ تُفَنِّدُوْنِ",
    "transliteration_en": "Wa lammaa fasalatil 'eeru qaala aboohum innee la ajidu reeha Yoosufa law laaa an tufannidoon",
    "transliteration_id": "Wa lammā faṣalatil-‘īru qāla abūhum innī la'ajidu rīḥa yūsufa lau lā an tufannidūn(i).",
    "translation_en": "And when the caravan departed [from Egypt], their father said, \"Indeed, I find the smell of Joseph [and would say that he was alive] if you did not think me weakened in mind.\"",
    "translation_id": "Ketika kafilah itu telah keluar (dari Mesir dan memasuki Palestina), ayah mereka berkata, “Sesungguhnya aku mencium bau Yusuf seandainya kamu tidak menuduhku lemah akal.”"
  },
  {
    "ayat": 95,
    "arabic": "قَالُوْا تَاللّٰهِ اِنَّكَ لَفِيْ ضَلٰلِكَ الْقَدِيْمِ",
    "transliteration_en": "Qaaloo tallaahi innaka lafee dalaalikal qadeem",
    "transliteration_id": "Qālū tallāhi innaka lafī ḍalālikal-qadīm(i).",
    "translation_en": "They said, \"By Allah, indeed you are in your [same] old error.\"",
    "translation_id": "Mereka (keluarga Yusuf) berkata, “Demi Allah, sesungguhnya engkau benar-benar masih dalam kekeliruanmu yang dahulu.”"
  },
  {
    "ayat": 96,
    "arabic": "فَلَمَّآ اَنْ جَاۤءَ الْبَشِيْرُ اَلْقٰىهُ عَلٰى وَجْهِهٖ فَارْتَدَّ بَصِيْرًاۗ قَالَ اَلَمْ اَقُلْ لَّكُمْۙ اِنِّيْٓ اَعْلَمُ مِنَ اللّٰهِ مَا لَا تَعْلَمُوْنَ",
    "transliteration_en": "Falammaaa an jaaa'albasheeru alqaahu 'alaa wajhihee fartadda baseeran qaala alam aqul lakum inneee a'lamu minal laahi maa laa ta'lamoon",
    "transliteration_id": "Falammā an jā'al-basyīru alqāhu ‘alā wajihihī fartadda baṣīrā(n), qāla alam aqul lakum, innī a‘lamu minallāhi mā lā ta‘lamūn(a).",
    "translation_en": "And when the bearer of good tidings arrived, he cast it over his face, and he returned [once again] seeing. He said, \"Did I not tell you that I know from Allah that which you do not know?\"",
    "translation_id": "Ketika telah tiba pembawa kabar gembira itu, diusapkannya (baju itu) ke wajahnya (Ya‘qub), lalu dia dapat melihat kembali. Dia (Ya‘qub) berkata, “Bukankah telah aku katakan kepadamu bahwa aku mengetahui dari Allah apa yang tidak kamu ketahui?”"
  },
  {
    "ayat": 97,
    "arabic": "قَالُوْا يٰٓاَبَانَا اسْتَغْفِرْ لَنَا ذُنُوْبَنَآ اِنَّا كُنَّا خٰطِـِٕيْنَ",
    "transliteration_en": "Qaaloo yaaa abaanas taghfir lanaa zunoo =banaaa innaa kunnaa khaati'een",
    "transliteration_id": "Qālū yā abānastagfir lanā żunūbanā innā kunnā khāṭi'īn(a).",
    "translation_en": "They said, \"O our father, ask for us forgiveness of our sins; indeed, we have been sinners.\"",
    "translation_id": "Mereka (anak-anak Ya‘qub) berkata, “Wahai ayah kami, mohonkanlah ampunan untuk kami atas dosa-dosa kami. Sesungguhnya kami adalah orang-orang yang bersalah.”"
  },
  {
    "ayat": 98,
    "arabic": "قَالَ سَوْفَ اَسْتَغْفِرُ لَكُمْ رَبِّيْ ۗاِنَّهٗ هُوَ الْغَفُوْرُ الرَّحِيْمُ",
    "transliteration_en": "Qaala sawfa astaghfiru lakum Rabbeee innahoo Huwal Ghafoorur Raheem",
    "transliteration_id": "Qāla saufa astagfiru lakum rabbī, innahū huwal-gafūrur-raḥīm(u).",
    "translation_en": "He said, \"I will ask forgiveness for you from my Lord. Indeed, it is He who is the Forgiving, the Merciful.\"",
    "translation_id": "Dia (Ya‘qub) berkata, “Aku akan memohonkan ampunan bagimu kepada Tuhanku. Sesungguhnya Dialah Yang Maha Pengampun lagi Maha Penyayang.”"
  },
  {
    "ayat": 99,
    "arabic": "فَلَمَّا دَخَلُوْا عَلٰى يُوْسُفَ اٰوٰٓى اِلَيْهِ اَبَوَيْهِ وَقَالَ ادْخُلُوْا مِصْرَ اِنْ شَاۤءَ اللّٰهُ اٰمِنِيْنَ ۗ",
    "transliteration_en": "Falammaa dakhaloo 'alaa Yoosufa aawaaa ilaihi abayaihi wa qaalad khuloo Misra inshaaa'al laahu aamineen",
    "transliteration_id": "Falammā dakhalū ‘alā yūsufa āwā ilaihi abawaihi wa qāladkhulū miṣra in syā'allāhu āminīn(a).",
    "translation_en": "And when they entered upon Joseph, he took his parents to himself and said, \"Enter Egypt, Allah willing, safe [and secure].\"",
    "translation_id": "Maka ketika mereka masuk ke (tempat) Yusuf, dia merangkul ibu bapaknya seraya berkata, “Masuklah ke negeri Mesir. Insyaallah dalam keadaan aman.”"
  },
  {
    "ayat": 100,
    "arabic": "وَرَفَعَ اَبَوَيْهِ عَلَى الْعَرْشِ وَخَرُّوْا لَهٗ سُجَّدًاۚ وَقَالَ يٰٓاَبَتِ هٰذَا تَأْوِيْلُ رُءْيَايَ مِنْ قَبْلُ  ۖقَدْ جَعَلَهَا رَبِّيْ حَقًّاۗ وَقَدْ اَحْسَنَ بِيْٓ اِذْ اَخْرَجَنِيْ مِنَ السِّجْنِ وَجَاۤءَ بِكُمْ مِّنَ الْبَدْوِ مِنْۢ بَعْدِ اَنْ نَّزَغَ الشَّيْطٰنُ بَيْنِيْ وَبَيْنَ اِخْوَتِيْۗ اِنَّ رَبِّيْ لَطِيْفٌ لِّمَا يَشَاۤءُ ۗاِنَّهٗ هُوَ الْعَلِيْمُ الْحَكِيْمُ",
    "transliteration_en": "Wa raf'a abawaihi 'alal 'arshi wa kharroo lahoo sujjadaa; wa qaala yaaa abati haaza taaweelu ru'yaaya min qablu qad ja'alahaa Rabbee haqqaa; wa qad ahsana beee iz akhrajanee minas sijni wa jaaa'a bikum minal badwi mim ba'di an nazaghash Shaitaanu bainee wa baina ikhwatee; inna Rabbee lateeful limaa yashaaa'; innahoo Huwal 'Aleemul Hakeem",
    "transliteration_id": "Wa rafa‘a abawaihi ‘alal-‘arsyi wa kharrū lahū sujjadā(n), wa qāla yā abati hāżā ta'wīlu ru'yāya min qabl(u), qad ja‘alahā rabbī ḥaqqā(n), wa qad aḥsana bī iż akhrajanī minas-sijni wa jā'a bikum minal-badwi mim ba‘di an nazagasy-syaiṭānu bainī wa baina ikhwatī, inna rabbī laṭīful limā yasyā'(u), innahū huwal-‘alīmul-ḥakīm(u).",
    "translation_en": "And he raised his parents upon the throne, and they bowed to him in prostration. And he said, \"O my father, this is the explanation of my vision of before. My Lord has made it reality. And He was certainly good to me when He took me out of prison and brought you [here] from bedouin life after Satan had induced [estrangement] between me and my brothers. Indeed, my Lord is Subtle in what He wills. Indeed, it is He who is the Knowing, the Wise.",
    "translation_id": "Dia (Yusuf) menaikkan kedua ibu bapaknya ke atas singgasana. Mereka tunduk bersujud kepadanya (Yusuf). Dia (Yusuf) berkata, “Wahai ayahku, inilah takwil mimpiku yang dahulu itu. Sungguh, Tuhanku telah menjadikannya kenyataan. Sungguh, Tuhanku telah berbuat baik kepadaku, ketika Dia membebaskan aku dari penjara dan ketika membawa kamu dari dusun, setelah setan merusak (hubungan) antara aku dengan saudara-saudaraku. Sesungguhnya Tuhanku Maha Lembut terhadap apa yang Dia kehendaki. Sesungguhnya Dialah Yang Maha Mengetahui lagi Maha Bijaksana."
  }
]