[
  {
    "ayat": 101,
    "arabic": "وَاِذَا بَدَّلْنَآ اٰيَةً مَّكَانَ اٰيَةٍ ۙوَّاللّٰهُ اَعْلَمُ بِمَا يُنَزِّلُ قَالُوْٓا اِنَّمَآ اَنْتَ مُفْتَرٍۗ بَلْ اَكْثَرُهُمْ لَا يَعْلَمُوْنَ",
    "transliteration_en": "Wa izaa baddalnaaa Aayatam makaana Aayatinw wal laahu a'lamu bimaa yunazzilu qaalooo innamaa anta muftar; bal aksaruhum laa ya'lamoon",
    "transliteration_id": "Wa iżā baddalnā āyatam makāna āyah(tin), wallāhu a‘lamu bimā yunazzilu qālū innamā anta muftar(in), bal akṡaruhum lā ya‘lamūn(a).",
    "translation_en": "And when We substitute a verse in place of a verse - and Allah is most knowing of what He sends down - they say, \"You, [O Muhammad], are but an inventor [of lies].\" But most of them do not know.",
    "translation_id": "Apabila Kami ganti suatu ayat di tempat ayat yang lain, padahal Allah lebih mengetahui apa yang diturunkan-Nya, mereka berkata, “Sesungguhnya engkau (Nabi Muhammad) adalah pembuat kebohongan.” Bahkan kebanyakan mereka tidak mengetahui."
  },
  {
    "ayat": 102,
    "arabic": "قُلْ نَزَّلَهٗ رُوْحُ الْقُدُسِ مِنْ رَّبِّكَ بِالْحَقِّ لِيُثَبِّتَ الَّذِيْنَ اٰمَنُوْا وَهُدًى وَّبُشْرٰى لِلْمُسْلِمِيْنَ",
    "transliteration_en": "Qul nazzalahoo Roohul Qudusi mir Rabbika bilhaqqi liyusabbital lazeena aamanoo wa hudanw wa bushraa lilmuslimeen",
    "transliteration_id": "Qul nazzalahū rūḥul-qudusi mir rabbika bil-ḥaqqi liyuṡabbital-lażīna āmanū wa hudaw wa busyrā lil-muslimīn(a).",
    "translation_en": "Say, [O Muhammad], \"The Pure Spirit has brought it down from your Lord in truth to make firm those who believe and as guidance and good tidings to the Muslims.\"",
    "translation_id": "Katakanlah (Nabi Muhammad), “Ruhulkudus (Jibril) menurunkannya (Al-Qur’an) dari Tuhanmu dengan hak untuk meneguhkan (hati) orang-orang yang telah beriman dan menjadi petunjuk serta kabar gembira bagi orang-orang muslim (yang berserah diri kepada Allah).”"
  },
  {
    "ayat": 103,
    "arabic": "وَلَقَدْ نَعْلَمُ اَنَّهُمْ يَقُوْلُوْنَ اِنَّمَا يُعَلِّمُهٗ بَشَرٌۗ لِسَانُ الَّذِيْ يُلْحِدُوْنَ اِلَيْهِ اَعْجَمِيٌّ وَّهٰذَا لِسَانٌ عَرَبِيٌّ مُّبِيْنٌ",
    "transliteration_en": "Wa laqad na'lamu annahum yaqooloona innamaa yu'allimuhoo bashar; lisaanul lazee yulhidoona ilaihi a'ja miyyunw wa haaza lisaanun 'Arabiyyum mubeen",
    "transliteration_id": "Wa laqad na‘lamu annahum yaqūlūna innamā yu‘allimuhū basyar(un), lisānul-lażī yulḥidūna ilaihi a‘jamiyyuw wa hāżā lisānun ‘arabiyyum mubīn(un).",
    "translation_en": "And We certainly know that they say, \"It is only a human being who teaches the Prophet.\" The tongue of the one they refer to is foreign, and this Qur'an is [in] a clear Arabic language.",
    "translation_id": "Sungguh, Kami benar-benar mengetahui bahwa mereka berkata, “Sesungguhnya ia (Al-Qur’an) hanyalah diajarkan kepadanya (Nabi Muhammad) oleh seorang manusia.” Bahasa orang yang mereka tuduh (bahwa Nabi Muhammad belajar kepadanya) adalah bahasa ajam (bukan bahasa Arab). Padahal, ini (Al-Qur’an) adalah bahasa Arab yang jelas."
  },
  {
    "ayat": 104,
    "arabic": "اِنَّ الَّذِيْنَ لَا يُؤْمِنُوْنَ بِاٰيٰتِ اللّٰهِۙ لَا يَهْدِيْهِمُ اللّٰهُ وَلَهُمْ عَذَابٌ اَلِيْمٌ",
    "transliteration_en": "Innal lazeena laa yu'minoona bi Aayaatil laahi laa yahdehimul laahu wa lahum 'azaabun aleem",
    "transliteration_id": "Innal-lażīna lā yu'minūna bi'āyātillāh(i), lā yahdīhimullāhu wa lahum ‘ażābun alīm(un).",
    "translation_en": "Indeed, those who do not believe in the verses of Allah - Allah will not guide them, and for them is a painful punishment.",
    "translation_id": "Sesungguhnya orang-orang yang tidak beriman kepada ayat-ayat Allah (Al-Qur’an) tidak akan Allah beri petunjuk dan bagi mereka ada azab yang sangat pedih."
  },
  {
    "ayat": 105,
    "arabic": "اِنَّمَا يَفْتَرِى الْكَذِبَ الَّذِيْنَ لَا يُؤْمِنُوْنَ بِاٰيٰتِ اللّٰهِۚ وَاُولٰۤىِٕكَ هُمُ الْكٰذِبُوْنَ",
    "transliteration_en": "Innamaa yaftaril kazibal lazeena laa yu'minoona bi Aayaatil laahi wa ulaaa'ika humul kaaziboon",
    "transliteration_id": "Innamā yaftaril-każibal-lażīna lā yu'minūna bi'āyātillāh(i), ulā'ika humul-kāżibūn(a).",
    "translation_en": "They only invent falsehood who do not believe in the verses of Allah, and it is those who are the liars.",
    "translation_id": "Sesungguhnya yang mengada-adakan kebohongan hanyalah orang-orang yang tidak beriman kepada ayat-ayat Allah. Mereka itulah para pembohong."
  },
  {
    "ayat": 106,
    "arabic": "مَنْ كَفَرَ بِاللّٰهِ مِنْۢ بَعْدِ اِيْمَانِهٖٓ اِلَّا مَنْ اُكْرِهَ وَقَلْبُهٗ مُطْمَىِٕنٌّۢ بِالْاِيْمَانِ وَلٰكِنْ مَّنْ شَرَحَ بِالْكُفْرِ صَدْرًا فَعَلَيْهِمْ غَضَبٌ مِّنَ اللّٰهِ ۗوَلَهُمْ عَذَابٌ عَظِيْمٌ",
    "transliteration_en": "man kafara billaahi mim ba'di eemaanihee illaa man ukriha wa qalbuhoo mutmma'innum bil eemaani wa laakim man sharaha bilkufri sadran fa'alaihim ghadabum minal laahi wa lahum 'azaabun 'azeem",
    "transliteration_id": "Man kafara billāhi mim ba‘di īmānihī illā man ukriha wa qalbuhū muṭma'innum bil-īmāni wa lākim man syaraḥa bil-kufri ṣadran fa ‘alaihim gaḍabum minallāh(i), wa lahum ‘ażābun aẓīm(un).",
    "translation_en": "Whoever disbelieves in Allah after his belief... except for one who is forced [to renounce his religion] while his heart is secure in faith. But those who [willingly] open their breasts to disbelief, upon them is wrath from Allah, and for them is a great punishment;",
    "translation_id": "Siapa yang kufur kepada Allah setelah beriman (dia mendapat kemurkaan Allah), kecuali orang yang dipaksa (mengucapkan kalimat kekufuran), sedangkan hatinya tetap tenang dengan keimanannya (dia tidak berdosa). Akan tetapi, siapa yang berlapang dada untuk (menerima) kekufuran, niscaya kemurkaan Allah menimpanya dan bagi mereka ada azab yang besar."
  },
  {
    "ayat": 107,
    "arabic": "ذٰلِكَ بِاَنَّهُمُ اسْتَحَبُّوا الْحَيٰوةَ الدُّنْيَا عَلَى الْاٰخِرَةِۙ وَاَنَّ اللّٰهَ لَا يَهْدِى الْقَوْمَ الْكٰفِرِيْنَ",
    "transliteration_en": "Zaalika bi annahumus tahabbul hayaatad dunyaa 'alal Aakhirati wa annal laaha laa yahdil qawmal kaafireen",
    "transliteration_id": "Żālika bi'annahumustaḥabbul-ḥayātad-dun-yā ‘alal-ākhirah(ti), wa annallāha lā yahdil-qaumal-kāfirīn(a).",
    "translation_en": "That is because they preferred the worldly life over the Hereafter and that Allah does not guide the disbelieving people.",
    "translation_id": "Yang demikian itu disebabkan mereka lebih mencintai kehidupan dunia daripada akhirat dan sesungguhnya Allah tidak memberi petunjuk kepada kaum yang kafir."
  },
  {
    "ayat": 108,
    "arabic": "اُولٰۤىِٕكَ الَّذِيْنَ طَبَعَ اللّٰهُ عَلٰى قُلُوْبِهِمْ وَسَمْعِهِمْ وَاَبْصَارِهِمْۗ وَاُولٰۤىِٕكَ هُمُ الْغٰفِلُوْنَ",
    "transliteration_en": "Ulaaa'ikal lazeena taba'al laahu 'alaa quloobihim wa sam'ihim wa absaarihim wa ulaaa'ika humul ghaafiloon",
    "transliteration_id": "Ulā'ikal-lażīna ṭaba‘allāhu ‘alā qulūbihim wa sam‘ihim wa abṣārihim, wa ulā'ika humul-gāfilūn(a).",
    "translation_en": "Those are the ones over whose hearts and hearing and vision Allah has sealed, and it is those who are the heedless.",
    "translation_id": "Mereka itulah orang-orang yang Allah kunci hati, pendengaran, dan penglihatannya. Mereka itulah orang-orang yang lalai."
  },
  {
    "ayat": 109,
    "arabic": "لَا جَرَمَ اَنَّهُمْ فِى الْاٰخِرَةِ هُمُ الْخٰسِرُوْنَ",
    "transliteration_en": "Laa jarama annnahum fil Aakhirati humul khassiroon",
    "transliteration_id": "Lā jarama annahum fil-ākhirati humul-khāsirūn(a).",
    "translation_en": "Assuredly, it is they, in the Hereafter, who will be the losers.",
    "translation_id": "Tidak diragukan bahwa merekalah orang-orang yang rugi di akhirat."
  },
  {
    "ayat": 110,
    "arabic": "ثُمَّ اِنَّ رَبَّكَ لِلَّذِيْنَ هَاجَرُوْا مِنْۢ بَعْدِ مَا فُتِنُوْا ثُمَّ جَاهَدُوْا وَصَبَرُوْاۚ اِنَّ رَبَّكَ مِنْۢ بَعْدِهَا لَغَفُوْرٌ رَّحِيْمٌ ࣖ",
    "transliteration_en": "Summa inna Rabbaka lillazeena haajaroo mim ba'dimaa futinoo summma jaahadoo wa sabaroo inna Rabbaka mim ba'dihaa la Ghafoorur Raheem",
    "transliteration_id": "Ṡumma inna rabbaka lil-lażīna hājarū mim ba‘di mā futinū ṡumma jāhadū wa ṣabarū, inna rabbaka mim ba‘dihā lagafūrur raḥīm(un).",
    "translation_en": "Then, indeed your Lord, to those who emigrated after they had been compelled [to renounce their religion] and thereafter fought [for the cause of Allah] and were patient - indeed, your Lord, after that, is Forgiving and Merciful",
    "translation_id": "Kemudian, sesungguhnya Tuhanmu (adalah pelindung) bagi orang-orang yang berhijrah setelah menderita cobaan. Lalu, mereka berjihad dan bersabar. Sesungguhnya Tuhanmu setelah itu benar-benar Maha Pengampun lagi Maha Penyayang."
  },
  {
    "ayat": 111,
    "arabic": "۞ يَوْمَ تَأْتِيْ كُلُّ نَفْسٍ تُجَادِلُ عَنْ نَّفْسِهَا وَتُوَفّٰى كُلُّ نَفْسٍ مَّا عَمِلَتْ وَهُمْ لَا يُظْلَمُوْنَ",
    "transliteration_en": "Yawma taatee kullu nafsin tujaadilu 'an nafsihaa wa tuwaffaa kullu nafsim maa 'amilat wa hum laa yuzlamoon",
    "transliteration_id": "Yauma ta'tī kullu nafsin tujādilu ‘an nafsihā wa tuwaffā kullu nafsim mā ‘amilat wa hum lā yuẓlamūn(a).",
    "translation_en": "On the Day when every soul will come disputing for itself, and every soul will be fully compensated for what it did, and they will not be wronged.",
    "translation_id": "(Ingatlah) hari (ketika) setiap orang datang untuk membela dirinya dan setiap orang disempurnakan (balasan) apa yang telah ia kerjakan dan mereka tidak dizalimi."
  },
  {
    "ayat": 112,
    "arabic": "وَضَرَبَ اللّٰهُ مَثَلًا قَرْيَةً كَانَتْ اٰمِنَةً مُّطْمَىِٕنَّةً يَّأْتِيْهَا رِزْقُهَا رَغَدًا مِّنْ كُلِّ مَكَانٍ فَكَفَرَتْ بِاَنْعُمِ اللّٰهِ فَاَذَاقَهَا اللّٰهُ لِبَاسَ الْجُوْعِ وَالْخَوْفِ بِمَا كَانُوْا يَصْنَعُوْنَ",
    "transliteration_en": "Wa darabal laahu masalan qaryatan kaanat aaminatam mutma'innatany yaaateehaa rizquhaa rghadam min kulli makaanin fakafarat bi an'umil laahi fa azaaqahal laahu libaasal joo'i walkhawfi bimaa kaanoo yasna'oon",
    "transliteration_id": "Wa ḍaraballāhu maṡalan qaryatan kānat āminatam muṭma'innatay ya'tīhā rizquhā ragadam min kulli makānin fa kafarat bi'an‘umillāhi fa ażāqahallāhu libāsal-jū‘i wal-khaufi bimā kānū yaṣna‘ūn(a).",
    "translation_en": "And Allah presents an example: a city which was safe and secure, its provision coming to it in abundance from every location, but it denied the favors of Allah. So Allah made it taste the envelopment of hunger and fear for what they had been doing.",
    "translation_id": "Allah telah membuat suatu perumpamaan sebuah negeri yang dahulu aman lagi tenteram yang rezekinya datang kepadanya berlimpah ruah dari setiap tempat, tetapi (penduduknya) mengingkari nikmat-nikmat Allah. Oleh karena itu, Allah menimpakan kepada mereka bencana kelaparan dan ketakutan karena apa yang selalu mereka perbuat."
  },
  {
    "ayat": 113,
    "arabic": "وَلَقَدْ جَاۤءَهُمْ رَسُوْلٌ مِّنْهُمْ فَكَذَّبُوْهُ فَاَخَذَهُمُ الْعَذَابُ وَهُمْ ظٰلِمُوْنَ",
    "transliteration_en": "Wa laqad jaaa'ahum Rasoolum minhum fakazzaboohu fa akhazahumul 'azaabu wa hum zaalimoon",
    "transliteration_id": "Wa laqad jā'ahum rasūlum minhum fa każżabūhu fa akhażahumul-‘ażābu wa hum ẓālimūn(a).",
    "translation_en": "And there had certainly come to them a Messenger from among themselves, but they denied him; so punishment overtook them while they were wrongdoers.",
    "translation_id": "Sungguh, telah datang kepada mereka seorang rasul dari (kalangan) mereka sendiri, tetapi mereka mendustakannya. Oleh karena itu, mereka ditimpa azab dan mereka itulah orang-orang zalim."
  },
  {
    "ayat": 114,
    "arabic": "فَكُلُوْا مِمَّا رَزَقَكُمُ اللّٰهُ حَلٰلًا طَيِّبًاۖ وَّاشْكُرُوْا نِعْمَتَ اللّٰهِ اِنْ كُنْتُمْ اِيَّاهُ تَعْبُدُوْنَ",
    "transliteration_en": "Fakuloo mimmaa razaqa kumul laahu halaalan taiyibanw washkuroo ni'matal laahi in kuntum iyyaahu ta'budoon",
    "transliteration_id": "Fa kulū mimmā razaqakumullāhu ḥalālan ṭayyibā(n), wasykurū ni‘matallāhi in kuntum iyyāhu ta‘budūn(a).",
    "translation_en": "Then eat of what Allah has provided for you [which is] lawful and good. And be grateful for the favor of Allah, if it is [indeed] Him that you worship.",
    "translation_id": "Makanlah sebagian apa yang telah Allah anugerahkan kepadamu sebagai (rezeki) yang halal lagi baik dan syukurilah nikmat Allah jika kamu hanya menyembah kepada-Nya."
  },
  {
    "ayat": 115,
    "arabic": "اِنَّمَا حَرَّمَ عَلَيْكُمُ الْمَيْتَةَ وَالدَّمَ وَلَحْمَ الْخِنْزِيْرِ وَمَآ اُهِلَّ لِغَيْرِ اللّٰهِ بِهٖۚ فَمَنِ اضْطُرَّ غَيْرَ بَاغٍ وَّلَا عَادٍ فَاِنَّ اللّٰهَ غَفُوْرٌ رَّحِيْمٌ",
    "transliteration_en": "Innamaa harrma 'alai kumul maitata waddama wa lahmal khinzeeri wa maaa uhilla lighairil laahi bihee famanid turra ghaira baaghinw wa laa 'aadin fa innal laaha Ghafoorur Raheem",
    "transliteration_id": "Innamā ḥarrama ‘alaikumul-maitata wad-dama wa laḥmal-khinzīri wa mā uhilla ligairillāhi bih(ī), famaniḍṭurra gaira bāgiw wa lā ‘ādin fa innallāha gafūrur raḥīm(un).",
    "translation_en": "He has only forbidden to you dead animals, blood, the flesh of swine, and that which has been dedicated to other than Allah. But whoever is forced [by necessity], neither desiring [it] nor transgressing [its limit] - then indeed, Allah is Forgiving and Merciful.",
    "translation_id": "Sesungguhnya Allah hanya mengharamkan atasmu bangkai, darah, daging babi, dan (hewan) yang disembelih dengan (menyebut nama) selain Allah. Akan tetapi, siapa yang terpaksa (memakannya) bukan karena menginginkan dan tidak (pula) melampaui batas, sesungguhnya Allah Maha Pengampun lagi Maha Penyayang."
  },
  {
    "ayat": 116,
    "arabic": "وَلَا تَقُوْلُوْا لِمَا تَصِفُ اَلْسِنَتُكُمُ الْكَذِبَ هٰذَا حَلٰلٌ وَّهٰذَا حَرَامٌ لِّتَفْتَرُوْا عَلَى اللّٰهِ الْكَذِبَۗ اِنَّ الَّذِيْنَ يَفْتَرُوْنَ عَلَى اللّٰهِ الْكَذِبَ لَا يُفْلِحُوْنَۗ",
    "transliteration_en": "Wa laa taqooloo limaa tasifu alsinatukumul kaziba haaza halaalunw wa haazaa haraamul litaftaroo 'alal laahil kazib; innal lazeena yaftaroona 'alal laahil kaziba laa yuflihoon",
    "transliteration_id": "Wa lā taqūlū limā taṣifu alsinatukumul-każiba hāżā ḥalāluw wa hāżā ḥarāmul litaftarū ‘alallāhil-każib(a), innal-lażīna yaftarūna ‘alallāhil-każiba lā yufliḥūn(a).",
    "translation_en": "And do not say about what your tongues assert of untruth, \"This is lawful and this is unlawful,\" to invent falsehood about Allah. Indeed, those who invent falsehood about Allah will not succeed.",
    "translation_id": "Janganlah kamu mengatakan terhadap apa yang diucapkan oleh lidahmu secara bohong, “Ini halal dan ini haram,” untuk mengada-adakan kebohongan terhadap Allah. Sesungguhnya orang-orang yang mengada-adakan kebohongan terhadap Allah tidak akan beruntung."
  },
  {
    "ayat": 117,
    "arabic": "مَتَاعٌ قَلِيْلٌ  ۖوَّلَهُمْ عَذَابٌ اَلِيْمٌ",
    "transliteration_en": "Mata'un qaleelunw wa lahum 'azaabun aleem",
    "transliteration_id": "Matā‘un qalīl(un), wa lahum ‘ażābun alīm(un).",
    "translation_en": "[It is but] a brief enjoyment, and they will have a painful punishment.",
    "translation_id": "(Itu adalah) kesenangan yang sedikit dan bagi mereka ada azab yang pedih."
  },
  {
    "ayat": 118,
    "arabic": "وَعَلَى الَّذِيْنَ هَادُوْا حَرَّمْنَا مَا قَصَصْنَا عَلَيْكَ مِنْ قَبْلُ ۗوَمَا ظَلَمْنٰهُمْ وَلٰكِنْ كَانُوْٓا اَنْفُسَهُمْ يَظْلِمُوْنَ",
    "transliteration_en": "Wa 'alal lazeena haadoo harramnaa ma qasasnaa 'alaika min qablu wa maa zalamanaahum wa laakin kaanoo anfusahum wa laakin kaanoo anfusahum yazlimoon",
    "transliteration_id": "Wa ‘alal-lażīna hādū ḥarramnā mā qaṣaṣnā ‘alaika min qabl(u), wa mā ẓalamnāhum wa lākin kānū anfusahum yaẓlimūn(a).",
    "translation_en": "And to those who are Jews We have prohibited that which We related to you before. And We did not wrong them [thereby], but they were wronging themselves.",
    "translation_id": "Terhadap orang Yahudi Kami haramkan apa yang telah Kami ceritakan kepadamu (Nabi Muhammad) dahulu. Kami tidak menzalimi mereka, tetapi merekalah yang menzalimi diri sendiri."
  },
  {
    "ayat": 119,
    "arabic": "ثُمَّ اِنَّ رَبَّكَ لِلَّذِيْنَ عَمِلُوا السُّوْۤءَ بِجَهَالَةٍ ثُمَّ تَابُوْا مِنْۢ بَعْدِ ذٰلِكَ وَاَصْلَحُوْٓا اِنَّ رَبَّكَ مِنْۢ بَعْدِهَا لَغَفُوْرٌ رَّحِيْمٌ ࣖ",
    "transliteration_en": "Summma inna Rabbaka lillazeena 'amilus sooo'a bijahaalatin summa taaboo mim ba'di zaaalika wa aslahoo inna Rabbaka mim ba'dihaa la Ghafoorur Raheem",
    "transliteration_id": "Ṡumma inna rabbaka lil-lażīna ‘amilus-sū'a bijahālatin ṡumma tābū mim ba‘di żālika wa aṣlaḥū inna rabbaka mim ba‘dihā lagafūrur raḥīm(un).",
    "translation_en": "Then, indeed your Lord, to those who have done wrong out of ignorance and then repent after that and correct themselves - indeed, your Lord, thereafter, is Forgiving and Merciful.",
    "translation_id": "Kemudian, sesungguhnya Tuhanmu (mengampuni) orang-orang yang melakukan keburukan karena kebodohan (tidak menyadari akibatnya), lalu bertobat dan memperbaiki (dirinya). Sesungguhnya Tuhanmu setelah itu benar-benar Maha Pengampun lagi Maha Penyayang."
  },
  {
    "ayat": 120,
    "arabic": "اِنَّ اِبْرٰهِيْمَ كَانَ اُمَّةً قَانِتًا لِّلّٰهِ حَنِيْفًاۗ وَلَمْ يَكُ مِنَ الْمُشْرِكِيْنَۙ",
    "transliteration_en": "Inna Ibraaheema kaana ummatan qaanital lillaahi Haneefanw wa lam yakuminal mushrikeen",
    "transliteration_id": "Inna ibrāhīma kāna ummatan qānital lillāhi ḥanīfā(n), wa lam yaku minal-musyrikīn(a).",
    "translation_en": "Indeed, Abraham was a [comprehensive] leader, devoutly obedient to Allah, inclining toward truth, and he was not of those who associate others with Allah.",
    "translation_id": "Sesungguhnya Ibrahim adalah imam (sosok anutan) yang patuh kepada Allah, hanif (lurus), dan bukan termasuk orang-orang musyrik."
  },
  {
    "ayat": 121,
    "arabic": "شَاكِرًا لِّاَنْعُمِهِ ۖاجْتَبٰىهُ وَهَدٰىهُ اِلٰى صِرَاطٍ مُّسْتَقِيْمٍ",
    "transliteration_en": "Shaakiral li an'umih; ijtabaahu wa hadaahu ilaa Siraatim Muustaqeem",
    "transliteration_id": "Syākiral li'an‘umih(ī), ijtabāhu wa hadāhu ilā ṣirāṭim mustaqīm(in).",
    "translation_en": "[He was] grateful for His favors. Allah chose him and guided him to a straight path.",
    "translation_id": "(Ibrahim) bersyukur atas nikmat-nikmat-Nya (dan Allah) telah memilih serta menunjukinya ke jalan yang lurus."
  },
  {
    "ayat": 122,
    "arabic": "وَاٰتَيْنٰهُ فِى الدُّنْيَا حَسَنَةً ۗوَاِنَّهٗ فِى الْاٰخِرَةِ لَمِنَ الصّٰلِحِيْنَ ۗ",
    "transliteration_en": "Wa aatainaahu fid dunyaa hasanah; wa innahoo fil Aakhirati laminas saaliheen",
    "transliteration_id": "Wa ātaināhu fid-dun-yā ḥasanah(tan), wa innahū fil-ākhirati laminaṣ-ṣāliḥīn(a).",
    "translation_en": "And We gave him good in this world, and indeed, in the Hereafter he will be among the righteous.",
    "translation_id": "Kami berikan kepadanya kebaikan di dunia dan sesungguhnya di akhirat dia termasuk orang-orang yang saleh."
  },
  {
    "ayat": 123,
    "arabic": "ثُمَّ اَوْحَيْنَآ اِلَيْكَ اَنِ اتَّبِعْ مِلَّةَ اِبْرٰهِيْمَ حَنِيْفًا ۗوَمَا كَانَ مِنَ الْمُشْرِكِيْنَ",
    "transliteration_en": "Summma awhainaa ilaika anit tabi' Millata Ibraaheema haneefaa; wa maa kaana minal mushrikeen",
    "transliteration_id": "Ṡumma auḥainā ilaika anittabi‘ millata ibrāhīma ḥanīfā(n), wa mā kāna minal-musyrikīn(a).",
    "translation_en": "Then We revealed to you, [O Muhammad], to follow the religion of Abraham, inclining toward truth; and he was not of those who associate with Allah.",
    "translation_id": "Kemudian, Kami wahyukan kepadamu (Nabi Muhammad), “Ikutilah agama Ibrahim sebagai (sosok) yang hanif dan tidak termasuk orang-orang musyrik.”"
  },
  {
    "ayat": 124,
    "arabic": "اِنَّمَا جُعِلَ السَّبْتُ عَلَى الَّذِيْنَ اخْتَلَفُوْا فِيْهِۗ وَاِنَّ رَبَّكَ لَيَحْكُمُ بَيْنَهُمْ يَوْمَ الْقِيٰمَةِ فِيْمَا كَانُوْا فِيْهِ يَخْتَلِفُوْنَ",
    "transliteration_en": "Innnamaa ju'ilas Sabtu 'alal lazeenakhtalafoo feeh; wa inna Rabbaka la yahkumu bainahum Yawmal Qiyaamati feemaa kaanoo feehi yakhtalifoon",
    "transliteration_id": "Innamā ju‘ilas-sabtu ‘alal-lażīnakhtalafū fīh(i), wa inna rabbaka layaḥkumu bainahum yaumal-qiyāmati fīmā kānū fīhi yakhtalifūn(a).",
    "translation_en": "The sabbath was only appointed for those who differed over it. And indeed, your Lord will judge between them on the Day of Resurrection concerning that over which they used to differ.",
    "translation_id": "Sesungguhnya (mengagungkan) hari Sabtu hanya diwajibkan bagi orang-orang (Yahudi) yang memperselisihkannya. Sesungguhnya Tuhanmu benar-benar akan memberi keputusan di antara mereka pada hari Kiamat tentang apa yang mereka perselisihkan."
  },
  {
    "ayat": 125,
    "arabic": "اُدْعُ اِلٰى سَبِيْلِ رَبِّكَ بِالْحِكْمَةِ وَالْمَوْعِظَةِ الْحَسَنَةِ وَجَادِلْهُمْ بِالَّتِيْ هِيَ اَحْسَنُۗ اِنَّ رَبَّكَ هُوَ اَعْلَمُ بِمَنْ ضَلَّ عَنْ سَبِيْلِهٖ وَهُوَ اَعْلَمُ بِالْمُهْتَدِيْنَ",
    "transliteration_en": "Ud'u ilaa sabeeli Rabbika bilhikmati walmaw 'izatil hasanati wa jaadilhum billatee hiya ahsan; inna Rabbaka huwa a'almu biman dalla 'an sabeelihee wa Huwa a'lamu bilmuhtadeen",
    "transliteration_id": "Ud‘u ilā sabīli rabbika bil-ḥikmati wal-mau‘iẓatil-ḥasanati wa jādilhum bil-latī hiya aḥsan(u), inna rabbaka huwa a‘lamu biman ḍalla ‘an sabīlihī wa huwa a‘lamu bil-muhtadīn(a).",
    "translation_en": "Invite to the way of your Lord with wisdom and good instruction, and argue with them in a way that is best. Indeed, your Lord is most knowing of who has strayed from His way, and He is most knowing of who is [rightly] guided.",
    "translation_id": "Serulah (manusia) ke jalan Tuhanmu dengan hikmah dan pengajaran yang baik serta debatlah mereka dengan cara yang lebih baik. Sesungguhnya Tuhanmu Dialah yang paling tahu siapa yang tersesat dari jalan-Nya dan Dia (pula) yang paling tahu siapa yang mendapat petunjuk."
  },
  {
    "ayat": 126,
    "arabic": "وَاِنْ عَاقَبْتُمْ فَعَاقِبُوْا بِمِثْلِ مَا عُوْقِبْتُمْ بِهٖۗ وَلَىِٕنْ صَبَرْتُمْ لَهُوَ خَيْرٌ لِّلصّٰبِرِيْنَ",
    "transliteration_en": "Wa in 'aaqabtum fa'aaqiboo bimisli maa 'ooqibtum bihee wa la'in sabartum lahuwa khairul lissaabireen",
    "transliteration_id": "Wa in ‘āqabtum fa ‘āqibū bimiṡli mā ‘ūqibtum bih(ī), wa la'in ṣabartum lahuwa khairul liṣ-ṣābirīn(a).",
    "translation_en": "And if you punish [an enemy, O believers], punish with an equivalent of that with which you were harmed. But if you are patient - it is better for those who are patient.",
    "translation_id": "Jika kamu membalas, balaslah dengan (balasan) yang sama dengan siksaan yang ditimpakan kepadamu. Sungguh, jika kamu bersabar, hal itu benar-benar lebih baik bagi orang-orang yang sabar."
  },
  {
    "ayat": 127,
    "arabic": "وَاصْبِرْ وَمَا صَبْرُكَ اِلَّا بِاللّٰهِ وَلَا تَحْزَنْ عَلَيْهِمْ وَلَا تَكُ فِيْ ضَيْقٍ مِّمَّا يَمْكُرُوْنَ",
    "transliteration_en": "Wasbir wa maa sabruka illaa billaah; wa laa tahzan 'alaihim wa laa taku fee daiqim mimmaa yamkuroon",
    "transliteration_id": "Waṣbir wa mā ṣabruka illā billāhi wa lā taḥzan ‘alaihim wa lā taku fī ḍaiqim mimmā yamkurūn(a).",
    "translation_en": "And be patient, [O Muhammad], and your patience is not but through Allah. And do not grieve over them and do not be in distress over what they conspire.",
    "translation_id": "Bersabarlah (Nabi Muhammad) dan kesabaranmu itu semata-mata dengan (pertolongan) Allah, janganlah bersedih terhadap (kekufuran) mereka, dan jangan (pula) bersempit dada terhadap tipu daya yang mereka rencanakan."
  },
  {
    "ayat": 128,
    "arabic": "اِنَّ اللّٰهَ مَعَ الَّذِيْنَ اتَّقَوْا وَّالَّذِيْنَ هُمْ مُّحْسِنُوْنَ ࣖ   ۔",
    "transliteration_en": "Innal laaha ma'al lazeenat taqaw wal lazeena hum muhsinoon",
    "transliteration_id": "Innallāha ma‘al-lażīnattaqau wal-lażīna hum muḥsinūn(a).",
    "translation_en": "Indeed, Allah is with those who fear Him and those who are doers of good.",
    "translation_id": "Sesungguhnya Allah bersama orang-orang yang bertakwa dan yang berbuat kebaikan."
  }
]