[
  {
    "ayat": 1,
    "arabic": "اَتٰىٓ اَمْرُ اللّٰهِ فَلَا تَسْتَعْجِلُوْهُ ۗسُبْحٰنَهٗ وَتَعٰلٰى عَمَّا يُشْرِكُوْنَ",
    "transliteration_en": "Ataaa amrullaahi falaa tasta'jilooh; Subhaanahoo wa Ta'aalaa 'ammaa yushrikoon",
    "transliteration_id": "Atā amrullāhi falā tasta‘jilūh(u), subḥānahū wa ta‘ālā ‘ammā yusyrikūn(a).",
    "translation_en": "The command of Allah is coming, so be not impatient for it. Exalted is He and high above what they associate with Him.",
    "translation_id": "Ketetapan Allah pasti datang. Maka, janganlah kamu meminta agar dipercepat (kedatangan)-nya. Maha Suci dan Maha Tinggi Dia dari apa yang mereka persekutukan."
  },
  {
    "ayat": 2,
    "arabic": "يُنَزِّلُ الْمَلٰۤىِٕكَةَ بِالرُّوْحِ مِنْ اَمْرِهٖ عَلٰى مَنْ يَّشَاۤءُ مِنْ عِبَادِهٖٓ اَنْ اَنْذِرُوْٓا اَنَّهٗ لَآ اِلٰهَ اِلَّآ اَنَا۠ فَاتَّقُوْنِ",
    "transliteration_en": "Yunazzilul malaaa 'ikata birroohi min amrihee 'alaa mai yashaaa'u min 'ibaadiheee an anzirooo annahoo laaa ilaaha illaaa ana fattaqoon",
    "transliteration_id": "Yunazzilul-malā'ikata bir-rūḥi min amrihī ‘alā may yasyā'u min ‘ibādihī an anżirū annahū lā ilāha illā ana fattaqūn(i).",
    "translation_en": "He sends down the angels, with the inspiration of His command, upon whom He wills of His servants, [telling them], \"Warn that there is no deity except Me; so fear Me.\"",
    "translation_id": "Dia menurunkan para malaikat membawa wahyu atas perintah-Nya kepada siapa yang Dia kehendaki di antara hamba-hamba-Nya, yaitu (dengan berfirman), “Peringatkanlah (hamba-hamba-Ku) bahwa tidak ada tuhan selain Aku. Maka, bertakwalah kepada-Ku.”"
  },
  {
    "ayat": 3,
    "arabic": "خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ بِالْحَقِّۗ تَعٰلٰى عَمَّا يُشْرِكُوْنَ",
    "transliteration_en": "Khalaqas samaawaati wal arda bilhaqq; Ta'aalaa 'ammaa yushrikoon",
    "transliteration_id": "Khalaqas-samāwāti wal-arḍa bil-ḥaqq(i), ta‘ālā ‘ammā yusyrikūn(a).",
    "translation_en": "He created the heavens and earth in truth. High is He above what they associate with Him.",
    "translation_id": "Dia menciptakan langit dan bumi dengan hak. Maha Tinggi Dia dari apa yang mereka persekutukan."
  },
  {
    "ayat": 4,
    "arabic": "خَلَقَ الْاِنْسَانَ مِنْ نُّطْفَةٍ فَاِذَا هُوَ خَصِيْمٌ مُّبِيْنٌ",
    "transliteration_en": "Khalaqal insaana min nutfatin fa izaa huwa khaseemum mubeen",
    "transliteration_id": "Khalaqal-insāna min nuṭfatin fa iżā huwa khaṣīmum mubīn(un).",
    "translation_en": "He created man from a sperm-drop; then at once, he is a clear adversary.",
    "translation_id": "Dia telah menciptakan manusia dari mani, lalu ternyata dia menjadi pembantah yang nyata."
  },
  {
    "ayat": 5,
    "arabic": "وَالْاَنْعَامَ خَلَقَهَا لَكُمْ فِيْهَا دِفْءٌ وَّمَنَافِعُ وَمِنْهَا تَأْكُلُوْنَ",
    "transliteration_en": "Wal an 'amaa khalaqahaa; lakum feehaa dif'unw wa manaafi'u wa minhaa taakuloon",
    "transliteration_id": "Wal-an‘āma khalaqahā lakum fīhā dif'uw wa manāfi‘u wa minhā ta'kulūn(a).",
    "translation_en": "And the grazing livestock He has created for you; in them is warmth and [numerous] benefits, and from them you eat.",
    "translation_id": "Dia telah menciptakan hewan ternak untukmu. Padanya (hewan ternak itu) ada (bulu) yang menghangatkan dan berbagai manfaat, serta sebagian (daging)-nya kamu makan."
  },
  {
    "ayat": 6,
    "arabic": "وَلَكُمْ فِيْهَا جَمَالٌ حِيْنَ تُرِيْحُوْنَ وَحِيْنَ تَسْرَحُوْنَۖ",
    "transliteration_en": "Wa lakum feehaa jamaalun heena tureehoona wa heena tasrahoon",
    "transliteration_id": "Wa lakum fīhā jamālun ḥīna turīḥūna wa ḥīna tasraḥūn(a).",
    "translation_en": "And for you in them is [the enjoyment of] beauty when you bring them in [for the evening] and when you send them out [to pasture].",
    "translation_id": "Kamu memperoleh keindahan padanya ketika kamu membawanya kembali ke kandang dan ketika melepaskannya (ke tempat penggembalaan)."
  },
  {
    "ayat": 7,
    "arabic": "وَتَحْمِلُ اَثْقَالَكُمْ اِلٰى بَلَدٍ لَّمْ تَكُوْنُوْا بٰلِغِيْهِ اِلَّا بِشِقِّ الْاَنْفُسِۗ اِنَّ رَبَّكُمْ لَرَءُوْفٌ رَّحِيْمٌۙ",
    "transliteration_en": "Wa tahmilu asqaalakum ilaa baladil lam takoonoo baaligheehi illaa bishiqqil anfus; inna Rabbakum la Ra'oofur Raheem",
    "transliteration_id": "Wa taḥmilu aṡqālakum ilā baladil lam takūnū bāligīhi illā bisyiqqil-anfus(i), inna rabbakum lara'ūfur raḥīm(un).",
    "translation_en": "And they carry your loads to a land you could not have reached except with difficulty to yourselves. Indeed, your Lord is Kind and Merciful.",
    "translation_id": "Ia mengangkut beban-bebanmu ke suatu negeri yang kamu tidak sanggup mencapainya, kecuali dengan susah payah. Sesungguhnya Tuhanmu Maha Pengasih lagi Maha Penyayang."
  },
  {
    "ayat": 8,
    "arabic": "وَّالْخَيْلَ وَالْبِغَالَ وَالْحَمِيْرَ لِتَرْكَبُوْهَا وَزِيْنَةًۗ وَيَخْلُقُ مَا لَا تَعْلَمُوْنَ",
    "transliteration_en": "Walkhaila wal bighaala wal hameera litarkaboohaa wa zeenah; wa yakhluqu maa laa ta'lamoon",
    "transliteration_id": "Wal-khaila wal-bigāla wal-ḥamīra litarkabūhā wa zīnah(tan), wa yakhluqu mā lā ta‘lamūn(a).",
    "translation_en": "And [He created] the horses, mules and donkeys for you to ride and [as] adornment. And He creates that which you do not know.",
    "translation_id": "(Dia telah menciptakan) kuda, bagal, dan keledai untuk kamu tunggangi dan (menjadi) perhiasan. Allah menciptakan apa yang tidak kamu ketahui."
  },
  {
    "ayat": 9,
    "arabic": "وَعَلَى اللّٰهِ قَصْدُ السَّبِيْلِ وَمِنْهَا جَاۤىِٕرٌ ۗوَلَوْ شَاۤءَ لَهَدٰىكُمْ اَجْمَعِيْنَ ࣖ",
    "transliteration_en": "Wa 'alal laahi qasdus sabeeli wa minhaa jaaa'ir; wa law shaaa'a lahadaakum ajma'een",
    "transliteration_id": "Wa ‘alallāhi qaṣdus-sabīli wa minhā jā'ir(un), wa lau syā'a lahadākum ajma‘īn(a).",
    "translation_en": "And upon Allah is the direction of the [right] way, and among the various paths are those deviating. And if He willed, He could have guided you all.",
    "translation_id": "Allahlah yang menerangkan jalan yang lurus dan di antaranya ada (jalan) yang menyimpang. Jika Dia menghendaki, tentu Dia memberi petunjuk kamu semua (ke jalan yang benar)."
  },
  {
    "ayat": 10,
    "arabic": "هُوَ الَّذِيْٓ اَنْزَلَ مِنَ السَّمَاۤءِ مَاۤءً لَّكُمْ مِّنْهُ شَرَابٌ وَّمِنْهُ شَجَرٌ فِيْهِ تُسِيْمُوْنَ",
    "transliteration_en": "Huwal lazeee anzala minas samaaa'i maaa'al lakum minhu sharaabunw wa minhu shajarun feehi tuseemoon",
    "transliteration_id": "Huwal-lażī anzala minas-samā'i mā'al lakum minhu syarābuw wa minhu syajarun fīhi tusīmūn(a).",
    "translation_en": "It is He who sends down rain from the sky; from it is drink and from it is foliage in which you pasture [animals].",
    "translation_id": "Dialah yang telah menurunkan air (hujan) dari langit untuk kamu. Sebagiannya menjadi minuman dan sebagiannya (menyuburkan) tumbuhan yang dengannya kamu menggembalakan ternakmu."
  },
  {
    "ayat": 11,
    "arabic": "يُنْۢبِتُ لَكُمْ بِهِ الزَّرْعَ وَالزَّيْتُوْنَ وَالنَّخِيْلَ وَالْاَعْنَابَ وَمِنْ كُلِّ الثَّمَرٰتِۗ اِنَّ فِيْ ذٰلِكَ لَاٰيَةً لِّقَوْمٍ يَّتَفَكَّرُوْنَ",
    "transliteration_en": "Yumbitu lakum bihiz zar'a wazzaitoona wanna kheela wal-a'naaba wa min kullis samaraat, inna fee zaalika la Aayatal liqawminy yatafakkaroon",
    "transliteration_id": "Yumbitu lakum bihiz-zar‘a waz-zaitūna wan-nakhīla wal-a‘nāba wa min kulliṡ-ṡamarāt(i), inna fī żālika la'āyatal liqaumiy yatafakkarūn(a).",
    "translation_en": "He causes to grow for you thereby the crops, olives, palm trees, grapevines, and from all the fruits. Indeed in that is a sign for a people who give thought.",
    "translation_id": "Dengan (air hujan) itu Dia menumbuhkan untukmu tumbuh-tumbuhan, zaitun, kurma, anggur, dan segala macam buah-buahan. Sesungguhnya pada yang demikian itu benar-benar terdapat tanda (kebesaran Allah) bagi orang yang berpikir."
  },
  {
    "ayat": 12,
    "arabic": "وَسَخَّرَ لَكُمُ الَّيْلَ وَالنَّهَارَۙ وَالشَّمْسَ وَالْقَمَرَ ۗوَالنُّجُوْمُ مُسَخَّرٰتٌۢ بِاَمْرِهٖ ۗاِنَّ فِيْ ذٰلِكَ لَاٰيٰتٍ لِّقَوْمٍ يَّعْقِلُوْنَۙ",
    "transliteration_en": "Wa sakkhkhara lakumul laila wannahaara wash shamsa walqamara wannujoomu musakhkharaatum bi amrih; inna fee zaalika la Aayaatil liqawminy ya'qiloon",
    "transliteration_id": "Wa sakhkhara lakumul-laila wan-nahār(a), wasy-syamsa wal-qamar(a), wan-nujūmu musakhkharātum bi'amrih(ī), inna fī żālika la'āyātil liqaumiy ya‘qilūn(a).",
    "translation_en": "And He has subjected for you the night and day and the sun and moon, and the stars are subjected by His command. Indeed in that are signs for a people who reason.",
    "translation_id": "Dia menundukkan malam dan siang, matahari dan bulan untukmu, dan bintang-bintang dikendalikan dengan perintah-Nya. Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda (kebesaran Allah) bagi orang yang mengerti."
  },
  {
    "ayat": 13,
    "arabic": "وَمَا ذَرَاَ لَكُمْ فِى الْاَرْضِ مُخْتَلِفًا اَلْوَانُهٗ ۗاِنَّ فِيْ ذٰلِكَ لَاٰيَةً لِّقَوْمٍ يَّذَّكَّرُوْنَ",
    "transliteration_en": "Wa maa zara a lakum fil ardi mukhtalifan alwaanuh; inna fee zaalika la Aayatal liqawminy yazakkaroon",
    "transliteration_id": "Wa mā żara'a lakum fil-arḍi mukhtalifan alwānuh(ū), inna fī żālika la'āyatal liqaumiy yażżakkarūn(a).",
    "translation_en": "And [He has subjected] whatever He multiplied for you on the earth of varying colors. Indeed in that is a sign for a people who remember.",
    "translation_id": "(Dia juga mengendalikan) apa yang Dia ciptakan untukmu di bumi ini dengan berbagai jenis dan macam warnanya. Sesungguhnya pada yang demikian itu benar-benar terdapat tanda (kebesaran Allah) bagi kaum yang mengambil pelajaran."
  },
  {
    "ayat": 14,
    "arabic": "وَهُوَ الَّذِيْ سَخَّرَ الْبَحْرَ لِتَأْكُلُوْا مِنْهُ لَحْمًا طَرِيًّا وَّتَسْتَخْرِجُوْا مِنْهُ حِلْيَةً تَلْبَسُوْنَهَاۚ وَتَرَى الْفُلْكَ مَوَاخِرَ فِيْهِ وَلِتَبْتَغُوْا مِنْ فَضْلِهٖ وَلَعَلَّكُمْ تَشْكُرُوْنَ",
    "transliteration_en": "Wa Huwal lazee sakhkharal bahra litaakuloo minhu lahman tariyyanw wa tastakhrijoo minhu hilyatan talbasoonahaa wa taral fulka mawaakhira feehi wa litabtaghoo min fadlihee wa la'allakum tashkuroon",
    "transliteration_id": "Wa huwal-lażī sakhkharal-baḥra lita'kulū minhu laḥman ṭariyyaw wa tastakhrijū minhu ḥilyatan talbasūnahā, wa taral-fulka mawākhira fīhi wa litabtagū min faḍlihī wa la‘allakum tasykurūn(a).",
    "translation_en": "And it is He who subjected the sea for you to eat from it tender meat and to extract from it ornaments which you wear. And you see the ships plowing through it, and [He subjected it] that you may seek of His bounty; and perhaps you will be grateful.",
    "translation_id": "Dialah yang menundukkan lautan (untukmu) agar kamu dapat memakan daging yang segar (ikan) darinya dan (dari lautan itu) kamu mengeluarkan perhiasan yang kamu pakai. Kamu (juga) melihat perahu berlayar padanya, dan agar kamu mencari sebagian karunia-Nya, dan agar kamu bersyukur."
  },
  {
    "ayat": 15,
    "arabic": "وَاَلْقٰى فِى الْاَرْضِ رَوَاسِيَ اَنْ تَمِيْدَ بِكُمْ وَاَنْهٰرًا وَّسُبُلًا لَّعَلَّكُمْ تَهْتَدُوْنَۙ",
    "transliteration_en": "Wa alqaa fil ardi rawaasiya an tameeda bikum wa anhaaranw wa sublulal la 'allakum tahtadoon",
    "transliteration_id": "Wa alqā fil-arḍi rawāsiya an tamīda bikum wa anhāraw wa subulal la‘allakum tahtadūn(a).",
    "translation_en": "And He has cast into the earth firmly set mountains, lest it shift with you, and [made] rivers and roads, that you may be guided,",
    "translation_id": "Dia memancangkan gunung-gunung di bumi agar bumi tidak berguncang bersamamu serta (menciptakan) sungai-sungai dan jalan-jalan agar kamu mendapat petunjuk."
  },
  {
    "ayat": 16,
    "arabic": "وَعَلٰمٰتٍۗ وَبِالنَّجْمِ هُمْ يَهْتَدُوْنَ",
    "transliteration_en": "Wa 'alaamaat; wa bin najmi hum yahtadoon",
    "transliteration_id": "Wa ‘alāmāt(in), wa bin-najmi hum yahtadūn(a).",
    "translation_en": "And landmarks. And by the stars they are [also] guided.",
    "translation_id": "(Dia juga menciptakan) tanda-tanda. Dengan bintang-bintang mereka mendapat petunjuk."
  },
  {
    "ayat": 17,
    "arabic": "اَفَمَنْ يَّخْلُقُ كَمَنْ لَّا يَخْلُقُۗ اَفَلَا تَذَكَّرُوْنَ",
    "transliteration_en": "Afamany yakhluqu kamallaa yakhluq; afalaa tazak karoon",
    "transliteration_id": "Afamay yakhluqu kamal lā yakhluq(u), afalā tażakkarūn(a).",
    "translation_en": "Then is He who creates like one who does not create? So will you not be reminded?",
    "translation_id": "Maka, apakah (Zat) yang (dapat) menciptakan (sesuatu) sama dengan yang tidak (dapat) menciptakan? Apakah kamu tidak mengambil pelajaran?"
  },
  {
    "ayat": 18,
    "arabic": "وَاِنْ تَعُدُّوْا نِعْمَةَ اللّٰهِ لَا تُحْصُوْهَا ۗاِنَّ اللّٰهَ لَغَفُوْرٌ رَّحِيْمٌ",
    "transliteration_en": "Wa in ta'uddoo ni'matal laahi laa tuhsoohaa; innal laaha la Ghafoorur Raheem",
    "transliteration_id": "Wa in ta‘uddū ni‘matallāhi lā tuḥṣūhā, innallāha lagafūrur raḥīm(un).",
    "translation_en": "And if you should count the favors of Allah, you could not enumerate them. Indeed, Allah is Forgiving and Merciful.",
    "translation_id": "Jika kamu menghitung nikmat Allah, niscaya kamu tidak akan mampu menghitungnya. Sesungguhnya Allah benar-benar Maha Pengampun lagi Maha Penyayang."
  },
  {
    "ayat": 19,
    "arabic": "وَاللّٰهُ يَعْلَمُ مَا تُسِرُّوْنَ وَمَا تُعْلِنُوْنَ",
    "transliteration_en": "Wallaahu ya'lamu maa tusirroona wa maa tu'linoon",
    "transliteration_id": "Wallāhu ya‘lamu mā tusirrūna wa mā tu‘linūn(a).",
    "translation_en": "And Allah knows what you conceal and what you declare.",
    "translation_id": "Allah mengetahui apa yang kamu rahasiakan dan apa yang kamu tampakkan."
  },
  {
    "ayat": 20,
    "arabic": "وَالَّذِيْنَ يَدْعُوْنَ مِنْ دُوْنِ اللّٰهِ لَا يَخْلُقُوْنَ شَيْـًٔا وَّهُمْ يُخْلَقُوْنَۗ",
    "transliteration_en": "Wallazeena yad'oona min doonil laahi laa yakhluqoona shai'anw wa hum yukhlaqoon",
    "transliteration_id": "Wal-lażīna yad‘ūna min dūnillāhi  lā yakhluqūna syai'aw wa hum yukhlaqūn(a).",
    "translation_en": "And those they invoke other than Allah create nothing, and they [themselves] are created.",
    "translation_id": "(Berhala-berhala) yang mereka seru selain Allah tidak dapat menciptakan sesuatu apa pun, bahkan berhala-berhala itu (sendiri) diciptakan (oleh manusia)."
  },
  {
    "ayat": 21,
    "arabic": "اَمْوَاتٌ غَيْرُ اَحْيَاۤءٍ ۗوَمَا يَشْعُرُوْنَۙ اَيَّانَ يُبْعَثُوْنَ ࣖ",
    "transliteration_en": "Amwaatun ghairu ahyaaa'inw wa maa yash'uroona aiyaana yub'asoon",
    "transliteration_id": "Amwātun gairu aḥyā'(in), wa mā yasy‘urūna ayyāna yub‘aṡūn(a).",
    "translation_en": "They are, [in fact], dead, not alive, and they do not perceive when they will be resurrected.",
    "translation_id": "(Berhala-berhala itu benda) mati, tidak hidup, dan tidak mengetahui kapankah mereka (penyembahnya) dibangkitkan."
  },
  {
    "ayat": 22,
    "arabic": "اِلٰهُكُمْ اِلٰهٌ وَّاحِدٌ ۚفَالَّذِيْنَ لَا يُؤْمِنُوْنَ بِالْاٰخِرَةِ قُلُوْبُهُمْ مُّنْكِرَةٌ وَّهُمْ مُّسْتَكْبِرُوْنَ",
    "transliteration_en": "Illahukum Ilaahunw Waahid; fallazeena laa yu'minoona bil Aakhirati quloobuhum munkiratunw wa hum mustakbiroon",
    "transliteration_id": "Ilāhukum ilāhuw wāḥid(un), fal-lażīna lā yu'minūna bil-ākhirati qulūbuhum munkiratuw wa hum mustakbirūn(a).",
    "translation_en": "Your god is one God. But those who do not believe in the Hereafter - their hearts are disapproving, and they are arrogant.",
    "translation_id": "Tuhanmu adalah Tuhan Yang Maha Esa. Maka, orang-orang yang tidak beriman kepada akhirat hatinya mengingkari (keesaan Allah). Mereka adalah orang-orang yang sombong."
  },
  {
    "ayat": 23,
    "arabic": "لَا جَرَمَ اَنَّ اللّٰهَ يَعْلَمُ مَا يُسِرُّوْنَ وَمَا يُعْلِنُوْنَ ۗاِنَّهٗ لَا يُحِبُّ الْمُسْتَكْبِرِيْنَ",
    "transliteration_en": "Laa jarama annal laaha ya'lamu maa yusirrona wa ma yu'linoon; innahoo laa yuhibbul mustakbireen",
    "transliteration_id": "Lā jarama annallāha ya‘lamu mā yusirrūna wa mā yu‘linūn(a), innahū lā yuḥibbul-mustakbirīn(a).",
    "translation_en": "Assuredly, Allah knows what they conceal and what they declare. Indeed, He does not like the arrogant.",
    "translation_id": "Tidak diragukan lagi bahwa Allah mengetahui apa yang mereka rahasiakan dan apa yang mereka tampakkan. Sesungguhnya Dia tidak menyukai orang-orang yang sombong."
  },
  {
    "ayat": 24,
    "arabic": "وَاِذَا قِيْلَ لَهُمْ مَّاذَآ اَنْزَلَ رَبُّكُمْ ۙقَالُوْٓا اَسَاطِيْرُ الْاَوَّلِيْنَ",
    "transliteration_en": "Wa izaa qeela lahum maazaaa anzala Rabbukum qaaloo asaateerul awwaleen",
    "transliteration_id": "Wa iżā qīla lahum māżā anzala rabbukum, qālū asāṭīrul-awwalīn(a).",
    "translation_en": "And when it is said to them, \"What has your Lord sent down?\" They say, \"Legends of the former peoples,\"",
    "translation_id": "Apabila dikatakan kepada mereka, “Apa yang telah Tuhanmu turunkan?” Mereka menjawab, “Dongeng-dongeng orang terdahulu.”"
  },
  {
    "ayat": 25,
    "arabic": "لِيَحْمِلُوْٓا اَوْزَارَهُمْ كَامِلَةً يَّوْمَ الْقِيٰمَةِ ۙوَمِنْ اَوْزَارِ الَّذِيْنَ يُضِلُّوْنَهُمْ بِغَيْرِ عِلْمٍ ۗ اَلَا سَاۤءَ مَا يَزِرُوْنَ ࣖ",
    "transliteration_en": "Liyahmilooo awzaarahum kaamilatany Yawmal Qiyaamati wa min awzaaril lazeena yudilloonahum bighairi 'ilm; alaa saaa'a maa yaziroon",
    "transliteration_id": "Liyaḥmilū auzārahum kāmilatay yaumal-qiyāmah(ti), wa min auzāril-lażīna yuḍillūnahum bigairi ‘ilm(in), alā sā'a mā yazirūn(a).",
    "translation_en": "That they may bear their own burdens in full on the Day of Resurrection and some of the burdens of those whom they misguide without knowledge. Unquestionably, evil is that which they bear.",
    "translation_id": "(Ucapan mereka) menyebabkan mereka pada hari Kiamat memikul dosa-dosanya sendiri secara utuh dan sebagian dosa orang-orang yang mereka sesatkan yang tidak mengetahui (bahwa mereka disesatkan). Ingatlah, alangkah buruknya (dosa) yang mereka pikul."
  },
  {
    "ayat": 26,
    "arabic": "قَدْ مَكَرَ الَّذِيْنَ مِنْ قَبْلِهِمْ فَاَتَى اللّٰهُ بُنْيَانَهُمْ مِّنَ الْقَوَاعِدِ فَخَرَّ عَلَيْهِمُ السَّقْفُ مِنْ فَوْقِهِمْ وَاَتٰىهُمُ الْعَذَابُ مِنْ حَيْثُ لَا يَشْعُرُوْنَ",
    "transliteration_en": "Qad makaral lazeena min qablihim fa atal laahu bunyaa nahum minal qawaa'idi fakharra 'alaihimus saqfu min fawqihim wa ataahumul 'azaabu min haisu laa yash'uroon",
    "transliteration_id": "Qad makaral-lażīna min qablihim fa atallāhu bun-yānahum minal-qawā‘idi fa kharra ‘alaihimus-saqfu min fauqihim wa atāhumul-‘ażābu min ḥaiṡu lā yasy‘urūn(a).",
    "translation_en": "Those before them had already plotted, but Allah came at their building from the foundations, so the roof fell upon them from above them, and the punishment came to them from where they did not perceive.",
    "translation_id": "Sungguh, orang-orang sebelum mereka telah mengadakan tipu daya. Maka, Allah menghancurkan rumah-rumah mereka mulai dari fondasinya, lalu atapnya jatuh menimpa mereka dari atas. Azab itu datang kepada mereka dari arah yang tidak mereka sadari."
  },
  {
    "ayat": 27,
    "arabic": "ثُمَّ يَوْمَ الْقِيٰمَةِ يُخْزِيْهِمْ وَيَقُوْلُ اَيْنَ شُرَكَاۤءِيَ الَّذِيْنَ كُنْتُمْ تُشَاۤقُّوْنَ فِيْهِمْ ۗقَالَ الَّذِيْنَ اُوْتُوا الْعِلْمَ اِنَّ الْخِزْيَ الْيَوْمَ وَالسُّوْۤءَ عَلَى الْكٰفِرِيْنَۙ",
    "transliteration_en": "Summa Yawmal Qiyaamati yukhzeehim wa yaqoolu aina shurakaaa'iyal lazeena kuntum tushaaaqqoona feehim; qaalal lazeena ootul 'ilma innal khizyal Yawma wassooo'a 'alal kaafireen",
    "transliteration_id": "Ṡumma yaumal-qiyāmati yukhzīhim wa yaqūlu aina syurakā'iyal-lażīna kuntum tusyāqqūna fīhim, qālal-lażīna ūtul-‘ilma innal-khizyal-yauma was-sū'a ‘alal-kāfirīn(a).",
    "translation_en": "Then on the Day of Resurrection He will disgrace them and say, \"Where are My 'partners' for whom you used to oppose [the believers]?\" Those who were given knowledge will say, \"Indeed disgrace, this Day, and evil are upon the disbelievers\" -",
    "translation_id": "Pada hari Kiamat Dia kemudian menghinakan mereka dan berfirman, “Di manakah sekutu-sekutu-Ku itu (yang karena membelanya) kamu selalu memusuhi mereka (nabi-nabi dan orang yang beriman)?” Orang-orang yang dianugerahi ilmu berkata, “Sesungguhnya kehinaan dan azab pada hari ini ditimpakan kepada orang-orang kafir."
  },
  {
    "ayat": 28,
    "arabic": "الَّذِيْنَ تَتَوَفّٰىهُمُ الْمَلٰۤىِٕكَةُ ظَالِمِيْٓ اَنْفُسِهِمْ ۖفَاَلْقَوُا السَّلَمَ مَا كُنَّا نَعْمَلُ مِنْ سُوْۤءٍ ۗبَلٰىٓ اِنَّ اللّٰهَ عَلِيْمٌۢ بِمَا كُنْتُمْ تَعْمَلُوْنَ",
    "transliteration_en": "Allazeena tatawaf faahu mul malaaa'ikatu zaalimeee anfusihim fa alqawus salama maa kunnaa na'malu min sooo'; balaaa innal laaha 'aleemum bimaa kuntum ta'maloon",
    "transliteration_id": "Allażīna tatawaffāhumul-malā'ikatu ẓālimī anfusihim, fa alqawus-salama mā kunnā na‘malu min sū'(in), balā innallāha ‘alīmum bimā kuntum ta‘malūn(a).",
    "translation_en": "The ones whom the angels take in death [while] wronging themselves, and [who] then offer submission, [saying], \"We were not doing any evil.\" But, yes! Indeed, Allah is Knowing of what you used to do.",
    "translation_id": "(yaitu) orang yang dicabut nyawanya oleh malaikat dalam keadaan (berbuat) zalim kepada diri sendiri, lalu mereka menyerahkan diri (sambil berkata), “Kami tidak pernah mengerjakan suatu kejahatan pun.” (Malaikat menjawab,) “Pernah! Sesungguhnya Allah Maha Mengetahui apa yang telah kamu kerjakan.”"
  },
  {
    "ayat": 29,
    "arabic": "فَادْخُلُوْٓا اَبْوَابَ جَهَنَّمَ خٰلِدِيْنَ فِيْهَا ۗفَلَبِئْسَ مَثْوَى الْمُتَكَبِّرِيْنَ",
    "transliteration_en": "Fadkhulooo abwaaba jahannama khaalideena feeha falabi'sa maswal mutakab bireen",
    "transliteration_id": "Fadkhulū abwāba jahannama khālidīna fīhā, fa labi'sa maṡwal-mutakabbirīn(a).",
    "translation_en": "So enter the gates of Hell to abide eternally therein, and how wretched is the residence of the arrogant.",
    "translation_id": "Maka, masukilah pintu-pintu (neraka) Jahanam. Kamu kekal di dalamnya. Itulah seburuk-buruk tempat (bagi) orang yang menyombongkan diri."
  },
  {
    "ayat": 30,
    "arabic": "۞ وَقِيْلَ لِلَّذِيْنَ اتَّقَوْا مَاذَآ اَنْزَلَ رَبُّكُمْ ۗقَالُوْا خَيْرًا ۚلِلَّذِيْنَ اَحْسَنُوْا فِيْ هٰذِهِ الدُّنْيَا حَسَنَةٌ  ۗوَلَدَارُ الْاٰخِرَةِ خَيْرٌ ۗوَلَنِعْمَ دَارُ الْمُتَّقِيْنَۙ",
    "transliteration_en": "Wa qeela lillazeenat taqaw maazaaa anzala Rabbukum; qaaloo khairaa; lillazeena absanoo fee haazihid dunyaa hasanah; wa la Daarul Aakhirati khair; wa lani'ma daarul muttaqeen",
    "transliteration_id": "Wa qīla lil-lażīnattaqau māżā anzala rabbukum, qālū khairā(n), lil-lażīna aḥsanū fī hāżihid-dun-yā ḥasanah(tun), wa ladārul-ākhirati khair(un), wa lani‘ma dārul-muttaqīn(a).",
    "translation_en": "And it will be said to those who feared Allah, \"What did your Lord send down?\" They will say, \"[That which is] good.\" For those who do good in this world is good; and the home of the Hereafter is better. And how excellent is the home of the righteous -",
    "translation_id": "Kemudian, dikatakan kepada orang yang bertakwa, “Apa yang telah Tuhanmu turunkan?” Mereka menjawab, “Kebaikan.” Orang-orang yang berbuat baik di dunia ini mendapat (balasan) yang baik. Sungguh, negeri akhirat pasti lebih baik. Itulah sebaik-baik tempat (bagi) orang-orang yang bertakwa,"
  },
  {
    "ayat": 31,
    "arabic": "جَنّٰتُ عَدْنٍ يَّدْخُلُوْنَهَا تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُ لَهُمْ فِيْهَا مَا يَشَاۤءُوْنَ ۗ كَذٰلِكَ يَجْزِى اللّٰهُ الْمُتَّقِيْنَۙ",
    "transliteration_en": "Jannaatu 'Adniny yadkhuloonahaa tajree min tahtihal anhaaru lahum feehaa maa yashaaa'oon; kazaalika yajzil laahul muttaqeen",
    "transliteration_id": "Jannātu ‘adniy yadkhulūnahā tajrī min taḥtihal-anhāru lahum fīhā mā yasyā'ūn(a), każālika yajzillāhul-muttaqīn(a).",
    "translation_en": "Gardens of perpetual residence, which they will enter, beneath which rivers flow. They will have therein whatever they wish. Thus does Allah reward the righteous -",
    "translation_id": "(yaitu) surga-surga ‘Adn yang mereka masuki. Sungai-sungai mengalir di bawahnya. Di dalam (surga) itu mereka mendapat segala yang mereka inginkan. Demikianlah Allah memberi balasan kepada orang-orang yang bertakwa."
  },
  {
    "ayat": 32,
    "arabic": "الَّذِيْنَ تَتَوَفّٰىهُمُ الْمَلٰۤىِٕكَةُ طَيِّبِيْنَ ۙيَقُوْلُوْنَ سَلٰمٌ عَلَيْكُمُ ادْخُلُوا الْجَنَّةَ بِمَا كُنْتُمْ تَعْمَلُوْنَ",
    "transliteration_en": "Allazeena tatawaf faahumul malaaa'ikatu taiyibeena yaqooloona salaamun 'alai kumud khulul Jannata bimaa kuntum ta'maloon",
    "transliteration_id": "Allażīna tatawafāhumul-malā'ikatu ṭayyibīn(a), yaqūlūna salāmun ‘alaikumudkhulul-jannata bimā kuntum ta‘malūn(a).",
    "translation_en": "The ones whom the angels take in death, [being] good and pure; [the angels] will say, \"Peace be upon you. Enter Paradise for what you used to do.\"",
    "translation_id": "(Yaitu) orang-orang yang diwafatkan oleh malaikat dalam keadaan baik. Mereka (para malaikat) mengatakan, “Salāmun ‘alaikum (semoga keselamatan tercurah kepadamu). Masuklah ke dalam surga karena apa yang telah kamu kerjakan.”"
  },
  {
    "ayat": 33,
    "arabic": "هَلْ يَنْظُرُوْنَ اِلَّآ اَنْ تَأْتِيَهُمُ الْمَلٰۤىِٕكَةُ اَوْ يَأْتِيَ اَمْرُ رَبِّكَ ۗ كَذٰلِكَ فَعَلَ الَّذِيْنَ مِنْ قَبْلِهِمْ ۗوَمَا ظَلَمَهُمُ اللّٰهُ وَلٰكِنْ كَانُوْٓا اَنْفُسَهُمْ يَظْلِمُوْنَ",
    "transliteration_en": "Hal yanzuroona illaaa an taatiyahumul malaaa'ikatu aw yaatiya amru Rabbik; kazaalika fa'alal lazeena min qablihim; wa maa zalamahumul laahu wa laakin kaanoo anfusahum yazlimoon",
    "transliteration_id": "Hal yanẓurūna illā an ta'tiyahumul-malā'ikatu au ya'tiya amru rabbik(a), każālika fa‘alal-lażīna min qablihim, wa mā ẓalamahumullāhu wa lākin kānū anfusahum yaẓlimūn(a).",
    "translation_en": "Do the disbelievers await [anything] except that the angels should come to them or there comes the command of your Lord? Thus did those do before them. And Allah wronged them not, but they had been wronging themselves.",
    "translation_id": "Adakah yang mereka (orang kafir) tunggu selain kedatangan para malaikat kepadanya atau perintah Tuhanmu? Demikianlah orang-orang (kafir) sebelumnya berbuat. Allah tidak menzalimi mereka, justru merekalah yang (selalu) menzalimi diri mereka sendiri."
  },
  {
    "ayat": 34,
    "arabic": "فَاَصَابَهُمْ سَيِّاٰتُ مَا عَمِلُوْا وَحَاقَ بِهِمْ مَّا كَانُوْا بِهٖ يَسْتَهْزِءُوْنَ ࣖ",
    "transliteration_en": "Fa asaabahum saiyi aatu maa 'amiloo wa haaqa bihim maa kaano bihee yastahzi'oon",
    "transliteration_id": "Fa aṣābahum sayyi'ātu mā ‘amilū wa ḥāqa bihim mā kānū bihī yastahzi'ūn(a).",
    "translation_en": "So they were struck by the evil consequences of what they did and were enveloped by what they used to ridicule.",
    "translation_id": "Maka, mereka ditimpa azab (akibat) perbuatan mereka dan diliputi oleh azab yang dahulu mereka selalu perolok-olokkan."
  },
  {
    "ayat": 35,
    "arabic": "وَقَالَ الَّذِيْنَ اَشْرَكُوْا لَوْ شَاۤءَ اللّٰهُ مَا عَبَدْنَا مِنْ دُوْنِهٖ مِنْ شَيْءٍ نَّحْنُ وَلَآ اٰبَاۤؤُنَا وَلَا حَرَّمْنَا مِنْ دُوْنِهٖ مِنْ شَيْءٍ ۗ كَذٰلِكَ فَعَلَ الَّذِيْنَ مِنْ قَبْلِهِمْ ۚفَهَلْ عَلَى الرُّسُلِ اِلَّا الْبَلٰغُ الْمُبِيْنُ",
    "transliteration_en": "Wa qaalal lazeena ashrakoo law shaaa'al laahu ma 'abadnaa min doonihee min shai'in nahnu wa laaa aabaaa'unaa wa laa harramnaa min doonihee min shai'; kazaalika fa'alal lazeena min qablihim fahal 'alar Rusuli illal balaaghul mubeen",
    "transliteration_id": "Wa qālal-lażīna asyrakū lau syā'allāhu mā ‘abadnā min dūnihī min syai'in naḥnu wa lā ābā'unā wa lā ḥarramnā min dūnihī min syai'(in), każālika fa‘alal-lażīna min qablihim, fahal ‘alar-rusuli illal-balāgul-mubīn(u).",
    "translation_en": "And those who associate others with Allah say, \"If Allah had willed, we would not have worshipped anything other than Him, neither we nor our fathers, nor would we have forbidden anything through other than Him.\" Thus did those do before them. So is there upon the messengers except [the duty of] clear notification?",
    "translation_id": "Orang-orang yang musyrik berkata, “Seandainya Allah menghendaki, niscaya kami dan nenek moyang kami tidak akan menyembah sesuatu apa pun selain-Nya dan tidak (pula) mengharamkan sesuatu pun tanpa (ketetapan)-Nya.” Demikianlah orang-orang (kafir) sebelumnya berbuat. Bukankah kewajiban para rasul hanya menyampaikan (amanat Allah) dengan jelas?"
  },
  {
    "ayat": 36,
    "arabic": "وَلَقَدْ بَعَثْنَا فِيْ كُلِّ اُمَّةٍ رَّسُوْلًا اَنِ اعْبُدُوا اللّٰهَ وَاجْتَنِبُوا الطَّاغُوْتَۚ فَمِنْهُمْ مَّنْ هَدَى اللّٰهُ وَمِنْهُمْ مَّنْ حَقَّتْ عَلَيْهِ الضَّلٰلَةُ ۗ فَسِيْرُوْا فِى الْاَرْضِ فَانْظُرُوْا كَيْفَ كَانَ عَاقِبَةُ الْمُكَذِّبِيْنَ",
    "transliteration_en": "Wa laqad ba'asnaa fee kulli ummatir Rasoolan ani'budul laaha wajtanibut Taaghoota faminhum man hadal laahu wa minhum man haqqat 'alaihid dalaalah; faseeroo fil ardi fanzuroo kaifa kaana 'aaqibatul mukazzibeen",
    "transliteration_id": "Wa laqad ba‘aṡnā fī kulli ummatir rasūlan ani‘budullāha wajtanibuṭ-ṭāgūt(a), fa minhum man hadallāhu wa minhum man ḥaqqat ‘alaihiḍ-ḍalālah(tu), fa sīrū fil-arḍi fanẓurū kaifa kāna ‘āqibatul-mukażżibīn(a).",
    "translation_en": "And We certainly sent into every nation a messenger, [saying], \"Worship Allah and avoid Taghut.\" And among them were those whom Allah guided, and among them were those upon whom error was [deservedly] decreed. So proceed through the earth and observe how was the end of the deniers.",
    "translation_id": "Sungguh, Kami telah mengutus seorang rasul untuk setiap umat (untuk menyerukan), “Sembahlah Allah dan jauhilah tagut!” Di antara mereka ada yang diberi petunjuk oleh Allah dan ada pula yang ditetapkan dalam kesesatan. Maka, berjalanlah kamu di bumi dan perhatikanlah bagaimana kesudahan orang yang mendustakan (rasul-rasul)."
  },
  {
    "ayat": 37,
    "arabic": "اِنْ تَحْرِصْ عَلٰى هُدٰىهُمْ فَاِنَّ اللّٰهَ لَا يَهْدِيْ مَنْ يُّضِلُّ وَمَا لَهُمْ مِّنْ نّٰصِرِيْنَ",
    "transliteration_en": "In tahris 'alaa hudaahum fa innal laaha laa yahdee mai yudillu wa maa lahum min naasireen",
    "transliteration_id": "In taḥriṣ ‘alā hudāhum fa innallāha lā yahdī may yuḍillu wa mā lahum min nāṣirīn(a).",
    "translation_en": "[Even] if you should strive for their guidance, [O Muhammad], indeed, Allah does not guide those He sends astray, and they will have no helpers.",
    "translation_id": "Jika engkau (Nabi Muhammad) berusaha keras untuk memberi mereka petunjuk, maka sesungguhnya Allah tidak akan memberi petunjuk kepada orang yang telah Dia sesatkan dan mereka tidak mempunyai penolong."
  },
  {
    "ayat": 38,
    "arabic": "وَاَقْسَمُوْا بِاللّٰهِ جَهْدَ اَيْمَانِهِمْۙ  لَا يَبْعَثُ اللّٰهُ مَنْ يَّمُوْتُۗ بَلٰى وَعْدًا عَلَيْهِ حَقًّا وَّلٰكِنَّ اَكْثَرَ النَّاسِ لَا يَعْلَمُوْنَۙ",
    "transliteration_en": "Wa aqsamoo billaahi jahda aimaanihim laa yab'asul laahu mai yamoot; balaa wa'dan 'alaihi haqqanw wa laakinna aksaran naasi laa ya'lamoon",
    "transliteration_id": "Wa aqsamū billāhi jahda aimānihim, lā yab‘aṡullāhu may yamūt(u), balā wa‘dan ‘alaihi ḥaqqaw wa lākinna akṡaran-nāsi lā ya‘lamūn(a).",
    "translation_en": "And they swear by Allah their strongest oaths [that] Allah will not resurrect one who dies. But yes - [it is] a true promise [binding] upon Him, but most of the people do not know.",
    "translation_id": "Mereka sungguh-sungguh bersumpah dengan (nama) Allah, “Allah tidak akan membangkitkan orang yang mati.” Bukan demikian (justru Allah pasti akan membangkitkannya). (Yang demikian ini) adalah janji yang pasti Dia penuhi, tetapi kebanyakan manusia tidak mengetahui,"
  },
  {
    "ayat": 39,
    "arabic": "لِيُبَيِّنَ لَهُمُ الَّذِيْ يَخْتَلِفُوْنَ فِيْهِ وَلِيَعْلَمَ الَّذِيْنَ كَفَرُوْٓا اَنَّهُمْ كَانُوْا كٰذِبِيْنَ",
    "transliteration_en": "Liyubaiyina lahumul lazee yakhtalifoona feehi wa liya'lamal lazeena kafarooo annahum kaanoo kaazibeen",
    "transliteration_id": "Liyubayyina lahumul-lażī yakhtalifūna fīhi wa liya‘lamal-lażīna kafarū annahum kānū-kāżibīn(a).",
    "translation_en": "[It is] so He will make clear to them [the truth of] that wherein they differ and so those who have disbelieved may know that they were liars.",
    "translation_id": "supaya Dia menjelaskan kepada mereka apa yang mereka perselisihkan, dan supaya orang-orang yang kufur mengetahui bahwa mereka adalah para pendusta."
  },
  {
    "ayat": 40,
    "arabic": "اِنَّمَا قَوْلُنَا لِشَيْءٍ اِذَآ اَرَدْنٰهُ اَنْ نَّقُوْلَ لَهٗ كُنْ فَيَكُوْنُ ࣖ",
    "transliteration_en": "Innamaa qawlunaa lisha y'in izaa aradnaahu an naqoola lahoo kun fa yakoon",
    "transliteration_id": "Innamā qaulunā lisyai'in iżā aradnāhu an naqūla lahū kun fa yakūn(u).",
    "translation_en": "Indeed, Our word to a thing when We intend it is but that We say to it, \"Be,\" and it is.",
    "translation_id": "Sesungguhnya firman Kami terhadap sesuatu apabila Kami menghendakinya, hanya (dengan) berfirman kepadanya, “Jadilah!” Maka, jadilah sesuatu itu."
  },
  {
    "ayat": 41,
    "arabic": "وَالَّذِيْنَ هَاجَرُوْا فِى اللّٰهِ مِنْۢ بَعْدِ مَا ظُلِمُوْا لَنُبَوِّئَنَّهُمْ فِى الدُّنْيَا حَسَنَةً  ۗوَلَاَجْرُ الْاٰخِرَةِ اَكْبَرُۘ لَوْ كَانُوْا يَعْلَمُوْنَۙ",
    "transliteration_en": "Wallazeena haajaroo fil laahi mim ba'di maa zulimoo lanubawwi' annahum fiddunyaa hasanatanw wa la ajrul Aakhirati akbar; law kaanoo ya'lamoon",
    "transliteration_id": "Wal-lażīna hājarū fillāhi mim ba‘di mā ẓulimū lanubawwi'annahum fid-dun-yā ḥasanah(tan), wa la'ajrul-ākhirati akbar(u), lau kānū ya‘lamūn(a).",
    "translation_en": "And those who emigrated for [the cause of] Allah after they had been wronged - We will surely settle them in this world in a good place; but the reward of the Hereafter is greater, if only they could know.",
    "translation_id": "Orang yang berhijrah karena Allah setelah mereka dizalimi, pasti Kami akan memberikan tempat yang baik kepada mereka di dunia. Pahala di akhirat pasti lebih besar, sekiranya mereka mengetahui,"
  },
  {
    "ayat": 42,
    "arabic": "الَّذِيْنَ صَبَرُوْا وَعَلٰى رَبِّهِمْ يَتَوَكَّلُوْنَ",
    "transliteration_en": "Allazeena sabaroo wa 'alaa Rabbihim yatawak kaloon",
    "transliteration_id": "Allażīna ṣabarū wa ‘alā rabbihim yatawakkalūn(a).",
    "translation_en": "[They are] those who endured patiently and upon their Lord relied.",
    "translation_id": "(yaitu) orang-orang yang sabar dan hanya kepada Tuhan mereka bertawakal."
  },
  {
    "ayat": 43,
    "arabic": "وَمَآ اَرْسَلْنَا مِنْ قَبْلِكَ اِلَّا رِجَالًا نُّوْحِيْٓ اِلَيْهِمْ  فَسْـَٔلُوْٓا اَهْلَ الذِّكْرِ اِنْ كُنْتُمْ لَا تَعْلَمُوْنَۙ",
    "transliteration_en": "Wa maaa arsalnaa min qablika illaa rijaalan nooheee ilaihim; fas'alooo ahlaz zikri in kuntum laa ta'lamoon",
    "transliteration_id": "Wa mā arsalnā min qablika illā rijālan nūḥī ilaihim fas'alū ahlaż-żikri in kuntum lā ta‘lamūn(a).",
    "translation_en": "And We sent not before you except men to whom We revealed [Our message]. So ask the people of the message if you do not know.",
    "translation_id": "Kami tidak mengutus sebelum engkau (Nabi Muhammad), melainkan laki-laki yang Kami beri wahyu kepadanya. Maka, bertanyalah kepada orang-orang yang mempunyai pengetahuan jika kamu tidak mengetahui."
  },
  {
    "ayat": 44,
    "arabic": "بِالْبَيِّنٰتِ وَالزُّبُرِۗ وَاَنْزَلْنَآ اِلَيْكَ الذِّكْرَ لِتُبَيِّنَ لِلنَّاسِ مَا نُزِّلَ اِلَيْهِمْ وَلَعَلَّهُمْ يَتَفَكَّرُوْنَ",
    "transliteration_en": "Bilbaiyinaati waz Zubur; wa anzalnaaa ilaikaz Zikra litubaiyina linnaasi maa nuzzila ilaihim wa la'allahum yatafakkaroon",
    "transliteration_id": "Bil-bayyināti waz-zubur(i), wa anzalnā ilaikaż-żikra litubayyina lin-nāsi mā nuzzila ilaihim wa la‘allahum yatafakkarūn(a).",
    "translation_en": "[We sent them] with clear proofs and written ordinances. And We revealed to you the message that you may make clear to the people what was sent down to them and that they might give thought.",
    "translation_id": "(Kami mengutus mereka) dengan (membawa) bukti-bukti yang jelas (mukjizat) dan kitab-kitab. Kami turunkan aż-Żikr (Al-Qur’an) kepadamu agar engkau menerangkan kepada manusia apa yang telah diturunkan kepada mereka dan agar mereka memikirkan."
  },
  {
    "ayat": 45,
    "arabic": "اَفَاَمِنَ الَّذِيْنَ مَكَرُوا السَّيِّاٰتِ اَنْ يَّخْسِفَ اللّٰهُ بِهِمُ الْاَرْضَ اَوْ يَأْتِيَهُمُ الْعَذَابُ مِنْ حَيْثُ لَا يَشْعُرُوْنَۙ",
    "transliteration_en": "Afa aminal lazeena makarus saiyi aati ai yakhsifal laahu bihimul arda aw yaaa tiyahumul 'azaabu min haisu laa yash'uroon",
    "transliteration_id": "Afa aminal-lażīna makarus-sayyi'āti ay yakhsifallāhu bihimul-arḍa au ya'tiyahumul-‘ażābu min ḥaiṡu lā yasy‘urūn(a).",
    "translation_en": "Then, do those who have planned evil deeds feel secure that Allah will not cause the earth to swallow them or that the punishment will not come upon them from where they do not perceive?",
    "translation_id": "Apakah orang-orang yang membuat tipu daya yang jahat itu merasa aman (dari bencana) dibenamkannya bumi oleh Allah bersama mereka atau (terhadap) datangnya siksa kepada mereka dari arah yang tidak mereka sadari."
  },
  {
    "ayat": 46,
    "arabic": "اَوْ يَأْخُذَهُمْ فِيْ تَقَلُّبِهِمْ فَمَا هُمْ بِمُعْجِزِيْنَۙ",
    "transliteration_en": "Aw yaakhuzahum fee taqallubihim famaa hum bi mu'jizeen",
    "transliteration_id": "Au ya'khużahum fī taqallubihim famā hum bimu‘jizīn(a).",
    "translation_en": "Or that He would not seize them during their [usual] activity, and they could not cause failure?",
    "translation_id": "Atau, Allah mengazab mereka pada waktu mereka dalam perjalanan sehingga mereka tidak berdaya menolak (azab itu)."
  },
  {
    "ayat": 47,
    "arabic": "اَوْ يَأْخُذَهُمْ عَلٰى تَخَوُّفٍۗ فَاِنَّ رَبَّكُمْ لَرَءُوْفٌ رَّحِيْمٌ",
    "transliteration_en": "Aw yaakhuzahum 'alaa takhawwuf; fa inna Rabbakum la Ra'oofur Raheem",
    "transliteration_id": "Au ya'khużahum ‘alā takhawwuf(in), fa inna rabbakum lara'ūfur raḥīm(un).",
    "translation_en": "Or that He would not seize them gradually [in a state of dread]? But indeed, your Lord is Kind and Merciful.",
    "translation_id": "Atau, Allah mengazab mereka dengan kekurangan (secara berangsur-angsur sampai binasa). Sesungguhnya Tuhanmu Maha Pengasih lagi Maha Penyayang."
  },
  {
    "ayat": 48,
    "arabic": "اَوَلَمْ يَرَوْا اِلٰى مَا خَلَقَ اللّٰهُ مِنْ شَيْءٍ يَّتَفَيَّؤُا ظِلٰلُهٗ عَنِ الْيَمِيْنِ وَالشَّمَاۤىِٕلِ سُجَّدًا لِّلّٰهِ وَهُمْ دَاخِرُوْنَ",
    "transliteration_en": "Awa lam yaraw ilaa maa khalaqal laahu min shai'iny-yatafaiya'u zilaaluhoo 'anil yameeni washshamaaa' ili sujjadal lillaahi wa hum daakhiroon",
    "transliteration_id": "Awalam yarau ilā mā khalaqallāhu min syai'iy yatafayya'u ẓilāluhū ‘anil-yamīni wasy-syamā'ili sujjadal lillāhi wa hum dākhirūn(a).",
    "translation_en": "Have they not considered what things Allah has created? Their shadows incline to the right and to the left, prostrating to Allah, while they are humble.",
    "translation_id": "Apakah mereka tidak memperhatikan segala sesuatu yang diciptakan Allah, bayang-bayangnya berbolak-balik ke kanan dan ke kiri (dalam keadaan) sujud kepada Allah, sedangkan mereka rendah hati."
  },
  {
    "ayat": 49,
    "arabic": "وَلِلّٰهِ يَسْجُدُ مَا فِى السَّمٰوٰتِ وَمَا فِى الْاَرْضِ مِنْ دَاۤبَّةٍ وَّالْمَلٰۤىِٕكَةُ وَهُمْ لَا يَسْتَكْبِرُوْنَ",
    "transliteration_en": "Wa lillaahi yasjudu maa fis samaawaati wa maa fil ardi min daaabbatinw walma laaa'ikatu wa hum laa yastakbiroon",
    "transliteration_id": "Wa lillāhi yasjudu mā fis-samāwāti wa mā fil-arḍi min dābbatiw wal-malā'ikatu wa hum yastakbirūn(a).",
    "translation_en": "And to Allah prostrates whatever is in the heavens and whatever is on the earth of creatures, and the angels [as well], and they are not arrogant.",
    "translation_id": "Hanya kepada Allah bersujud segala apa yang ada di langit dan apa yang ada di bumi, yaitu semua makhluk yang bergerak (bernyawa). Para malaikat (juga bersujud) dan mereka tidak menyombongkan diri."
  },
  {
    "ayat": 50,
    "arabic": "يَخَافُوْنَ رَبَّهُمْ مِّنْ فَوْقِهِمْ وَيَفْعَلُوْنَ مَا يُؤْمَرُوْنَ ࣖ ۩",
    "transliteration_en": "yakhaafoona Rabbahum min fawqihim wa yaf'aloona maa yu'maroon",
    "transliteration_id": "Yakhāfūna rabbahum min fauqihim wa yaf‘alūna mā yu'marūn(a).",
    "translation_en": "They fear their Lord above them, and they do what they are commanded.",
    "translation_id": "Mereka takut kepada Tuhan mereka yang (berkuasa) di atas mereka dan melaksanakan apa yang diperintahkan (kepada mereka)."
  }
]