[
  {
    "ayat": 1,
    "arabic": "اِقْتَرَبَ لِلنَّاسِ حِسَابُهُمْ وَهُمْ فِيْ غَفْلَةٍ مُّعْرِضُوْنَ ۚ",
    "transliteration_en": "Iqtaraba linnaasi hisaa buhum wa hum fee ghaflatim mu'ridoon",
    "transliteration_id": "Iqtaraba lin-nāsi ḥisābuhum wa hum fī gaflatim mu‘riḍūn(a).",
    "translation_en": "[The time of] their account has approached for the people, while they are in heedlessness turning away.",
    "translation_id": "Telah makin dekat kepada manusia perhitungan (amal) mereka, sedangkan mereka dalam keadaan lengah lagi berpaling (darinya)."
  },
  {
    "ayat": 2,
    "arabic": "مَا يَأْتِيْهِمْ مِّنْ ذِكْرٍ مِّنْ رَّبِّهِمْ مُّحْدَثٍ اِلَّا اسْتَمَعُوْهُ وَهُمْ يَلْعَبُوْنَ ۙ",
    "transliteration_en": "Maa yaateehim min zikrim mir Rabbihim muhdasin illas tama'oohu wa hum yal'aboon",
    "transliteration_id": "Mā ya'tīhim min żikrim mir rabbihim muḥdaṡin illastama‘ūhu wa hum yal‘abūn(a).",
    "translation_en": "No mention comes to them anew from their Lord except that they listen to it while they are at play",
    "translation_id": "Tidaklah diturunkan kepada mereka peringatan yang baru dari Tuhan, kecuali mereka mendengarkannya sambil bermain-main"
  },
  {
    "ayat": 3,
    "arabic": "لَاهِيَةً قُلُوْبُهُمْۗ وَاَسَرُّوا النَّجْوَىۖ الَّذِيْنَ ظَلَمُوْاۖ هَلْ هٰذَآ اِلَّا بَشَرٌ مِّثْلُكُمْۚ اَفَتَأْتُوْنَ السِّحْرَ وَاَنْتُمْ تُبْصِرُوْنَ",
    "transliteration_en": "Laahiyatan quloobuhum; wa asarrun najwal lazeena zalamoo hal haazaa illaa basharum mislukum afataa toonas sihra wa antum tubsiroon",
    "transliteration_id": "Lāhiyatan qulūbuhum, wa asarrun-najwal-lażīna ẓalamū, hal hāżā illā basyarum miṡlukum, afa ta'tūnas-siḥra wa antum tubṣirūn(a).",
    "translation_en": "With their hearts distracted. And those who do wrong conceal their private conversation, [saying], \"Is this [Prophet] except a human being like you? So would you approach magic while you are aware [of it]?\"",
    "translation_id": "(dan) hati mereka dalam keadaan lalai. Mereka, orang-orang yang zalim itu, merahasiakan pembicaraan (dengan saling berbisik), “Bukankah (orang) ini (Nabi Muhammad) tidak lain hanyalah seorang manusia seperti kamu? Apakah kamu mengikuti sihir itu padahal kamu menyaksikannya?”"
  },
  {
    "ayat": 4,
    "arabic": "قٰلَ رَبِّيْ يَعْلَمُ الْقَوْلَ فِى السَّمَاۤءِ وَالْاَرْضِۖ وَهُوَ السَّمِيْعُ الْعَلِيْمُ",
    "transliteration_en": "Qaala Rabbee ya'lamul qawla fis samaaa'i wal ardi wa Huwas Samee'ul Aleem",
    "transliteration_id": "Qāla rabbī ya‘lamul-qaula fis-samā'i wal-arḍ(i), wa huwas-samī‘ul-‘alīm(u).",
    "translation_en": "The Prophet said, \"My Lord knows whatever is said throughout the heaven and earth, and He is the Hearing, the Knowing.\"",
    "translation_id": "Dia (Nabi Muhammad) berkata, “Tuhanku mengetahui (semua) perkataan di langit serta di bumi dan Dia Maha Mendengar lagi Maha Mengetahui.”"
  },
  {
    "ayat": 5,
    "arabic": "بَلْ قَالُوْٓا اَضْغَاثُ اَحْلَامٍۢ بَلِ افْتَرٰىهُ بَلْ هُوَ شَاعِرٌۚ فَلْيَأْتِنَا بِاٰيَةٍ كَمَآ اُرْسِلَ الْاَوَّلُوْنَ",
    "transliteration_en": "Bal qaalooo adghaasu ahlaamim balif taraahu bal huwa shaa'irun falyaatinaa bi Aayatin kamaa ursilal awwaloon",
    "transliteration_id": "Bal qālū aḍgāṡu aḥlāmim baliftarāhu bal huwa syā‘ir(un), falya'tinā bi'āyatin kamā ursilal-awwalūn(a).",
    "translation_en": "But they say, \"[The revelation is but] a mixture of false dreams; rather, he has invented it; rather, he is a poet. So let him bring us a sign just as the previous [messengers] were sent [with miracles].\"",
    "translation_id": "Bahkan, mereka berkata, “(Al-Qur’an itu buah) mimpi-mimpi kosong. Malah, dia (Nabi Muhammad) merekayasanya. Lebih dari itu, dia seorang penyair. Maka, hendaklah dia mendatangkan kepada kami suatu tanda (mukjizat) sebagaimana rasul-rasul yang diutus terdahulu.”"
  },
  {
    "ayat": 6,
    "arabic": "مَآ اٰمَنَتْ قَبْلَهُمْ مِّنْ قَرْيَةٍ اَهْلَكْنٰهَاۚ اَفَهُمْ يُؤْمِنُوْنَ",
    "transliteration_en": "Maaa aaamanat qablahum min qaryatin ahlaknaahaa a-fahum yu'minoon",
    "transliteration_id": "Mā āmanat qablahum min qaryatin ahlaknāhā, afahum yu'minūn(a).",
    "translation_en": "Not a [single] city which We destroyed believed before them, so will they believe?",
    "translation_id": "Tidak ada satu pun (penduduk) negeri sebelum mereka yang telah Kami binasakan itu beriman, (padahal telah Kami kirimkan bukti). Apakah mereka (penduduk Makkah) akan beriman (jika Kami kirimkan bukti)?"
  },
  {
    "ayat": 7,
    "arabic": "وَمَآ اَرْسَلْنَا قَبْلَكَ اِلَّا رِجَالًا نُّوْحِيْٓ اِلَيْهِمْ فَسْـَٔلُوْٓا اَهْلَ الذِّكْرِ اِنْ كُنْتُمْ لَا تَعْلَمُوْنَ",
    "transliteration_en": "Wa maaa arsalnaa qablaka illaa rijaalan nooheee ilaihim fas'aloo ahlaz zikri in kuntum laa ta'lamoon",
    "transliteration_id": "Wa mā arsalnā qablaka illā rijālan nūḥī ilaihim fas'alū ahlaż-żikri in kuntum lā ta‘lamūn(a).",
    "translation_en": "And We sent not before you, [O Muhammad], except men to whom We revealed [the message], so ask the people of the message if you do not know.",
    "translation_id": "Kami tidak mengutus sebelum engkau (Nabi Muhammad) melainkan beberapa orang laki-laki yang Kami beri wahyu kepada mereka. Maka, bertanyalah kepada orang yang berilmu jika kamu tidak mengetahui."
  },
  {
    "ayat": 8,
    "arabic": "وَمَا جَعَلْنٰهُمْ جَسَدًا لَّا يَأْكُلُوْنَ الطَّعَامَ وَمَا كَانُوْا خٰلِدِيْنَ",
    "transliteration_en": "Wa maa ja'alnaahum jasadal laa yaakuloonat ta'aama wa maa kaanoo khaalideen",
    "transliteration_id": "Wa mā ja‘alnāhum jasadal lā ya'kulūnaṭ-ṭa‘āma wa mā kānū khālidīn(a).",
    "translation_en": "And We did not make the prophets forms not eating food, nor were they immortal [on earth].",
    "translation_id": "Kami tidak menjadikan mereka (para utusan) sebagai jasad yang tidak membutuhkan makanan. Mereka tidak (pula) hidup kekal."
  },
  {
    "ayat": 9,
    "arabic": "ثُمَّ صَدَقْنٰهُمُ الْوَعْدَ فَاَنْجَيْنٰهُمْ وَمَنْ نَّشَاۤءُ وَاَهْلَكْنَا الْمُسْرِفِيْنَ",
    "transliteration_en": "summa sadaqnaa humul wa'da fa-anjainaahum wa man nashaaa'u wa ahlaknal musrifeen",
    "transliteration_id": "Ṡumma ṣadaqnāhumul-wa‘da fa anjaināhum wa man nasyā'u wa ahlaknal-musrifīn(a).",
    "translation_en": "Then We fulfilled for them the promise, and We saved them and whom We willed and destroyed the transgressors.",
    "translation_id": "Kemudian Kami tepati janji kepada mereka (para utusan). Maka, Kami selamatkan mereka dan orang-orang yang Kami kehendaki dan Kami binasakan orang-orang yang melampaui batas."
  },
  {
    "ayat": 10,
    "arabic": "لَقَدْ اَنْزَلْنَآ اِلَيْكُمْ كِتٰبًا فِيْهِ ذِكْرُكُمْۗ اَفَلَا تَعْقِلُوْنَ ࣖ",
    "transliteration_en": "Laqad anzalnaaa ilaikum Kitaaban feehi zikrukum afalaa ta'qiloon",
    "transliteration_id": "Laqad anzalnā ilaikum kitāban fīhi żikrukum, afalā ta‘qilūn(a).",
    "translation_en": "We have certainly sent down to you a Book in which is your mention. Then will you not reason?",
    "translation_id": "Sungguh, Kami benar-benar telah menurunkan kepadamu sebuah Kitab (Al-Qur’an) yang di dalamnya terdapat peringatan bagimu. Apakah kamu tidak mengerti?"
  },
  {
    "ayat": 11,
    "arabic": "وَكَمْ قَصَمْنَا مِنْ قَرْيَةٍ كَانَتْ ظَالِمَةً وَّاَنْشَأْنَا بَعْدَهَا قَوْمًا اٰخَرِيْنَ",
    "transliteration_en": "Wa kam qasamnaa min qaryatin kannat zaalimatanw wa anshadnaa ba'dahaa qawman aakhareen",
    "transliteration_id": "Wa kam qaṣamnā min qaryatin kānat ẓālimataw wa ansya'nā ba‘dahā qauman ākharīn(a).",
    "translation_en": "And how many a city which was unjust have We shattered and produced after it another people.",
    "translation_id": "Betapa banyak (penduduk) negeri yang zalim telah Kami binasakan dan Kami lahirkan generasi yang lain setelah mereka (sebagai penggantinya)."
  },
  {
    "ayat": 12,
    "arabic": "فَلَمَّآ اَحَسُّوْا بَأْسَنَآ اِذَا هُمْ مِّنْهَا يَرْكُضُوْنَ ۗ",
    "transliteration_en": "Falammaaa ahassoo baasanaaa izaaa hum minhaa yarkudoon",
    "transliteration_id": "Falammā aḥassū ba'sanā iżā hum minhā yarkuḍūn(a).",
    "translation_en": "And when its inhabitants perceived Our punishment, at once they fled from it.",
    "translation_id": "Maka, ketika mereka menyadari (dekatnya) azab Kami, tiba-tiba mereka melarikan diri darinya (negeri itu)."
  },
  {
    "ayat": 13,
    "arabic": "لَا تَرْكُضُوْا وَارْجِعُوْٓا اِلٰى مَآ اُتْرِفْتُمْ فِيْهِ وَمَسٰكِنِكُمْ لَعَلَّكُمْ تُسْـَٔلُوْنَ",
    "transliteration_en": "Laa tarkudoo warji'ooo ilaa maaa utriftum feehe wa masaakinikum la'allakum tus'aloon",
    "transliteration_id": "Lā tarkuḍū warji‘ū ilā mā utriftum fīhi wa masākinikum la‘allakum tus'alūn(a).",
    "translation_en": "[Some angels said], \"Do not flee but return to where you were given luxury and to your homes - perhaps you will be questioned.\"",
    "translation_id": "Janganlah kamu berlari tergesa-gesa. Kembalilah kamu kepada kesenangan hidupmu dan tempat-tempat kediamanmu (yang baik) agar kamu dapat ditanya."
  },
  {
    "ayat": 14,
    "arabic": "قَالُوْا يٰوَيْلَنَآ اِنَّا كُنَّا ظٰلِمِيْنَ",
    "transliteration_en": "Qaaloo yaa wailanaaa innaa kunnaa zaalimeen",
    "transliteration_id": "Qālū yā wailanā innā kunnā ẓālimīn(a).",
    "translation_en": "They said, \"O woe to us! Indeed, we were wrongdoers.\"",
    "translation_id": "Mereka berkata, “Betapa celaka kami! Sesungguhnya kami adalah orang-orang zalim.”"
  },
  {
    "ayat": 15,
    "arabic": "فَمَا زَالَتْ تِّلْكَ دَعْوٰىهُمْ حَتّٰى جَعَلْنٰهُمْ حَصِيْدًا خٰمِدِيْنَ",
    "transliteration_en": "Famaa zaalat tilka da'waahum hattaa ja'alnaahum haseedan khaamideen",
    "transliteration_id": "Famā zālat tilka da‘wāhum ḥattā ja‘alnāhum ḥaṣīdan khāmidīn(a).",
    "translation_en": "And that declaration of theirs did not cease until We made them [as] a harvest [mowed down], extinguished [like a fire].",
    "translation_id": "Kemudian, (kalimat) itu selalu menjadi keluhan mereka hingga mereka Kami jadikan seperti tanaman yang telah dituai dan (seperti api yang) padam."
  },
  {
    "ayat": 16,
    "arabic": "وَمَا خَلَقْنَا السَّمَاۤءَ وَالْاَرْضَ وَمَا بَيْنَهُمَا لٰعِبِيْنَ",
    "transliteration_en": "Wa maa khalaqnas samaaa'a wal arda wa maa bainahumaa laa'ibeen",
    "transliteration_id": "Wa mā khalaqnas-samā'a wal-arḍa wa mā bainahumā lā‘ibīn(a).",
    "translation_en": "And We did not create the heaven and earth and that between them in play.",
    "translation_id": "Kami tidak menciptakan langit dan bumi serta segala apa yang ada di antara keduanya dengan main-main."
  },
  {
    "ayat": 17,
    "arabic": "لَوْ اَرَدْنَآ اَنْ نَّتَّخِذَ لَهْوًا لَّاتَّخَذْنٰهُ مِنْ لَّدُنَّآ  ۖاِنْ كُنَّا فٰعِلِيْنَ",
    "transliteration_en": "Law aradnaaa an nattakhiza lahwal lat takhaznaahu mil ladunnaaa in kunnaa faa'ileen",
    "transliteration_id": "Lau aradnā an nattakhiża lahwal lattakhażnāhum mil ladunnā, in kunnā fā‘ilīn(a).",
    "translation_en": "Had We intended to take a diversion, We could have taken it from [what is] with Us - if [indeed] We were to do so.",
    "translation_id": "Seandainya Kami hendak menjadikan sesuatu sebagai permainan, tentulah Kami akan membuatnya dari sisi Kami, jika Kami benar-benar menghendaki berbuat (demikian)."
  },
  {
    "ayat": 18,
    "arabic": "بَلْ نَقْذِفُ بِالْحَقِّ عَلَى الْبَاطِلِ فَيَدْمَغُهٗ فَاِذَا هُوَ زَاهِقٌۗ وَلَكُمُ الْوَيْلُ مِمَّا تَصِفُوْنَ",
    "transliteration_en": "Bal naqzifu bilhaqqi 'alal baatili fa yadmaghuhoo fa izaa huwa zaahiq; wa lakumul wailu mimmaa tasifoon",
    "transliteration_id": "Bal naqżifu bil-ḥaqqi ‘alal-bāṭili fa yadmaguhū fa iżā huwa zāhiq(un), wa lakumul-wailu mimmā taṣifūn(a).",
    "translation_en": "Rather, We dash the truth upon falsehood, and it destroys it, and thereupon it departs. And for you is destruction from that which you describe.",
    "translation_id": "Sebaliknya, Kami melemparkan yang hak (kebenaran) kepada yang batil (tidak benar) lalu (yang hak) itu menghancurkannya. Maka, seketika itu ia (yang batil) lenyap. Celakalah kamu karena kamu menyifati (Allah dengan sifat-sifat yang tidak pantas bagi-Nya)."
  },
  {
    "ayat": 19,
    "arabic": "وَلَهٗ مَنْ فِى السَّمٰوٰتِ وَالْاَرْضِۗ وَمَنْ عِنْدَهٗ لَا يَسْتَكْبِرُوْنَ عَنْ عِبَادَتِهٖ وَلَا يَسْتَحْسِرُوْنَ ۚ",
    "transliteration_en": "Wa lahoo man fis samaawaati wal ard; wa man 'indahoo laa yastakbiroona 'an 'ibaada tihee wa laa yastahsiroon",
    "transliteration_id": "Wa lahū man fis-samāwāti wal-arḍ(i), wa man ‘indahū lā yastakbirūna ‘an ‘ibādatihī wa lā yastaḥsirūn(a).",
    "translation_en": "To Him belongs whoever is in the heavens and the earth. And those near Him are not prevented by arrogance from His worship, nor do they tire.",
    "translation_id": "Hanya milik-Nya siapa yang di langit dan di bumi. (Malaikat-malaikat) yang di sisi-Nya tidak mempunyai rasa angkuh untuk menyembah-Nya dan tidak (pula) merasa letih."
  },
  {
    "ayat": 20,
    "arabic": "يُسَبِّحُوْنَ الَّيْلَ وَالنَّهَارَ لَا يَفْتُرُوْنَ",
    "transliteration_en": "Yusabbihoona laila wannahaara laa yafturoon",
    "transliteration_id": "Yusabbiḥūnal-laila wan-nahāra wa lā yafturūn(a).",
    "translation_en": "They exalt [Him] night and day [and] do not slacken.",
    "translation_id": "Mereka (malaikat-malaikat) bertasbih pada waktu malam dan siang dengan tidak henti-hentinya."
  },
  {
    "ayat": 21,
    "arabic": "اَمِ اتَّخَذُوْٓا اٰلِهَةً مِّنَ الْاَرْضِ هُمْ يُنْشِرُوْنَ",
    "transliteration_en": "Amit takhazooo aalihatam minal ardi hum yunshiroon",
    "transliteration_id": "Amittakhażū ālihatam minal-arḍi  hum yunsyirūn(a).",
    "translation_en": "Or have men taken for themselves gods from the earth who resurrect [the dead]?",
    "translation_id": "Apakah mereka mengambil dari bumi tuhan-tuhan yang dapat menghidupkan (orang-orang yang mati)?"
  },
  {
    "ayat": 22,
    "arabic": "لَوْ كَانَ فِيْهِمَآ اٰلِهَةٌ اِلَّا اللّٰهُ لَفَسَدَتَاۚ فَسُبْحٰنَ اللّٰهِ رَبِّ الْعَرْشِ عَمَّا يَصِفُوْنَ",
    "transliteration_en": "Law kaana feehimaaa aalihatun illal laahu lafasadataa; fa-Subhaanal laahi Rabbil 'Arshi 'ammaa yasifoon",
    "transliteration_id": "Lau kāna fīhimā ālihatun illallāhu lafasadatā, fa subḥānallāhi rabbil-‘arsyi ‘ammā yaṣifūn(a).",
    "translation_en": "Had there been within the heavens and earth gods besides Allah, they both would have been ruined. So exalted is Allah, Lord of the Throne, above what they describe.",
    "translation_id": "Seandainya pada keduanya (langit dan bumi) ada tuhan-tuhan selain Allah, tentu keduanya telah binasa. Maha Suci Allah, Tuhan pemilik ʻArasy, dari apa yang mereka sifatkan."
  },
  {
    "ayat": 23,
    "arabic": "لَا يُسْـَٔلُ عَمَّا يَفْعَلُ وَهُمْ يُسْـَٔلُوْنَ",
    "transliteration_en": "Laa yus'alu 'ammaa yaf'alu wa hum yus'aloon",
    "transliteration_id": "Lā yus'alu ‘ammā yaf‘alu wa hum yus'alūn(a).",
    "translation_en": "He is not questioned about what He does, but they will be questioned.",
    "translation_id": "(Allah) tidak ditanya tentang apa yang Dia kerjakan, tetapi merekalah yang akan ditanya."
  },
  {
    "ayat": 24,
    "arabic": "اَمِ اتَّخَذُوْا مِنْ دُوْنِهٖٓ اٰلِهَةً ۗقُلْ هَاتُوْا بُرْهَانَكُمْۚ هٰذَا ذِكْرُ مَنْ مَّعِيَ وَذِكْرُ مَنْ قَبْلِيْۗ بَلْ اَكْثَرُهُمْ لَا يَعْلَمُوْنَۙ الْحَقَّ فَهُمْ مُّعْرِضُوْنَ",
    "transliteration_en": "Amit takhazoo min doonihee aalihatan qul haatoo burhaanakum haaza zikru mam ma'iya wa zikru man qablee; bal aksaruhum laa ya'lamoonal haqqa fahum mu'ridoon",
    "transliteration_id": "Amittakhażū min dūnihī ālihah(tan), qul hātū burhānakum, hāżā żikru mam ma‘iya wa żikru man qablī, bal akṡaruhum lā ya‘lamūnal-ḥaqqa fahum mu‘riḍūn(a).",
    "translation_en": "Or have they taken gods besides Him? Say, [O Muhammad], \"Produce your proof. This [Qur'an] is the message for those with me and the message of those before me.\" But most of them do not know the truth, so they are turning away.",
    "translation_id": "Apakah mereka mengambil tuhan-tuhan selain-Nya? Katakanlah (Nabi Muhammad), “Kemukakanlah alasan-alasanmu! Ini (ajaran tauhid) adalah sesuatu yang selalu diingatkan kepada orang yang bersamaku dan kepada orang sebelumku.” Akan tetapi, kebanyakan mereka tidak mengetahui yang hak (kebenaran) sehingga mereka berpaling."
  },
  {
    "ayat": 25,
    "arabic": "وَمَآ اَرْسَلْنَا مِنْ قَبْلِكَ مِنْ رَّسُوْلٍ اِلَّا نُوْحِيْٓ اِلَيْهِ اَنَّهٗ لَآ اِلٰهَ اِلَّآ اَنَا۠ فَاعْبُدُوْنِ",
    "transliteration_en": "Wa maaa arsalnaa min qablika mir Rasoolin illaa nooheee ilaihi annahoo laaa ilaaha illaaa Ana fa'budoon",
    "transliteration_id": "Wa mā arsalnā min qablika mir rasūlin illā nūḥī ilaihi annahū lā ilāha illā ana fa‘budūn(i).",
    "translation_en": "And We sent not before you any messenger except that We revealed to him that, \"There is no deity except Me, so worship Me.\"",
    "translation_id": "Kami tidak mengutus seorang rasul pun sebelum engkau (Nabi Muhammad), melainkan Kami mewahyukan kepadanya bahwa tidak ada tuhan selain Aku. Maka, sembahlah Aku."
  },
  {
    "ayat": 26,
    "arabic": "وَقَالُوا اتَّخَذَ الرَّحْمٰنُ وَلَدًا سُبْحٰنَهٗ ۗبَلْ عِبَادٌ مُّكْرَمُوْنَ ۙ",
    "transliteration_en": "Wa qaalut takhazar Rahmaanu waladan Subhaanah; bal 'ibaadum mkkramoon",
    "transliteration_id": "Wa qāluttakhażar-raḥmānu waladan subḥānah(ū), bal ‘ibādum mukramūn(a).",
    "translation_en": "And they say, \"The Most Merciful has taken a son.\" Exalted is He! Rather, they are [but] honored servants.",
    "translation_id": "Mereka berkata, “Tuhan Yang Maha Pengasih telah menjadikan (malaikat) sebagai anak.” Maha Suci Dia. Sebaliknya, mereka (para malaikat itu) adalah hamba-hamba yang dimuliakan."
  },
  {
    "ayat": 27,
    "arabic": "لَا يَسْبِقُوْنَهٗ بِالْقَوْلِ وَهُمْ بِاَمْرِهٖ يَعْمَلُوْنَ",
    "transliteration_en": "Laa yasbiqoonahoo bil qawli wa hum bi amrihee ya'maloon",
    "transliteration_id": "Lā yasbiqūnahū bil-qauli wa hum bi'amrihī ya‘malūn(a).",
    "translation_en": "They cannot precede Him in word, and they act by His command.",
    "translation_id": "Mereka tidak berbicara mendahului-Nya dan mereka mengerjakan perintah-perintah-Nya."
  },
  {
    "ayat": 28,
    "arabic": "يَعْلَمُ مَا بَيْنَ اَيْدِيْهِمْ وَمَا خَلْفَهُمْ وَلَا يَشْفَعُوْنَۙ اِلَّا لِمَنِ ارْتَضٰى وَهُمْ مِّنْ خَشْيَتِهٖ مُشْفِقُوْنَ",
    "transliteration_en": "Ya'lamu maa baina aideehim wa maa khalfahum wa laa yashfa'oona illaa limanir tadaa wa hum min khash yatihee mushfiqoon",
    "transliteration_id": "Ya‘lamū mā baina aidīhim wa mā khalfahum wa lā yasyfa‘ūna illā limanirtaḍā wa hum min khasy-yatihī musyfiqūn(a).",
    "translation_en": "He knows what is [presently] before them and what will be after them, and they cannot intercede except on behalf of one whom He approves. And they, from fear of Him, are apprehensive.",
    "translation_id": "Dia (Allah) mengetahui segala sesuatu yang ada di hadapan mereka (malaikat) dan yang ada di belakang mereka. Mereka tidak memberi syafaat melainkan kepada orang yang Dia ridai dan mereka selalu berhati-hati karena takut kepada-Nya."
  },
  {
    "ayat": 29,
    "arabic": "۞ وَمَنْ يَّقُلْ مِنْهُمْ اِنِّيْٓ اِلٰهٌ مِّنْ دُوْنِهٖ فَذٰلِكَ نَجْزِيْهِ جَهَنَّمَۗ  كَذٰلِكَ نَجْزِى الظّٰلِمِيْنَ ࣖ",
    "transliteration_en": "Wa mai yaqul minhum inneee ilaahum min doonihee fazaalika najzeehi Jahannam; kazaalika najziz zaalimeen",
    "transliteration_id": "Wa may yaqul minhum innī ilāhun min dūnihī fa żālika najzīhi jahannam(a), każālika najziẓ-ẓālimīn(a).",
    "translation_en": "And whoever of them should say, \"Indeed, I am a god besides Him\"- that one We would recompense with Hell. Thus do We recompense the wrongdoers.",
    "translation_id": "Siapa saja di antara mereka (malaikat) yang berkata, “Sesungguhnya aku adalah tuhan selain-Nya,” maka (dia) itu Kami beri balasan dengan (neraka) Jahanam. Demikianlah Kami memberi balasan kepada orang-orang zalim."
  },
  {
    "ayat": 30,
    "arabic": "اَوَلَمْ يَرَ الَّذِيْنَ كَفَرُوْٓا اَنَّ السَّمٰوٰتِ وَالْاَرْضَ كَانَتَا رَتْقًا فَفَتَقْنٰهُمَاۗ وَجَعَلْنَا مِنَ الْمَاۤءِ كُلَّ شَيْءٍ حَيٍّۗ  اَفَلَا يُؤْمِنُوْنَ",
    "transliteration_en": "Awalam yaral lazeena kafarooo annas samaawaati wal arda kaanataa ratqan faftaqnaahumaa wa ja'alnaa minal maaa'i kulla shai'in haiyin afalaa yu'minoon",
    "transliteration_id": "Awalam yaral-lażīna kafarū annas-samāwāti wal-arḍa kānatā ratqan fa fataqnāhumā, wa ja‘alnā minal-mā'i kulla syai'in ḥayy(in),  afalā yu'minūn(a).",
    "translation_en": "Have those who disbelieved not considered that the heavens and the earth were a joined entity, and We separated them and made from water every living thing? Then will they not believe?",
    "translation_id": "Apakah orang-orang kafir tidak mengetahui bahwa langit dan bumi, keduanya, dahulu menyatu, kemudian Kami memisahkan keduanya dan Kami menjadikan segala sesuatu yang hidup berasal dari air? Maka, tidakkah mereka beriman?"
  },
  {
    "ayat": 31,
    "arabic": "وَجَعَلْنَا فِى الْاَرْضِ رَوَاسِيَ اَنْ تَمِيْدَ بِهِمْۖ وَجَعَلْنَا فِيْهَا فِجَاجًا سُبُلًا لَّعَلَّهُمْ يَهْتَدُوْنَ",
    "transliteration_en": "Wa ja'alnaa fil ardi rawaasiya an tameeda bihim wa ja'alnaa feehaa fijaajan subulal la'allahum yahtadoon",
    "transliteration_id": "Wa ja‘alnā fil-arḍi rawāsiya an tamīda bihim, wa ja‘anā fīhā fijājan subulal la‘allahum yahtadūn(a).",
    "translation_en": "And We placed within the earth firmly set mountains, lest it should shift with them, and We made therein [mountain] passes [as] roads that they might be guided.",
    "translation_id": "Kami telah menjadikan di bumi gunung-gunung yang kukuh agar (tidak) berguncang bersama mereka dan Kami menjadikan (pula) di sana jalan-jalan yang luas agar mereka mendapat petunjuk."
  },
  {
    "ayat": 32,
    "arabic": "وَجَعَلْنَا السَّمَاۤءَ سَقْفًا مَّحْفُوْظًاۚ وَهُمْ عَنْ اٰيٰتِهَا مُعْرِضُوْنَ",
    "transliteration_en": "Wa ja'alnas samaaa'a saqfam mahfoozanw wa hum 'an Aayaatihaa mu'ridoon",
    "transliteration_id": "Wa ja‘alnas-samā'a saqfam maḥfūẓā(n), wa hum ‘an āyātihā mu‘riḍūn(a).",
    "translation_en": "And We made the sky a protected ceiling, but they, from its signs, are turning away.",
    "translation_id": "Kami menjadikan langit sebagai atap yang terpelihara, tetapi mereka tetap berpaling dari tanda-tandanya (yang menunjukkan kebesaran Allah, seperti matahari dan bulan)."
  },
  {
    "ayat": 33,
    "arabic": "وَهُوَ الَّذِيْ خَلَقَ الَّيْلَ وَالنَّهَارَ وَالشَّمْسَ وَالْقَمَرَۗ  كُلٌّ فِيْ فَلَكٍ يَّسْبَحُوْنَ",
    "transliteration_en": "Wa Huwal lazee khalaqal laila wannahaara washshamsa wal qamara kullun fee falakiny yashbahoon",
    "transliteration_id": "Wa huwal-lażī khalaqal-laila wan-nahāra wasy-syamsa wal-qamar(a), kullun fī falakiy yasbaḥūn(a).",
    "translation_en": "And it is He who created the night and the day and the sun and the moon; all [heavenly bodies] in an orbit are swimming.",
    "translation_id": "Dialah yang telah menciptakan malam dan siang, matahari dan bulan. Masing-masing beredar pada garis edarnya."
  },
  {
    "ayat": 34,
    "arabic": "وَمَا جَعَلْنَا لِبَشَرٍ مِّنْ قَبْلِكَ الْخُلْدَۗ اَفَا۟ىِٕنْ مِّتَّ فَهُمُ الْخٰلِدُوْنَ",
    "transliteration_en": "Wa maa ja'alnaa libasharim min qablikal khuld; afaimmitta fahumul khaalidoon",
    "transliteration_id": "Wa mā ja‘alnā libasyarim min qablikal-khuld(a), afa'im mitta fahumul-khālidūn(a).",
    "translation_en": "And We did not grant to any man before you eternity [on earth]; so if you die - would they be eternal?",
    "translation_id": "Kami tidak menjadikan keabadian bagi seorang manusia pun sebelum engkau (Nabi Muhammad). Maka, jika engkau wafat, apakah mereka akan kekal?"
  },
  {
    "ayat": 35,
    "arabic": "كُلُّ نَفْسٍ ذَاۤىِٕقَةُ الْمَوْتِۗ وَنَبْلُوْكُمْ بِالشَّرِّ وَالْخَيْرِ فِتْنَةً ۗوَاِلَيْنَا تُرْجَعُوْنَ",
    "transliteration_en": "Kullu nafsin zaaa'iqatul mawt; wa nablookum bishsharri walkhairi fitnatanw wa ilainaa turja'oon",
    "transliteration_id": "Kullu nafsin żā'iqatul-maut(i), wa nablūkum bisy-syarri wal-khairi fitnah(tan), wa ilainā turja‘ūn(a).",
    "translation_en": "Every soul will taste death. And We test you with evil and with good as trial; and to Us you will be returned.",
    "translation_id": "Setiap yang bernyawa akan merasakan kematian. Kami menguji kamu dengan keburukan dan kebaikan sebagai cobaan. Kepada Kamilah kamu akan dikembalikan."
  },
  {
    "ayat": 36,
    "arabic": "وَاِذَا رَاٰكَ الَّذِيْنَ كَفَرُوْٓا اِنْ يَّتَّخِذُوْنَكَ اِلَّا هُزُوًاۗ اَهٰذَا الَّذِيْ يَذْكُرُ اٰلِهَتَكُمْۚ وَهُمْ بِذِكْرِ الرَّحْمٰنِ هُمْ كٰفِرُوْنَ",
    "transliteration_en": "Wa izaa ra aakal lazeena kafarooo iny-yattakhizoonaka illa huzuwaa; ahaazal lazee yazkuru aalihatakum wa hum bi zikrir Rahmaani hum kaafiroon",
    "transliteration_id": "Wa iżā ra'ākal-lażīna kafarū iy yattakhiżūnaka illā huzuwā(n), ahāżal-lażī yażkuru ālihatakum, wa hum biżikrir-raḥmāni hum kāfirūn(a).",
    "translation_en": "And when those who disbelieve see you, [O Muhammad], they take you not except in ridicule, [saying], \"Is this the one who insults your gods?\" And they are, at the mention of the Most Merciful, disbelievers.",
    "translation_id": "Apabila orang-orang yang kufur itu melihat engkau (Nabi Muhammad), mereka hanya menjadikan engkau bahan ejekan. (Mereka mengatakan,) “Inikah orang yang mencela tuhan-tuhanmu?” Padahal, mereka orang yang ingkar mengingat (Allah) Yang Maha Pengasih."
  },
  {
    "ayat": 37,
    "arabic": "خُلِقَ الْاِنْسَانُ مِنْ عَجَلٍۗ سَاُورِيْكُمْ اٰيٰتِيْ فَلَا تَسْتَعْجِلُوْنِ",
    "transliteration_en": "Khuliqal insaanu min 'ajal; sa ureekum Aayaatee falaa tasta'jiloon",
    "transliteration_id": "Khuliqal-insānu min ‘ajal(in), sa'urīkum āyātī falā tasta‘jilūn(i).",
    "translation_en": "Man was created of haste. I will show you My signs, so do not impatiently urge Me.",
    "translation_id": "Manusia diciptakan (bersifat) tergesa-gesa. Kelak Aku akan memperlihatkan kepadamu (azab yang menjadi) tanda-tanda (kekuasaan)- Ku. Maka, janganlah kamu meminta Aku menyegerakannya."
  },
  {
    "ayat": 38,
    "arabic": "وَيَقُوْلُوْنَ مَتٰى هٰذَا الْوَعْدُ اِنْ كُنْتُمْ صٰدِقِيْنَ",
    "transliteration_en": "Wa yaqooloona mataa haazal wa'du in kuntum saadiqeen",
    "transliteration_id": "Wa yaqūlūna matā hāżal-wa‘du in kuntum ṣādiqīn(a).",
    "translation_en": "And they say, \"When is this promise, if you should be truthful?\"",
    "translation_id": "Mereka berkata, “Kapankah janji ini (akan datang), jika kamu orang yang benar?”"
  },
  {
    "ayat": 39,
    "arabic": "لَوْ يَعْلَمُ الَّذِيْنَ كَفَرُوْا حِيْنَ لَا يَكُفُّوْنَ عَنْ وُّجُوْهِهِمُ النَّارَ وَلَا عَنْ ظُهُوْرِهِمْ وَلَا هُمْ يُنْصَرُوْنَ",
    "transliteration_en": "Law ya'lamul lazeena kafaroo heena laa yakuffoona 'anw wujoohihimun Naara wa laa 'an zuhoorihim wa laa hum yunsaroon",
    "transliteration_id": "Lau ya‘lamul-lażīna kafarū ḥīna lā yakuffūna ‘aw wujūhihimun nāra wa lā ‘an ẓuhūrihim wa lā hum yunṣarūn(a).",
    "translation_en": "If those who disbelieved but knew the time when they will not avert the Fire from their faces or from their backs and they will not be aided...",
    "translation_id": "Seandainya orang-orang yang kufur itu mengetahui saat mereka tidak mampu mengelakkan api neraka dari wajah dan punggung mereka dan saat mereka tidak mendapat pertolongan, (tentulah mereka tidak meminta agar azab itu disegerakan)."
  },
  {
    "ayat": 40,
    "arabic": "بَلْ تَأْتِيْهِمْ بَغْتَةً فَتَبْهَتُهُمْ فَلَا يَسْتَطِيْعُوْنَ رَدَّهَا وَلَا هُمْ يُنْظَرُوْنَ",
    "transliteration_en": "Bal taateehim baghtatan fatabhatuhum falaa yastatee'oona raddahaa wa laa hum yunzaroon",
    "transliteration_id": "Bal ta'tīhim bagtatan fa tabhatuhum falā yastaṭī‘ūna raddahā wa lā hum yunẓarūn(a).",
    "translation_en": "Rather, it will come to them unexpectedly and bewilder them, and they will not be able to repel it, nor will they be reprieved.",
    "translation_id": "Sebenarnya (hari Kiamat) itu akan datang kepada mereka secara tiba-tiba, lalu menjadikan mereka panik. Maka, mereka tidak sanggup menolaknya dan tidak pula diberi penangguhan (waktu)."
  },
  {
    "ayat": 41,
    "arabic": "وَلَقَدِ اسْتُهْزِئَ بِرُسُلٍ مِّنْ قَبْلِكَ فَحَاقَ بِالَّذِيْنَ سَخِرُوْا مِنْهُمْ مَّا كَانُوْا بِهٖ يَسْتَهْزِءُوْنَ ࣖ",
    "transliteration_en": "Wa laqadis tuhzi'a bi-Rusulim min qablika fahaaqa billazeena sakhiroo minhum maa kaanoo bihee yastahzi'oon",
    "transliteration_id": "Wa laqadistuhzi'a birusulim min qablika fa ḥāqa bil-lażīna sakhirū minhum mā kānū bihī yastahzi'ūn(a).",
    "translation_en": "And already were messengers ridiculed before you, but those who mocked them were enveloped by what they used to ridicule.",
    "translation_id": "Sungguh, rasul-rasul sebelum engkau (Nabi Muhammad) telah diperolok-olokkan, lalu (karena itu) turunlah kepada orang-orang yang mencemooh mereka (rasul-rasul) apa (azab) yang selalu mereka perolok-olokkan."
  },
  {
    "ayat": 42,
    "arabic": "قُلْ مَنْ يَّكْلَؤُكُمْ بِالَّيْلِ وَالنَّهَارِ مِنَ الرَّحْمٰنِۗ  بَلْ هُمْ عَنْ ذِكْرِ رَبِّهِمْ مُّعْرِضُوْنَ",
    "transliteration_en": "Qul mai yakla 'ukum billaili wannahaari minar Rahmaan; bal hum 'an zikri Rabbihim mu'ridoon",
    "transliteration_id": "Qul may yakla'ukum bil-laili wan-nahāri minar-raḥmān(i), bal hum ‘an żikrihim mu‘riḍūn(a).",
    "translation_en": "Say, \"Who can protect you at night or by day from the Most Merciful?\" But they are, from the remembrance of their Lord, turning away.",
    "translation_id": "Katakanlah, “Siapakah yang akan menjaga kamu pada waktu malam dan siang dari (siksaan) Allah Yang Maha Pengasih?” Bahkan, mereka berpaling dari mengingat Tuhan mereka."
  },
  {
    "ayat": 43,
    "arabic": "اَمْ لَهُمْ اٰلِهَةٌ تَمْنَعُهُمْ مِّنْ دُوْنِنَاۗ  لَا يَسْتَطِيْعُوْنَ نَصْرَ اَنْفُسِهِمْ وَلَا هُمْ مِّنَّا يُصْحَبُوْنَ",
    "transliteration_en": "Am lahum aalihatun tamna'ulum min dooninaa; laa yastatee'oona nasra anfusihim wa laa hum minnna yus-haboon",
    "transliteration_id": "Am lahum ālihatun tamna‘uhum min dūninā, lā yastaṭī‘ūna naṣra anfusihim wa lā hum minnā yuṣḥabūn(a).",
    "translation_en": "Or do they have gods to defend them other than Us? They are unable [even] to help themselves, nor can they be protected from Us.",
    "translation_id": "Ataukah mereka mempunyai tuhan-tuhan selain Kami yang dapat memelihara mereka (dari azab Kami)? (Tuhan-tuhan mereka itu) tidak sanggup menolong diri mereka sendiri dan tidak (pula) dilindungi dari (azab) Kami."
  },
  {
    "ayat": 44,
    "arabic": "بَلْ مَتَّعْنَا هٰٓؤُلَاۤءِ وَاٰبَاۤءَهُمْ حَتّٰى طَالَ عَلَيْهِمُ الْعُمُرُۗ اَفَلَا يَرَوْنَ اَنَّا نَأْتِى الْاَرْضَ نَنْقُصُهَا مِنْ اَطْرَافِهَاۗ اَفَهُمُ الْغٰلِبُوْنَ",
    "transliteration_en": "Bal matta'naa haaa'ulaaa'i wa aabaaa'ahum hattaa taala 'alaihimul 'umur; afalaa yarawna anna naatil arda nanqusuhaa min atraafihaa; afahumul ghaaliboon",
    "transliteration_id": "Bal matta‘nā hā'ulā'i wa ābā'ahum ḥattā ṭāla ‘alaihimul-‘umur(u), afalā yarauna annā na'til-arḍa nanquṣuhā min aṭrāfihā, afahumul-gālibūn(a).",
    "translation_en": "But, [on the contrary], We have provided good things for these [disbelievers] and their fathers until life was prolonged for them. Then do they not see that We set upon the land, reducing it from its borders? So it is they who will overcome?",
    "translation_id": "Sebenarnya Kami telah memberi mereka dan nenek moyang mereka kenikmatan (hidup di dunia) hingga panjang usia mereka. Maka, tidakkah mereka melihat bahwa Kami mendatangi negeri (yang berada di bawah kekuasaan orang kafir), lalu Kami kurangi luasnya dari ujung-ujungnya? Merekakah yang menang?"
  },
  {
    "ayat": 45,
    "arabic": "قُلْ اِنَّمَآ اُنْذِرُكُمْ بِالْوَحْيِۖ وَلَا يَسْمَعُ الصُّمُّ الدُّعَاۤءَ اِذَا مَا يُنْذَرُوْنَ",
    "transliteration_en": "Qul innamaaa unzirukum bilwahyi; wa laa yasma'us summud du'aaa'a izaa maa yunzaroon",
    "transliteration_id": "Qul innamā unżirukum bil-waḥy(i), wa lā yasma‘uṣ-ṣummud-du‘ā'a iżā mā yunżarūn(a).",
    "translation_en": "Say, \"I only warn you by revelation.\" But the deaf do not hear the call when they are warned.",
    "translation_id": "Katakanlah (Nabi Muhammad), “Sesungguhnya aku hanya memperingatkanmu dengan wahyu.” Akan tetapi, orang-orang tuli (musyrik) tidak mendengarkan seruan bila mereka diberi peringatan."
  },
  {
    "ayat": 46,
    "arabic": "وَلَىِٕنْ مَّسَّتْهُمْ نَفْحَةٌ مِّنْ عَذَابِ رَبِّكَ لَيَقُوْلُنَّ يٰوَيْلَنَآ اِنَّا كُنَّا ظٰلِمِيْنَ",
    "transliteration_en": "Wa la'im massat hum nafhatum min 'azaabi Rabbika la yaqoolunna yaawailanaaa innnaa kunnaa zaalimeen",
    "transliteration_id": "Wa la'im massathum nafḥatum min ‘ażābi rabbika layaqūlunna yā wailanā innā kunnā ẓālimīn(a).",
    "translation_en": "And if [as much as] a whiff of the punishment of your Lord should touch them, they would surely say, \"O woe to us! Indeed, we have been wrongdoers.\"",
    "translation_id": "Jika mereka ditimpa sedikit saja azab Tuhanmu, pastilah mereka berkata, “Celakalah kami! Sesungguhnya kami adalah orang yang selalu menzalimi (diri sendiri).”"
  },
  {
    "ayat": 47,
    "arabic": "وَنَضَعُ الْمَوَازِيْنَ الْقِسْطَ لِيَوْمِ الْقِيٰمَةِ فَلَا تُظْلَمُ نَفْسٌ شَيْـًٔاۗ وَاِنْ كَانَ مِثْقَالَ حَبَّةٍ مِّنْ خَرْدَلٍ اَتَيْنَا بِهَاۗ وَكَفٰى بِنَا حٰسِبِيْنَ",
    "transliteration_en": "Wa nada'ul mawaazeenal qista li Yawmil Qiyaamati falaa tuzlamu nafsun shai'aa; wa in kaana misqaala habbatim min khardalin atainaa bihaa; wa kafaa binaa haasibeen",
    "transliteration_id": "Wa naḍa‘ul-mawāzīnal-qisṭa liyaumil-qiyāmati falā tuẓlamu nafsun syai'ā(n), wa in kāna miṡqāla ḥabbatim min khardalin atainā bihā, wa kafā binā ḥāsibīn(a).",
    "translation_en": "And We place the scales of justice for the Day of Resurrection, so no soul will be treated unjustly at all. And if there is [even] the weight of a mustard seed, We will bring it forth. And sufficient are We as accountant.",
    "translation_id": "Kami akan meletakkan timbangan (amal) yang tepat pada hari Kiamat, sehingga tidak seorang pun dirugikan walaupun sedikit. Sekalipun (amal itu) hanya seberat biji sawi, pasti Kami mendatangkannya. Cukuplah Kami sebagai pembuat perhitungan."
  },
  {
    "ayat": 48,
    "arabic": "وَلَقَدْ اٰتَيْنَا مُوْسٰى وَهٰرُوْنَ الْفُرْقَانَ وَضِيَاۤءً وَّذِكْرًا لِّلْمُتَّقِيْنَ ۙ",
    "transliteration_en": "Wa laqad aatainaa Moosa wa haaroonal Furqaana wa diyaa'anw wa zikral lilmuttaqeen",
    "transliteration_id": "Wa laqad ātainā mūsā wa hārūnal-furqāna wa ḍiyā'aw wa żikral lil-muttaqīn(a).",
    "translation_en": "And We had already given Moses and Aaron the criterion and a light and a reminder for the righteous",
    "translation_id": "Sungguh, Kami telah menganugerahkan kepada Musa dan Harun Al-Furqan (Kitab Taurat), sinar (kehidupan), dan peringatan bagi orang-orang yang bertakwa."
  },
  {
    "ayat": 49,
    "arabic": "الَّذِيْنَ يَخْشَوْنَ رَبَّهُمْ بِالْغَيْبِ وَهُمْ مِّنَ السَّاعَةِ مُشْفِقُوْنَ",
    "transliteration_en": "Allazeena yakhshawna Rabbahum bilghaibi wa hum minas Saa'ati mushfiqoon",
    "transliteration_id": "Allażīna yakhsyauna rabbahum bil-gaibi wa hum minas-sā‘ati musyfiqūn(a).",
    "translation_en": "Who fear their Lord unseen, while they are of the Hour apprehensive.",
    "translation_id": "(Yaitu) orang-orang yang takut (azab) Tuhannya, sekalipun mereka tidak melihat-Nya, dan mereka merasa takut akan (tibanya) hari Kiamat."
  },
  {
    "ayat": 50,
    "arabic": "وَهٰذَا ذِكْرٌ مُّبٰرَكٌ اَنْزَلْنٰهُۗ اَفَاَنْتُمْ لَهٗ مُنْكِرُوْنَ ࣖ",
    "transliteration_en": "Wa haazaa Zikrum Mubaarakun anzalnaah; afa antum lahoo munkiroon",
    "transliteration_id": "Wa hāżā żikrum mubārakun anzalnāh(u), afa antum lahū munkirūn(a).",
    "translation_en": "And this [Qur'an] is a blessed message which We have sent down. Then are you with it unacquainted?",
    "translation_id": "Ini (Al-Qur’an) adalah peringatan yang diberkahi yang telah Kami turunkan. Maka, apakah kamu menjadi pengingkar terhadapnya?"
  }
]