[
  {
    "ayat": 51,
    "arabic": "اَلَمْ تَرَ اِلَى الَّذِيْنَ اُوْتُوْا نَصِيْبًا مِّنَ الْكِتٰبِ يُؤْمِنُوْنَ بِالْجِبْتِ وَالطَّاغُوْتِ وَيَقُوْلُوْنَ لِلَّذِيْنَ كَفَرُوْا هٰٓؤُلَاۤءِ اَهْدٰى مِنَ الَّذِيْنَ اٰمَنُوْا سَبِيْلًا",
    "transliteration_en": "Alam tara ilal lazeena 'ootoo naseebam minal kitaabi yu'minoona bil Jibti wat Taaghooti wa yaqooloona lillazeena kafaroo haaa ulaaa'i ahdaa minal lazeena aamanoo sabeelaa",
    "transliteration_id": "Alam tara ilal-lażīna ūtū naṣībam minal-kitābi yu'minūna bil-jibti waṭ-ṭāgūti wa yaqūlūna lil-lażīna kafarū hā'ulā'i ahdā minal-lażīna āmanū sabīlā(n).",
    "translation_en": "Have you not seen those who were given a portion of the Scripture, who believe in superstition and false objects of worship and say about the disbelievers, \"These are better guided than the believers as to the way\"?",
    "translation_id": "Tidakkah engkau memperhatikan orang-orang (Yahudi) yang telah diberi bagian (pengetahuan) dari Kitab (Taurat), (betapa) mereka percaya kepada jibt dan tagut serta mengatakan kepada orang-orang kafir (musyrik Makkah) bahwa mereka itu lebih benar jalannya daripada orang-orang yang beriman."
  },
  {
    "ayat": 52,
    "arabic": "اُولٰۤىِٕكَ الَّذِيْنَ لَعَنَهُمُ اللّٰهُ ۗوَمَنْ يَّلْعَنِ اللّٰهُ فَلَنْ تَجِدَ لَهٗ نَصِيْرًا",
    "transliteration_en": "Ulaaa'ikal lazeena la'ana humul laahu wa mai yal'anil laahu falan tajida lahoo naseeraa",
    "transliteration_id": "Ulā'ikal-lażīna la‘anahumullāh(u), wa may yal‘anillāhu falan tajida lahū naṣīrā(n).",
    "translation_en": "Those are the ones whom Allah has cursed; and he whom Allah curses - never will you find for him a helper.",
    "translation_id": "Mereka itulah yang dilaknat Allah. Siapa pun yang dilaknat Allah niscaya engkau (Nabi Muhammad) tidak akan mendapat penolong baginya."
  },
  {
    "ayat": 53,
    "arabic": "اَمْ لَهُمْ نَصِيْبٌ مِّنَ الْمُلْكِ فَاِذًا لَّا يُؤْتُوْنَ النَّاسَ نَقِيْرًاۙ",
    "transliteration_en": "Am lahum naseebum minal mulki fa izal laa yu'toonan naasa naqeeraa",
    "transliteration_id": "Am lahum naṣībum minal-mulki fa iżal lā yu'tūnan-nāsa naqīrā(n).",
    "translation_en": "Or have they a share of dominion? Then [if that were so], they would not give the people [even as much as] the speck on a date seed.",
    "translation_id": "Ataukah mereka mempunyai bagian dari kerajaan (kekuasaan)? Meskipun ada, mereka tidak akan memberikan (kebajikan) sedikit pun kepada manusia."
  },
  {
    "ayat": 54,
    "arabic": "اَمْ يَحْسُدُوْنَ النَّاسَ عَلٰى مَآ اٰتٰىهُمُ اللّٰهُ مِنْ فَضْلِهٖۚ فَقَدْ اٰتَيْنَآ اٰلَ اِبْرٰهِيْمَ الْكِتٰبَ وَالْحِكْمَةَ وَاٰتَيْنٰهُمْ مُّلْكًا عَظِيْمًا",
    "transliteration_en": "Am yahsudoonan naasa 'alaa maaa aataahumul laahu min fadlihee faqad aatainaaa Aala Ibraaheemal Kitaaba wal Hikmata wa aatainaahum mulkan 'azeemaa",
    "transliteration_id": "Am yaḥsudūnan-nāsa ‘alā mā ātāhumullāhu min faḍlih(ī), faqad ātainā āla ibrāhīmal-kitāba wal-ḥikmata wa ātaināhum mulkan ‘aẓīmā(n).",
    "translation_en": "Or do they envy people for what Allah has given them of His bounty? But we had already given the family of Abraham the Scripture and wisdom and conferred upon them a great kingdom.",
    "translation_id": "Ataukah mereka dengki kepada manusia karena karunia yang telah dianugerahkan Allah kepadanya? Sungguh, Kami telah menganugerahkan kitab dan hikmah kepada keluarga Ibrahim dan Kami telah menganugerahkan kerajaan (kekuasaan) yang sangat besar kepada mereka."
  },
  {
    "ayat": 55,
    "arabic": "فَمِنْهُمْ مَّنْ اٰمَنَ بِهٖ وَمِنْهُمْ مَّنْ صَدَّ عَنْهُ ۗ وَكَفٰى بِجَهَنَّمَ سَعِيْرًا",
    "transliteration_en": "Faminhum man aamana bihee wa minhum man sadda 'anh; wa kafaa bi Jahannama sa'eeraa",
    "transliteration_id": "Fa minhum man āmana bihī wa minhum man ṣadda ‘anh(u), wa kafā bijahannama sa‘īrā(n).",
    "translation_en": "And some among them believed in it, and some among them were averse to it. And sufficient is Hell as a blaze.",
    "translation_id": "Lalu, di antara mereka ada yang beriman kepadanya dan di antara mereka ada pula yang berpaling darinya. Cukuplah (bagi mereka neraka) Jahanam yang apinya menyala-nyala."
  },
  {
    "ayat": 56,
    "arabic": "اِنَّ الَّذِيْنَ كَفَرُوْا بِاٰيٰتِنَا سَوْفَ نُصْلِيْهِمْ نَارًاۗ كُلَّمَا نَضِجَتْ جُلُوْدُهُمْ بَدَّلْنٰهُمْ جُلُوْدًا غَيْرَهَا لِيَذُوْقُوا الْعَذَابَۗ اِنَّ اللّٰهَ كَانَ عَزِيْزًا حَكِيْمًا",
    "transliteration_en": "Innal lazeena kafaroo bi Aayaatinaa sawfa nusleehim Naaran kullamaa nadijat julooduhum baddalnaahum juloodan ghairahaa liyazooqul 'azaab; innallaaha kaana 'Azeezan Hakeemaa",
    "transliteration_id": "Innal-lażīna kafarū bi'āyātinā sanuṣlīhim nārā(n), kullamā naḍijat julūduhum baddalnāhum julūdan gairahā liyażūqul-‘ażāb(a), innallāha kāna ‘azīzan ḥakīmā(n).",
    "translation_en": "Indeed, those who disbelieve in Our verses - We will drive them into a Fire. Every time their skins are roasted through We will replace them with other skins so they may taste the punishment. Indeed, Allah is ever Exalted in Might and Wise.",
    "translation_id": "Sesungguhnya orang-orang yang kufur pada ayat-ayat Kami kelak akan Kami masukkan ke dalam neraka. Setiap kali kulit mereka hangus, Kami ganti dengan kulit yang lain agar mereka merasakan (kepedihan) azab. Sesungguhnya Allah Maha Perkasa lagi Maha Bijaksana."
  },
  {
    "ayat": 57,
    "arabic": "وَالَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ سَنُدْخِلُهُمْ جَنّٰتٍ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُ خٰلِدِيْنَ فِيْهَآ اَبَدًاۗ  لَهُمْ فِيْهَآ اَزْوَاجٌ مُّطَهَّرَةٌ ۙ وَّنُدْخِلُهُمْ ظِلًّا ظَلِيْلًا",
    "transliteration_en": "Wallazeena aamanoo wa 'amilus saalihaati sanud khiluum jannaatin tajree min tahtihal anhaaru khaalideena feehaaa abadaa, lahum feehaaa azwaajum mutahharatun wa nudkhiluhum zillan zaleelaa",
    "transliteration_id": "Wal-lażīna āmanū wa ‘amiluṣ-ṣāliḥāti sanudkhiluhum jannātin tajrī min taḥtihal-anhāru khālidīna fīhā abadā(n), lahum fīhā azwājum muṭahharah(tun), wa nudkhiluhum ẓillan ẓalīlā(n).",
    "translation_en": "But those who believe and do righteous deeds - We will admit them to gardens beneath which rivers flow, wherein they abide forever. For them therein are purified spouses, and We will admit them to deepening shade.",
    "translation_id": "Orang-orang yang beriman dan mengerjakan kebajikan akan Kami masukkan ke dalam surga yang mengalir di bawahnya sungai-sungai. Mereka kekal di dalamnya selama-lamanya. Di sana mereka mempunyai pasangan-pasangan yang disucikan dan Kami masukkan mereka ke tempat yang teduh lagi nyaman."
  },
  {
    "ayat": 58,
    "arabic": "۞ اِنَّ اللّٰهَ يَأْمُرُكُمْ اَنْ تُؤَدُّوا الْاَمٰنٰتِ اِلٰٓى اَهْلِهَاۙ وَاِذَا حَكَمْتُمْ بَيْنَ النَّاسِ اَنْ تَحْكُمُوْا بِالْعَدْلِ ۗ اِنَّ اللّٰهَ نِعِمَّا يَعِظُكُمْ بِهٖ ۗ اِنَّ اللّٰهَ كَانَ سَمِيْعًاۢ بَصِيْرًا",
    "transliteration_en": "Innal laaha yaamurukum an tu'addul amaanaati ilaaa ahlihaa wa izaa hakamtum bainan naasi an tahkumoo bil 'adl; innal laaha yaamurukum an tu'addul amaanaati ilaaa ahlihaa wa izaa hakamtum bainan naasi an tahkumoo bil 'adl; innal laaha ni'immaa ya'izukum bih; innal laaha kaana Samee'am Baseera",
    "transliteration_id": "Innallāha ya'murukum an tu'addul-amānāti ilā ahlihā, wa iżā ḥakamtum bainan-nāsi an taḥkumū bil-‘adl(i), innallāha ni‘immā ya‘iẓukum bih(ī), innallāha kāna samī‘am baṣīrā(n).",
    "translation_en": "Indeed, Allah commands you to render trusts to whom they are due and when you judge between people to judge with justice. Excellent is that which Allah instructs you. Indeed, Allah is ever Hearing and Seeing.",
    "translation_id": "Sesungguhnya Allah menyuruh kamu menyampaikan amanah kepada pemiliknya. Apabila kamu menetapkan hukum di antara manusia, hendaklah kamu tetapkan secara adil. Sesungguhnya Allah memberi pengajaran yang paling baik kepadamu. Sesungguhnya Allah Maha Mendengar lagi Maha Melihat."
  },
  {
    "ayat": 59,
    "arabic": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْٓا اَطِيْعُوا اللّٰهَ وَاَطِيْعُوا الرَّسُوْلَ وَاُولِى الْاَمْرِ مِنْكُمْۚ  فَاِنْ تَنَازَعْتُمْ فِيْ شَيْءٍ فَرُدُّوْهُ اِلَى اللّٰهِ وَالرَّسُوْلِ اِنْ كُنْتُمْ تُؤْمِنُوْنَ بِاللّٰهِ وَالْيَوْمِ الْاٰخِرِۗ ذٰلِكَ خَيْرٌ وَّاَحْسَنُ تَأْوِيْلًا ࣖ",
    "transliteration_en": "Yaaa aiyuhal lazeena aamanooo atee'ul laaha wa atee'ur Rasoola wa ulil amri minkum fa in tanaaza'tum fee shai'in faruddoohu ilal laahi war Rasooli in kuntum tu'minoona billaahi wal yawmil Aakhir; zaalika khairunw wa ahsanu taaweelaa",
    "transliteration_id": "Yā ayyuhal-lażīna āmanū aṭī‘ullāha wa aṭī‘ur-rasūla wa ulil-amri minkum, fa in tanāza‘tum fī syai'in fa rudd­hu ilallāhi war-rasūli in kuntum tu'minūna billāhi wal-yaumil-ākhir(i), żālika khairuw wa aḥsanu ta'wīlā(n).",
    "translation_en": "O you who have believed, obey Allah and obey the Messenger and those in authority among you. And if you disagree over anything, refer it to Allah and the Messenger, if you should believe in Allah and the Last Day. That is the best [way] and best in result.",
    "translation_id": "Wahai orang-orang yang beriman, taatilah Allah dan taatilah Rasul (Nabi Muhammad) serta ululamri (pemegang kekuasaan) di antara kamu. Jika kamu berbeda pendapat tentang sesuatu, kembalikanlah kepada Allah (Al-Qur’an) dan Rasul (sunahnya) jika kamu beriman kepada Allah dan hari Akhir. Yang demikian itu lebih baik (bagimu) dan lebih bagus akibatnya (di dunia dan di akhirat)."
  },
  {
    "ayat": 60,
    "arabic": "اَلَمْ تَرَ اِلَى الَّذِيْنَ يَزْعُمُوْنَ اَنَّهُمْ اٰمَنُوْا بِمَآ اُنْزِلَ اِلَيْكَ وَمَآ اُنْزِلَ مِنْ قَبْلِكَ يُرِيْدُوْنَ اَنْ يَّتَحَاكَمُوْٓا اِلَى الطَّاغُوْتِ وَقَدْ اُمِرُوْٓا اَنْ يَّكْفُرُوْا بِهٖ ۗوَيُرِيْدُ الشَّيْطٰنُ اَنْ يُّضِلَّهُمْ ضَلٰلًا ۢ بَعِيْدًا",
    "transliteration_en": "Alam tara ilal lazeena yaz'umoona annahum aarmanoo bimaa unzilaa ilaika wa maaa unzila min qablika yureedoona ai yatahaakamooo ilat Taaghooti wa qad umirooo ai yakfuroo bih, wa yureedush Shaitaanu ai yudillahum dalaalam ba'eedaa",
    "transliteration_id": "Alam tara ilal-lażīna yaz‘umūna annahum āmanū bimā unzila ilaika  wa mā unzila min qablika  yurīdūna ay yataḥākamū ilaṭ-ṭāgūti wa qad umirū ay yakfurū bih(ī), wa yurīdusy-syaiṭānu ay yuḍillahum ḍalālam ba‘īdā(n).",
    "translation_en": "Have you not seen those who claim to have believed in what was revealed to you, [O Muhammad], and what was revealed before you? They wish to refer legislation to Taghut, while they were commanded to reject it; and Satan wishes to lead them far astray.",
    "translation_id": "Tidakkah engkau (Nabi Muhammad) memperhatikan orang-orang yang mengaku bahwa mereka telah beriman pada apa yang diturunkan kepadamu (Al-Qur’an) dan pada apa yang diturunkan sebelummu? Mereka hendak bertahkim kepada tagut, padahal mereka telah diperintahkan untuk mengingkarinya. Setan bermaksud menyesatkan mereka (dengan) kesesatan yang sangat jauh."
  },
  {
    "ayat": 61,
    "arabic": "وَاِذَا قِيْلَ لَهُمْ تَعَالَوْا اِلٰى مَآ اَنْزَلَ اللّٰهُ وَاِلَى الرَّسُوْلِ رَاَيْتَ الْمُنٰفِقِيْنَ يَصُدُّوْنَ عَنْكَ صُدُوْدًاۚ",
    "transliteration_en": "Wa izaa qeela lahum ta'aalaw ilaa maaa anzalallaahu wa ilar Rasooli ra aital munaafiqeena yasuddoona 'anka sudoodaa",
    "transliteration_id": "Wa iżā qīla lahum ta‘ālau ilā mā anzalallāhu wa ilar-rasūli ra'aital-munāfiqīna yaṣuddūna ‘anka ṣudūdā(n).",
    "translation_en": "And when it is said to them, \"Come to what Allah has revealed and to the Messenger,\" you see the hypocrites turning away from you in aversion.",
    "translation_id": "Apabila dikatakan kepada mereka, “Marilah (patuh) pada apa yang telah diturunkan Allah dan (patuh) kepada Rasul,” engkau (Nabi Muhammad) melihat orang-orang munafik benar-benar berpaling darimu."
  },
  {
    "ayat": 62,
    "arabic": "فَكَيْفَ اِذَآ اَصَابَتْهُمْ مُّصِيْبَةٌ ۢبِمَا قَدَّمَتْ اَيْدِيْهِمْ ثُمَّ جَاۤءُوْكَ يَحْلِفُوْنَ بِاللّٰهِ ۖاِنْ اَرَدْنَآ اِلَّآ اِحْسَانًا وَّتَوْفِيْقًا",
    "transliteration_en": "Fakaifa izaaa asaabathum museebatum summa jaaa'ooka yahlifoona billaahi in aradnaaa illaaa ihsaananw wa tawfeeqaa",
    "transliteration_id": "Fa kaifa iżā aṣābathum muṣībatum bimā qaddamat aidīhim ṡumma jā'ūka yaḥlifūna billāh(i), in aradnā illā iḥsānaw wa taufīqā(n).",
    "translation_en": "So how [will it be] when disaster strikes them because of what their hands have put forth and then they come to you swearing by Allah, \"We intended nothing but good conduct and accommodation.\"",
    "translation_id": "Bagaimana halnya apabila (kelak) musibah menimpa mereka (orang munafik) karena perbuatannya sendiri. Kemudian, mereka datang kepadamu (Nabi Muhammad) sambil bersumpah, “Demi Allah, kami sekali-kali tidak menghendaki selain kebaikan dan perdamaian.”"
  },
  {
    "ayat": 63,
    "arabic": "اُولٰۤىِٕكَ الَّذِيْنَ يَعْلَمُ اللّٰهُ مَا فِيْ قُلُوْبِهِمْ فَاَعْرِضْ عَنْهُمْ وَعِظْهُمْ وَقُلْ لَّهُمْ فِيْٓ  اَنْفُسِهِمْ قَوْلًا ۢ بَلِيْغًا",
    "transliteration_en": "Ulaaa'ikal lazeena ya'la mullaahu maa fee quloobihim fa a'rid 'anhum wa 'izhum wa qul lahum feee anfusihim qawlam baleeghaa",
    "transliteration_id": "Ulā'ikal-lażīna ya‘lamullāhu mā fī qulūbihim fa a‘riḍ ‘anhum wa ‘iẓhum wa qul lahum fī anfusihim qaulam balīgā(n).",
    "translation_en": "Those are the ones of whom Allah knows what is in their hearts, so turn away from them but admonish them and speak to them a far-reaching word.",
    "translation_id": "Mereka itulah orang-orang yang Allah ketahui apa yang ada di dalam hatinya. Oleh karena itu, berpalinglah dari mereka, nasihatilah mereka, dan katakanlah kepada mereka perkataan yang membekas pada jiwanya."
  },
  {
    "ayat": 64,
    "arabic": "وَمَآ اَرْسَلْنَا مِنْ رَّسُوْلٍ اِلَّا لِيُطَاعَ بِاِذْنِ اللّٰهِ ۗوَلَوْ اَنَّهُمْ اِذْ ظَّلَمُوْٓا اَنْفُسَهُمْ جَاۤءُوْكَ فَاسْتَغْفَرُوا اللّٰهَ وَاسْتَغْفَرَ لَهُمُ الرَّسُوْلُ لَوَجَدُوا اللّٰهَ تَوَّابًا رَّحِيْمًا",
    "transliteration_en": "Wa maa arsalnaa mir Rasoolin illaa liyutaa'a bi iznil laah; wa law annahum 'iz zalamooo anfusahum jaaa'ooka fastaghfarul laaha wastaghfara lahumur Rasoolu la wajadul laaha Tawwaabar Raheemaa",
    "transliteration_id": "Wa mā arsalnā mir rasūlin illā liyuṭā‘a bi'iżnillāh(i), wa lau annahum iẓ ẓalamū anfusahum jā'ūka fastagfarullāha wastagfara lahumur-rasūlu lawajadullāha tawwābar raḥīmā(n).",
    "translation_en": "And We did not send any messenger except to be obeyed by permission of Allah. And if, when they wronged themselves, they had come to you, [O Muhammad], and asked forgiveness of Allah and the Messenger had asked forgiveness for them, they would have found Allah Accepting of repentance and Merciful.",
    "translation_id": "Kami tidak mengutus seorang rasul pun, kecuali untuk ditaati dengan izin Allah. Seandainya mereka (orang-orang munafik) setelah menzalimi dirinya datang kepadamu (Nabi Muhammad), lalu memohon ampunan kepada Allah, dan Rasul pun memohonkan ampunan untuk mereka, niscaya mereka mendapati Allah Maha Penerima tobat lagi Maha Penyayang."
  },
  {
    "ayat": 65,
    "arabic": "فَلَا وَرَبِّكَ لَا يُؤْمِنُوْنَ حَتّٰى يُحَكِّمُوْكَ فِيْمَا شَجَرَ بَيْنَهُمْ ثُمَّ لَا يَجِدُوْا فِيْٓ اَنْفُسِهِمْ حَرَجًا مِّمَّا قَضَيْتَ وَيُسَلِّمُوْا تَسْلِيْمًا",
    "transliteration_en": "Falaa wa Rabbika laa yu'minoona hattaa yuhakkimooka fe emaa shajara bainahum summa laa yajidoo fee anfusihim harajam mimmaa qadaita wa yusal limoo tasleemaa",
    "transliteration_id": "Falā wa rabbika lā yu'minūna ḥattā yuḥakkimūka fīmā syajara bainahum ṡumma lā yajidū fī anfusihim ḥarajam mimmā qaḍaita wa yusallimū taslīmā(n).",
    "translation_en": "But no, by your Lord, they will not [truly] believe until they make you, [O Muhammad], judge concerning that over which they dispute among themselves and then find within themselves no discomfort from what you have judged and submit in [full, willing] submission.",
    "translation_id": "Demi Tuhanmu, mereka tidak beriman hingga bertahkim kepadamu (Nabi Muhammad) dalam perkara yang diperselisihkan di antara mereka. Kemudian, tidak ada keberatan dalam diri mereka terhadap putusan yang engkau berikan dan mereka terima dengan sepenuhnya."
  },
  {
    "ayat": 66,
    "arabic": "وَلَوْ اَنَّا كَتَبْنَا عَلَيْهِمْ اَنِ اقْتُلُوْٓا اَنْفُسَكُمْ اَوِ اخْرُجُوْا مِنْ دِيَارِكُمْ مَّا فَعَلُوْهُ اِلَّا قَلِيْلٌ مِّنْهُمْ ۗوَلَوْ اَنَّهُمْ فَعَلُوْا مَا يُوْعَظُوْنَ بِهٖ لَكَانَ خَيْرًا لَّهُمْ وَاَشَدَّ تَثْبِيْتًاۙ",
    "transliteration_en": "Wa law annaa katabnaa 'alaihim aniq tulooo anfusakum awikh rujoo min diyaarikum maa fa'aloohu illaa qaleelum minhum wa law annahum fa'aloo maa yoo'azoona bihee lakaana khairal lahum wa ashadda tasbeetaa",
    "transliteration_id": "Wa lau annā katabnā ‘alaihim aniqtulū anfusakum awikhrujū min diyārikum mā fa‘alūhu illā qalīlum minhum, wa lau annahum fa‘alū mā yū‘aẓūna bihī lakāna khairal lahum wa asyadda taṡbītā(n).",
    "translation_en": "And if We had decreed upon them, \"Kill yourselves\" or \"Leave your homes,\" they would not have done it, except for a few of them. But if they had done what they were instructed, it would have been better for them and a firmer position [for them in faith].",
    "translation_id": "Seandainya Kami perintahkan kepada mereka (orang-orang munafik), “Bunuhlah dirimu atau keluarlah kamu dari kampung halamanmu,” niscaya mereka tidak akan melakukannya, kecuali sebagian kecil dari mereka. Seandainya mereka melaksanakan pengajaran yang diberikan kepada mereka, sungguh itu lebih baik bagi mereka dan lebih menguatkan (iman mereka)."
  },
  {
    "ayat": 67,
    "arabic": "وَّاِذًا لَّاٰتَيْنٰهُمْ مِّنْ لَّدُنَّآ اَجْرًا عَظِيْمًاۙ",
    "transliteration_en": "Wa izal la aatainaahum mil ladunnaaa ajran 'azeemaa",
    "transliteration_id": "Wa iżal la'ātaināhum mil ladunnā ajran ‘aẓīmā(n).",
    "translation_en": "And then We would have given them from Us a great reward.",
    "translation_id": "Jika demikian (halnya), pasti Kami anugerahkan kepada mereka dari sisi Kami pahala yang sangat besar"
  },
  {
    "ayat": 68,
    "arabic": "وَّلَهَدَيْنٰهُمْ صِرَاطًا مُّسْتَقِيْمًا",
    "transliteration_en": "Wa lahadainaahum Siraatam mustaqeemaa",
    "transliteration_id": "Wa lahadaināhum ṣirāṭam mustaqīmā(n).",
    "translation_en": "And We would have guided them to a straight path.",
    "translation_id": "dan pasti Kami tunjukkan kepada mereka jalan yang lurus."
  },
  {
    "ayat": 69,
    "arabic": "وَمَنْ يُّطِعِ اللّٰهَ وَالرَّسُوْلَ فَاُولٰۤىِٕكَ مَعَ الَّذِيْنَ اَنْعَمَ اللّٰهُ عَلَيْهِمْ مِّنَ النَّبِيّٖنَ وَالصِّدِّيْقِيْنَ وَالشُّهَدَاۤءِ وَالصّٰلِحِيْنَ ۚ وَحَسُنَ اُولٰۤىِٕكَ رَفِيْقًا",
    "transliteration_en": "Wa many-yuti'il laaha war Rasoola fa ulaaa'ika ma'al lazeena an'amal laahu 'alaihim minan nabiyyeena wassiddeeqeena washshuhadaaa'i wassaaliheen; wa hasuna ulaaa'ika rafeeqaa",
    "transliteration_id": "Wa may yuṭi‘illāha war-rasūla fa ulā'ika ma‘al-lażīna an‘amallāhu ‘alaihim minan-nabiyyīna waṣ-ṣiddīqīna wasy-syuhadā'i waṣ-ṣāliḥīn(a), wa ḥasuna ulā'ika rafīqā(n).",
    "translation_en": "And whoever obeys Allah and the Messenger - those will be with the ones upon whom Allah has bestowed favor of the prophets, the steadfast affirmers of truth, the martyrs and the righteous. And excellent are those as companions.",
    "translation_id": "Siapa yang menaati Allah dan Rasul (Nabi Muhammad), mereka itulah orang-orang yang (akan dikumpulkan) bersama orang-orang yang dianugerahi nikmat oleh Allah, (yaitu) para nabi, para pencinta kebenaran, orang-orang yang mati syahid, dan orang-orang saleh. Mereka itulah teman yang sebaik-baiknya."
  },
  {
    "ayat": 70,
    "arabic": "ذٰلِكَ الْفَضْلُ مِنَ اللّٰهِ ۗوَكَفٰى بِاللّٰهِ عَلِيْمًا ࣖ",
    "transliteration_en": "Zaalikal fadlu minal laah; wa kafaa billaahi 'Aleemaa",
    "transliteration_id": "Żālikal-faḍlu minallāh(i), wa kafā billāhi ‘alīmā(n).",
    "translation_en": "That is the bounty from Allah, and sufficient is Allah as Knower.",
    "translation_id": "Itulah karunia dari Allah. Cukuplah Allah Yang Maha Mengetahui."
  },
  {
    "ayat": 71,
    "arabic": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْا خُذُوْا حِذْرَكُمْ فَانْفِرُوْا ثُبَاتٍ اَوِ انْفِرُوْا جَمِيْعًا",
    "transliteration_en": "Yaaa aiyuhal lazeena aamanoo khuzoo hizrakum fanfiroo subaain awin firoo jamee'aa",
    "transliteration_id": "Yā ayyuhal-lażīna āmanū khużū ḥiżrakum fanfirū ṡubātin awinfirū jamī‘ā(n).",
    "translation_en": "O you who have believed, take your precaution and [either] go forth in companies or go forth all together.",
    "translation_id": "Wahai orang-orang yang beriman, bersiap siagalah dan majulah (ke medan pertempuran) secara berkelompok-kelompok atau majulah bersama-sama (serentak)."
  },
  {
    "ayat": 72,
    "arabic": "وَاِنَّ مِنْكُمْ لَمَنْ لَّيُبَطِّئَنَّۚ فَاِنْ اَصَابَتْكُمْ مُّصِيْبَةٌ قَالَ قَدْ اَنْعَمَ اللّٰهُ عَلَيَّ اِذْ لَمْ اَكُنْ مَّعَهُمْ شَهِيْدًا",
    "transliteration_en": "Wa inna minkum lamal la yubatti'anna fa in asaabatkum museebatun qaala qad an'amal laahu 'alaiya iz lam akum ma'ahum shaheeda",
    "transliteration_id": "Wa inna minkum lamal layubaṭṭi'ann(a), fa in aṣābatkum muṣībatun qāla qad an‘amallāhu ‘alayya iż lam akum ma‘ahum syahīdā(n).",
    "translation_en": "And indeed, there is among you he who lingers behind; and if disaster strikes you, he says, \"Allah has favored me in that I was not present with them.\"",
    "translation_id": "Sesungguhnya di antara kamu pasti ada orang yang sangat enggan pergi (ke medan pertempuran). Jika kamu ditimpa musibah, dia berkata, “Sungguh, Allah telah menganugerahkan nikmat kepadaku karena aku tidak ikut berperang bersama mereka.\""
  },
  {
    "ayat": 73,
    "arabic": "وَلَىِٕنْ اَصَابَكُمْ فَضْلٌ مِّنَ اللّٰهِ لَيَقُوْلَنَّ كَاَنْ لَّمْ تَكُنْۢ بَيْنَكُمْ وَبَيْنَهٗ مَوَدَّةٌ يّٰلَيْتَنِيْ كُنْتُ مَعَهُمْ فَاَفُوْزَ فَوْزًا عَظِيْمًا",
    "transliteration_en": "Wa la'in asaabakum fadlum minal laahi la yaqoolanna ka al lam takum bainakum wa bainahoo mawaddatuny yaa laitanee kuntu ma'ahum fa afooza fawzan 'azeemaa",
    "transliteration_id": "Wa la'in aṣābakum faḍlum minallāhi layaqūlanna ka'allam takum bainakum wa bainahū mawaddattuy yā laitanī kuntu ma‘ahum fa afūza fauzan ‘aẓīmā(n).",
    "translation_en": "But if bounty comes to you from Allah, he will surely say, as if there had never been between you and him any affection. \"Oh, I wish I had been with them so I could have attained a great attainment.\"",
    "translation_id": "Sungguh, jika kamu mendapat karunia (kemenangan) dari Allah, tentulah dia mengatakan seakan-akan belum pernah ada hubungan kasih sayang antara kamu dengan dia, “Aduhai, sekiranya aku dahulu bersama mereka, tentu aku akan memperoleh kemenangan yang agung (pula).”"
  },
  {
    "ayat": 74,
    "arabic": "۞ فَلْيُقَاتِلْ فِيْ سَبِيْلِ اللّٰهِ الَّذِيْنَ يَشْرُوْنَ الْحَيٰوةَ الدُّنْيَا بِالْاٰخِرَةِ ۗ وَمَنْ يُّقَاتِلْ فِيْ سَبِيْلِ اللّٰهِ فَيُقْتَلْ اَوْ يَغْلِبْ فَسَوْفَ نُؤْتِيْهِ اَجْرًا عَظِيْمًا",
    "transliteration_en": "Falyuqaatil fee sabeelil laahil lazeena yashroonal hayaatad dunyaa bil Aakhirah; wa many-uqaatil fee sabeelil laahi fa yuqtal aw yaghlib fasawfa nu'teehi ajran 'azeemaa",
    "transliteration_id": "Falyuqātil fī sabīlillāhil-lażīna yasytarūnal-ḥayātad-dun-yā bil-ākhirah(ti), wa may yuqātil fī sabīlillāhi fa yuqtal au yaglib fa saufa nu'tīhi ajran ‘aẓīmā(n).",
    "translation_en": "So let those fight in the cause of Allah who sell the life of this world for the Hereafter. And he who fights in the cause of Allah and is killed or achieves victory - We will bestow upon him a great reward.",
    "translation_id": "Oleh karena itu, hendaklah orang-orang yang membeli kehidupan dunia dengan (kehidupan) akhirat berperang di jalan Allah! Siapa yang berperang di jalan Allah dan gugur atau memperoleh kemenangan niscaya kelak Kami anugerahkan kepadanya pahala yang sangat besar."
  },
  {
    "ayat": 75,
    "arabic": "وَمَا لَكُمْ لَا تُقَاتِلُوْنَ فِيْ سَبِيْلِ اللّٰهِ وَالْمُسْتَضْعَفِيْنَ مِنَ الرِّجَالِ وَالنِّسَاۤءِ وَالْوِلْدَانِ الَّذِيْنَ يَقُوْلُوْنَ رَبَّنَآ اَخْرِجْنَا مِنْ هٰذِهِ الْقَرْيَةِ الظَّالِمِ اَهْلُهَاۚ وَاجْعَلْ لَّنَا مِنْ لَّدُنْكَ وَلِيًّاۚ وَاجْعَلْ لَّنَا مِنْ لَّدُنْكَ نَصِيْرًا",
    "transliteration_en": "Wa maa lakum laa tuqaatiloona fee sabeelil laahi walmustad'afeena minar rijaali wannisaaa'i walwildaanil lazeena yaqooloona Rabbanaaa akhrijnaa min haazihil qaryatiz zaalimi ahluhaa waj'al lanaa mil ladunka waliyanw waj'al lanaa mil ladunka naseeraa",
    "transliteration_id": "Wa mā lakum lā tuqātilūna fī sabīlillāhi wal-mustaḍ‘afīna minar-rijāli wan-nisā'i wal-wildānil-lażīna yaqūlūna rabbanā akhrijnā min hāżihil-qaryatiẓ-ẓālimi ahluhā, waj‘al lanā mil ladunka waliyyā(n), waj‘al lanā mil ladunka naṣīrā(n).",
    "translation_en": "And what is [the matter] with you that you fight not in the cause of Allah and [for] the oppressed among men, women, and children who say, \"Our Lord, take us out of this city of oppressive people and appoint for us from Yourself a protector and appoint for us from Yourself a helper?\"",
    "translation_id": "Mengapa kamu tidak berperang di jalan Allah dan (membela) orang-orang yang lemah dari (kalangan) laki-laki, perempuan, dan anak-anak yang berdoa, “Wahai Tuhan kami, keluarkanlah kami dari negeri ini (Makkah) yang penduduknya zalim. Berilah kami pelindung dari sisi-Mu dan berilah kami penolong dari sisi-Mu.”"
  },
  {
    "ayat": 76,
    "arabic": "اَلَّذِيْنَ اٰمَنُوْا يُقَاتِلُوْنَ فِيْ سَبِيْلِ اللّٰهِ ۚ وَالَّذِيْنَ كَفَرُوْا يُقَاتِلُوْنَ فِيْ سَبِيْلِ الطَّاغُوْتِ فَقَاتِلُوْٓا  اَوْلِيَاۤءَ الشَّيْطٰنِ ۚ اِنَّ كَيْدَ الشَّيْطٰنِ كَانَ ضَعِيْفًا ۚ ࣖ",
    "transliteration_en": "Allazeena aamanoo yuqaatiloona fee sabeelil laahi wallazeena kafaroo yuqaatiloona fee sabeelit Taaghoot faqaatiloo awliyaaa'ash Shaitaan; inna kaidash Shairaani kaana da'eefa",
    "transliteration_id": "Al-lażīna āmanū yuqātilūna fī sabīlillāh(i), wal-lażīna kafarū yuqātilūna fī sabīliṭ-ṭāgūti fa qātilū auliyā'asy-syaiṭān(i), inna kaidasy-syaiṭāni kāna ḍa‘īfā(n).",
    "translation_en": "Those who believe fight in the cause of Allah, and those who disbelieve fight in the cause of Taghut. So fight against the allies of Satan. Indeed, the plot of Satan has ever been weak.",
    "translation_id": "Orang-orang yang beriman berperang di jalan Allah dan orang-orang yang kufur berperang di jalan tagut. Perangilah kawan-kawan setan itu. Sesungguhnya tipu daya setan itu lemah."
  },
  {
    "ayat": 77,
    "arabic": "اَلَمْ تَرَ اِلَى الَّذِيْنَ قِيْلَ لَهُمْ كُفُّوْٓا اَيْدِيَكُمْ وَاَقِيْمُوا الصَّلٰوةَ وَاٰتُوا الزَّكٰوةَۚ فَلَمَّا كُتِبَ عَلَيْهِمُ الْقِتَالُ اِذَا فَرِيْقٌ مِّنْهُمْ يَخْشَوْنَ النَّاسَ كَخَشْيَةِ اللّٰهِ اَوْ اَشَدَّ خَشْيَةً ۚ وَقَالُوْا رَبَّنَا لِمَ كَتَبْتَ عَلَيْنَا الْقِتَالَۚ  لَوْلَآ اَخَّرْتَنَآ اِلٰٓى اَجَلٍ قَرِيْبٍۗ قُلْ مَتَاعُ الدُّنْيَا قَلِيْلٌۚ وَالْاٰخِرَةُ خَيْرٌ لِّمَنِ اتَّقٰىۗ وَلَا تُظْلَمُوْنَ فَتِيْلًا",
    "transliteration_en": "Alam tara ilal lazeena qeela lahum kuffooo aidiyakum wa aqeemus Salaata w aaatuz Zakaata falammaa kutiba 'alaihimul qitaalu izaa fareequm minhum yakhshawnnan naasa kakhashyatil laahi aw ashadda khashyah; wa qaaloo Rabbanaa lima katabta 'alainal qitaala law laaa akhkhartanaa ilaaa ajalin qareeb; qul mataa'ud dunyaa qaleelunw wal Aakhiratu khairul limanit taqaa wa laa tuzlamoona fateelaa",
    "transliteration_id": "Alam tara ilal-lażīna qīla lahum kuffū aidiyakum wa aqīmuṣ-ṣalāta wa ātuz-zakāt(a), fa lammā kutiba ‘alaihimul-qitālu  iżā farīqum minhum yakhsyaunan-nāsa kakhasy-yatillāhi  au asyadda khasy-yah(tan), wa qālū rabbanā lima katabta ‘alainal-qitāl(a), lau lā akhkhartanā ilā ajalin qarīb(in), qul matā‘ud-dun-yā qalīl(un), wal-ākhiratu khairul limanittaqā, wa lā tuẓlamūna fatīlā(n).",
    "translation_en": "Have you not seen those who were told, \"Restrain your hands [from fighting] and establish prayer and give zakah\"? But then when fighting was ordained for them, at once a party of them feared men as they fear Allah or with [even] greater fear. They said, \"Our Lord, why have You decreed upon us fighting? If only You had postponed [it for] us for a short time.\" Say, The enjoyment of this world is little, and the Hereafter is better for he who fears Allah. And injustice will not be done to you, [even] as much as a thread [inside a date seed].\"",
    "translation_id": "Tidakkah engkau memperhatikan orang-orang yang dikatakan kepada mereka, “Tahanlah tanganmu (dari berperang), tegakkanlah salat, dan tunaikanlah zakat!” Ketika mereka diwajibkan berperang, tiba-tiba segolongan mereka (munafik) takut kepada manusia (musuh) seperti ketakutan mereka kepada Allah, bahkan lebih takut daripada itu. Mereka berkata, “Wahai Tuhan kami, mengapa Engkau wajibkan berperang kepada kami? Mengapa tidak Engkau tangguhkan (kewajiban berperang) kepada kami beberapa waktu lagi?” Katakanlah, “Kesenangan di dunia ini hanyalah sedikit, sedangkan akhirat itu lebih baik bagi orang yang bertakwa dan kamu tidak akan dizalimi sedikit pun.”"
  },
  {
    "ayat": 78,
    "arabic": "اَيْنَ مَا تَكُوْنُوْا يُدْرِكْكُّمُ الْمَوْتُ وَلَوْ كُنْتُمْ فِيْ بُرُوْجٍ مُّشَيَّدَةٍ ۗ وَاِنْ تُصِبْهُمْ حَسَنَةٌ يَّقُوْلُوْا هٰذِهٖ مِنْ عِنْدِ اللّٰهِ ۚ وَاِنْ تُصِبْهُمْ سَيِّئَةٌ يَّقُوْلُوْا هٰذِهٖ مِنْ عِنْدِكَ ۗ قُلْ كُلٌّ مِّنْ عِنْدِ اللّٰهِ ۗ فَمَالِ هٰٓؤُلَاۤءِ الْقَوْمِ لَا يَكَادُوْنَ يَفْقَهُوْنَ حَدِيْثًا",
    "transliteration_en": "Ainamaa takoonoo yudrikkumul mawtu wa law kuntum fee buroojim mushai yadah; wa in tusibhum hasanatuny yaqooloo haazihee min indil laahi wa in tusibhum saiyi'atuny yaqooloo haazihee min 'indik; qul kullum min 'indillaahi famaa lihaaa 'ulaaa'il qawmi laa yakkaadoona yafqahoona hadeesaa",
    "transliteration_id": "Aina mā takūnū yudrikkumul-mautu wa lau kuntum fī burūjim musyayyadah(tin), wa in tuṣibhum ḥasanatuy yaqūlū hāżihī min ‘indillāh(i), wa in tuṣibhum sayyi'atuy yaqūlū hāżihī min ‘indik(a), qul kullum min ‘indillāh(i), famā lihā'ulā'il-qaumi lā yakādūna yafqahūna ḥadīṡā(n).",
    "translation_en": "Wherever you may be, death will overtake you, even if you should be within towers of lofty construction. But if good comes to them, they say, \"This is from Allah \"; and if evil befalls them, they say, \"This is from you.\" Say, \"All [things] are from Allah.\" So what is [the matter] with those people that they can hardly understand any statement?",
    "translation_id": "Di mana pun kamu berada, kematian akan mendatangimu, meskipun kamu berada dalam benteng yang kukuh. Jika mereka (orang-orang munafik) memperoleh suatu kebaikan, mereka berkata, “Ini dari sisi Allah” dan jika mereka ditimpa suatu keburukan, mereka berkata, “Ini dari engkau (Nabi Muhammad).” Katakanlah, “Semuanya (datang) dari sisi Allah.” Mengapa orang-orang itu hampir tidak memahami pembicaraan?"
  },
  {
    "ayat": 79,
    "arabic": "مَآ اَصَابَكَ مِنْ حَسَنَةٍ فَمِنَ اللّٰهِ ۖ وَمَآ اَصَابَكَ مِنْ سَيِّئَةٍ فَمِنْ نَّفْسِكَ ۗ وَاَرْسَلْنٰكَ لِلنَّاسِ رَسُوْلًا  ۗ وَكَفٰى بِاللّٰهِ شَهِيْدًا",
    "transliteration_en": "Maaa asaabaka min hasanatin faminal laahi wa maaa asaaabaka min saiyi'atin famin nafsik; wa arsalnaaka linnaasi Rasoolaa; wa kafaa billaahi Shaheedaa",
    "transliteration_id": "Mā aṣābaka min ḥasanatin fa minallāh(i), wa mā aṣābaka min sayyi'atin fa min nafsik(a), wa arsalnāka lin-nāsi rasūlā(n), wa kafā billāhi syahīdā(n).",
    "translation_en": "What comes to you of good is from Allah, but what comes to you of evil, [O man], is from yourself. And We have sent you, [O Muhammad], to the people as a messenger, and sufficient is Allah as Witness.",
    "translation_id": "Kebaikan (nikmat) apa pun yang kamu peroleh (berasal) dari Allah, sedangkan keburukan (bencana) apa pun yang menimpamu itu disebabkan oleh (kesalahan) dirimu sendiri. Kami mengutus engkau (Nabi Muhammad) menjadi Rasul kepada (seluruh) manusia. Cukuplah Allah sebagai saksi."
  },
  {
    "ayat": 80,
    "arabic": "مَنْ يُّطِعِ الرَّسُوْلَ فَقَدْ اَطَاعَ اللّٰهَ ۚ وَمَنْ تَوَلّٰى فَمَآ اَرْسَلْنٰكَ عَلَيْهِمْ حَفِيْظًا ۗ",
    "transliteration_en": "Man yuti'ir Rasoola faqad ataa'al laaha wa man tawallaa famaaa arsalnaaka 'alaihim hafeezaa",
    "transliteration_id": "May yuṭi‘ir-rasūla faqad aṭā‘allāh(a), wa man tawallā famā arsalnāka ‘alaihim ḥafīẓā(n).",
    "translation_en": "He who obeys the Messenger has obeyed Allah; but those who turn away - We have not sent you over them as a guardian.",
    "translation_id": "Siapa yang menaati Rasul (Muhammad), maka sungguh telah menaati Allah. Siapa yang berpaling, maka Kami tidak mengutus engkau (Nabi Muhammad) sebagai pemelihara mereka."
  },
  {
    "ayat": 81,
    "arabic": "وَيَقُوْلُوْنَ طَاعَةٌ  ۖ فَاِذَا بَرَزُوْا مِنْ عِنْدِكَ بَيَّتَ طَاۤىِٕفَةٌ مِّنْهُمْ غَيْرَ الَّذِيْ تَقُوْلُ ۗ وَاللّٰهُ يَكْتُبُ مَا يُبَيِّتُوْنَ ۚ فَاَعْرِضْ عَنْهُمْ وَتَوَكَّلْ عَلَى اللّٰهِ ۗ وَكَفٰى بِاللّٰهِ وَكِيْلًا",
    "transliteration_en": "Wa yaqooloona taa'antun fa izaa barazoo min 'indika baiyata taaa'ifatum minhum ghairal lazee taqoolu wallaahu yaktubu maa yubaiyitoona faa'rid 'anhum wa tawakkal 'alal laah; wa kafaa billaahi Wakeelaa",
    "transliteration_id": "Wa yaqūlūna ṭā‘ah(tun), fa iżā barazū min ‘indika bayyata ṭā'ifatum minhum gairal-lażī taqūl(u), wallāhu yaktubu mā yubayyitūn(a),  fa a‘riḍ ‘anhum wa tawakkal ‘alallāh(i), wa kafā billāhi wakīlā(n).",
    "translation_en": "And they say, \"[We pledge] obedience.\" But when they leave you, a group of them spend the night determining to do other than what you say. But Allah records what they plan by night. So leave them alone and rely upon Allah. And sufficient is Allah as Disposer of affairs.",
    "translation_id": "Mereka (orang-orang munafik) berkata, “(Kewajiban kami hanyalah) taat.” Akan tetapi, apabila mereka telah pergi darimu (Nabi Muhammad), sebagian mereka mengatur siasat pada malam hari (mengambil keputusan) berbeda dari yang telah mereka katakan. Allah mencatat siasat yang mereka atur pada malam hari itu. Berpalinglah dari mereka dan bertawakallah kepada Allah. Cukuplah Allah sebagai pelindung."
  },
  {
    "ayat": 82,
    "arabic": "اَفَلَا يَتَدَبَّرُوْنَ الْقُرْاٰنَ ۗ وَلَوْ كَانَ مِنْ عِنْدِ غَيْرِ اللّٰهِ لَوَجَدُوْا فِيْهِ اخْتِلَافًا كَثِيْرًا",
    "transliteration_en": "Afalaa yatadabbaroonal Qur'aan; wa law kaana min 'indi ghairil laahi la wajadoo fee hikh tilaafan kaseeraa",
    "transliteration_id": "Afalā yatadabbarūnal-qur'ān(a), wa lau kāna min ‘indi gairillāhi lawajadū fīhikhtilāfan kaṡīrā(n).",
    "translation_en": "Then do they not reflect upon the Qur'an? If it had been from [any] other than Allah, they would have found within it much contradiction.",
    "translation_id": "Tidakkah mereka menadaburi Al-Qur’an? Seandainya (Al-Qur’an) itu tidak datang dari sisi Allah, tentulah mereka menemukan banyak pertentangan di dalamnya."
  },
  {
    "ayat": 83,
    "arabic": "وَاِذَا جَاۤءَهُمْ اَمْرٌ مِّنَ الْاَمْنِ اَوِ الْخَوْفِ اَذَاعُوْا بِهٖ ۗ وَلَوْ رَدُّوْهُ اِلَى الرَّسُوْلِ وَاِلٰٓى اُولِى الْاَمْرِ مِنْهُمْ لَعَلِمَهُ الَّذِيْنَ يَسْتَنْۢبِطُوْنَهٗ مِنْهُمْ ۗ وَلَوْلَا فَضْلُ اللّٰهِ عَلَيْكُمْ وَرَحْمَتُهٗ لَاتَّبَعْتُمُ الشَّيْطٰنَ اِلَّا قَلِيْلًا",
    "transliteration_en": "Wa izaa jaaa'ahum amrum minal amni awil kkhawfi azaa'oo bihee wa law raddoohu ilar Rasooli wa ilaaa ulil amri minhum la'alimahul lazeena yastambitoonahoo minhum; wa law laa fadlul laahi 'alaikum wa rahmatuhoo lattaba'tumush Shaitaana illaa qaleelaa",
    "transliteration_id": "Wa iżā jā'ahum amrum minal-amni awil-khaufi ażā‘ū bih(ī), wa lau ruddūhu ilar-rasūli wa ilā ulil-amri minhum la‘alimahul-lażīna yastambiṭūnahū minhum, wa lau lā faḍlullāhi ‘alaikum wa raḥmatuhū lattaba‘tumusy-syaiṭāna illā qalīlā(n).",
    "translation_en": "And when there comes to them information about [public] security or fear, they spread it around. But if they had referred it back to the Messenger or to those of authority among them, then the ones who [can] draw correct conclusions from it would have known about it. And if not for the favor of Allah upon you and His mercy, you would have followed Satan, except for a few.",
    "translation_id": "Apabila datang kepada mereka suatu berita tentang keamanan (kemenangan) atau ketakutan (kekalahan), mereka menyebarluaskannya. Padahal, seandainya mereka menyerahkannya kepada Rasul dan ululamri (pemegang kekuasaan) di antara mereka, tentulah orang-orang yang ingin mengetahui kebenarannya (akan dapat) mengetahuinya (secara resmi) dari mereka (Rasul dan ululamri). Sekiranya bukan karena karunia dan rahmat Allah kepadamu, tentulah engkau mengikuti setan, kecuali sebagian kecil saja (di antara kamu)."
  },
  {
    "ayat": 84,
    "arabic": "فَقَاتِلْ فِيْ سَبِيْلِ اللّٰهِ ۚ لَا تُكَلَّفُ اِلَّا نَفْسَكَ وَحَرِّضِ الْمُؤْمِنِيْنَ ۚ عَسَى اللّٰهُ اَنْ يَّكُفَّ بَأْسَ الَّذِيْنَ كَفَرُوْا ۗوَاللّٰهُ اَشَدُّ بَأْسًا وَّاَشَدُّ تَنْكِيْلًا",
    "transliteration_en": "Faqaatil fee sabeelil laahi laa tukallafu illa nafsaka wa harridil mu'mineena 'asallaahu ai yakuffa baasallazeena kafaroo; wallaahu ashaddu baasanw wa ashaaddu tanakeelaa",
    "transliteration_id": "Faqātil fī sabīlillāh(i), lā tukallafu illā nafsaka wa ḥarriḍil-mu'minīn(a), ‘asallāhu ay yakuffa ba'sal lażīna kafarū,  wallāhu asyaddu ba'saw wa asyaddu tankīlā(n).",
    "translation_en": "So fight, [O Muhammad], in the cause of Allah; you are not held responsible except for yourself. And encourage the believers [to join you] that perhaps Allah will restrain the [military] might of those who disbelieve. And Allah is greater in might and stronger in [exemplary] punishment.",
    "translation_id": "Maka, berperanglah engkau (Nabi Muhammad) di jalan Allah. Tidaklah engkau dibebani (tanggung jawab), kecuali (yang terkait) dengan dirimu sendiri. Kobarkanlah (semangat) orang-orang mukmin (untuk berperang). Semoga Allah menolak serangan orang-orang yang kufur itu. Allah sangat dahsyat kekuatan-Nya dan sangat keras siksaan-Nya."
  },
  {
    "ayat": 85,
    "arabic": "مَنْ يَّشْفَعْ شَفَاعَةً حَسَنَةً يَّكُنْ لَّهٗ نَصِيْبٌ مِّنْهَا ۚ وَمَنْ يَّشْفَعْ شَفَاعَةً سَيِّئَةً يَّكُنْ لَّهٗ كِفْلٌ مِّنْهَا ۗ وَكَانَ اللّٰهُ عَلٰى كُلِّ شَيْءٍ مُّقِيْتًا",
    "transliteration_en": "Mai yashfa' shafaa'atan hasanatay yakul lahoo naseebum minhaa wa mai yashfa' shafaa'tan saiyi'atanny-yakul lahoo kiflum minhaa; wa kaanal laahu 'alaa kulli shai'im Muqeetaa",
    "transliteration_id": "May yasyfa‘ syafā‘atan ḥasanatay yakul lahū naṣībum minhā, wa may yasyfa‘ syafā‘atan sayyi'atay yakul lahū kiflum minhā, wa kānallāhu ‘alā kulli syai'im muqītā(n).",
    "translation_en": "Whoever intercedes for a good cause will have a reward therefrom; and whoever intercedes for an evil cause will have a burden therefrom. And ever is Allah, over all things, a Keeper.",
    "translation_id": "Siapa yang memberi pertolongan yang baik niscaya akan memperoleh bagian (pahala) darinya. Siapa yang memberi pertolongan yang buruk niscaya akan menanggung bagian (dosa) darinya. Allah Maha Kuasa atas segala sesuatu."
  },
  {
    "ayat": 86,
    "arabic": "وَاِذَا حُيِّيْتُمْ بِتَحِيَّةٍ فَحَيُّوْا بِاَحْسَنَ مِنْهَآ اَوْ رُدُّوْهَا ۗ اِنَّ اللّٰهَ كَانَ عَلٰى كُلِّ شَيْءٍ حَسِيْبًا",
    "transliteration_en": "Wa izaa huyyeetum bitahiy yatin fahaiyoo bi ahsana minhaaa aw ruddoohaa; innal laaha kaana 'alaa kulli shai'in Haseeba",
    "transliteration_id": "Wa iżā ḥuyyītum bitaḥiyyatin fa ḥayyū bi'aḥsana minhā au ruddūhā, innallāha kāna ‘alā kulli syai'in ḥasībā(n).",
    "translation_en": "And when you are greeted with a greeting, greet [in return] with one better than it or [at least] return it [in a like manner]. Indeed, Allah is ever, over all things, an Accountant.",
    "translation_id": "Apabila kamu dihormati dengan suatu penghormatan (salam), balaslah penghormatan itu dengan yang lebih baik daripadanya atau balaslah dengan yang sepadan. Sesungguhnya Allah Maha Memperhitungkan segala sesuatu."
  },
  {
    "ayat": 87,
    "arabic": "اَللّٰهُ لَآ اِلٰهَ اِلَّا هُوَۗ  لَيَجْمَعَنَّكُمْ اِلٰى يَوْمِ الْقِيٰمَةِ لَا رَيْبَ فِيْهِ ۗ وَمَنْ اَصْدَقُ مِنَ اللّٰهِ حَدِيْثًا ࣖ",
    "transliteration_en": "Allaahu laaa ilaaha illaa huwa la yajma'annakum ilaa Yawmil Qiyaamati laa raiba feeh; wa man asdaqu mminallaahi hadeesaa",
    "transliteration_id": "Allāhu lā ilāha illā huw(a), layajma‘annakum ilā yaumil-qiyāmati lā raiba fīh(i), wa man aṣdaqu minallāhi ḥadīṡā(n).",
    "translation_en": "Allah - there is no deity except Him. He will surely assemble you for [account on] the Day of Resurrection, about which there is no doubt. And who is more truthful than Allah in statement.",
    "translation_id": "Allah, tidak ada tuhan selain Dia. Sungguh, Dia pasti mengumpulkan kamu pada hari Kiamat yang tidak ada keraguan di dalamnya. Siapakah yang lebih benar perkataannya daripada Allah?"
  },
  {
    "ayat": 88,
    "arabic": "۞ فَمَا لَكُمْ فِى الْمُنٰفِقِيْنَ فِئَتَيْنِ وَاللّٰهُ اَرْكَسَهُمْ بِمَا كَسَبُوْا ۗ اَتُرِيْدُوْنَ اَنْ تَهْدُوْا مَنْ اَضَلَّ اللّٰهُ ۗوَمَنْ يُّضْلِلِ اللّٰهُ فَلَنْ تَجِدَ لَهٗ سَبِيْلًا",
    "transliteration_en": "Famaa lakum filmuna afiqeena fi'ataini wallaahu arkasahum bimaa kasaboo; atureedoona an tahdoo man adallal laahu wa mmai yudlilil laahu falan tajida lahoo sabeelaa",
    "transliteration_id": "Famā lakum fil-munāfiqīna fi'ataini wallāhu arkasahum bimā kasabū, aturīdūna an tahdū man aḍallallāh(u), wa may yuḍlilillāhu falan tajida lahū sabīlā(n).",
    "translation_en": "What is [the matter] with you [that you are] two groups concerning the hypocrites, while Allah has made them fall back [into error and disbelief] for what they earned. Do you wish to guide those whom Allah has sent astray? And he whom Allah sends astray - never will you find for him a way [of guidance].",
    "translation_id": "Mengapa kamu (wahai orang mukmin) (terpecah) menjadi dua golongan dalam (menghadapi) orang-orang munafik, padahal Allah telah mengembalikan mereka (pada kekufuran) karena usaha mereka sendiri? Apakah kamu bermaksud memberi petunjuk kepada orang yang telah dibiarkan sesat oleh Allah? Siapa yang dibiarkan sesat oleh Allah niscaya engkau (Nabi Muhammad) tidak akan menemukan jalan baginya (untuk diberi petunjuk)."
  },
  {
    "ayat": 89,
    "arabic": "وَدُّوْا لَوْ تَكْفُرُوْنَ كَمَا كَفَرُوْا فَتَكُوْنُوْنَ سَوَاۤءً فَلَا تَتَّخِذُوْا مِنْهُمْ اَوْلِيَاۤءَ حَتّٰى يُهَاجِرُوْا فِيْ سَبِيْلِ اللّٰهِ ۗ فَاِنْ تَوَلَّوْا فَخُذُوْهُمْ وَاقْتُلُوْهُمْ حَيْثُ وَجَدْتُّمُوْهُمْ ۖ وَلَا تَتَّخِذُوْا مِنْهُمْ وَلِيًّا وَّلَا نَصِيْرًاۙ",
    "transliteration_en": "Wadoo law takfuroona kamaa kafaroo fatakoonoona sawaaa'an falaa tattakhizoo minhum awliyaaa'a hattaa yuhaajiroo fee sabeelil laah; fa in tawallaw fa khuzoohum waqtuloohum haisu wajat tumoohum wa laa tattakhizoo minhum waliyyanw wa laa naseeraa",
    "transliteration_id": "Waddū lau takfurūna kamā kafarū fa takūnūna sawā'an falā tattakhiżū minhum auliyā'a ḥattā yuhājirū fī sabīlillāh(i), fa in tawallau fa khużūhum waqtulūhum ḥaiṡu wajattumūhum, wa lā tattakhiżū minhum waliyyaw wa lā naṣīrā(n).",
    "translation_en": "They wish you would disbelieve as they disbelieved so you would be alike. So do not take from among them allies until they emigrate for the cause of Allah. But if they turn away, then seize them and kill them wherever you find them and take not from among them any ally or helper.",
    "translation_id": "Mereka sangat menginginkan agar kamu mau menjadi kufur sebagaimana mereka telah kufur sehingga kamu sama (dengan mereka). Janganlah kamu jadikan siapa pun di antara mereka sebagai teman setia sebelum mereka berpindah pada jalan Allah. Jika mereka berpaling, tawan dan bunuhlah mereka di mana pun kamu temukan mereka. Janganlah kamu jadikan seorang pun di antara mereka sebagai teman setia dan jangan pula sebagai penolong."
  },
  {
    "ayat": 90,
    "arabic": "اِلَّا الَّذِيْنَ يَصِلُوْنَ اِلٰى قَوْمٍۢ بَيْنَكُمْ وَبَيْنَهُمْ مِّيْثَاقٌ اَوْ جَاۤءُوْكُمْ حَصِرَتْ صُدُوْرُهُمْ اَنْ يُّقَاتِلُوْكُمْ اَوْ يُقَاتِلُوْا قَوْمَهُمْ ۗ وَلَوْ شَاۤءَ اللّٰهُ لَسَلَّطَهُمْ عَلَيْكُمْ فَلَقَاتَلُوْكُمْ ۚ فَاِنِ اعْتَزَلُوْكُمْ فَلَمْ يُقَاتِلُوْكُمْ وَاَلْقَوْا اِلَيْكُمُ السَّلَمَ ۙ فَمَا جَعَلَ اللّٰهُ لَكُمْ عَلَيْهِمْ سَبِيْلًا",
    "transliteration_en": "Illal lazeena yasiloona ilaa qawmim binakum wa bainahum meesaaqun aw jaaa'ookum hasirat sudooruhum ai yuqaatilookum aw yuqaatiloo qawmahum, wa law shaaa'al laahu lasallatahum 'alaikum falaqaatalookum; fa ini' tazalookum falam yuqaatilookum wa alqaw ilaikumus salama famaa ja'alal laahu lakum 'alaihim sabeelaa",
    "transliteration_id": "Illal lażīna yaṣilūna ilā qaumim bainakum wa bainahum mīṡāqun au jā'ūkum ḥaṣirat ṣudūruhum ay yuqātilūkum au yuqātilū qaumahum, wa lau syā'allāhu lasallaṭahum ‘alaikum fa laqātalūkum, fa ini‘tazalūkum falam yuqātilūkum wa alqau ilaikumus-salam(a), famā ja‘alallāhu lakum ‘alaihim sabīlā(n).",
    "translation_en": "Except for those who take refuge with a people between yourselves and whom is a treaty or those who come to you, their hearts strained at [the prospect of] fighting you or fighting their own people. And if Allah had willed, He could have given them power over you, and they would have fought you. So if they remove themselves from you and do not fight you and offer you peace, then Allah has not made for you a cause [for fighting] against them.",
    "translation_id": "Kecuali, orang-orang yang menjalin hubungan dengan suatu kaum yang antara kamu dan kaum itu ada perjanjian (damai, mereka jangan dibunuh atau jangan ditawan). (Demikian juga) orang-orang yang datang kepadamu, sedangkan hati mereka berat untuk memerangi kamu atau memerangi kaumnya. Seandainya Allah menghendaki, niscaya Dia berikan kekuasaan kepada mereka untuk menghadapi kamu sehingga mereka memerangimu. Akan tetapi, jika mereka membiarkanmu (tidak mengganggumu), tidak memerangimu, dan menawarkan perdamaian kepadamu (menyerah), Allah tidak memberi jalan bagimu (untuk menawan dan membunuh) mereka."
  },
  {
    "ayat": 91,
    "arabic": "سَتَجِدُوْنَ اٰخَرِيْنَ يُرِيْدُوْنَ اَنْ يَّأْمَنُوْكُمْ وَيَأْمَنُوْا قَوْمَهُمْ ۗ كُلَّ مَا رُدُّوْٓا اِلَى الْفِتْنَةِ اُرْكِسُوْا فِيْهَا ۚ فَاِنْ لَّمْ يَعْتَزِلُوْكُمْ وَيُلْقُوْٓا اِلَيْكُمُ السَّلَمَ وَيَكُفُّوْٓا اَيْدِيَهُمْ فَخُذُوْهُمْ وَاقْتُلُوْهُمْ حَيْثُ ثَقِفْتُمُوْهُمْ ۗ وَاُولٰۤىِٕكُمْ جَعَلْنَا لَكُمْ عَلَيْهِمْ سُلْطٰنًا مُّبِيْنًا ࣖ",
    "transliteration_en": "Satajidoona aakhareena yureedoona ai yaamanookum wa yaamanoo qawmahum kullamaa ruddooo ilal itnati urkisoo feehaa; fa il lam ya'tazilookum wa yulqooo ilai kumus salama wa yakuffooo aidiyahum fakhuzoohum waqtuloohum haisu saqif tumoohum; wa ulaaa'ikum ja'alnaa lakum 'alaihim sultaanam mubeenaa",
    "transliteration_id": "Satajidūna akharīna yurīdūna ay ya'manūkum wa ya'manū qaumahum, kullamā ruddū ilal-fitnati urkisū fīhā, fa illam ya‘tazilūkum wa yulqū ilaikumus-salama  wa yakuffū aidiyahum fa khużūhum waqtulūhum ḥaiṡu ṡaqiftumūhum, wa ulā'ikum ja‘alnā lakum ‘alaihim sulṭānam mubīnā(n).",
    "translation_en": "You will find others who wish to obtain security from you and [to] obtain security from their people. Every time they are returned to [the influence of] disbelief, they fall back into it. So if they do not withdraw from you or offer you peace or restrain their hands, then seize them and kill them wherever you overtake them. And those - We have made for you against them a clear authorization.",
    "translation_id": "Akan kamu dapati (golongan) lain yang menginginkan agar mereka hidup aman bersamamu dan aman (pula) bersama kaumnya. Setiap kali mereka diajak kembali kepada fitnah (syirik), mereka pun terjerumus ke dalamnya. Oleh karena itu, jika mereka tidak membiarkanmu (tetap mengganggumu), tidak pula mau menawarkan perdamaian kepadamu, dan tidak menahan tangan mereka (dari memerangimu), tawanlah dan bunuhlah mereka di mana saja kamu temukan. Merekalah orang-orang yang Kami berikan kepadamu alasan yang nyata (untuk menawan dan membunuh) mereka."
  },
  {
    "ayat": 92,
    "arabic": "وَمَا كَانَ لِمُؤْمِنٍ اَنْ يَّقْتُلَ مُؤْمِنًا اِلَّا خَطَـًٔا ۚ وَمَنْ قَتَلَ مُؤْمِنًا خَطَـًٔا فَتَحْرِيْرُ رَقَبَةٍ مُّؤْمِنَةٍ وَّدِيَةٌ مُّسَلَّمَةٌ اِلٰٓى  اَهْلِهٖٓ  اِلَّآ  اَنْ يَّصَّدَّقُوْا ۗ فَاِنْ كَانَ مِنْ قَوْمٍ عَدُوٍّ لَّكُمْ وَهُوَ مُؤْمِنٌ فَتَحْرِيْرُ رَقَبَةٍ مُّؤْمِنَةٍ ۗوَاِنْ كَانَ مِنْ قَوْمٍۢ بَيْنَكُمْ وَبَيْنَهُمْ مِّيْثَاقٌ فَدِيَةٌ مُّسَلَّمَةٌ اِلٰٓى اَهْلِهٖ وَتَحْرِيْرُ رَقَبَةٍ مُّؤْمِنَةٍ ۚ فَمَنْ لَّمْ يَجِدْ فَصِيَامُ شَهْرَيْنِ مُتَتَابِعَيْنِۖ تَوْبَةً مِّنَ اللّٰهِ ۗوَكَانَ اللّٰهُ عَلِيْمًا حَكِيْمًا",
    "transliteration_en": "Wa maa kaana limu'minin ai yaqtula mu'minan illaa khata'aa; waman qatala mu'minan khata'an fatabreeru raqabatim mu'minatinw wa diyatum mmusallamatun ilaaa ahliheee illaaa ai yassaddaqoo; fa in kaana min qawmin 'aduwwil lakum wa huwa mu'minun fatabreeru raqabatim mu'minah; wa in kaana min qawmim bainakum wa bainahum meesaaqun fadiyatum mmusallamatun ilaaa ahlihee wa tahreeru raqabatim mu'minatin famal lam yajid fa Siyaamu shahraini mutataabi'aini tawhatam minal laah; wa kaanal laahu 'Aleeman hakeemaa",
    "transliteration_id": "Wa mā kāna limu'minin ay yaqtula mu'minan illā khaṭa'ā(n), wa man qatala mu'minan khaṭa'an fa taḥrīru raqabatim mu'minatiw wa diyatum musallamatun ilā ahlihī illā ay yaṣṣaddaqū, fa in kāna min qaumim bainakum wa bainahum mīṡāqun fa diyatum musallamatun ilā ahlihī wa taḥrīru raqabatim mu'minah(tin), famal lam yajid fa ṣiyāmu syahraini mutatābi‘aini taubatam minallāh(i), wa kānallāhu ‘alīman ḥakīmā(n).",
    "translation_en": "And never is it for a believer to kill a believer except by mistake. And whoever kills a believer by mistake - then the freeing of a believing slave and a compensation payment presented to the deceased's family [is required] unless they give [up their right as] charity. But if the deceased was from a people at war with you and he was a believer - then [only] the freeing of a believing slave; and if he was from a people with whom you have a treaty - then a compensation payment presented to his family and the freeing of a believing slave. And whoever does not find [one or cannot afford to buy one] - then [instead], a fast for two months consecutively, [seeking] acceptance of repentance from Allah. And Allah is ever Knowing and Wise.",
    "translation_id": "Tidak patut bagi seorang mukmin membunuh seorang mukmin, kecuali karena tersalah (tidak sengaja). Siapa yang membunuh seorang mukmin karena tersalah (hendaklah) memerdekakan seorang hamba sahaya mukmin dan (membayar) tebusan yang diserahkan kepada keluarganya (terbunuh), kecuali jika mereka (keluarga terbunuh) membebaskan pembayaran. Jika dia (terbunuh) dari kaum yang memusuhimu, padahal dia orang beriman, (hendaklah pembunuh) memerdekakan hamba sahaya mukmin. Jika dia (terbunuh) dari kaum (kafir) yang ada perjanjian (damai) antara mereka dengan kamu, (hendaklah pembunuh) membayar tebusan yang diserahkan kepada keluarganya serta memerdekakan hamba sahaya mukmin. Siapa yang tidak mendapatkan (hamba sahaya) hendaklah berpuasa dua bulan berturut-turut sebagai (ketetapan) cara bertobat dari Allah. Allah Maha Mengetahui lagi Maha Bijaksana."
  },
  {
    "ayat": 93,
    "arabic": "وَمَنْ يَّقْتُلْ مُؤْمِنًا مُّتَعَمِّدًا فَجَزَاۤؤُهٗ جَهَنَّمُ خَالِدًا فِيْهَا وَغَضِبَ اللّٰهُ عَلَيْهِ وَلَعَنَهٗ وَاَعَدَّ لَهٗ عَذَابًا عَظِيْمًا",
    "transliteration_en": "Wa mai yaqtul mu'minammuta 'ammidan fajazaaa'uhoo Jahannamu khaalidan feehaa wa ghadibal laahu' alaihi wa la'anahoo wa a'adda lahoo 'azaaban 'azeemaa",
    "transliteration_id": "Wa may yaqtul mu'minam muta‘ammidan fa jazā'uhū jahannamu khālidan fīhā wa gaḍiballāhu ‘alaihi wa la‘anahū wa a‘adda lahū ‘ażāban ‘aẓīmā(n).",
    "translation_en": "But whoever kills a believer intentionally - his recompense is Hell, wherein he will abide eternally, and Allah has become angry with him and has cursed him and has prepared for him a great punishment.",
    "translation_id": "Siapa yang membunuh seorang mukmin dengan sengaja, balasannya adalah (neraka) Jahanam. Dia kekal di dalamnya. Allah murka kepadanya, melaknatnya, dan menyediakan baginya azab yang sangat besar."
  },
  {
    "ayat": 94,
    "arabic": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْٓا اِذَا ضَرَبْتُمْ فِيْ سَبِيْلِ اللّٰهِ فَتَبَيَّنُوْا وَلَا تَقُوْلُوْا لِمَنْ اَلْقٰىٓ اِلَيْكُمُ السَّلٰمَ لَسْتَ مُؤْمِنًاۚ تَبْتَغُوْنَ عَرَضَ الْحَيٰوةِ الدُّنْيَا ۖفَعِنْدَ اللّٰهِ مَغَانِمُ كَثِيْرَةٌ ۗ كَذٰلِكَ كُنْتُمْ مِّنْ قَبْلُ فَمَنَّ اللّٰهُ عَلَيْكُمْ فَتَبَيَّنُوْاۗ اِنَّ اللّٰهَ كَانَ بِمَا تَعْمَلُوْنَ خَبِيْرًا",
    "transliteration_en": "Yaaa aiyuhal lazeena aamanoo izaa darabtum fee sabeelil laahi fatabaiyanoo wa laa taqooloo liman alqaaa ilaikumus salaama lasta mu'minan tabtaghoona 'aradal hayaatid dunyaa fa'indal laahi maghaanimu kaseerah; kazaalika kuntum min qablu famannnal laahu 'alaikum fatabaiyanoo; innallaaha kaana bimaa ta'maloona Khabeeraa",
    "transliteration_id": "Yā ayyuhal-lażīna āmanū iżā ḍarabtum fī sabīlillāhi fa tabayyanū wa lā taqūlū liman alqā ilaikumus-salāma lasta mu'minā(n), tabtagūna ‘araḍal-ḥayātid-dun-yā, fa ‘indallāhi magānimu kaṡīrah(tun), każālika kuntum min qablu fa mannallāhu ‘alaikum fa tabayyanū, innallāha kāna bimā ta‘malūna khabīrā(n).",
    "translation_en": "O you who have believed, when you go forth [to fight] in the cause of Allah, investigate; and do not say to one who gives you [a greeting of] peace \"You are not a believer,\" aspiring for the goods of worldly life; for with Allah are many acquisitions. You [yourselves] were like that before; then Allah conferred His favor upon you, so investigate. Indeed Allah is ever, with what you do, Acquainted.",
    "translation_id": "Wahai orang-orang yang beriman, apabila kamu pergi (berperang) di jalan Allah, bertabayunlah (carilah kejelasan) dan janganlah kamu mengatakan kepada orang yang mengucapkan salam kepadamu, “Kamu bukan seorang mukmin,” (lalu kamu membunuhnya) dengan maksud mencari harta benda kehidupan dunia karena di sisi Allah ada harta yang banyak. Demikianlah keadaan kamu dahulu, lalu Allah menganugerahkan nikmat-Nya kepadamu, maka telitilah. Sesungguhnya Allah Maha Mengetahui apa yang kamu kerjakan."
  },
  {
    "ayat": 95,
    "arabic": "لَا يَسْتَوِى الْقٰعِدُوْنَ مِنَ الْمُؤْمِنِيْنَ غَيْرُ اُولِى الضَّرَرِ وَالْمُجٰهِدُوْنَ فِيْ سَبِيْلِ اللّٰهِ بِاَمْوَالِهِمْ وَاَنْفُسِهِمْۗ  فَضَّلَ اللّٰهُ الْمُجٰهِدِيْنَ بِاَمْوَالِهِمْ وَاَنْفُسِهِمْ عَلَى الْقٰعِدِيْنَ دَرَجَةً ۗ وَكُلًّا وَّعَدَ اللّٰهُ الْحُسْنٰىۗ وَفَضَّلَ اللّٰهُ الْمُجٰهِدِيْنَ عَلَى الْقٰعِدِيْنَ اَجْرًا عَظِيْمًاۙ",
    "transliteration_en": "Laa yastawil qaa'idoona Minal mu'mineena ghairu ulid darari walmujaahidoona fee sabeelil laahi bi amwaalihim wa anfusihim; faddalal laahul mujaahideena bi amwaalihim wa anfusihim; faddalal laahul mujaahideena bi am waalihim wa anfusihim 'alalqaa'ideena darajab; wa kullanw wa'adal laahul husnaa; wa faddalal laahul mujaahideena 'alal qaa'ideena ajran 'azeemaa",
    "transliteration_id": "Lā yastawil-qā‘idūna minal-mu'minīna gairu uliḍ-ḍarari wal-mujāhidūna fī sabīlillāhi bi'amwālihim wa anfusihim, faḍḍalallāhul-mujāhidīna bi amwālihim wa anfusihim ‘alal-qā‘idīna darajah(tan), wa kullaw wa‘adallāhul-ḥusnā, wa faḍḍalallāhul-mujāhidīna ‘alal-qā‘idīna ajran ‘aẓīmā(n).",
    "translation_en": "Not equal are those believers remaining [at home] - other than the disabled - and the mujahideen, [who strive and fight] in the cause of Allah with their wealth and their lives. Allah has preferred the mujahideen through their wealth and their lives over those who remain [behind], by degrees. And to both Allah has promised the best [reward]. But Allah has preferred the mujahideen over those who remain [behind] with a great reward -",
    "translation_id": "Tidak sama orang-orang mukmin yang duduk (tidak turut berperang) tanpa mempunyai uzur dengan orang-orang yang berjihad di jalan Allah dengan harta dan jiwanya. Allah melebihkan derajat orang-orang yang berjihad dengan harta dan jiwanya atas orang-orang yang duduk (tidak ikut berperang tanpa uzur). Kepada masing-masing, Allah menjanjikan (pahala) yang terbaik (surga), (tetapi) Allah melebihkan orang-orang yang berjihad atas orang-orang yang duduk dengan pahala yang besar."
  },
  {
    "ayat": 96,
    "arabic": "دَرَجٰتٍ مِّنْهُ وَمَغْفِرَةً وَّرَحْمَةً ۗوَكَانَ اللّٰهُ غَفُوْرًا رَّحِيْمًا ࣖ",
    "transliteration_en": "Darajaatim minhu wa maghfiratanw wa rahmah; wa kaanal laahu Ghafoorar Raheema",
    "transliteration_id": "Darajātim minhu wa magfirataw wa raḥmah(tan), wa kānallāhu  gafūrar raḥīmā(n).",
    "translation_en": "Degrees [of high position] from Him and forgiveness and mercy. And Allah is ever Forgiving and Merciful.",
    "translation_id": "(Yaitu,) beberapa derajat dari-Nya, serta ampunan dan rahmat. Allah Maha Pengampun lagi Maha Penyayang."
  },
  {
    "ayat": 97,
    "arabic": "اِنَّ الَّذِيْنَ تَوَفّٰىهُمُ الْمَلٰۤىِٕكَةُ ظَالِمِيْٓ اَنْفُسِهِمْ قَالُوْا فِيْمَ كُنْتُمْ ۗ قَالُوْا كُنَّا مُسْتَضْعَفِيْنَ فِى الْاَرْضِۗ  قَالُوْٓا اَلَمْ تَكُنْ اَرْضُ اللّٰهِ وَاسِعَةً فَتُهَاجِرُوْا فِيْهَا ۗ فَاُولٰۤىِٕكَ مَأْوٰىهُمْ جَهَنَّمُ ۗ وَسَاۤءَتْ مَصِيْرًاۙ",
    "transliteration_en": "Innal lazeena tawaffaa humul malaaa'ikatu zaalimeee anfusihim qaaloo feema kuntum qaaloo kunnaa mustad'afeena fil-ard; qaalooo alam takun ardul laahi waasi'atan fatuhaajiroo feehaa; fa ulaaa'ika maawaahum Jahannamu wa saaa'at maseeraa",
    "transliteration_id": "Innal-lażīna tawaffāhumul-malā'ikatu ẓālimī anfusihim qālū fīma kuntum, qālū kunnā mustaḍ‘afīna fil-arḍ(i), qālū alam takun arḍullāhi wāsi‘atan fa tuhājirū fīhā, fa ulā'ika ma'wāhum jahannam(u), wa sā'at maṣīrā(n).",
    "translation_en": "Indeed, those whom the angels take [in death] while wronging themselves - [the angels] will say, \"In what [condition] were you?\" They will say, \"We were oppressed in the land.\" The angels will say, \"Was not the earth of Allah spacious [enough] for you to emigrate therein?\" For those, their refuge is Hell - and evil it is as a destination.",
    "translation_id": "Sesungguhnya orang-orang yang dicabut nyawanya oleh malaikat dalam keadaan menzalimi dirinya, mereka (malaikat) bertanya, “Bagaimana kamu ini?” Mereka menjawab, “Kami adalah orang-orang yang tertindas di bumi (Makkah).” Mereka (malaikat) bertanya, “Bukankah bumi Allah itu luas sehingga kamu dapat berhijrah di sana?” Maka, tempat mereka itu (neraka) Jahanam dan itu seburuk-buruk tempat kembali."
  },
  {
    "ayat": 98,
    "arabic": "اِلَّا الْمُسْتَضْعَفِيْنَ مِنَ الرِّجَالِ وَالنِّسَاۤءِ وَالْوِلْدَانِ لَا يَسْتَطِيْعُوْنَ حِيْلَةً وَّلَا يَهْتَدُوْنَ سَبِيْلًاۙ",
    "transliteration_en": "Illal mustad 'afeena minar rijaali wannisaaa'i walwildaani laa yastatee'oona heelatanw wa laa yahtadoona sabeela",
    "transliteration_id": "Illal-mustaḍ‘afīna minar-rijāli wan-nisā'i wal-wildāni lā yastaṭī‘ūna ḥīlataw wa lā yahtadūna sabīlā(n).",
    "translation_en": "Except for the oppressed among men, women and children who cannot devise a plan nor are they directed to a way -",
    "translation_id": "Kecuali, mereka yang tertindas dari (kalangan) laki-laki, perempuan, dan anak-anak yang tidak berdaya dan tidak mengetahui jalan (untuk berhijrah)."
  },
  {
    "ayat": 99,
    "arabic": "فَاُولٰۤىِٕكَ عَسَى اللّٰهُ اَنْ يَّعْفُوَ عَنْهُمْ ۗ وَكَانَ اللّٰهُ عَفُوًّا غَفُوْرًا",
    "transliteration_en": "Fa ulaaa'ika 'asal laahu ai ya'fuwa 'anhum; wa kaanal laahu 'Afuwwan Ghafooraa",
    "transliteration_id": "Fa ulā'ika ‘asallāhu ay ya‘fuwa ‘anhum, wa kānallāhu  ‘afuwwan gafūrā(n).",
    "translation_en": "For those it is expected that Allah will pardon them, and Allah is ever Pardoning and Forgiving.",
    "translation_id": "Mereka itu, mudah-mudahan Allah memaafkannya. Allah Maha Pemaaf lagi Maha Pengampun."
  },
  {
    "ayat": 100,
    "arabic": "۞ وَمَنْ يُّهَاجِرْ فِيْ سَبِيْلِ اللّٰهِ يَجِدْ فِى الْاَرْضِ مُرٰغَمًا كَثِيْرًا وَّسَعَةً ۗوَمَنْ يَّخْرُجْ مِنْۢ بَيْتِهٖ مُهَاجِرًا اِلَى اللّٰهِ وَرَسُوْلِهٖ ثُمَّ يُدْرِكْهُ الْمَوْتُ فَقَدْ وَقَعَ اَجْرُهٗ عَلَى اللّٰهِ ۗوَكَانَ اللّٰهُ غَفُوْرًا رَّحِيْمًا ࣖ",
    "transliteration_en": "Wa mai yuhaajir fee sabeelil laahi yajid fil ardi mmuraaghaman kaseeranw wa sa'ah; wa mai yakhruj mim baitihee muhaajiran ilal laahi wa Rasoolihee summa yudrikhul mawtu faqad waqa'a ajruhoo 'alal laah; wa kaanal laahu Ghafoorar Raheemaa",
    "transliteration_id": "Wa may yuhājir fī sabīlillāhi yajid fil-arḍi murāgaman kaṡīraw wa sa‘ah(tan), wa may yakhruj mim baitihī muhājiran ilallāhi wa rasūlihī ṡumma yudrik-hul-mautu faqad waqa‘a ajruhū ‘alallāh(i), wa kānallāhu  gafūrar raḥīmā(n).",
    "translation_en": "And whoever emigrates for the cause of Allah will find on the earth many [alternative] locations and abundance. And whoever leaves his home as an emigrant to Allah and His Messenger and then death overtakes him - his reward has already become incumbent upon Allah. And Allah is ever Forgiving and Merciful.",
    "translation_id": "Siapa yang berhijrah di jalan Allah niscaya akan mendapatkan di bumi ini tempat hijrah yang banyak dan kelapangan (rezeki dan hidup). Siapa yang keluar dari rumahnya untuk berhijrah karena Allah dan Rasul-Nya, kemudian meninggal (sebelum sampai ke tempat tujuan), sungguh, pahalanya telah ditetapkan di sisi Allah. Allah Maha Pengampun lagi Maha Penyayang."
  }
]