[
  {
    "ayat": 101,
    "arabic": "وَاِذَا ضَرَبْتُمْ فِى الْاَرْضِ فَلَيْسَ عَلَيْكُمْ جُنَاحٌ اَنْ تَقْصُرُوْا مِنَ الصَّلٰوةِ ۖ اِنْ خِفْتُمْ اَنْ يَّفْتِنَكُمُ الَّذِيْنَ كَفَرُوْاۗ اِنَّ الْكٰفِرِيْنَ كَانُوْا لَكُمْ عَدُوًّا مُّبِيْنًا",
    "transliteration_en": "Wa izaa darabtum fil ardi falaisa 'alaikum junaahun an taqsuroo minas Salaati in khiftum ai yaftinakumul lazeena kafarooo; innal kaafireena kaanoo lakum aduwwam mubeenaa",
    "transliteration_id": "Wa iżā ḍarabtum fil-arḍi fa laisa ‘alaikum junāḥun an taqṣurū minaṣ-ṣalāh(ti), in khiftum ay yaftinakumul-lażīna kafarū, innal-kāfirīna kānū lakum ‘aduwwam mubīnā(n).",
    "translation_en": "And when you travel throughout the land, there is no blame upon you for shortening the prayer, [especially] if you fear that those who disbelieve may disrupt [or attack] you. Indeed, the disbelievers are ever to you a clear enemy.",
    "translation_id": "Apabila kamu bepergian di bumi, maka tidak dosa bagimu untuk mengqasar salat jika kamu takut diserang orang-orang yang kufur. Sesungguhnya orang-orang kafir itu adalah musuh yang nyata bagimu."
  },
  {
    "ayat": 102,
    "arabic": "وَاِذَا كُنْتَ فِيْهِمْ فَاَقَمْتَ لَهُمُ الصَّلٰوةَ فَلْتَقُمْ طَاۤىِٕفَةٌ مِّنْهُمْ مَّعَكَ وَلْيَأْخُذُوْٓا اَسْلِحَتَهُمْ ۗ فَاِذَا سَجَدُوْا فَلْيَكُوْنُوْا مِنْ وَّرَاۤىِٕكُمْۖ  وَلْتَأْتِ طَاۤىِٕفَةٌ اُخْرٰى لَمْ يُصَلُّوْا فَلْيُصَلُّوْا مَعَكَ وَلْيَأْخُذُوْا حِذْرَهُمْ وَاَسْلِحَتَهُمْ ۚ وَدَّ الَّذِيْنَ كَفَرُوْا لَوْ تَغْفُلُوْنَ عَنْ اَسْلِحَتِكُمْ وَاَمْتِعَتِكُمْ فَيَمِيْلُوْنَ عَلَيْكُمْ مَّيْلَةً وَّاحِدَةً  ۗوَلَا جُنَاحَ عَلَيْكُمْ اِنْ كَانَ بِكُمْ اَذًى مِّنْ مَّطَرٍ اَوْ كُنْتُمْ مَّرْضٰٓى اَنْ تَضَعُوْٓا اَسْلِحَتَكُمْ وَخُذُوْا حِذْرَكُمْ ۗ اِنَّ اللّٰهَ اَعَدَّ لِلْكٰفِرِيْنَ عَذَابًا مُّهِيْنًا",
    "transliteration_en": "Wa izaa kunta feehim fa aqamta lahumus Salaata faltaqum taaa'ifatum minhum ma'aka walyaakhuzooo aslihatahum fa izaa sajadoo fal yakoonoo minw waraaa'ikum waltaati taaa'ifatun ukhraa lam yusalloo falyusallo ma'aka walyaakhuzoo hizrahum wa aslihatahum; waddal lazeena kafaroo law taghfuloona 'anaslihatikum wa amti'atikum fa yameeloona 'alaikum mailatanw waahidah; wa laa junaaha 'alaikum in kaana bikum azam mimmatarin aw kuntum mmardaaa an tada'ooo aslihatakum wa khuzoo hizrakum; innal laaha a'adda lilkaafireena 'azaabam muheenaa",
    "transliteration_id": "Wa iżā kunta fīhim fa aqamta lahumuṣ-ṣalāta faltaqum ṭā'ifatum minhum ma‘aka walya'khużū asliḥatahum, fa iżā sajadū falyakūnū miw warā'ikum, walta'ti ṭā'ifatun ukhrā lam yuṣallū falyuṣallū ma‘aka walya'khużū ḥiżrahum wa asliḥatahum, waddal-lażīna kafarū lau tagfulūna ‘an asliḥatakum wa amti‘atikum, fa yamīlūna ‘alaikum mailataw wāḥidah(tan), wa lā junāḥa ‘alaikum in kāna bikum ażam mim maṭarin au kuntum marḍā an taḍa‘ū asliḥatakum wa khużū ḥiżrakum, innallāha a‘adda lil-kāfirīna ‘ażābam muhīnā(n).",
    "translation_en": "And when you are among them and lead them in prayer, let a group of them stand [in prayer] with you and let them carry their arms. And when they have prostrated, let them be [in position] behind you and have the other group come forward which has not [yet] prayed and let them pray with you, taking precaution and carrying their arms. Those who disbelieve wish that you would neglect your weapons and your baggage so they could come down upon you in one [single] attack. But there is no blame upon you, if you are troubled by rain or are ill, for putting down your arms, but take precaution. Indeed, Allah has prepared for the disbelievers a humiliating punishment.",
    "translation_id": "Apabila engkau (Nabi Muhammad) berada di tengah-tengah mereka (sahabatmu dan dalam keadaan takut diserang), lalu engkau hendak melaksanakan salat bersama mereka, hendaklah segolongan dari mereka berdiri (salat) bersamamu dengan menyandang senjatanya. Apabila mereka (yang salat bersamamu) telah sujud (menyempurnakan satu rakaat), hendaklah mereka pindah dari belakangmu (untuk menghadapi musuh). Lalu, hendaklah datang golongan lain yang belum salat agar mereka salat bersamamu dan hendaklah mereka bersiap siaga dengan menyandang senjatanya. Orang-orang yang kufur ingin agar kamu lengah terhadap senjata dan harta bendamu, lalu mereka menyerbumu secara tiba-tiba. Tidak ada dosa bagimu meletakkan senjata jika kamu mendapat suatu kesusahan, baik karena hujan maupun karena sakit dan bersiap siagalah kamu. Sesungguhnya Allah telah menyediakan azab yang menghinakan bagi orang-orang kafir."
  },
  {
    "ayat": 103,
    "arabic": "فَاِذَا قَضَيْتُمُ الصَّلٰوةَ فَاذْكُرُوا اللّٰهَ قِيَامًا وَّقُعُوْدًا وَّعَلٰى جُنُوْبِكُمْ ۚ فَاِذَا اطْمَأْنَنْتُمْ فَاَقِيْمُوا الصَّلٰوةَ ۚ اِنَّ الصَّلٰوةَ كَانَتْ عَلَى الْمُؤْمِنِيْنَ كِتٰبًا مَّوْقُوْتًا",
    "transliteration_en": "Fa izaa qadaitumus Salaata fazkurul laaha qiyaamanw wa qu'oodanw wa 'alaa junoobikum; fa izat maanantum fa aqeemus Salaah; innas Salaata kaanat 'alal mu'mineena kitaabam mawqootaa",
    "transliteration_id": "Fa iżā qaḍaitumuṣ-ṣalāta fażkurullāha qiyāmaw wa qu‘ūdaw wa ‘alā junūbikum, fa iżaṭma'nantum fa aqīmuṣ-ṣalāh(ta),  innaṣ-ṣalāta kānat ‘alal-mu'minīna kitābam mauqūtā(n).",
    "translation_en": "And when you have completed the prayer, remember Allah standing, sitting, or [lying] on your sides. But when you become secure, re-establish [regular] prayer. Indeed, prayer has been decreed upon the believers a decree of specified times.",
    "translation_id": "Apabila kamu telah menyelesaikan salat, berzikirlah kepada Allah (mengingat dan menyebut-Nya), baik ketika kamu berdiri, duduk, maupun berbaring. Apabila kamu telah merasa aman, laksanakanlah salat itu (dengan sempurna). Sesungguhnya salat itu merupakan kewajiban yang waktunya telah ditentukan atas orang-orang mukmin."
  },
  {
    "ayat": 104,
    "arabic": "وَلَا تَهِنُوْا فِى ابْتِغَاۤءِ الْقَوْمِ ۗ اِنْ تَكُوْنُوْا تَأْلَمُوْنَ فَاِنَّهُمْ يَأْلَمُوْنَ كَمَا تَأْلَمُوْنَ ۚوَتَرْجُوْنَ مِنَ اللّٰهِ مَا لَا يَرْجُوْنَ ۗوَكَانَ اللّٰهُ عَلِيْمًا حَكِيْمًا ࣖ",
    "transliteration_en": "Wa laa tahinoo fibtighaaa'il qawmi in takoonoo taalamoona fa innahum yaalamoona kamaa taalamoona wa tarjoona minal laahi maa laa yarjoon; wa kaanal laahu 'Aleeman Hakeemaa",
    "transliteration_id": "Wa lā tahinū fibtigā'il-qaum(i), in takūnū ta'lamūna fa innahum ya'lamūna kamā ta'lamūn(a), wa tarjūna minallāhi mā lā yarjūn(a), wa kānallāhu  ‘alīman ḥakīmā(n).",
    "translation_en": "And do not weaken in pursuit of the enemy. If you should be suffering - so are they suffering as you are suffering, but you expect from Allah that which they expect not. And Allah is ever Knowing and Wise.",
    "translation_id": "Janganlah kamu merasa lemah dalam mengejar kaum itu (musuhmu). Jika kamu menderita kesakitan, sesungguhnya mereka pun menderita kesakitan sebagaimana yang kamu rasakan. (Bahkan) kamu dapat mengharapkan dari Allah apa yang tidak dapat mereka harapkan. Allah Maha Mengetahui lagi Maha Bijaksana."
  },
  {
    "ayat": 105,
    "arabic": "اِنَّآ اَنْزَلْنَآ اِلَيْكَ الْكِتٰبَ بِالْحَقِّ لِتَحْكُمَ بَيْنَ النَّاسِ بِمَآ اَرٰىكَ اللّٰهُ ۗوَلَا تَكُنْ لِّلْخَاۤىِٕنِيْنَ خَصِيْمًا ۙ",
    "transliteration_en": "Innaaa anzalnaaa ilaikal Kitaaba bilhaqqi litahkuma bainan naasi bimaaa araakal laah; wa laa takul lilkhaaa'ineena khaseemaa",
    "transliteration_id": "Innā anzalnā ilaikal-kitāba bil-ḥaqqi litaḥkuma bainan-nāsi bimā arākallāh(u), wa lā takun lil-khā'inīna khaṣīmā(n).",
    "translation_en": "Indeed, We have revealed to you, [O Muhammad], the Book in truth so you may judge between the people by that which Allah has shown you. And do not be for the deceitful an advocate.",
    "translation_id": "Sesungguhnya Kami telah menurunkan Kitab (Al-Qur’an) kepadamu (Nabi Muhammad) dengan hak agar kamu memutuskan (perkara) di antara manusia dengan apa yang telah Allah ajarkan kepadamu. Janganlah engkau menjadi penentang (orang yang tidak bersalah) karena (membela) para pengkhianat."
  },
  {
    "ayat": 106,
    "arabic": "وَّاسْتَغْفِرِ اللّٰهَ ۗاِنَّ اللّٰهَ كَانَ غَفُوْرًا رَّحِيْمًاۚ",
    "transliteration_en": "Wastaghfiril laaha innal laaha kaana Ghafoorar Raheema",
    "transliteration_id": "Wastagfirillāh(a), innallāha kāna gafūrar raḥīmā(n).",
    "translation_en": "And seek forgiveness of Allah. Indeed, Allah is ever Forgiving and Merciful.",
    "translation_id": "Mohonlah ampunan kepada Allah. Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang."
  },
  {
    "ayat": 107,
    "arabic": "وَلَا تُجَادِلْ عَنِ الَّذِيْنَ يَخْتَانُوْنَ اَنْفُسَهُمْ ۗ اِنَّ اللّٰهَ لَا يُحِبُّ مَنْ كَانَ خَوَّانًا اَثِيْمًاۙ",
    "transliteration_en": "Wa laa tujaadil 'anil lazeena yakhtaanoona anfusahum; innal laaha laa yuhibbuman kaana khawwaanan aseemaa",
    "transliteration_id": "Wa lā tujādil ‘anil-lażīna yakhtānūna anfusahum, innallāha lā yuḥibbu man kāna khawwānan aṡīmā(n).",
    "translation_en": "And do not argue on behalf of those who deceive themselves. Indeed, Allah loves not one who is a habitually sinful deceiver.",
    "translation_id": "Janganlah engkau (Nabi Muhammad) berdebat untuk (membela) orang-orang yang mengkhianati dirinya. Sesungguhnya Allah tidak menyukai orang-orang yang selalu berkhianat dan bergelimang dosa."
  },
  {
    "ayat": 108,
    "arabic": "يَّسْتَخْفُوْنَ مِنَ النَّاسِ وَلَا يَسْتَخْفُوْنَ مِنَ اللّٰهِ وَهُوَ مَعَهُمْ اِذْ يُبَيِّتُوْنَ مَا لَا يَرْضٰى مِنَ الْقَوْلِ ۗ وَكَانَ اللّٰهُ بِمَا يَعْمَلُوْنَ مُحِيْطًا",
    "transliteration_en": "Yastakhfoona minannaasi wa laa yastakh foona minal laahi wa huwa ma'ahum iz yubaiyitoona maa laa yardaa minal qawl; wa kaanal laahu bimaa ya'maloona muheetaa",
    "transliteration_id": "Yastakhfūna minan-nāsi wa lā yastakhfūna minallāhi wa huwa ma‘ahum iż yubayyitūna mā lā yarḍā minal-qaul(i), wa kānallāhu bimā ya‘malūna muḥīṭā(n).",
    "translation_en": "They conceal [their evil intentions and deeds] from the people, but they cannot conceal [them] from Allah, and He is with them [in His knowledge] when they spend the night in such as He does not accept of speech. And ever is Allah, of what they do, encompassing.",
    "translation_id": "Mereka dapat bersembunyi dari manusia, tetapi tidak dapat bersembunyi dari Allah. Dia bersama (mengawasi) mereka ketika pada malam hari mereka menetapkan keputusan rahasia yang tidak diridai-Nya. Allah Maha Meliputi apa yang mereka kerjakan."
  },
  {
    "ayat": 109,
    "arabic": "هٰٓاَنْتُمْ هٰٓؤُلَاۤءِ جَادَلْتُمْ عَنْهُمْ فِى الْحَيٰوةِ الدُّنْيَاۗ فَمَنْ يُّجَادِلُ اللّٰهَ عَنْهُمْ يَوْمَ الْقِيٰمَةِ اَمْ مَّنْ يَّكُوْنُ عَلَيْهِمْ وَكِيْلًا",
    "transliteration_en": "haaa antum haaa'ulaaa'i jaadaltum 'anhum fil hayaatid dunyaa famai yujaadilul laaha 'anhum Yawmal Qiyaamati am mai yakoonu 'alaihim wakeelaa",
    "transliteration_id": "Hā'antum hā'ulā'i jādaltum ‘anhum fil-ḥayātid-dun-yā, famay yujādilullāha ‘anhum yaumal-qiyāmati am may yakūnu ‘alaihim wakīlā(n).",
    "translation_en": "Here you are - those who argue on their behalf in [this] worldly life - but who will argue with Allah for them on the Day of Resurrection, or who will [then] be their representative?",
    "translation_id": "Begitulah kamu. Kamu berdebat untuk (membela) mereka dalam kehidupan dunia ini. Akan tetapi, siapa yang akan menentang Allah untuk (membela) mereka pada hari Kiamat? Atau, siapakah yang menjadi pelindung mereka (dari azab Allah)?"
  },
  {
    "ayat": 110,
    "arabic": "وَمَنْ يَّعْمَلْ سُوْۤءًا اَوْ يَظْلِمْ نَفْسَهٗ ثُمَّ يَسْتَغْفِرِ اللّٰهَ يَجِدِ اللّٰهَ غَفُوْرًا رَّحِيْمًا",
    "transliteration_en": "Wa mai ya'mal sooo'an aw yazlim nafsahoo summa yastaghfiril laaha yajidil laaha Ghafoorar Raheemaa",
    "transliteration_id": "Wa may ya‘mal sū'an au yaẓlim nafsahū ṡumma yastagfirillāha yajidillāha gafūrar raḥīmā(n).",
    "translation_en": "And whoever does a wrong or wrongs himself but then seeks forgiveness of Allah will find Allah Forgiving and Merciful.",
    "translation_id": "Siapa yang berbuat kejahatan atau menganiaya dirinya, kemudian memohon ampunan kepada Allah, niscaya akan mendapati Allah Maha Pengampun lagi Maha Penyayang."
  },
  {
    "ayat": 111,
    "arabic": "وَمَنْ يَّكْسِبْ اِثْمًا فَاِنَّمَا يَكْسِبُهٗ عَلٰى نَفْسِهٖ ۗ وَكَانَ اللّٰهُ عَلِيْمًا حَكِيْمًا",
    "transliteration_en": "Wa mai yaksib isman fa innamaa yaksibuhoo 'alaa nafsih; wa kaanal laahu 'Aleeman hakeemaa",
    "transliteration_id": "Wa may yaksib iṡman fa innamā yaksibuhū ‘alā nafsih(ī),wa kānallāhu ‘alīman ḥakīmā(n).",
    "translation_en": "And whoever commits a sin only earns it against himself. And Allah is ever Knowing and Wise.",
    "translation_id": "Siapa yang berbuat dosa sesungguhnya dia mengerjakannya untuk merugikan dirinya sendiri. Allah Maha Mengetahui lagi Maha Bijaksana."
  },
  {
    "ayat": 112,
    "arabic": "وَمَنْ يَّكْسِبْ خَطِيْۤـَٔةً اَوْ اِثْمًا ثُمَّ يَرْمِ بِهٖ بَرِيْۤـًٔا فَقَدِ احْتَمَلَ بُهْتَانًا وَّاِثْمًا مُّبِيْنًا ࣖ",
    "transliteration_en": "Wa mai yaksib khateee'atan aw isman summa yarmi bihee bareee'an faqadih tamala buhtaananw wa ismam mubeenaa",
    "transliteration_id": "Wa may yaksib khaṭī'atan au iṡman ṡumma yarmi bihī barī'an fa qadiḥtamala buhtānaw wa iṡmam mubīnā(n).",
    "translation_en": "But whoever earns an offense or a sin and then blames it on an innocent [person] has taken upon himself a slander and manifest sin.",
    "translation_id": "Siapa yang berbuat kesalahan atau dosa, kemudian menuduhkannya kepada orang yang tidak bersalah, sungguh telah memikul suatu kebohongan dan dosa yang nyata."
  },
  {
    "ayat": 113,
    "arabic": "وَلَوْلَا فَضْلُ اللّٰهِ عَلَيْكَ وَرَحْمَتُهٗ لَهَمَّتْ طَّاۤىِٕفَةٌ مِّنْهُمْ اَنْ يُّضِلُّوْكَۗ وَمَا يُضِلُّوْنَ اِلَّآ اَنْفُسَهُمْ وَمَا يَضُرُّوْنَكَ مِنْ شَيْءٍ ۗ وَاَنْزَلَ اللّٰهُ عَلَيْكَ الْكِتٰبَ وَالْحِكْمَةَ وَعَلَّمَكَ مَا لَمْ تَكُنْ تَعْلَمُۗ وَكَانَ فَضْلُ اللّٰهِ عَلَيْكَ عَظِيْمًا",
    "transliteration_en": "Wa law laa fadlul laahi 'alaika wa rahmatuhoo lahammat taaa'ifatum minhum ai yudillooka wa maa yudilloona illaaa anfusahum wa maa yadurroonaka min shai'; wa anzalal laahu 'alaikal Kitaaba wal Hikmata wa 'allamaka maa lam takun ta'lam; wa kaana fadlul laahi 'alaika 'azeemaa",
    "transliteration_id": "Wa lau lā faḍlullāhi ‘alaika wa raḥmatuhū lahammaṭ-ṭā'ifatum minhum ay yuḍillūk(a), wa mā yuḍillūna illā anfusahum wa mā yaḍurrūnaka min syai'(in), wa anzalallāhu ‘alaikal-kitāba wal-ḥikmata wa ‘allamaka mā lam takun ta‘lam(u), wa kāna faḍlullāhi ‘alaika ‘aẓīmā(n).",
    "translation_en": "And if it was not for the favor of Allah upon you, [O Muhammad], and His mercy, a group of them would have determined to mislead you. But they do not mislead except themselves, and they will not harm you at all. And Allah has revealed to you the Book and wisdom and has taught you that which you did not know. And ever has the favor of Allah upon you been great.",
    "translation_id": "Kalau bukan karena karunia Allah dan rahmat-Nya kepadamu (Nabi Muhammad), tentu segolongan dari mereka berkeinginan keras untuk menyesatkanmu. Akan tetapi, mereka tidak menyesatkan, kecuali dirinya sendiri dan tidak membahayakanmu sedikit pun. Allah telah menurunkan Kitab (Al-Qur’an) dan hikmah (sunah) kepadamu serta telah mengajarkan kepadamu apa yang tadinya belum kamu ketahui. Karunia Allah yang dilimpahkan kepadamu itu sangat besar."
  },
  {
    "ayat": 114,
    "arabic": "۞ لَا خَيْرَ فِيْ كَثِيْرٍ مِّنْ نَّجْوٰىهُمْ اِلَّا مَنْ اَمَرَ بِصَدَقَةٍ اَوْ مَعْرُوْفٍ اَوْ اِصْلَاحٍۢ بَيْنَ النَّاسِۗ وَمَنْ يَّفْعَلْ ذٰلِكَ ابْتِغَاۤءَ مَرْضَاتِ اللّٰهِ فَسَوْفَ نُؤْتِيْهِ اَجْرًا عَظِيْمًا",
    "transliteration_en": "laa khaira fee kaseerim min najwaahum illaa man amara bisadaqatin aw ma'roofin aw islaahim bainan naas; wa mai yaf'al zaalikab tighaaa'a mardaatil laahi fa sawfa nu'teehi ajran 'azeemaa",
    "transliteration_id": "Lā khaira fī kaṡīrim min najwāhum illā man amara biṣadaqatin au ma‘rūfin au iṣlāḥim bainan-nās(i), wa may yaf‘al żālikabtigā'a marḍātillāhi fa saufa nu'tīhi ajran ‘aẓīmā(n).",
    "translation_en": "No good is there in much of their private conversation, except for those who enjoin charity or that which is right or conciliation between people. And whoever does that seeking means to the approval of Allah - then We are going to give him a great reward.",
    "translation_id": "Tidak ada kebaikan pada banyak pembicaraan rahasia mereka, kecuali (pada pembicaraan rahasia) orang yang menyuruh bersedekah, (berbuat) kebaikan, atau mengadakan perdamaian di antara manusia. Siapa yang berbuat demikian karena mencari rida Allah kelak Kami anugerahkan kepadanya pahala yang sangat besar."
  },
  {
    "ayat": 115,
    "arabic": "وَمَنْ يُّشَاقِقِ الرَّسُوْلَ مِنْۢ بَعْدِ مَا تَبَيَّنَ لَهُ الْهُدٰى وَيَتَّبِعْ غَيْرَ سَبِيْلِ الْمُؤْمِنِيْنَ نُوَلِّهٖ مَا تَوَلّٰى وَنُصْلِهٖ جَهَنَّمَۗ وَسَاۤءَتْ مَصِيْرًا ࣖ",
    "transliteration_en": "Wa mai yushaaqiqir Rasoola mim ba'di maa tabaiyana lahul hudaa wa tattabi' ghaira sabeelil mu'mineena nuwallihee ma tawallaa wa nuslihee Jahannama wa saaa'at maseeraa",
    "transliteration_id": "Wa may yusyāqiqir-rasūla mim ba‘di mā tabayyana lahul-hudā wa yattabi‘ gaira sabīlil-mu'minīna nuwallihī mā tawallā wa nuṣlihī jahannam(a), wa sā'at maṣīrā(n).",
    "translation_en": "And whoever opposes the Messenger after guidance has become clear to him and follows other than the way of the believers - We will give him what he has taken and drive him into Hell, and evil it is as a destination.",
    "translation_id": "Siapa yang menentang Rasul (Nabi Muhammad) setelah jelas kebenaran baginya dan mengikuti jalan yang bukan jalan orang-orang mukmin, Kami biarkan dalam kesesatannya dan akan Kami masukkan ke dalam (neraka) Jahanam. Itu seburuk-buruk tempat kembali."
  },
  {
    "ayat": 116,
    "arabic": "اِنَّ اللّٰهَ لَا يَغْفِرُ اَنْ يُّشْرَكَ بِهٖ وَيَغْفِرُ مَا دُوْنَ ذٰلِكَ لِمَنْ يَّشَاۤءُ ۗ وَمَنْ يُّشْرِكْ بِاللّٰهِ فَقَدْ ضَلَّ ضَلٰلًا ۢ بَعِيْدًا",
    "transliteration_en": "Innal laaha laa yaghfiru ai yushraka bihee wayaghfiru maa doona zaalika limai yashaaa'; wa mai yushrik billaahi faqad dalla dalaalam ba'eedaa",
    "transliteration_id": "Innallāha lā yagfiru ay yusyraka bihī wa yagfiru mā dūna żālika limay yasyā'(u), wa may yusyrik billāhi faqad ḍalla ḍalālam ba‘īdā(n).",
    "translation_en": "Indeed, Allah does not forgive association with Him, but He forgives what is less than that for whom He wills. And he who associates others with Allah has certainly gone far astray.",
    "translation_id": "Sesungguhnya Allah tidak akan mengampuni (dosa) karena mempersekutukan-Nya (syirik), tetapi Dia mengampuni apa (dosa) yang selain (syirik) itu bagi siapa yang Dia kehendaki. Siapa pun yang mempersekutukan Allah sungguh telah tersesat jauh."
  },
  {
    "ayat": 117,
    "arabic": "اِنْ يَّدْعُوْنَ مِنْ دُوْنِهٖٓ اِلَّآ اِنٰثًاۚ وَاِنْ يَّدْعُوْنَ اِلَّا شَيْطٰنًا مَّرِيْدًاۙ",
    "transliteration_en": "iny yad'oona min dooniheee illaaa inaasanw wa iny yad'oona illaa Shaitaanam mareedaa",
    "transliteration_id": "Iy yad‘ūna min dūnihī illā ināṡā(n), wa iy yad‘ūna illā syaiṭānam marīdā(n).",
    "translation_en": "They call upon instead of Him none but female [deities], and they [actually] call upon none but a rebellious Satan.",
    "translation_id": "Mereka tidak menyembah selain Dia, kecuali berhala dan mereka juga tidak menyembah, kecuali setan yang durhaka."
  },
  {
    "ayat": 118,
    "arabic": "لَّعَنَهُ اللّٰهُ ۘ وَقَالَ لَاَتَّخِذَنَّ مِنْ عِبَادِكَ نَصِيْبًا مَّفْرُوْضًاۙ",
    "transliteration_en": "La'anahul laah; wa qaala la attakhizanna min 'ibaadika naseebam mafroodaa",
    "transliteration_id": "La‘anahullāh(u), wa qāla la'attakhiżanna min ‘ibādika naṣībam mafrūḍā(n).",
    "translation_en": "Whom Allah has cursed. For he had said, \"I will surely take from among Your servants a specific portion.",
    "translation_id": "Allah melaknatnya. Dia (setan) berkata, “Aku benar-benar akan mengambil bagian tertentu dari hamba-hamba-Mu."
  },
  {
    "ayat": 119,
    "arabic": "وَّلَاُضِلَّنَّهُمْ وَلَاُمَنِّيَنَّهُمْ وَلَاٰمُرَنَّهُمْ فَلَيُبَتِّكُنَّ اٰذَانَ الْاَنْعَامِ وَلَاٰمُرَنَّهُمْ فَلَيُغَيِّرُنَّ خَلْقَ اللّٰهِ ۗوَمَنْ يَّتَّخِذِ الشَّيْطٰنَ وَلِيًّا مِّنْ دُوْنِ اللّٰهِ فَقَدْ خَسِرَ خُسْرَانًا مُّبِيْنًا",
    "transliteration_en": "Wa la udillannahum wa la umanni yannnahum wa la aamurannahum fala yubat tikunna aazaanal lan'aami wa la aamurannahum fala yughai yirunna khalqal laah; wa mai yattakhizish Shaitaana waliyyam mmin doonil laahi faqad khasira khusraanam mubeena",
    "transliteration_id": "Wa la'uḍillannahum wa la'umanniyannahum wa la'āmurannahum fa layubattikunna āżānal-an‘āmi wa la'āmurannahum fa layugayyirunna  khalqallāh(i), wa may yattakhiżisy-syaiṭāna waliyyam min dūnillāhi faqad khasira khusrānam mubīnā(n).",
    "translation_en": "And I will mislead them, and I will arouse in them [sinful] desires, and I will command them so they will slit the ears of cattle, and I will command them so they will change the creation of Allah.\" And whoever takes Satan as an ally instead of Allah has certainly sustained a clear loss.",
    "translation_id": "Aku benar-benar akan menyesatkan mereka, membangkitkan angan-angan kosong mereka, menyuruh mereka (untuk memotong telinga-telinga binatang ternaknya) hingga mereka benar-benar memotongnya, dan menyuruh mereka (mengubah ciptaan Allah) hingga benar-benar mengubahnya.” Siapa yang menjadikan setan sebagai pelindung selain Allah sungguh telah menderita kerugian yang nyata."
  },
  {
    "ayat": 120,
    "arabic": "يَعِدُهُمْ وَيُمَنِّيْهِمْۗ وَمَا يَعِدُهُمُ الشَّيْطٰنُ اِلَّا غُرُوْرًا",
    "transliteration_en": "Ya'iduhum wa yuman neehim wa maa ya'iduhumush Shaitaanu illaa ghurooraa",
    "transliteration_id": "Ya‘iduhum wa yumannīhim, wa mā ya‘iduhumusy-syaiṭānu illā gurūrā(n).",
    "translation_en": "Satan promises them and arouses desire in them. But Satan does not promise them except delusion.",
    "translation_id": "(Setan) memberikan janji-janji kepada mereka dan membangkitkan angan-angan kosong mereka. Padahal, setan tidak menjanjikan kepada mereka, kecuali tipuan belaka."
  },
  {
    "ayat": 121,
    "arabic": "اُولٰۤىِٕكَ مَأْوٰىهُمْ جَهَنَّمُۖ وَلَا يَجِدُوْنَ عَنْهَا مَحِيْصًا",
    "transliteration_en": "Ulaaa'ika maawaahum Jahannamu wa laa yajidoona 'anhaa maheesaa",
    "transliteration_id": "Ulā'ika ma'wāhum jahannam(u), wa lā yajidūna ‘anhā maḥīṣā(n).",
    "translation_en": "The refuge of those will be Hell, and they will not find from it an escape.",
    "translation_id": "Mereka (yang tertipu) itu tempatnya di (neraka) Jahanam dan tidak akan menemukan tempat (lain untuk) lari darinya."
  },
  {
    "ayat": 122,
    "arabic": "وَالَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ سَنُدْخِلُهُمْ جَنّٰتٍ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُ خٰلِدِيْنَ فِيْهَآ اَبَدًاۗ وَعْدَ اللّٰهِ حَقًّا ۗوَمَنْ اَصْدَقُ مِنَ اللّٰهِ قِيْلًا",
    "transliteration_en": "Wallazeena aamanoo wa 'amilus saalihaati sanud khiluhum Jannaatin tajree min tahtihal anhaaru khaalideena feehaaa abadaa; wa'dal laahi haqqaa; wa man asdaqu minal laahi qeelaa",
    "transliteration_id": "Wal-lażīna āmanū wa ‘amiluṣ-ṣāliḥāti sanudkhiluhum jannātin tajrī min taḥtihal-anhāru khālidīna fīhā abadā(n), wa‘dallāhi ḥaqqā(n), wa man aṣdaqu minallāhi qīlā(n).",
    "translation_en": "But the ones who believe and do righteous deeds - We will admit them to gardens beneath which rivers flow, wherein they will abide forever. [It is] the promise of Allah, [which is] truth, and who is more truthful than Allah in statement.",
    "translation_id": "Orang-orang yang beriman dan beramal saleh akan Kami masukkan ke dalam surga yang mengalir di bawahnya sungai-sungai. Mereka kekal di dalamnya selama-lamanya. Janji Allah itu benar. Siapakah yang lebih benar perkataannya daripada Allah?"
  },
  {
    "ayat": 123,
    "arabic": "لَيْسَ بِاَمَانِيِّكُمْ وَلَآ اَمَانِيِّ اَهْلِ الْكِتٰبِ ۗ مَنْ يَّعْمَلْ سُوْۤءًا يُّجْزَ بِهٖۙ وَلَا يَجِدْ لَهٗ مِنْ دُوْنِ اللّٰهِ وَلِيًّا وَّلَا نَصِيْرًا",
    "transliteration_en": "Laisa bi amaaniyyikum wa laaa amaaniyyi Ahlil Kitaab; mai ya'mal sooo'ai yujza bihee wa laa yajid lahoo min doonil laahi waliyanw wa laa naseeraa",
    "transliteration_id": "Laisa bi'amāniyyikum wa lā amāniyyi ahlil-kitāb(i), may ya‘mal sū'ay yujza bih(ī), wa lā yajid lahū min dūnillāhi waliyyaw wa lā naṣīrā(n).",
    "translation_en": "Paradise is not [obtained] by your wishful thinking nor by that of the People of the Scripture. Whoever does a wrong will be recompensed for it, and he will not find besides Allah a protector or a helper.",
    "translation_id": "(Pahala dari Allah) bukanlah (menurut) angan-anganmu dan bukan (pula menurut) angan-angan Ahlulkitab. Siapa yang mengerjakan kejahatan niscaya akan dibalas sesuai dengan (kejahatan itu) dan dia tidak akan menemukan untuknya pelindung serta penolong selain Allah."
  },
  {
    "ayat": 124,
    "arabic": "وَمَنْ يَّعْمَلْ مِنَ الصّٰلِحٰتِ مِنْ ذَكَرٍ اَوْ اُنْثٰى وَهُوَ مُؤْمِنٌ فَاُولٰۤىِٕكَ يَدْخُلُوْنَ الْجَنَّةَ وَلَا يُظْلَمُوْنَ نَقِيْرًا",
    "transliteration_en": "Wa mai ya'mal minas saalihaati min zakarin aw unsaa wa huwa mu'minun fa ulaaa'ika yadkhuloonal Jannata wa laa yuzlamoona naqeeraa",
    "transliteration_id": "Wa may ya‘mal minaṣ-ṣāliḥāti min żakarin au unṡā wa huwa mu'minun fa ulā'ika yadkhulūnal-jannata wa lā yuẓlamūna naqīrā(n).",
    "translation_en": "And whoever does righteous deeds, whether male or female, while being a believer - those will enter Paradise and will not be wronged, [even as much as] the speck on a date seed.",
    "translation_id": "Siapa yang beramal saleh, baik laki-laki maupun perempuan, sedangkan dia beriman, akan masuk ke dalam surga dan tidak dizalimi sedikit pun."
  },
  {
    "ayat": 125,
    "arabic": "وَمَنْ اَحْسَنُ دِيْنًا مِّمَّنْ اَسْلَمَ وَجْهَهٗ لِلّٰهِ وَهُوَ مُحْسِنٌ وَّاتَّبَعَ مِلَّةَ اِبْرٰهِيْمَ حَنِيْفًا ۗوَاتَّخَذَ اللّٰهُ اِبْرٰهِيْمَ خَلِيْلًا",
    "transliteration_en": "Wa man ahsanu deenam mimmman aslama wajhahoo lillaahi wa huwa muhsinunw wattaba'a Millata Ibraaheema haneefaa; wattakhazal laahu Ibraaheema khaleelaa",
    "transliteration_id": "Wa man aḥsanu dīnam mimman aslama wajhahū lillāhi wa huwa muḥsinuw wattaba‘a millata ibrāhīma ḥanīfā(n), wattakhażallāhu ibrāhīma khalīlā(n).",
    "translation_en": "And who is better in religion than one who submits himself to Allah while being a doer of good and follows the religion of Abraham, inclining toward truth? And Allah took Abraham as an intimate friend.",
    "translation_id": "Siapakah yang lebih baik agamanya daripada orang yang memasrahkan dirinya kepada Allah, sedangkan dia muhsin (orang yang berbuat kebaikan) dan mengikuti agama Ibrahim yang hanif? Allah telah menjadikan Ibrahim sebagai kekasih(-Nya)."
  },
  {
    "ayat": 126,
    "arabic": "وَلِلّٰهِ مَا فِى السَّمٰوٰتِ وَمَا فِى الْاَرْضِۗ وَكَانَ اللّٰهُ بِكُلِّ شَيْءٍ مُّحِيْطًا ࣖ",
    "transliteration_en": "Wa lillaahi maa fis samaawaati wa maa fil ard; wa kaanal laahu bikulli shai'im muheetaa",
    "transliteration_id": "Wa lillāhi mā fis-samāwāti wa mā fil-arḍ(i), wa kānallāhu bikulli syai'im muḥīṭā(n).",
    "translation_en": "And to Allah belongs whatever is in the heavens and whatever is on the earth. And ever is Allah, of all things, encompassing.",
    "translation_id": "Hanya milik Allah apa yang ada di langit dan apa yang ada di bumi. Allah Maha Meliputi segala sesuatu."
  },
  {
    "ayat": 127,
    "arabic": "وَيَسْتَفْتُوْنَكَ فِى النِّسَاۤءِۗ  قُلِ اللّٰهُ يُفْتِيْكُمْ فِيْهِنَّ ۙوَمَا يُتْلٰى عَلَيْكُمْ فِى الْكِتٰبِ فِيْ يَتٰمَى النِّسَاۤءِ الّٰتِيْ لَا تُؤْتُوْنَهُنَّ مَا كُتِبَ لَهُنَّ وَتَرْغَبُوْنَ اَنْ تَنْكِحُوْهُنَّ وَالْمُسْتَضْعَفِيْنَ مِنَ الْوِلْدَانِۙ وَاَنْ تَقُوْمُوْا لِلْيَتٰمٰى بِالْقِسْطِ ۗوَمَا تَفْعَلُوْا مِنْ خَيْرٍ فَاِنَّ اللّٰهَ كَانَ بِهٖ عَلِيْمًا",
    "transliteration_en": "Wa yastaftoonaka finnisaaa'i qulil laahu yufteekum feehinna wa maa yutlaa 'alaikum fil Kitaabi fee yataaman nisaaa'il laatee laa tu'toonahunna mmaa kutiba lahunnna wa targhaboona an tankihoohunna wal mustad'a feena minal wildaani wa an taqoomoo lilyataamaa bilqist; wa maa taf'aloo min khairin fa innal laaha kaana bihee 'Aleemaa",
    "transliteration_id": "Wa yastaftūnaka fin-nisā'(i), qulillāhu yuftīkum fīhinn(a), wa mā yutlā ‘alaikum fil-kitābi fī yatāman-nisā'il-lātī lā tu'tūnahunna mā kutiba  lahunna wa targabūna an tankiḥūhunna wal-mustaḍ‘afīna minal-wildān(i), wa an taqūmū lil-yatāmā bil-qisṭ(i), wa mā taf‘alū min khairin fa innallāha kāna bihī ‘alīmā(n).",
    "translation_en": "And they request from you, [O Muhammad], a [legal] ruling concerning women. Say, \"Allah gives you a ruling about them and [about] what has been recited to you in the Book concerning the orphan girls to whom you do not give what is decreed for them - and [yet] you desire to marry them - and concerning the oppressed among children and that you maintain for orphans [their rights] in justice.\" And whatever you do of good - indeed, Allah is ever Knowing of it.",
    "translation_id": "Mereka meminta fatwa kepada engkau (Nabi Muhammad) tentang perempuan. Katakanlah, “Allah memberi fatwa kepadamu tentang mereka, dan apa yang dibacakan kepadamu dalam Al-Qur’an tentang para perempuan yatim yang tidak kamu berikan sesuatu (maskawin) yang ditetapkan untuk mereka, sedangkan kamu ingin menikahi mereka, serta (tentang) anak-anak yang tidak berdaya. (Allah juga memberi fatwa kepadamu) untuk mengurus anak-anak yatim secara adil. Kebajikan apa pun yang kamu kerjakan, sesungguhnya Allah Maha Mengetahuinya."
  },
  {
    "ayat": 128,
    "arabic": "وَاِنِ امْرَاَةٌ خَافَتْ مِنْۢ بَعْلِهَا نُشُوْزًا اَوْ اِعْرَاضًا فَلَا جُنَاحَ عَلَيْهِمَآ اَنْ يُّصْلِحَا بَيْنَهُمَا صُلْحًا ۗوَالصُّلْحُ خَيْرٌ ۗوَاُحْضِرَتِ الْاَنْفُسُ الشُّحَّۗ وَاِنْ تُحْسِنُوْا وَتَتَّقُوْا فَاِنَّ اللّٰهَ كَانَ بِمَا تَعْمَلُوْنَ خَبِيْرًا",
    "transliteration_en": "Wa inimra atun khaafat mim ba'lihaa nushoozan aw i'raadan falaa junaaha 'alaihi maaa ai yuslihaa bainahumaa sulhaa; wassulhu khair; wa uhdiratil anfusush shuhh; wa in tuhsinoo wa tattaqoo fa innal laaha kaana bimaa ta'maloona Khabeeraa",
    "transliteration_id": "Wa inimra'atun khāfat mim ba‘lihā nusyūzan au i‘rāḍan falā junāḥa ‘alaihimā ay yuṣliḥā bainahumā ṣulḥā(n), waṣ-ṣulḥu khair(un), wa uḥḍiratil-anfususy-syuḥḥ(a), wa in tuḥsinū wa tattaqū fa innallāha kāna bimā ta‘malūna khabīrā(n).",
    "translation_en": "And if a woman fears from her husband contempt or evasion, there is no sin upon them if they make terms of settlement between them - and settlement is best. And present in [human] souls is stinginess. But if you do good and fear Allah - then indeed Allah is ever, with what you do, Acquainted.",
    "translation_id": "Jika seorang perempuan khawatir suaminya akan nusyuz atau bersikap tidak acuh, keduanya dapat mengadakan perdamaian yang sebenarnya. Perdamaian itu lebih baik (bagi mereka), walaupun manusia itu menurut tabiatnya kikir. Jika kamu berbuat kebaikan dan memelihara dirimu (dari nusyuz dan sikap tidak acuh) sesungguhnya Allah Maha Teliti terhadap apa yang kamu kerjakan."
  },
  {
    "ayat": 129,
    "arabic": "وَلَنْ تَسْتَطِيْعُوْٓا اَنْ تَعْدِلُوْا بَيْنَ النِّسَاۤءِ وَلَوْ حَرَصْتُمْ فَلَا تَمِيْلُوْا كُلَّ الْمَيْلِ فَتَذَرُوْهَا كَالْمُعَلَّقَةِ ۗوَاِنْ تُصْلِحُوْا وَتَتَّقُوْا فَاِنَّ اللّٰهَ كَانَ غَفُوْرًا رَّحِيْمًا",
    "transliteration_en": "Wa lan tastatee'ooo an ta'diloo bainan nisaaa'i wa law harastum falaa tameeloo kullal maili fatazaroohaa kalmu'al laqah; wa in tuslihoo wa tattaqoo fa innal laaha kaana Ghafoorar Raheema",
    "transliteration_id": "Wa lan tastaṭī‘ū an ta‘dilū bainan-nisā'i wa lau ḥaraṣtum falā tamīlū kullal-maili fa tażarūhā kal-mu‘allaqah(ti), wa in tuṣliḥū wa tattaqū fa innallāha kāna gafūrar raḥīmā(n).",
    "translation_en": "And you will never be able to be equal [in feeling] between wives, even if you should strive [to do so]. So do not incline completely [toward one] and leave another hanging. And if you amend [your affairs] and fear Allah - then indeed, Allah is ever Forgiving and Merciful.",
    "translation_id": "Kamu sekali-kali tidak akan dapat berlaku adil di antara istri-istri(-mu) walaupun kamu sangat ingin berbuat demikian. Oleh karena itu, janganlah kamu terlalu cenderung (kepada yang kamu cintai) sehingga kamu biarkan yang lain terkatung-katung. Jika kamu mengadakan islah (perbaikan) dan memelihara diri (dari kecurangan), sesungguhnya Allah Maha Pengampun lagi Maha Penyayang."
  },
  {
    "ayat": 130,
    "arabic": "وَاِنْ يَّتَفَرَّقَا يُغْنِ اللّٰهُ كُلًّا مِّنْ سَعَتِهٖۗ وَكَانَ اللّٰهُ وَاسِعًا حَكِيْمًا",
    "transliteration_en": "Wa iny-yatafarraqaa yughnil laahu kullam min sa'atih; wa kaanal laahu Waasi'an Hakeemaa",
    "transliteration_id": "Wa iy yatafarraqā yugnillāhu kullam min sa‘atih(ī), wa kānallāhu wāsi‘an ḥakīmā(n).",
    "translation_en": "But if they separate [by divorce], Allah will enrich each [of them] from His abundance. And ever is Allah Encompassing and Wise.",
    "translation_id": "Jika keduanya bercerai, Allah akan memberi kecukupan kepada masing-masing dari keluasan (karunia)-Nya. Allah Maha Luas (karunia-Nya) lagi Maha Bijaksana."
  },
  {
    "ayat": 131,
    "arabic": "وَلِلّٰهِ مَا فِى السَّمٰوٰتِ وَمَا فِى الْاَرْضِۗ وَلَقَدْ وَصَّيْنَا الَّذِيْنَ اُوْتُوا الْكِتٰبَ مِنْ قَبْلِكُمْ وَاِيَّاكُمْ اَنِ اتَّقُوا اللّٰهَ ۗوَاِنْ تَكْفُرُوْا فَاِنَّ لِلّٰهِ مَا فِى السَّمٰوٰتِ وَمَا فِى الْاَرْضِۗ وَكَانَ اللّٰهُ غَنِيًّا حَمِيْدًا",
    "transliteration_en": "Wa lillaahi maafis samaawaati wa maa fil ard; wa laqad wassainal lazeena ootul Kitaaba min qablikum wa iyyaakum anit taqul laah; wa intakfuroo fa inna lillaahi maa fis samaawaati wa maa fil ard; wa kaanal laahu Ghaniyyan hameedaa",
    "transliteration_id": "Wa lillāhi mā fis-samāwāti wa mā fil-arḍ(i), wa laqad waṣṣainal-lażīna ūtul-kitāba min qablikum wa iyyākum anittaqullāh(a), wa in takfurū fa inna lillāhi mā fis-samāwāti wa mā fil-arḍ(i), wa kānallāhu ganiyyan ḥamīdā(n).",
    "translation_en": "And to Allah belongs whatever is in the heavens and whatever is on the earth. And We have instructed those who were given the Scripture before you and yourselves to fear Allah. But if you disbelieve - then to Allah belongs whatever is in the heavens and whatever is on the earth. And ever is Allah Free of need and Praiseworthy.",
    "translation_id": "Hanya milik Allah apa yang ada di langit dan apa yang ada di bumi. Sungguh, Kami telah mewasiatkan kepada orang-orang yang diberi kitab suci sebelum kamu dan (juga) kepadamu (umat Islam) agar bertakwa kepada Allah. Akan tetapi, jika kamu kufur, maka sesungguhnya hanya milik Allah apa yang ada di langit dan apa yang ada di bumi. Allah Maha Kaya lagi Maha Terpuji."
  },
  {
    "ayat": 132,
    "arabic": "وَلِلّٰهِ مَا فِى السَّمٰوٰتِ وَمَا فِى الْاَرْضِ ۗوَكَفٰى بِاللّٰهِ وَكِيْلًا",
    "transliteration_en": "Wa lillaahi maa fis samaawaati wa maa fil ard; wa kafaa billaahi Wakeelaa",
    "transliteration_id": "Wa lillāhi mā fis-samāwāti wa mā fil-arḍ(i), wa kafā billāhi wakīlā(n).",
    "translation_en": "And to Allah belongs whatever is in the heavens and whatever is on the earth. And sufficient is Allah as Disposer of affairs.",
    "translation_id": "Hanya milik Allah apa yang ada di langit dan apa yang ada di bumi. Cukuplah Allah sebagai pemelihara."
  },
  {
    "ayat": 133,
    "arabic": "اِنْ يَّشَأْ يُذْهِبْكُمْ اَيُّهَا النَّاسُ وَيَأْتِ بِاٰخَرِيْنَۗ  وَكَانَ اللّٰهُ عَلٰى ذٰلِكَ قَدِيْرًا",
    "transliteration_en": "Iny-yashaa yuzhibkum aiyuhan naasu wa yaati bi aakhareen; wa kaanal laahu 'alaa zaalika Qadeeraa",
    "transliteration_id": "Iy yasya' yużhibkum ayyuhan-nāsu wa ya'ti bi'ākharīn(a), wa kānallāhu ‘alā żālika qadīrā(n).",
    "translation_en": "If He wills, He can do away with you, O people, and bring others [in your place]. And ever is Allah competent to do that.",
    "translation_id": "Jika Dia menghendaki, niscaya Dia musnahkan kamu semua wahai manusia, dan Dia datangkan (umat) yang lain (sebagai penggantimu). Allah Maha Kuasa berbuat demikian."
  },
  {
    "ayat": 134,
    "arabic": "مَنْ كَانَ يُرِيْدُ ثَوَابَ الدُّنْيَا فَعِنْدَ اللّٰهِ ثَوَابُ الدُّنْيَا وَالْاٰخِرَةِ ۗوَكَانَ اللّٰهُ سَمِيْعًاۢ بَصِيْرًا ࣖ",
    "transliteration_en": "man kaana yureedu sawaabad dunyaa fa'indallaahi sawaabud dunyaa wal Aakhirah; wa kaanal laahu Samee'am Baseeraa",
    "transliteration_id": "Man kāna yurīdu ṡawābad-dun-yā fa ‘indallāhi ṡawābud-dun-yā wal-ākhirah(ti), wa kānallāhu samī‘am baṣīrā(n).",
    "translation_en": "Whoever desires the reward of this world - then with Allah is the reward of this world and the Hereafter. And ever is Allah Hearing and Seeing.",
    "translation_id": "Siapa yang menghendaki pahala dunia, maka di sisi Allah ada pahala dunia dan akhirat. Allah Maha Mendengar lagi Maha Melihat."
  },
  {
    "ayat": 135,
    "arabic": "۞ يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْا كُوْنُوْا قَوَّامِيْنَ بِالْقِسْطِ شُهَدَاۤءَ لِلّٰهِ وَلَوْ عَلٰٓى اَنْفُسِكُمْ اَوِ الْوَالِدَيْنِ وَالْاَقْرَبِيْنَ ۚ اِنْ يَّكُنْ غَنِيًّا اَوْ فَقِيْرًا فَاللّٰهُ اَوْلٰى بِهِمَاۗ فَلَا تَتَّبِعُوا الْهَوٰٓى اَنْ تَعْدِلُوْا ۚ وَاِنْ تَلْوٗٓا اَوْ تُعْرِضُوْا فَاِنَّ اللّٰهَ كَانَ بِمَا تَعْمَلُوْنَ خَبِيْرًا",
    "transliteration_en": "Yaa aiyuhal lazeena aamanoo koonoo qawwa ameena bilqisti shuhadaaa'a lillaahi wa law 'alaa anfusikum awil waalidaini wal aqrabeen iny yakun ghaniyyan aw faqeeran fallaahu awlaa bihimaa falaaa tattabi'ul hawaaa an ta'diloo; wa in talwooo aw tu'ridoo fa innal laaha kaana bimaa ta'maloona Khabeera",
    "transliteration_id": "Yā ayyuhal-lażīna āmanū kūnū qawwāmīna bil-qisṭi syuhadā'a lillāhi wa lau ‘alā anfusikum awil-wālidaini wal-aqrabīn(a), iy yakun ganiyyan au faqīran fallāhu aulā bihimā, falā tattabi‘ul-hawā an ta‘dilū, wa in talwū au tu‘riḍū fa innallāha kāna bimā ta‘malūna khabīrā(n).",
    "translation_en": "O you who have believed, be persistently standing firm in justice, witnesses for Allah, even if it be against yourselves or parents and relatives. Whether one is rich or poor, Allah is more worthy of both. So follow not [personal] inclination, lest you not be just. And if you distort [your testimony] or refuse [to give it], then indeed Allah is ever, with what you do, Acquainted.",
    "translation_id": "Wahai orang-orang yang beriman, jadilah kamu penegak keadilan dan saksi karena Allah, walaupun kesaksian itu memberatkan dirimu sendiri, ibu bapakmu, atau kerabatmu. Jika dia (yang diberatkan dalam kesaksian) kaya atau miskin, Allah lebih layak tahu (kemaslahatan) keduanya. Maka, janganlah kamu mengikuti hawa nafsu karena ingin menyimpang (dari kebenaran). Jika kamu memutarbalikkan (kata-kata) atau berpaling (enggan menjadi saksi), sesungguhnya Allah Maha Teliti terhadap segala apa yang kamu kerjakan."
  },
  {
    "ayat": 136,
    "arabic": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْٓا اٰمِنُوْا بِاللّٰهِ وَرَسُوْلِهٖ وَالْكِتٰبِ الَّذِيْ نَزَّلَ عَلٰى رَسُوْلِهٖ وَالْكِتٰبِ الَّذِيْٓ اَنْزَلَ مِنْ قَبْلُ ۗوَمَنْ يَّكْفُرْ بِاللّٰهِ وَمَلٰۤىِٕكَتِهٖ وَكُتُبِهٖ وَرُسُلِهٖ وَالْيَوْمِ الْاٰخِرِ فَقَدْ ضَلَّ ضَلٰلًا ۢ بَعِيْدًا",
    "transliteration_en": "Yaaa aiyuhal lazeena aamanooo aaminoo billaahi wa Rasoolihee wal Kitaabil lazee nazzala 'alaa Rasoolihee wal Kitaabil lazeee anzala min qabl; wa mai yakfur billaahi wa Malaaa'ikatihee wa Kutubihee wa Rusulihee wal Yawmil Aakhiri faqad dalla dalaalam ba'eedaa",
    "transliteration_id": "Yā ayyuhal-lażīna āmanū āminū billāhi wa rasūlihī wal-kitābil-lażī nazzala ‘alā rasūlihī wal-kitābil-lażī anzala min qabl(u), wa may yakfur billāhi wa malā'ikatihī wa kutubihī wa rusulihī wal-yaumil-ākhiri faqad ḍalla ḍalālam ba‘īdā(n).",
    "translation_en": "O you who have believed, believe in Allah and His Messenger and the Book that He sent down upon His Messenger and the Scripture which He sent down before. And whoever disbelieves in Allah, His angels, His books, His messengers, and the Last Day has certainly gone far astray.",
    "translation_id": "Wahai orang-orang yang beriman, tetaplah beriman kepada Allah, Rasul-Nya (Nabi Muhammad), Kitab (Al-Qur’an) yang diturunkan kepada Rasul-Nya, dan kitab yang Dia turunkan sebelumnya. Siapa yang kufur kepada Allah, para malaikat-Nya, kitab-kitab-Nya, para rasul-Nya, dan hari Akhir sungguh dia telah tersesat sangat jauh."
  },
  {
    "ayat": 137,
    "arabic": "اِنَّ الَّذِيْنَ اٰمَنُوْا ثُمَّ كَفَرُوْا ثُمَّ اٰمَنُوْا ثُمَّ كَفَرُوْا ثُمَّ ازْدَادُوْا كُفْرًا لَّمْ يَكُنِ اللّٰهُ لِيَغْفِرَ لَهُمْ وَلَا لِيَهْدِيَهُمْ سَبِيْلًاۗ",
    "transliteration_en": "Innal lazeena aamanoo summa kafaroo summa aamanoo summa kafaroo summaz daado kufral lam yakunil laahu liyaghfira lahum wa laa liyahdiyahum sabeelaa",
    "transliteration_id": "Innal-lażīna āmanū ṡumma kafarū ṡumma āmanū ṡumma kafarū ṡummazdādū kufral lam yakunillāhu liyagfira lahum wa lā liyahdiyahum sabīlā(n).",
    "translation_en": "Indeed, those who have believed then disbelieved, then believed, then disbelieved, and then increased in disbelief - never will Allah forgive them, nor will He guide them to a way.",
    "translation_id": "Sesungguhnya orang-orang yang beriman, lalu kufur, kemudian beriman (lagi), kemudian kufur (lagi), lalu bertambah kekufurannya, Allah tidak akan mengampuninya dan tidak (pula) menunjukkan kepadanya jalan (yang lurus)."
  },
  {
    "ayat": 138,
    "arabic": "بَشِّرِ الْمُنٰفِقِيْنَ بِاَنَّ لَهُمْ عَذَابًا اَلِيْمًاۙ",
    "transliteration_en": "Bashshiril munaafiqeena bi anna lahum 'azaaban aleemaa",
    "transliteration_id": "Basysyiril-munāfiqīna bi'anna lahum ‘ażāban alīmā(n).",
    "translation_en": "Give tidings to the hypocrites that there is for them a painful punishment -",
    "translation_id": "Berilah kabar ‘gembira’ kepada orang-orang munafik bahwa sesungguhnya bagi mereka azab yang sangat pedih."
  },
  {
    "ayat": 139,
    "arabic": "ۨالَّذِيْنَ يَتَّخِذُوْنَ الْكٰفِرِيْنَ اَوْلِيَاۤءَ مِنْ دُوْنِ الْمُؤْمِنِيْنَ ۗ اَيَبْتَغُوْنَ عِنْدَهُمُ الْعِزَّةَ فَاِنَّ الْعِزَّةَ لِلّٰهِ جَمِيْعًاۗ",
    "transliteration_en": "Allazeena yattakhizoo nal kaafireena awliyaaa'a min doonil mu'mineen; a-yabta ghoona 'indahumul 'izzata fainnnal 'izzata lillaahi jamee'aa",
    "transliteration_id": "Al-lażīna yattakhiżūnal-kāfirīna auliyā'a min dūnil-mu'minīn(a), ayabtagūna ‘indahumul-‘izzata fa innal-‘izzata lillāhi jamī‘ā(n).",
    "translation_en": "Those who take disbelievers as allies instead of the believers. Do they seek with them honor [through power]? But indeed, honor belongs to Allah entirely.",
    "translation_id": "(Yaitu) orang-orang yang menjadikan orang-orang kafir sebagai pelindung dengan meninggalkan orang-orang mukmin. Apakah mereka mencari kekuatan di sisi orang kafir itu? (Ketahuilah) sesungguhnya semua kemuliaan itu milik Allah."
  },
  {
    "ayat": 140,
    "arabic": "وَقَدْ نَزَّلَ عَلَيْكُمْ فِى الْكِتٰبِ اَنْ اِذَا سَمِعْتُمْ اٰيٰتِ اللّٰهِ يُكْفَرُ بِهَا وَيُسْتَهْزَاُ بِهَا فَلَا تَقْعُدُوْا مَعَهُمْ حَتّٰى يَخُوْضُوْا فِيْ حَدِيْثٍ غَيْرِهٖٓ  ۖ اِنَّكُمْ اِذًا مِّثْلُهُمْ ۗ اِنَّ اللّٰهَ جَامِعُ الْمُنٰفِقِيْنَ وَالْكٰفِرِيْنَ فِيْ جَهَنَّمَ جَمِيْعًاۙ",
    "transliteration_en": "Wa qad nazzala 'alaikum fil Kitaabi an izaa sami'tum Aayaatil laahi yukfaru bihaa wa yustahza u bihaa falaa taq'udoo ma'ahum hattaa yakhoodoo fee hadeesin ghairih; innakum izam misluhum; innal laaha jaami'ul munaafiqeena wal kaafireena fee jahannama jamee'aa",
    "transliteration_id": "Wa qad nazzala ‘alaikum fil-kitābi an iżā sami‘tum āyātillāhi yukfaru bihā wa yustahza'u bihā falā taq‘udū ma‘ahum ḥattā yakhūḍū fī ḥadīṡin gairih(ī), innakum iżam miṡlahum, innallāha jāmi‘ul-munāfiqīna wal-kāfirīna fī jahannama jamī‘ā(n).",
    "translation_en": "And it has already come down to you in the Book that when you hear the verses of Allah [recited], they are denied [by them] and ridiculed; so do not sit with them until they enter into another conversation. Indeed, you would then be like them. Indeed Allah will gather the hypocrites and disbelievers in Hell all together -",
    "translation_id": "Sungguh, Allah telah menurunkan (ketentuan) bagimu dalam Kitab (Al-Qur’an) bahwa apabila kamu mendengar ayat-ayat Allah diingkari dan diperolok-olokkan (oleh orang-orang kafir), janganlah kamu duduk bersama mereka hingga mereka memasuki pembicaraan yang lain. Sesungguhnya kamu (apabila tetap berbuat demikian) tentulah serupa dengan mereka. Sesungguhnya Allah akan mengumpulkan semua orang munafik dan orang kafir di (neraka) Jahanam."
  },
  {
    "ayat": 141,
    "arabic": "ۨالَّذِيْنَ يَتَرَبَّصُوْنَ بِكُمْۗ فَاِنْ كَانَ لَكُمْ فَتْحٌ مِّنَ اللّٰهِ قَالُوْٓا اَلَمْ نَكُنْ مَّعَكُمْ ۖ وَاِنْ كَانَ لِلْكٰفِرِيْنَ نَصِيْبٌ قَالُوْٓا اَلَمْ نَسْتَحْوِذْ عَلَيْكُمْ وَنَمْنَعْكُمْ مِّنَ الْمُؤْمِنِيْنَ ۗ فَاللّٰهُ يَحْكُمُ بَيْنَكُمْ يَوْمَ الْقِيٰمَةِ ۗ وَلَنْ يَّجْعَلَ اللّٰهُ لِلْكٰفِرِيْنَ عَلَى الْمُؤْمِنِيْنَ سَبِيْلًا ࣖ",
    "transliteration_en": "Allazeena yatarab basoona bikum fa in kaana lakum fathum minal laahi qaalooo alam nakum ma'akum wa in kaana lilkaafireena naseebun qaalooo alam nastah wiz 'alaikum wa nammna'kum minal mu'mineen; fallaahu yahkumu bainakum Yawmal Qiyaamah; wa lai yaj'alal laahu lilkaafireena 'alal mu'mineena sabeelaa",
    "transliteration_id": "Al-lażīna yatarabbaṣūna bikum, fa in kāna lakum fatḥum minallāhi qālū alam nakum ma‘akum, wa in kāna lil-kāfirīna naṣībun qālū alam nastaḥwiż ‘alaikum wa namna‘kum minal-mu'minīn(a), fallāhu yaḥkumu bainakum yaumal-qiyāmah(ti), wa lay yaj‘alallāhu lil-kāfirīna ‘alal-mu'minīna sabīlā(n).",
    "translation_en": "Those who wait [and watch] you. Then if you gain a victory from Allah, they say, \"Were we not with you?\" But if the disbelievers have a success, they say [to them], \"Did we not gain the advantage over you, but we protected you from the believers?\" Allah will judge between [all of] you on the Day of Resurrection, and never will Allah give the disbelievers over the believers a way [to overcome them].",
    "translation_id": "(Mereka itu adalah) orang-orang yang menunggu-nunggu (peristiwa) yang akan terjadi pada dirimu. Apabila kamu mendapat kemenangan dari Allah, mereka berkata, “Bukankah kami (turut berperang) bersamamu?” Jika orang-orang kafir mendapat bagian (dari kemenangan), mereka berkata, “Bukankah kami turut memenangkanmu dan membela kamu dari orang-orang mukmin?” Allah akan memberi keputusan di antara kamu pada hari Kiamat. Allah tidak akan memberi jalan kepada orang-orang kafir untuk mengalahkan orang-orang mukmin."
  },
  {
    "ayat": 142,
    "arabic": "اِنَّ الْمُنٰفِقِيْنَ يُخٰدِعُوْنَ اللّٰهَ وَهُوَ خَادِعُهُمْۚ وَاِذَا قَامُوْٓا اِلَى الصَّلٰوةِ قَامُوْا كُسَالٰىۙ يُرَاۤءُوْنَ النَّاسَ وَلَا يَذْكُرُوْنَ اللّٰهَ اِلَّا قَلِيْلًاۖ",
    "transliteration_en": "Innal munaafiqeena yukhaadi'oonal laaha wa huwa khaadi'uhum wa izaa qaamooo ilas Salaati qaamoo kusaalaa yuraaa'oonan naasa wa laa yazkuroonal laaha illaa qaleelaa",
    "transliteration_id": "Innal-munāfiqīna yukhādi‘ūnallāha wa huwa khādi‘uhum, wa iżā qāmū ilaṣ-ṣalāti qāmū kusālā, yurā'ūnan-nāsa wa lā yażkurūnallāha illā qalīlā(n).",
    "translation_en": "Indeed, the hypocrites [think to] deceive Allah, but He is deceiving them. And when they stand for prayer, they stand lazily, showing [themselves to] the people and not remembering Allah except a little,",
    "translation_id": "Sesungguhnya orang-orang munafik itu hendak menipu Allah, tetapi Allah membalas tipuan mereka (dengan membiarkan mereka larut dalam kesesatan dan penipuan mereka). Apabila berdiri untuk salat, mereka melakukannya dengan malas dan bermaksud riya di hadapan manusia. Mereka pun tidak mengingat Allah, kecuali sedikit sekali."
  },
  {
    "ayat": 143,
    "arabic": "مُّذَبْذَبِيْنَ بَيْنَ ذٰلِكَۖ  لَآ اِلٰى هٰٓؤُلَاۤءِ وَلَآ اِلٰى هٰٓؤُلَاۤءِ ۗ وَمَنْ يُّضْلِلِ اللّٰهُ فَلَنْ تَجِدَ لَهٗ سَبِيْلًا",
    "transliteration_en": "Muzabzabeena baina zaalika laaa ilaa haaa' ulaaa'i wa laaa ilaa haaa'ulaaa'; wa mai yudlilil laahu falan tajida lahoo sabeela",
    "transliteration_id": "Mużabżabīna baina żālik(a), lā ilā ha'ulā'i wa lā ilā ha'ulā'(i), wa may yuḍlilillāhu falan tajida lahū sabīlā(n).",
    "translation_en": "Wavering between them, [belonging] neither to the believers nor to the disbelievers. And whoever Allah leaves astray - never will you find for him a way.",
    "translation_id": "Mereka (orang-orang munafik) dalam keadaan ragu antara yang demikian (iman atau kafir), tidak termasuk golongan (orang beriman) ini dan tidak (pula) golongan (orang kafir) itu. Siapa yang dibiarkan sesat oleh Allah (karena tidak mengikuti tuntunan-Nya dan memilih kesesatan), kamu tidak akan menemukan jalan (untuk memberi petunjuk) baginya."
  },
  {
    "ayat": 144,
    "arabic": "يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْا لَا تَتَّخِذُوا الْكٰفِرِيْنَ اَوْلِيَاۤءَ مِنْ دُوْنِ الْمُؤْمِنِيْنَ ۚ اَتُرِيْدُوْنَ اَنْ تَجْعَلُوْا لِلّٰهِ عَلَيْكُمْ سُلْطٰنًا مُّبِيْنًا",
    "transliteration_en": "Yaaa aiyuhal lazeena aamanoo laa tattakhizul kaafireena awliyaaa'a min doonil mu'mineen; aturee doona an taj'aloo lillaahi 'alaikum sultaanam mubeenaa",
    "transliteration_id": "Yā ayyuhal-lażīna āmanū lā tattakhiżul-kāfirīna auliyā'a min dūnil-mu'minīn(a), aturīdūna an taj‘alū lillāhi ‘alaikum sulṭānam mubīnā(n).",
    "translation_en": "O you who have believed, do not take the disbelievers as allies instead of the believers. Do you wish to give Allah against yourselves a clear case?",
    "translation_id": "Wahai orang-orang yang beriman, janganlah kamu menjadikan orang-orang kafir sebagai teman setia dengan meninggalkan orang-orang mukmin. Apakah kamu ingin memberi alasan yang jelas bagi Allah (untuk menjatuhkan hukuman) atasmu?"
  },
  {
    "ayat": 145,
    "arabic": "اِنَّ الْمُنٰفِقِيْنَ فِى الدَّرْكِ الْاَسْفَلِ مِنَ النَّارِۚ وَلَنْ تَجِدَ لَهُمْ نَصِيْرًاۙ",
    "transliteration_en": "Innal munaafiqeena fiddarkil asfali minan Naari wa lan tajjida lahum naseeraa",
    "transliteration_id": "Innal-munāfiqīna fid-darkil-asfali minan-nār(i), wa lan tajida lahum naṣīrā(n).",
    "translation_en": "Indeed, the hypocrites will be in the lowest depths of the Fire - and never will you find for them a helper -",
    "translation_id": "Sesungguhnya orang-orang munafik itu (ditempatkan) di tingkat paling bawah dari neraka. Kamu tidak akan mendapat seorang penolong pun bagi mereka."
  },
  {
    "ayat": 146,
    "arabic": "اِلَّا الَّذِيْنَ تَابُوْا وَاَصْلَحُوْا وَاعْتَصَمُوْا بِاللّٰهِ وَاَخْلَصُوْا دِيْنَهُمْ لِلّٰهِ فَاُولٰۤىِٕكَ مَعَ الْمُؤْمِنِيْنَۗ وَسَوْفَ يُؤْتِ اللّٰهُ الْمُؤْمِنِيْنَ اَجْرًا عَظِيْمًا",
    "transliteration_en": "Illal lazeena taaboo wa aslahoo wa'tasamoo billaahi wa akhlasoo deenahum lillaahi faulaaa'ika ma'al mu'mineena wa sawfa yu'til laahul mu'mineena ajran 'azeemaa",
    "transliteration_id": "Illal-lażīna tābū wa aṣlaḥū wa‘taṣamū billāhi wa akhlaṣū dīnahum lillāhi fa ulā'ika ma‘al-mu'minīn(a), wa saufa yu'tillāhul mu'minīna ajran ‘aẓīmā(n).",
    "translation_en": "Except for those who repent, correct themselves, hold fast to Allah, and are sincere in their religion for Allah, for those will be with the believers. And Allah is going to give the believers a great reward.",
    "translation_id": "Kecuali, orang-orang yang bertobat, memperbaiki diri, berpegang teguh pada (agama) Allah, dan dengan ikhlas (menjalankan) agama mereka karena Allah, mereka itu bersama orang-orang mukmin. Kelak Allah akan memberikan pahala yang besar kepada orang-orang mukmin."
  },
  {
    "ayat": 147,
    "arabic": "مَا يَفْعَلُ اللّٰهُ بِعَذَابِكُمْ اِنْ شَكَرْتُمْ وَاٰمَنْتُمْۗ وَكَانَ اللّٰهُ شَاكِرًا عَلِيْمًا   ۔",
    "transliteration_en": "maa yafa'lul laahu bi 'azaabikum in shakartum wa aamantum; wa kaanal laahu Shaakiran 'Aleema",
    "transliteration_id": "Mā yaf‘alullāhu bi‘ażābikum in syakartum wa āmantum, wa kānallāhu syākiran ‘alīmā(n).",
    "translation_en": "What would Allah do with your punishment if you are grateful and believe? And ever is Allah Appreciative and Knowing.",
    "translation_id": "Allah tidak akan menyiksamu jika kamu bersyukur dan beriman. Allah Maha Mensyukuri lagi Maha Mengetahui."
  },
  {
    "ayat": 148,
    "arabic": "۞ لَا يُحِبُّ اللّٰهُ الْجَهْرَ بِالسُّوْۤءِ مِنَ الْقَوْلِ اِلَّا مَنْ ظُلِمَ ۗ وَكَانَ اللّٰهُ سَمِيْعًا عَلِيْمًا",
    "transliteration_en": "Laa yuhibbullaahul jahra bis sooo'i minal qawli illaa man zulim; wa kaanallaahu Samee'an 'Aleeman",
    "transliteration_id": "Lā yuḥibbullāhul-jahra bis-sū'i minal-qauli illā man ẓulim(a), wa kānallāhu samī‘an ‘alīmā(n).",
    "translation_en": "Allah does not like the public mention of evil except by one who has been wronged. And ever is Allah Hearing and Knowing.",
    "translation_id": "Allah tidak menyukai perkataan buruk (yang diucapkan) secara terus terang, kecuali oleh orang yang dizalimi. Allah Maha Mendengar lagi Maha Mengetahui."
  },
  {
    "ayat": 149,
    "arabic": "اِنْ تُبْدُوْا خَيْرًا اَوْ تُخْفُوْهُ اَوْ تَعْفُوْا عَنْ سُوْۤءٍ فَاِنَّ اللّٰهَ كَانَ عَفُوًّا قَدِيْرًا",
    "transliteration_en": "in tubdoo khairann aw tukhfoohu aw ta'foo 'an sooo'in fa innal laaha kaana 'afuwwan Qadeeraa",
    "transliteration_id": "In tubdū khairan au tukhfūhu au ta‘fū ‘an sū'in fa innallāha kāna ‘afuwwan qadīrā(n).",
    "translation_en": "If [instead] you show [some] good or conceal it or pardon an offense - indeed, Allah is ever Pardoning and Competent.",
    "translation_id": "Jika kamu menampakkan atau menyembunyikan suatu kebaikan atau memaafkan suatu kesalahan, sesungguhnya Allah Maha Pemaaf lagi Maha Kuasa."
  },
  {
    "ayat": 150,
    "arabic": "اِنَّ الَّذِيْنَ يَكْفُرُوْنَ بِاللّٰهِ وَرُسُلِهٖ وَيُرِيْدُوْنَ اَنْ يُّفَرِّقُوْا بَيْنَ اللّٰهِ وَرُسُلِهٖ وَيَقُوْلُوْنَ نُؤْمِنُ بِبَعْضٍ وَّنَكْفُرُ بِبَعْضٍۙ وَّيُرِيْدُوْنَ اَنْ يَّتَّخِذُوْا بَيْنَ ذٰلِكَ سَبِيْلًاۙ",
    "transliteration_en": "Innal lazeena yakkfuroona billaahi wa Rusulihee wa yureedoona ai yufarriqoo bainal laahi wa Rusulihee wa yaqooloona nu'minu biba'dinw wa nakfuru biba' dinw wa yureedoona ai yattakhizoo baina zaalika sabeelaa",
    "transliteration_id": "Innal-lażīna yakfurūna billāhi wa rusulihī wa yurīdūna ay yufarriqū bainallāhi wa rusulihī wa yaqūlūna nu'minu biba‘ḍin wa nakfuru biba‘ḍ(in), wa yurīdūna ay yattakhiżū baina żālika sabīlā(n).",
    "translation_en": "Indeed, those who disbelieve in Allah and His messengers and wish to discriminate between Allah and His messengers and say, \"We believe in some and disbelieve in others,\" and wish to adopt a way in between -",
    "translation_id": "Sesungguhnya orang-orang yang kufur kepada Allah dan rasul-rasul-Nya dan bermaksud membeda-bedakan antara (keimanan kepada) Allah dan rasul-rasul-Nya dengan mengatakan, “Kami beriman kepada sebagian dan kami mengingkari sebagian (yang lain),” serta bermaksud mengambil jalan tengah antara itu (keimanan atau kekufuran),"
  }
]