[
  {
    "ayat": 151,
    "arabic": "اُولٰۤىِٕكَ هُمُ الْكٰفِرُوْنَ حَقًّا ۚوَاَعْتَدْنَا لِلْكٰفِرِيْنَ عَذَابًا مُّهِيْنًا",
    "transliteration_en": "Ulaaa'ika humul kaafiroona haqqaa; wa a'tadnaa lilkaafireena 'azaabam muheenaa",
    "transliteration_id": "Ulā'ika humul-kāfirūna ḥaqqā(n), wa a‘tadnā lil-kāfirīna ‘ażābam muhīnā(n).",
    "translation_en": "Those are the disbelievers, truly. And We have prepared for the disbelievers a humiliating punishment.",
    "translation_id": "merekalah orang-orang kafir yang sebenarnya. Kami telah menyediakan untuk orang-orang kafir azab yang menghinakan."
  },
  {
    "ayat": 152,
    "arabic": "وَالَّذِيْنَ اٰمَنُوْا بِاللّٰهِ وَرُسُلِهٖ وَلَمْ يُفَرِّقُوْا بَيْنَ اَحَدٍ مِّنْهُمْ اُولٰۤىِٕكَ سَوْفَ يُؤْتِيْهِمْ اُجُوْرَهُمْ ۗوَكَانَ اللّٰهُ غَفُوْرًا رَّحِيْمًا ࣖ",
    "transliteration_en": "Wallazeena aamanoo billaahi wa Rusulihee wa lam yufarriqoo baina ahadim minhum ulaaa'ika sawfa yu'teehim ujoorahum; wa kaanal laahu Ghafoorar Raheema",
    "transliteration_id": "Wal-lażīna āmanū billāhi wa rusulihī wa lam yufarriqū baina aḥadim minhum ulā'ika saufa nu'tīhim ujūrahum, wa kānallāhu gafūrar raḥīmā(n).",
    "translation_en": "But they who believe in Allah and His messengers and do not discriminate between any of them - to those He is going to give their rewards. And ever is Allah Forgiving and Merciful.",
    "translation_id": "Adapun orang-orang yang beriman kepada Allah dan rasul-rasul-Nya dan tidak membeda-bedakan seorang pun di antara mereka (para rasul), kelak Allah akan memberikan pahala kepada mereka. Allah Maha Pengampun lagi Maha Penyayang."
  },
  {
    "ayat": 153,
    "arabic": "يَسْـَٔلُكَ اَهْلُ الْكِتٰبِ اَنْ تُنَزِّلَ عَلَيْهِمْ كِتٰبًا مِّنَ السَّمَاۤءِ فَقَدْ سَاَلُوْا مُوْسٰٓى اَكْبَرَ مِنْ ذٰلِكَ فَقَالُوْٓا اَرِنَا اللّٰهَ جَهْرَةً فَاَخَذَتْهُمُ الصَّاعِقَةُ بِظُلْمِهِمْۚ  ثُمَّ اتَّخَذُوا الْعِجْلَ مِنْۢ بَعْدِ مَا جَاۤءَتْهُمُ الْبَيِّنٰتُ فَعَفَوْنَا عَنْ ذٰلِكَ ۚ وَاٰتَيْنَا مُوْسٰى سُلْطٰنًا مُّبِيْنًا",
    "transliteration_en": "yas'aluka Ahlul Kitaabi an tunazzila 'alaihim Kitaabam minas samaaa'i faqad sa aloo Moosaa akbara min zaalika faqaaloo arinal laaha jahratan fa akhazat humus saa'iqatu bizulmihim; summat takhazul 'ijla mim ba'di maa jaa'at humul baiyinaatu fa'afawnaa 'ann zaalik; wa aatainaa Moosaa sultaanam mubeenaa",
    "transliteration_id": "Yas'aluka ahlul-kitābi an tunazzila ‘alaihim kitābam minas-samā'i faqad sa'alū mūsā akbara min żālika fa qālū arinallāha jahratan fa akhażathumuṣ-ṣā‘iqatu bi ẓulmihim, ṡummattakhażul-‘ijla mim ba‘di mā jā'athumul-bayyinātu fa ‘afaunā ‘an żālik(a), wa ātainā mūsā sulṭānam mubīnā(n).",
    "translation_en": "The People of the Scripture ask you to bring down to them a book from the heaven. But they had asked of Moses [even] greater than that and said, \"Show us Allah outright,\" so the thunderbolt struck them for their wrongdoing. Then they took the calf [for worship] after clear evidences had come to them, and We pardoned that. And We gave Moses a clear authority.",
    "translation_id": "Ahlulkitab meminta kepadamu (Nabi Muhammad) agar engkau menurunkan sebuah kitab dari langit kepada mereka. Sungguh, mereka telah meminta kepada Musa yang lebih besar daripada itu. Mereka berkata, “Perlihatkanlah Allah kepada kami secara nyata.” Maka, petir menyambar mereka karena kezalimannya. Kemudian, mereka menjadikan anak sapi (sebagai sembahan), (padahal) telah datang kepada mereka bukti-bukti (ketauhidan) yang nyata, lalu Kami memaafkan yang demikian itu. Kami telah menganugerahkan kepada Musa kekuasaan yang nyata."
  },
  {
    "ayat": 154,
    "arabic": "وَرَفَعْنَا فَوْقَهُمُ الطُّوْرَ بِمِيْثَاقِهِمْ وَقُلْنَا لَهُمُ ادْخُلُوا الْبَابَ سُجَّدًا وَّقُلْنَا لَهُمْ لَا تَعْدُوْا فِى السَّبْتِ وَاَخَذْنَا مِنْهُمْ مِّيْثَاقًا غَلِيْظًا",
    "transliteration_en": "Wa rafa'naa fawqahumut Toora bimeesaaqihim wa qulnaa lahumud khulul baaba sujjadanw wa qulnaa lahum laa ta'doo fis Sabti wa akhaznaa minhum meesaaqan ghaleezaa",
    "transliteration_id": "Wa rafa‘nā fauqahumuṭ ṭūra bimīṡāqihim wa qulnā lahumudkhulul-bāba sujjadaw wa qulnā lahum lā ta‘dū fis-sabti wa akhażnā minhum mīṡāqan galīẓā(n).",
    "translation_en": "And We raised over them the mount for [refusal of] their covenant; and We said to them, \"Enter the gate bowing humbly\", and We said to them, \"Do not transgress on the sabbath\", and We took from them a solemn covenant.",
    "translation_id": "Kami pun telah mengangkat gunung (Sinai) di atas mereka untuk (menguatkan) perjanjian mereka. Kami perintahkan kepada mereka, “Masukilah pintu gerbang (Baitulmaqdis) itu sambil bersujud”. Kami perintahkan pula kepada mereka, “Janganlah melanggar (peraturan) pada hari Sabat.” Kami telah mengambil dari mereka perjanjian yang kukuh."
  },
  {
    "ayat": 155,
    "arabic": "فَبِمَا نَقْضِهِمْ مِّيْثَاقَهُمْ وَكُفْرِهِمْ بِاٰيٰتِ اللّٰهِ وَقَتْلِهِمُ الْاَنْۢبِيَاۤءَ بِغَيْرِ حَقٍّ وَّقَوْلِهِمْ قُلُوْبُنَا غُلْفٌ ۗ بَلْ طَبَعَ اللّٰهُ عَلَيْهَا بِكُفْرِهِمْ فَلَا يُؤْمِنُوْنَ اِلَّا قَلِيْلًاۖ",
    "transliteration_en": "Fabimaa naqdihim meesaaqahum wa kufrihim bi Aayaatil laahi wa qatlihimul Ambiyaaa'a bighairi haqqinw wa qawlihim quloobunna ghulf; bal taba'al laahu 'alaihaa bikufrihim falaa yu'minoona illaa qaleelaa",
    "transliteration_id": "Fabimā naqḍihim mīṡāqahum wa kufrihim bi'āyātillāhi wa qatlihimul-ambiyā'a bigairi ḥaqqiw wa qaulihim qulūbunā gulf(un), bal ṭaba‘allāhu ‘alaihā bikufrihim falā yu'minūna illā qalīlā(n).",
    "translation_en": "And [We cursed them] for their breaking of the covenant and their disbelief in the signs of Allah and their killing of the prophets without right and their saying, \"Our hearts are wrapped\". Rather, Allah has sealed them because of their disbelief, so they believe not, except for a few.",
    "translation_id": "Maka, (Kami hukum mereka) karena mereka melanggar perjanjian itu, kafir terhadap keterangan-keterangan Allah, membunuh nabi-nabi tanpa hak (alasan yang benar), dan mengatakan, “Hati kami tertutup.” Sebenarnya Allah telah mengunci hati mereka karena kekufurannya. Maka, mereka tidak beriman kecuali hanya sebagian kecil (dari mereka)."
  },
  {
    "ayat": 156,
    "arabic": "وَّبِكُفْرِهِمْ وَقَوْلِهِمْ عَلٰى مَرْيَمَ بُهْتَانًا عَظِيْمًاۙ",
    "transliteration_en": "Wa bikufrihim wa qawlihim 'alaa Maryama buh taanan 'azeema",
    "transliteration_id": "Wa bikufrihim wa qaulihim ‘alā maryama buhtānan ‘aẓīmā(n).",
    "translation_en": "And [We cursed them] for their disbelief and their saying against Mary a great slander,",
    "translation_id": "(Kami juga menghukum mereka) karena kekufuran mereka dan tuduhan mereka terhadap Maryam dengan tuduhan palsu lagi sangat keji."
  },
  {
    "ayat": 157,
    "arabic": "وَّقَوْلِهِمْ اِنَّا قَتَلْنَا الْمَسِيْحَ عِيْسَى ابْنَ مَرْيَمَ رَسُوْلَ اللّٰهِۚ وَمَا قَتَلُوْهُ وَمَا صَلَبُوْهُ وَلٰكِنْ شُبِّهَ لَهُمْ ۗوَاِنَّ الَّذِيْنَ اخْتَلَفُوْا فِيْهِ لَفِيْ شَكٍّ مِّنْهُ ۗمَا لَهُمْ بِهٖ مِنْ عِلْمٍ اِلَّا اتِّبَاعَ الظَّنِّ وَمَا قَتَلُوْهُ يَقِيْنًاۢ ۙ",
    "transliteration_en": "Wa qawlihim innaa qatal nal maseeha 'Eesab-na-Maryama Rasoolal laahi wa maa qataloohu wa maa salaboohu wa laakin shubbiha lahum; wa innal lazeenakh talafoo fee lafee shakkim minh; maa lahum bihee min 'ilmin illat tibaa'az zann; wa maa qataloohu yaqeenaa",
    "transliteration_id": "Wa qaulihim innā qatalnal-masīḥa ‘īsabna maryama rasūlallāh(i), wa mā qatalūhu wa mā ṣalabūhu wa lākin syubbiha lahum, wa innal-lażīnakhtalafū fīhi lafī syakkim minh(u), mā lahum bihī min ‘ilmin illattibā‘aẓ-ẓanni wa mā qatalūhu yaqīnā(n).",
    "translation_en": "And [for] their saying, \"Indeed, we have killed the Messiah, Jesus, the son of Mary, the messenger of Allah.\" And they did not kill him, nor did they crucify him; but [another] was made to resemble him to them. And indeed, those who differ over it are in doubt about it. They have no knowledge of it except the following of assumption. And they did not kill him, for certain.",
    "translation_id": "(Kami menghukum pula mereka) karena ucapan mereka, “Sesungguhnya kami telah membunuh Almasih, Isa putra Maryam, Rasul Allah,” padahal mereka tidak membunuhnya dan tidak (pula) menyalibnya, tetapi (yang mereka bunuh adalah) orang yang menurut mereka menyerupai (Isa). Sesungguhnya mereka yang berselisih pendapat tentangnya (pembunuhan Isa), selalu dalam keragu-raguan terhadapnya. Mereka benar-benar tidak mengetahui (siapa sebenarnya yang dibunuh itu), kecuali mengikuti persangkaan belaka. (Jadi,) mereka tidak yakin telah membunuhnya."
  },
  {
    "ayat": 158,
    "arabic": "بَلْ رَّفَعَهُ اللّٰهُ اِلَيْهِ ۗوَكَانَ اللّٰهُ عَزِيْزًا حَكِيْمًا",
    "transliteration_en": "Bar rafa'ahul laahu ilayh; wa kaanal laahu 'Azeezan Hakeemaa",
    "transliteration_id": "Bar rafa‘ahullāhu ilaih(i), wa kānallāhu ‘azīzan ḥakīmā(n).",
    "translation_en": "Rather, Allah raised him to Himself. And ever is Allah Exalted in Might and Wise.",
    "translation_id": "Akan tetapi, Allah telah mengangkatnya (Isa) ke hadirat-Nya. Allah Maha Perkasa lagi Maha Bijaksana."
  },
  {
    "ayat": 159,
    "arabic": "وَاِنْ مِّنْ اَهْلِ الْكِتٰبِ اِلَّا لَيُؤْمِنَنَّ بِهٖ قَبْلَ مَوْتِهٖ ۚوَيَوْمَ الْقِيٰمَةِ يَكُوْنُ عَلَيْهِمْ شَهِيْدًاۚ",
    "transliteration_en": "Wa im min Ahlil Kitaabi illaa layu'minanna bihee qabla mawtihee wa Yawmal Qiyaamati yakoonu 'alaihim shaheedaa",
    "transliteration_id": "Wa im min ahlil-kitābi illā layu'minanna bihī qabla mautih(ī), wa yaumal-qiyāmati yakūnu ‘alaihim syahīdā(n).",
    "translation_en": "And there is none from the People of the Scripture but that he will surely believe in Jesus before his death. And on the Day of Resurrection he will be against them a witness.",
    "translation_id": "Tidak ada seorang pun di antara Ahlulkitab, kecuali beriman kepadanya (Isa) menjelang kematiannya. Pada hari Kiamat dia (Isa) akan menjadi saksi mereka."
  },
  {
    "ayat": 160,
    "arabic": "فَبِظُلْمٍ مِّنَ الَّذِيْنَ هَادُوْا حَرَّمْنَا عَلَيْهِمْ طَيِّبٰتٍ اُحِلَّتْ لَهُمْ وَبِصَدِّهِمْ عَنْ سَبِيْلِ اللّٰهِ كَثِيْرًاۙ",
    "transliteration_en": "Fabizulmin minal lazeena haadoo harramnaa 'alaihim taiyibaatin uhillat lahum wa bisadihim 'an sabeelil laahi kaseeraa",
    "transliteration_id": "Fa biẓulmim minal-lażīna hādū ḥarramnā ‘alaihim ṭayyibātin uḥillat lahum wa biṣaddihim ‘an sabīlillāhi kaṡīrā(n).",
    "translation_en": "For wrongdoing on the part of the Jews, We made unlawful for them [certain] good foods which had been lawful to them, and for their averting from the way of Allah many [people],",
    "translation_id": "Karena kezaliman orang-orang Yahudi, Kami mengharamkan atas mereka (makanan-makanan) yang baik yang (dahulu) pernah dihalalkan bagi mereka; juga karena mereka sering menghalangi (orang lain) dari jalan Allah,"
  },
  {
    "ayat": 161,
    "arabic": "وَّاَخْذِهِمُ الرِّبٰوا وَقَدْ نُهُوْا عَنْهُ وَاَكْلِهِمْ اَمْوَالَ النَّاسِ بِالْبَاطِلِ ۗوَاَعْتَدْنَا لِلْكٰفِرِيْنَ مِنْهُمْ عَذَابًا اَلِيْمًا",
    "transliteration_en": "Wa akhzihimur ribaa wa qad nuhoo 'anhu wa aklihim amwaalan naasi bilbaatil; wa a'tadnaa lilkaafireena minhum 'azaaban aleema",
    "transliteration_id": "Wa akhżihimur-ribā wa qad nuhū ‘anhu wa aklihim amwālan-nāsi bil-bāṭil(i), wa a‘tadnā lil-kāfirīna minhum ‘ażāban alīmā(n).",
    "translation_en": "And [for] their taking of usury while they had been forbidden from it, and their consuming of the people's wealth unjustly. And we have prepared for the disbelievers among them a painful punishment.",
    "translation_id": "melakukan riba, padahal sungguh mereka telah dilarang darinya; dan memakan harta orang dengan cara tidak sah (batil). Kami sediakan untuk orang-orang kafir di antara mereka azab yang sangat pedih."
  },
  {
    "ayat": 162,
    "arabic": "لٰكِنِ الرّٰسِخُوْنَ فِى الْعِلْمِ مِنْهُمْ وَالْمُؤْمِنُوْنَ يُؤْمِنُوْنَ بِمَآ اُنْزِلَ اِلَيْكَ وَمَآ اُنْزِلَ مِنْ قَبْلِكَ وَالْمُقِيْمِيْنَ الصَّلٰوةَ وَالْمُؤْتُوْنَ الزَّكٰوةَ وَالْمُؤْمِنُوْنَ بِاللّٰهِ وَالْيَوْمِ الْاٰخِرِۗ اُولٰۤىِٕكَ سَنُؤْتِيْهِمْ اَجْرًا عَظِيْمًا ࣖ",
    "transliteration_en": "Laakinir raasikhoona fil'ilmi minhum walmu'minoona yu'minoona bimaaa unzila ilaika wa maaa unzila min qablika walmuqeemeenas Salaata walmu'toonaz Zakaata walmu 'minoona billaahi wal yawmil Aakhir; ulaaa'ika sanu'teehim ajran 'azeemaa",
    "transliteration_id": "Lākinir-rāsikhūna fil-‘ilmi minhum wal-mu'minūna yu'minūna bimā unzila ilaika wa mā unzila min qablika wal-muqīmīnaṣ-ṣalāta wal-mu'tūnaz-zakāta wal-mu'minūna billāhi wal-yaumil-ākhir(i), ulā'ika sanu'tīhim ajran ‘aẓīmā(n).",
    "translation_en": "But those firm in knowledge among them and the believers believe in what has been revealed to you, [O Muhammad], and what was revealed before you. And the establishers of prayer [especially] and the givers of zakah and the believers in Allah and the Last Day - those We will give a great reward.",
    "translation_id": "Akan tetapi, orang-orang yang ilmunya mendalam di antara mereka dan orang-orang mukmin beriman pada (Al-Qur’an) yang diturunkan kepadamu (Nabi Muhammad) dan pada (kitab-kitab) yang diturunkan sebelummu. (Begitu pula) mereka yang melaksanakan salat, yang menunaikan zakat, dan yang beriman kepada Allah serta hari Akhir. Kepada mereka akan Kami berikan pahala yang besar."
  },
  {
    "ayat": 163,
    "arabic": "۞ اِنَّآ اَوْحَيْنَآ اِلَيْكَ كَمَآ اَوْحَيْنَآ اِلٰى نُوْحٍ وَّالنَّبِيّٖنَ مِنْۢ بَعْدِهٖۚ وَاَوْحَيْنَآ اِلٰٓى اِبْرٰهِيْمَ وَاِسْمٰعِيْلَ وَاِسْحٰقَ وَيَعْقُوْبَ وَالْاَسْبَاطِ وَعِيْسٰى وَاَيُّوْبَ وَيُوْنُسَ وَهٰرُوْنَ وَسُلَيْمٰنَ ۚوَاٰتَيْنَا دَاوٗدَ زَبُوْرًاۚ",
    "transliteration_en": "innaaa awhainaaa ilaika kamaaa awhainaaa ilaa Noohinw wan nabiyyeena mim ba'dih; wa awhainaaa ilaaa ibraaheema wa Ismaaa'eela wa Ishaaqa wa Ya'qooba wal Asbaati wa 'Eesaa wa Ayyooba wa Yoonusa wa haaroona wa Sulaimaan; wa aatainaa Daawooda Zabooraa",
    "transliteration_id": "Innā auḥainā ilaika kamā auḥainā ilā nūḥiw wan-nabiyyīna mim ba‘dih(ī), wa auḥainā ilā ibrāhīma wa ismā‘īla wa isḥāqa wa ya‘qūba wal-asbāṭi wa ‘īsā wa ayyūba wa yūnusa wa hārūna wa sulaimān(a), wa ātainā dāwūda zabūrā(n).",
    "translation_en": "Indeed, We have revealed to you, [O Muhammad], as We revealed to Noah and the prophets after him. And we revealed to Abraham, Ishmael, Isaac, Jacob, the Descendants, Jesus, Job, Jonah, Aaron, and Solomon, and to David We gave the book [of Psalms].",
    "translation_id": "Sesungguhnya Kami telah mewahyukan kepadamu (Nabi Muhammad) sebagaimana Kami telah mewahyukan kepada Nuh dan nabi-nabi setelahnya. Kami telah mewahyukan pula kepada Ibrahim, Ismail, Ishaq, Ya‘qub dan keturunan(-nya), Isa, Ayyub, Yunus, Harun, dan Sulaiman. Kami telah memberikan (Kitab) Zabur kepada Daud."
  },
  {
    "ayat": 164,
    "arabic": "وَرُسُلًا قَدْ قَصَصْنٰهُمْ عَلَيْكَ مِنْ قَبْلُ وَرُسُلًا لَّمْ نَقْصُصْهُمْ عَلَيْكَ ۗوَكَلَّمَ اللّٰهُ مُوْسٰى تَكْلِيْمًاۚ",
    "transliteration_en": "Wa Rusulan qad qasas naahum 'alaika min qablu wa Rusulal lam naqsushum 'alaik; wa kallamallaahu Moosaa takleemaa",
    "transliteration_id": "Wa rusulan qad qaṣaṣnāhum ‘alaika wa rusulal lam naqṣuṣhum ‘alaik(a), wa kallamallāhu mūsā taklīmā(n).",
    "translation_en": "And [We sent] messengers about whom We have related [their stories] to you before and messengers about whom We have not related to you. And Allah spoke to Moses with [direct] speech.",
    "translation_id": "Ada beberapa rasul yang telah Kami ceritakan (kisah) tentang mereka kepadamu sebelumnya dan ada (pula) beberapa rasul (lain) yang tidak Kami ceritakan (kisah) tentang mereka kepadamu. Allah telah benar-benar berbicara kepada Musa (secara langsung)."
  },
  {
    "ayat": 165,
    "arabic": "رُسُلًا مُّبَشِّرِيْنَ وَمُنْذِرِيْنَ لِئَلَّا يَكُوْنَ لِلنَّاسِ عَلَى اللّٰهِ حُجَّةٌ ۢ بَعْدَ الرُّسُلِ ۗوَكَانَ اللّٰهُ عَزِيْزًا حَكِيْمًا",
    "transliteration_en": "Rusulam mubashshireena wa munzireena li'allaa yakoona linnaasi 'alal laahi hujjatum ba'dar Rusul; wa kaanallaahu 'Azeezan Hakeema",
    "transliteration_id": "Rusulam mubasysyirīna wa munżirīna li'allā yakūna lin-nāsi ‘alallāhi ḥujjatum ba‘dar-rusul(i), wa kānallāhu ‘azīzan ḥakīmā(n).",
    "translation_en": "[We sent] messengers as bringers of good tidings and warners so that mankind will have no argument against Allah after the messengers. And ever is Allah Exalted in Might and Wise.",
    "translation_id": "(Kami mengutus) rasul-rasul sebagai pembawa berita gembira dan pemberi peringatan agar tidak ada alasan bagi manusia untuk membantah Allah setelah rasul-rasul itu (diutus). Allah Maha Perkasa lagi Maha Bijaksana."
  },
  {
    "ayat": 166,
    "arabic": "لٰكِنِ اللّٰهُ يَشْهَدُ بِمَآ اَنْزَلَ اِلَيْكَ اَنْزَلَهٗ بِعِلْمِهٖ ۚوَالْمَلٰۤىِٕكَةُ يَشْهَدُوْنَ ۗوَكَفٰى بِاللّٰهِ شَهِيْدًاۗ",
    "transliteration_en": "Laakinil laahu yashhadu bimaaa anzala ilaika anzalahoo bi'ilmihee wal malaaa'ikatu yashhadoon; wa kafaa billaahi Shaheeda",
    "transliteration_id": "Lākinillāhu yasyhadu bimā anzala ilaika anzalahū bi‘ilmih(ī), wal-malā'ikatu yasyhadūn(a), wa kafā billāhi syahīdā(n).",
    "translation_en": "But Allah bears witness to that which He has revealed to you. He has sent it down with His knowledge, and the angels bear witness [as well]. And sufficient is Allah as Witness.",
    "translation_id": "Akan tetapi, Allah bersaksi atas apa (Al-Qur’an) yang telah diturunkan-Nya kepadamu (Nabi Muhammad). Dia menurunkannya dengan ilmu-Nya. (Demikian pula) para malaikat pun bersaksi. Cukuplah Allah menjadi saksi."
  },
  {
    "ayat": 167,
    "arabic": "اِنَّ الَّذِيْنَ كَفَرُوْا وَصَدُّوْا عَنْ سَبِيْلِ اللّٰهِ قَدْ ضَلُّوْا ضَلٰلًا ۢ بَعِيْدًا",
    "transliteration_en": "Innal lazeena kafaroo wa saddoo 'an sabeelil laahi qad dalloo dalaalam ba'eedaa",
    "transliteration_id": "Innal-lażīna kafarū wa ṣaddū ‘an sabīlillāhi qad ḍallū ḍalālam ba‘īdā(n).",
    "translation_en": "Indeed, those who disbelieve and avert [people] from the way of Allah have certainly gone far astray.",
    "translation_id": "Sesungguhnya orang-orang yang kufur dan menghalang-halangi (orang lain) dari jalan Allah, benar-benar telah tersesat jauh."
  },
  {
    "ayat": 168,
    "arabic": "اِنَّ الَّذِيْنَ كَفَرُوْا وَظَلَمُوْا لَمْ يَكُنِ اللّٰهُ لِيَغْفِرَ لَهُمْ وَلَا لِيَهْدِيَهُمْ طَرِيْقًاۙ",
    "transliteration_en": "Innal lazeenakafaroo wa zalamoo lam yakkunillaahu liyaghfira lahum wa laa liyahdiyahum tareeqaa",
    "transliteration_id": "Innal-lażīna kafarū wa ẓalamū lam yakunillāhu liyagfira lahum wa lā liyahdiyahum ṭarīqā(n).",
    "translation_en": "Indeed, those who disbelieve and commit wrong [or injustice] - never will Allah forgive them, nor will He guide them to a path.",
    "translation_id": "Sesungguhnya orang-orang yang kufur dan melakukan kezaliman, Allah tidak akan mengampuni mereka dan tidak akan menunjukkan kepada mereka jalan apa pun,"
  },
  {
    "ayat": 169,
    "arabic": "اِلَّا طَرِيْقَ جَهَنَّمَ خٰلِدِيْنَ فِيْهَآ اَبَدًا ۗوَكَانَ ذٰلِكَ عَلَى اللّٰهِ يَسِيْرًا",
    "transliteration_en": "Illaa tareeqa jahannamma khaalideena feehaa abadaa; wa kaana zaalika 'alal laahi yaseeraa",
    "transliteration_id": "Illā ṭarīqa jahannama khālidīna fīhā abadā(n), wa kāna żālika ‘alallāhi yasīrā(n).",
    "translation_en": "Except the path of Hell; they will abide therein forever. And that, for Allah, is [always] easy.",
    "translation_id": "kecuali jalan ke (neraka) Jahanam. Mereka kekal di dalamnya selama-lamanya. Hal itu bagi Allah (sangat) mudah."
  },
  {
    "ayat": 170,
    "arabic": "يٰٓاَيُّهَا النَّاسُ قَدْ جَاۤءَكُمُ الرَّسُوْلُ بِالْحَقِّ مِنْ رَّبِّكُمْ فَاٰمِنُوْا خَيْرًا لَّكُمْ ۗوَاِنْ تَكْفُرُوْا فَاِنَّ لِلّٰهِ مَا فِى السَّمٰوٰتِ وَالْاَرْضِۗ وَكَانَ اللّٰهُ عَلِيْمًا حَكِيْمًا",
    "transliteration_en": "Yaaa aiyuhan naasu qad jaaa'akumur Rasoolu bilhaqqi mir Rabbikum fa ammminoo khairal lakum; wa in takfuroo fainnna lillaahi maa fis samaawaati wal ard; wa kaanal laahu 'Aleemann hakeemaa",
    "transliteration_id": "Yā ayyuhan-nāsu qad jā'akumur-rasūlu bil-ḥaqqi mir rabbikum fa āminū khairal lakum, wa in takfurū fa inna lillāhi mā fis-samāwāti wal-arḍ(i), wa kānallāhu ‘alīman ḥakīmā(n).",
    "translation_en": "O Mankind, the Messenger has come to you with the truth from your Lord, so believe; it is better for you. But if you disbelieve - then indeed, to Allah belongs whatever is in the heavens and earth. And ever is Allah Knowing and Wise.",
    "translation_id": "Wahai manusia, sungguh telah datang Rasul (Nabi Muhammad) kepadamu dengan (membawa) kebenaran dari Tuhanmu. Maka, berimanlah (kepadanya). Itu lebih baik bagimu. Jika kamu kufur, (itu tidak merugikan Allah sedikit pun) karena sesungguhnya milik Allahlah apa yang di langit dan di bumi. Allah Maha Mengetahui lagi Maha Bijaksana."
  },
  {
    "ayat": 171,
    "arabic": "يٰٓاَهْلَ الْكِتٰبِ لَا تَغْلُوْا فِيْ دِيْنِكُمْ وَلَا تَقُوْلُوْا عَلَى اللّٰهِ اِلَّا الْحَقَّۗ اِنَّمَا الْمَسِيْحُ عِيْسَى ابْنُ مَرْيَمَ رَسُوْلُ اللّٰهِ وَكَلِمَتُهٗ ۚ اَلْقٰىهَآ اِلٰى مَرْيَمَ وَرُوْحٌ مِّنْهُ ۖفَاٰمِنُوْا بِاللّٰهِ وَرُسُلِهٖۗ وَلَا تَقُوْلُوْا ثَلٰثَةٌ  ۗاِنْتَهُوْا خَيْرًا لَّكُمْ ۗ اِنَّمَا اللّٰهُ اِلٰهٌ وَّاحِدٌ ۗ سُبْحٰنَهٗٓ اَنْ يَّكُوْنَ لَهٗ وَلَدٌ ۘ لَهٗ مَا فِى السَّمٰوٰتِ وَمَا فِى الْاَرْضِۗ وَكَفٰى بِاللّٰهِ وَكِيْلًا ࣖ",
    "transliteration_en": "Yaaa Ahlal Kitaabi laa taghloo fee deenikum wa laa taqooloo 'alal laahi illalhaqq; innamal Maseehu 'Eesab-nu-Maryamma Rasoolul laahi wa Kalimatuhooo alqaahaaa ilaa Maryamma wa roohum minhum fa aaminoo billaahi wa Rusulihee wa laa taqooloo salaasah; intahoo khairallakum; innamal laahu Ilaahunw Waahid, Subhaanahooo ani yakoona lahoo walad; lahoo maa fissamaawaati wa maa fil ard; wa kafaa billaahi Wakeelaa",
    "transliteration_id": "Yā ahlal-kitābi lā taglū fī dīnikum wa lā taqūlū ‘alallāhi illal-ḥaqq(a), innamal-masīḥu ‘īsabnu maryama rasūlullāhi wa kalimatuh(ū), alqāhā ilā maryama wa rūḥum minh(u), fa āminū billāhi wa rusulih(ī), wa lā taqūlū ṡalāṡah(tun), inntahū khairal lakum innamallāhu ilāhuw wāḥid(un), subḥānahū ay yakūna lahū walad(un), lahū mā fis-samāwāti wa mā fil-arḍ(i), wa kafā billāhi wakīlā(n).",
    "translation_en": "O People of the Scripture, do not commit excess in your religion or say about Allah except the truth. The Messiah, Jesus, the son of Mary, was but a messenger of Allah and His word which He directed to Mary and a soul [created at a command] from Him. So believe in Allah and His messengers. And do not say, \"Three\"; desist - it is better for you. Indeed, Allah is but one God. Exalted is He above having a son. To Him belongs whatever is in the heavens and whatever is on the earth. And sufficient is Allah as Disposer of affairs.",
    "translation_id": "Wahai Ahlulkitab, janganlah kamu berlebih-lebihan dalam (menjalankan) agamamu dan janganlah kamu mengatakan terhadap Allah, kecuali yang benar. Sesungguhnya Almasih, Isa putra Maryam, hanyalah utusan Allah dan (makhluk yang diciptakan dengan) kalimat-Nya yang Dia sampaikan kepada Maryam dan (dengan tiupan) roh dari-Nya. Maka, berimanlah kepada Allah dan rasul-rasul-Nya dan janganlah kamu mengatakan, “(Tuhan itu) tiga.” Berhentilah (dari ucapan itu). (Itu) lebih baik bagimu. Sesungguhnya hanya Allahlah Tuhan Yang Maha Esa. Maha Suci Dia dari (anggapan) mempunyai anak. Milik-Nyalah apa yang ada di langit dan apa yang ada di bumi. Cukuplah Allah sebagai pelindung."
  },
  {
    "ayat": 172,
    "arabic": "لَنْ يَّسْتَنْكِفَ الْمَسِيْحُ اَنْ يَّكُوْنَ عَبْدًا لِّلّٰهِ وَلَا الْمَلٰۤىِٕكَةُ الْمُقَرَّبُوْنَۗ وَمَنْ يَّسْتَنْكِفْ عَنْ عِبَادَتِهٖ وَيَسْتَكْبِرْ فَسَيَحْشُرُهُمْ اِلَيْهِ جَمِيْعًا",
    "transliteration_en": "Lanny yastankifal Maseehu ai yakoona 'abdal lillaahi wa lal malaaa'ikatul muqarraboon; wa mai yastankif 'an ibaadatihee wa yastakbir fasa yahshuruhum ilaihi jamee'aa",
    "transliteration_id": "Lay yastankifal-masīḥu ay yakūna ‘abdal lillāhi wa lal-malā'ikatul-muqarrabūn(a), wa may yastankif ‘an ‘ibādatihī wa yastakbir fa sayaḥsyuruhum ilaihi jamī‘ā(n).",
    "translation_en": "Never would the Messiah disdain to be a servant of Allah, nor would the angels near [to Him]. And whoever disdains His worship and is arrogant - He will gather them to Himself all together.",
    "translation_id": "Almasih tidak akan pernah enggan menjadi hamba Allah dan begitu pula para malaikat yang dekat (kepada Allah). Siapa yang enggan menyembah-Nya dan menyombongkan diri, maka Allah akan mengumpulkan mereka semua kepada-Nya."
  },
  {
    "ayat": 173,
    "arabic": "فَاَمَّا الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ فَيُوَفِّيْهِمْ اُجُوْرَهُمْ وَيَزِيْدُهُمْ مِّنْ فَضْلِهٖۚ وَاَمَّا الَّذِيْنَ اسْتَنْكَفُوْا وَاسْتَكْبَرُوْا فَيُعَذِّبُهُمْ عَذَابًا اَلِيْمًاۙ وَّلَا يَجِدُوْنَ لَهُمْ مِّنْ دُوْنِ اللّٰهِ وَلِيًّا وَّلَا نَصِيْرًا",
    "transliteration_en": "Fa ammal lazeena aamanoo wa 'amilus saalihaati fa yuwaffeehim ujoorahum wa yazeeduhum min fadlihee wa ammal lazeenas tankafoo wastakbaroo fa yu'azzibuhum 'azaaban aleemanw wa laa yajidoona lahum min doonil laahi waliyyanw wa laa naseeraa",
    "transliteration_id": "Fa ammal-lażīna āmanū wa ‘amiluṣ-ṣāliḥāti fa yuwaffīhim ujūrahum wa yazīduhum min faḍlih(ī), wa ammal-lażīnastankafū wastakbarū fa yu‘ażżibuhum ‘ażāban alīmā(n), wa lā yajidūna lahum min dūnillāhi waliyyaw wa lā naṣīrā(n).",
    "translation_en": "And as for those who believed and did righteous deeds, He will give them in full their rewards and grant them extra from His bounty. But as for those who disdained and were arrogant, He will punish them with a painful punishment, and they will not find for themselves besides Allah any protector or helper.",
    "translation_id": "Adapun orang-orang yang beriman dan mengerjakan kebajikan, Allah akan menyempurnakan pahala bagi mereka dan menambah sebagian dari karunia-Nya. Sementara itu, orang-orang yang enggan (menyembah Allah) dan menyombongkan diri, maka Allah akan mengazab mereka dengan azab yang pedih. Mereka pun tidak akan mendapatkan pelindung dan penolong selain Allah."
  },
  {
    "ayat": 174,
    "arabic": "يٰٓاَيُّهَا النَّاسُ قَدْ جَاۤءَكُمْ بُرْهَانٌ مِّنْ رَّبِّكُمْ وَاَنْزَلْنَآ اِلَيْكُمْ نُوْرًا مُّبِيْنًا",
    "transliteration_en": "yaa aiyuhan naasu qad jaaa'akum burhaanum mir Rabbikum wa anzalnaaa ilaikum Nooram Mubeena",
    "transliteration_id": "Yā ayyuhan-nāsu qad jā'akum burhānum mir rabbikum wa anzalnā ilaikum nūram mubīnā(n).",
    "translation_en": "O mankind, there has come to you a conclusive proof from your Lord, and We have sent down to you a clear light.",
    "translation_id": "Wahai manusia, sesungguhnya telah sampai kepadamu bukti kebenaran (Nabi Muhammad dengan mukjizatnya) dari Tuhanmu dan telah Kami turunkan kepadamu cahaya yang terang benderang (Al-Qur’an)."
  },
  {
    "ayat": 175,
    "arabic": "فَاَمَّا الَّذِيْنَ اٰمَنُوْا بِاللّٰهِ وَاعْتَصَمُوْا بِهٖ فَسَيُدْخِلُهُمْ فِيْ رَحْمَةٍ مِّنْهُ وَفَضْلٍۙ وَّيَهْدِيْهِمْ اِلَيْهِ صِرَاطًا مُّسْتَقِيْمًاۗ",
    "transliteration_en": "Fa ammal lazeena aamanoo billaahi wa'tasamoo bihee fasa yudkhiluhum fee rah matim minhu wa fadlinw wa yahdeehim ilaihi Siraatam Mustaqeema",
    "transliteration_id": "Fa ammal-lażīna āmanū billāhi wa‘taṣamū bihī fa sayudkhiluhum fī raḥmatim minhu  wa faḍl(in), wa yahdīhim ilaihi ṣirāṭam mustaqīmā(n).",
    "translation_en": "So those who believe in Allah and hold fast to Him - He will admit them to mercy from Himself and bounty and guide them to Himself on a straight path.",
    "translation_id": "Adapun orang-orang yang beriman kepada Allah dan berpegang teguh pada (agama)-Nya, maka Allah akan memasukkan mereka ke dalam rahmat dan karunia dari-Nya (surga) serta menunjukkan mereka jalan yang lurus kepada-Nya."
  },
  {
    "ayat": 176,
    "arabic": "يَسْتَفْتُوْنَكَۗ قُلِ اللّٰهُ يُفْتِيْكُمْ فِى الْكَلٰلَةِ ۗاِنِ امْرُؤٌا هَلَكَ لَيْسَ لَهٗ وَلَدٌ وَّلَهٗٓ اُخْتٌ فَلَهَا نِصْفُ مَا تَرَكَۚ وَهُوَ يَرِثُهَآ اِنْ لَّمْ يَكُنْ لَّهَا وَلَدٌ ۚ فَاِنْ كَانَتَا اثْنَتَيْنِ فَلَهُمَا الثُّلُثٰنِ مِمَّا تَرَكَ ۗوَاِنْ كَانُوْٓا اِخْوَةً رِّجَالًا وَّنِسَاۤءً فَلِلذَّكَرِ مِثْلُ حَظِّ الْاُنْثَيَيْنِۗ يُبَيِّنُ اللّٰهُ لَكُمْ اَنْ تَضِلُّوْا ۗ وَاللّٰهُ بِكُلِّ شَيْءٍ عَلِيْمٌ ࣖ",
    "transliteration_en": "Yastaftoonaka qulillaahu yafteekum fil kalaalah; inimru'un halaka laisa lahoo waladunw wa lahoo ukhtun falahaa nisfu maa tarak; wa huwa yarisuhaaa il lam yakkul lahaa walad; fa in kaanatas nataini falahumas sulusaani mimmmaa tarak; wa in kaanooo ikhwatar rijaalanw wa nisaaa'an faliz zakari mislu hazzil unsayayn; yubaiyinullaahu lakum an tadilloo; wallaahu bikulli shai'in Aleem",
    "transliteration_id": "Yastaftūnak(a), qulillāhu yuftīkum fil-kalālah(ti), inimru'un halaka laisa lahū waladuw wa lahū ukhtun fa lahā niṣfu mā tarak(a), wa huwa yariṡuhā illam yakul lahā walad(un), fa in kānataṡnataini fa lahumaṡ-ṡuluṡāni mimmā tarak(a), wa in kānū ikhwatar rijālaw wa nisā'an fa liż-żakari miṡlu ḥaẓẓil-unṡayain(i), yubayyinullāhu lakum an taḍillū, wallāhu bikulli syai'in ‘alīm(un).",
    "translation_en": "They request from you a [legal] ruling. Say, \"Allah gives you a ruling concerning one having neither descendants nor ascendants [as heirs].\" If a man dies, leaving no child but [only] a sister, she will have half of what he left. And he inherits from her if she [dies and] has no child. But if there are two sisters [or more], they will have two-thirds of what he left. If there are both brothers and sisters, the male will have the share of two females. Allah makes clear to you [His law], lest you go astray. And Allah is Knowing of all things.",
    "translation_id": "Mereka meminta fatwa kepadamu (tentang kalālah). Katakanlah, “Allah memberi fatwa kepadamu tentang kalālah, (yaitu) jika seseorang meninggal dan dia tidak mempunyai anak, tetapi mempunyai seorang saudara perempuan, bagiannya (saudara perempuannya itu) seperdua dari harta yang ditinggalkannya. Adapun saudara laki-lakinya mewarisi (seluruh harta saudara perempuan) jika dia tidak mempunyai anak. Akan tetapi, jika saudara perempuan itu dua orang, bagi keduanya dua pertiga dari harta yang ditinggalkan. Jika mereka (ahli waris itu terdiri atas) beberapa saudara laki-laki dan perempuan, bagian seorang saudara laki-laki sama dengan bagian dua orang saudara perempuan. Allah menerangkan (hukum ini) kepadamu agar kamu tidak tersesat. Allah Maha Mengetahui segala sesuatu.”"
  }
]