[
  {
    "ayat": 1,
    "arabic": "الۤرٰ ۗتِلْكَ اٰيٰتُ الْكِتٰبِ وَقُرْاٰنٍ مُّبِيْنٍ  ۔",
    "transliteration_en": "Alif-Laaam-Raa; tilka Aayaatul Kitaabi wa Qur-aa-nim Mubeen",
    "transliteration_id": "Alif lām rā, tilka āyātul-kitābi wa qur'ānim mubīn(in).",
    "translation_en": "Alif, Lam, Ra. These are the verses of the Book and a clear Qur'an.",
    "translation_id": "Alif Lām Rā. Itulah ayat-ayat Kitab, yaitu (ayat-ayat) Al-Qur’an yang memberi penjelasan."
  },
  {
    "ayat": 2,
    "arabic": "رُبَمَا يَوَدُّ الَّذِيْنَ كَفَرُوْا لَوْ كَانُوْا مُسْلِمِيْنَ",
    "transliteration_en": "Rubamaa yawaddul lazeena kafaroo law kaanoo muslimeen",
    "transliteration_id": "Rubamā yawaddul-lażīna kafarū lau kānū muslimīn(a).",
    "translation_en": "Perhaps those who disbelieve will wish that they had been Muslims.",
    "translation_id": "Orang-orang yang kufur itu sering kali (nanti di akhirat) menginginkan, sekiranya mereka dahulu (di dunia) menjadi orang-orang muslim."
  },
  {
    "ayat": 3,
    "arabic": "ذَرْهُمْ يَأْكُلُوْا وَيَتَمَتَّعُوْا وَيُلْهِهِمُ الْاَمَلُ فَسَوْفَ يَعْلَمُوْنَ",
    "transliteration_en": "Zarhum yaakuloo wa tatamatta'oo wa yulhihimul amalu fasawfa ya'lamoon",
    "transliteration_id": "Żarhum ya'kulū wa yatamatta‘ū wa yulhihimul-amalu fa saufa ya‘lamūn(a).",
    "translation_en": "Let them eat and enjoy themselves and be diverted by [false] hope, for they are going to know.",
    "translation_id": "Biarkanlah mereka (di dunia ini) makan, bersenang-senang, dan dilalaikan oleh angan-angan (kosong). Kelak mereka akan mengetahui (akibat perbuatannya)."
  },
  {
    "ayat": 4,
    "arabic": "وَمَآ اَهْلَكْنَا مِنْ قَرْيَةٍ اِلَّا وَلَهَا كِتَابٌ مَّعْلُوْمٌ",
    "transliteration_en": "Wa maaa ahlaknaa min qaryatin illaa wa lahaa kitaabum ma'loom",
    "transliteration_id": "Wa mā ahlaknā min qaryatin illā wa lahā kitābum ma‘lūm(un).",
    "translation_en": "And We did not destroy any city but that for it was a known decree.",
    "translation_id": "Kami tidak membinasakan suatu negeri, kecuali sudah ada ketentuan yang ditetapkan baginya."
  },
  {
    "ayat": 5,
    "arabic": "مَا تَسْبِقُ مِنْ اُمَّةٍ اَجَلَهَا وَمَا يَسْتَأْخِرُوْنَ",
    "transliteration_en": "Maa tasbiqu min ummatin ajalahaa wa maa yastaakhiroon",
    "transliteration_id": "Mā tasbiqu min ummatin ajalahā wa mā yasta'khirūn(a).",
    "translation_en": "No nation will precede its term, nor will they remain thereafter.",
    "translation_id": "Tidak ada satu umat pun yang dapat menyegerakan ajalnya dan tidak (pula) menangguhkan(-nya)."
  },
  {
    "ayat": 6,
    "arabic": "وَقَالُوْا يٰٓاَيُّهَا الَّذِيْ نُزِّلَ عَلَيْهِ الذِّكْرُ اِنَّكَ لَمَجْنُوْنٌ  ۗ",
    "transliteration_en": "Wa qaaloo yaaa aiyuhal lazee nuzzila 'alaihiz Zikru innaka lamajnoon",
    "transliteration_id": "Wa qālū yā ayyuhal-lażī nuzzila ‘alaihiż-żikru innaka lamajnūn(un).",
    "translation_en": "And they say, \"O you upon whom the message has been sent down, indeed you are mad.",
    "translation_id": "Mereka berkata, “Wahai orang yang kepadanya diturunkan Al-Qur’an, sesungguhnya engkau (Nabi Muhammad) benar-benar orang gila."
  },
  {
    "ayat": 7,
    "arabic": "لَوْمَا تَأْتِيْنَا بِالْمَلٰۤىِٕكَةِ اِنْ كُنْتَ مِنَ الصّٰدِقِيْنَ",
    "transliteration_en": "Law maa taateenaa bil malaaa'ikati in kunta minas saadiqeen",
    "transliteration_id": "Lau mā ta'tīnā bil-malā'ikati in kunta minaṣ-ṣādiqīn(a).",
    "translation_en": "Why do you not bring us the angels, if you should be among the truthful?\"",
    "translation_id": "Mengapa engkau tidak mendatangkan malaikat kepada kami, jika engkau termasuk orang-orang yang benar?”"
  },
  {
    "ayat": 8,
    "arabic": "مَا نُنَزِّلُ الْمَلٰۤىِٕكَةَ اِلَّا بِالْحَقِّ وَمَا كَانُوْٓا اِذًا مُّنْظَرِيْنَ",
    "transliteration_en": "Maa nunazzilul malaaa'i kata illaa bilhaqqi wa maa kaanooo izam munzareen",
    "transliteration_id": "Mā nunazzilul-malā'ikata illā bil-ḥaqqi wa mā kānū iżam munẓarīn(a).",
    "translation_en": "We do not send down the angels except with truth; and the disbelievers would not then be reprieved.",
    "translation_id": "Kami tidak menurunkan malaikat, kecuali dengan kebenaran. (Jika orang-orang kafir itu mengingkarinya,) mereka tidak diberi penangguhan (dari azab Allah)."
  },
  {
    "ayat": 9,
    "arabic": "اِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ وَاِنَّا لَهٗ لَحٰفِظُوْنَ",
    "transliteration_en": "Innaa Nahnu nazalnaz Zikra wa Innaa lahoo lahaa fizoon",
    "transliteration_id": "Innā naḥnu nazzalnaż-żikra wa innā lahū laḥāfiẓūn(a).",
    "translation_en": "Indeed, it is We who sent down the Qur'an and indeed, We will be its guardian.",
    "translation_id": "Sesungguhnya Kamilah yang menurunkan Al-Qur’an dan pasti Kami (pula) yang memeliharanya."
  },
  {
    "ayat": 10,
    "arabic": "وَلَقَدْ اَرْسَلْنَا مِنْ قَبْلِكَ فِيْ شِيَعِ الْاَوَّلِيْنَ",
    "transliteration_en": "Wa laqad arsalnaa min qablika fee shiya'il awwaleen",
    "transliteration_id": "Wa laqad arsalnā min qablika fī syiya‘il-awwalīn(a).",
    "translation_en": "And We had certainly sent [messengers] before you, [O Muhammad], among the sects of the former peoples.",
    "translation_id": "Sungguh, Kami benar-benar telah mengutus (beberapa rasul) sebelum engkau (Nabi Muhammad) kepada umat-umat terdahulu."
  },
  {
    "ayat": 11,
    "arabic": "وَمَا يَأْتِيْهِمْ مِّنْ رَّسُوْلٍ اِلَّا كَانُوْا بِهٖ يَسْتَهْزِءُوْنَ",
    "transliteration_en": "Wa maa yaateehim mir Rasoolin illaa kaanoo bihee yastahzi'oon",
    "transliteration_id": "Wa mā ya'tīhim mir rasūlin illā kānū bihī yastahzi'ūn(a).",
    "translation_en": "And no messenger would come to them except that they ridiculed him.",
    "translation_id": "Tidaklah datang seorang rasul kepada mereka, kecuali selalu memperolok-olokkannya."
  },
  {
    "ayat": 12,
    "arabic": "كَذٰلِكَ نَسْلُكُهٗ فِيْ قُلُوْبِ الْمُجْرِمِيْنَۙ",
    "transliteration_en": "kazaalika naslukuhoo fee quloobil mujrimeen",
    "transliteration_id": "Każālika naslukuhū fī qulūbil-mujrimīn(a).",
    "translation_en": "Thus do We insert denial into the hearts of the criminals.",
    "translation_id": "Demikianlah, Kami memasukkannya (olok-olok itu) ke dalam hati orang-orang yang berdosa."
  },
  {
    "ayat": 13,
    "arabic": "لَا يُؤْمِنُوْنَ بِهٖ وَقَدْ خَلَتْ سُنَّةُ الْاَوَّلِيْنَ",
    "transliteration_en": "Laa yu'minoona bihee wa qad khalat sunnatul awwaleen",
    "transliteration_id": "Lā yu'minūna bihī wa qad khalat sunnatul-awwalīn(a).",
    "translation_en": "They will not believe in it, while there has already occurred the precedent of the former peoples.",
    "translation_id": "Mereka tidak beriman kepadanya (Al-Qur’an), padahal telah berlalu sunatullah terhadap orang-orang terdahulu."
  },
  {
    "ayat": 14,
    "arabic": "وَلَوْ فَتَحْنَا عَلَيْهِمْ بَابًا مِّنَ السَّمَاۤءِ فَظَلُّوْا فِيْهِ يَعْرُجُوْنَۙ",
    "transliteration_en": "Wa law fatahnaa 'alaihim baabam minas samaaa'i fazaloo feehi ya'rujoon",
    "transliteration_id": "Wa lau fataḥnā ‘alaihim bābam minas-samā'i fa ẓallū fīhi ya‘rujūn(a).",
    "translation_en": "And [even] if We opened to them a gate from the heaven and they continued therein to ascend,",
    "translation_id": "Kalau Kami bukakan (salah satu) pintu langit untuk mereka, lalu mereka terus menerus naik ke atasnya,"
  },
  {
    "ayat": 15,
    "arabic": "لَقَالُوْٓا اِنَّمَا سُكِّرَتْ اَبْصَارُنَا بَلْ نَحْنُ قَوْمٌ مَّسْحُوْرُوْنَ ࣖ",
    "transliteration_en": "Laqaaloo innamaa sukkirat absaarunaa bal nahnu qawmum mashooroon",
    "transliteration_id": "Laqālū innamā sukkirat abṣārunā bal naḥnu qaumum masḥūrūn(a).",
    "translation_en": "They would say, \"Our eyes have only been dazzled. Rather, we are a people affected by magic.\"",
    "translation_id": "tentulah mereka berkata, “Sesungguhnya pandangan kamilah yang dikaburkan. Bahkan, kami adalah kaum yang terkena sihir.”"
  },
  {
    "ayat": 16,
    "arabic": "وَلَقَدْ جَعَلْنَا فِى السَّمَاۤءِ بُرُوْجًا وَّزَيَّنّٰهَا لِلنّٰظِرِيْنَۙ",
    "transliteration_en": "Wa laqad ja'alnaa fissamaaa'i buroojanw wa zaiyannaahaa linnaazireen",
    "transliteration_id": "Wa laqad ja‘alnā fis-samā'i burūjaw wa zayyannāhā lin-nāẓirīn(a).",
    "translation_en": "And We have placed within the heaven great stars and have beautified it for the observers.",
    "translation_id": "Sungguh, Kami benar-benar telah menciptakan gugusan bintang di langit dan menjadikannya terasa indah bagi orang-orang yang memandang (langit itu)."
  },
  {
    "ayat": 17,
    "arabic": "وَحَفِظْنٰهَا مِنْ كُلِّ شَيْطٰنٍ رَّجِيْمٍۙ",
    "transliteration_en": "Wa hafiznaahaa min kulli Shaitaanir rajeem",
    "transliteration_id": "Wa ḥafiẓnāhā min kulli syaiṭānir rajīm(in).",
    "translation_en": "And We have protected it from every devil expelled [from the mercy of Allah]",
    "translation_id": "Kami menjaganya dari setiap setan yang terkutuk,"
  },
  {
    "ayat": 18,
    "arabic": "اِلَّا مَنِ اسْتَرَقَ السَّمْعَ فَاَتْبَعَهٗ شِهَابٌ مُّبِيْنٌ",
    "transliteration_en": "Illaa manis taraqas sam'a fa atba'ahoo shihaabum mubeen",
    "transliteration_id": "Illā manistaraqas-sam‘a fa atba‘ahū syihābum mubīn(un).",
    "translation_en": "Except one who steals a hearing and is pursued by a clear burning flame.",
    "translation_id": "kecuali (setan) yang mencuri-curi (berita) yang dapat didengar (dari malaikat) maka dia dikejar oleh bintang-bintang (berapi) yang terang."
  },
  {
    "ayat": 19,
    "arabic": "وَالْاَرْضَ مَدَدْنٰهَا وَاَلْقَيْنَا فِيْهَا رَوَاسِيَ وَاَنْۢبَتْنَا فِيْهَا مِنْ كُلِّ شَيْءٍ مَّوْزُوْنٍ",
    "transliteration_en": "Wal arda madadnaahaa wa alqainaa feehaa rawaasiya wa ambatnaa feehaa min kulli shai'im mawzoon",
    "transliteration_id": "Wal-arḍa madadnāhā wa alqainā fīhā rawāsiya wa ambatnā fīhā min kulli syai'im mauzūn(in).",
    "translation_en": "And the earth - We have spread it and cast therein firmly set mountains and caused to grow therein [something] of every well-balanced thing.",
    "translation_id": "Kami telah menghamparkan bumi, memancangkan padanya gunung-gunung, dan menumbuhkan di sana segala sesuatu menurut ukuran(-nya)."
  },
  {
    "ayat": 20,
    "arabic": "وَجَعَلْنَا لَكُمْ فِيْهَا مَعَايِشَ وَمَنْ لَّسْتُمْ لَهٗ بِرٰزِقِيْنَ",
    "transliteration_en": "Wa ja'alnaa lakum feehaa ma'aayisha wa mal lastum lahoo biraaziqeen",
    "transliteration_id": "Wa ja‘alnā lakum fīhā ma‘āyisya  wa mal lastum lahū birāziqīn(a).",
    "translation_en": "And We have made for you therein means of living and [for] those for whom you are not providers.",
    "translation_id": "Kami telah menjadikan di sana sumber-sumber kehidupan untukmu dan (menjadikan pula) makhluk hidup yang bukan kamu pemberi rezekinya."
  },
  {
    "ayat": 21,
    "arabic": "وَاِنْ مِّنْ شَيْءٍ اِلَّا عِنْدَنَا خَزَاۤىِٕنُهٗ وَمَا نُنَزِّلُهٗٓ اِلَّا بِقَدَرٍ مَّعْلُوْمٍ",
    "transliteration_en": "Wa im min shai'in illaa 'indanaa khazaaa 'inuhoo wa maa nunazziluhooo illaa biqadarim ma'loom",
    "transliteration_id": "Wa im min syai'in illā ‘indanā khazā'inuhū wa mā nunazziluhū illā biqadarim ma‘lūm(un).",
    "translation_en": "And there is not a thing but that with Us are its depositories, and We do not send it down except according to a known measure.",
    "translation_id": "Tidak ada sesuatu pun melainkan di sisi Kamilah perbendaharaannya dan Kami tidak menurunkannya melainkan dengan ukuran tertentu."
  },
  {
    "ayat": 22,
    "arabic": "وَاَرْسَلْنَا الرِّيٰحَ لَوَاقِحَ فَاَنْزَلْنَا مِنَ السَّمَاۤءِ مَاۤءً فَاَسْقَيْنٰكُمُوْهُۚ وَمَآ اَنْتُمْ لَهٗ بِخٰزِنِيْنَ",
    "transliteration_en": "Wa arsalnar riyaaha la waaqiha fa anzalnaa minas samaaa'i maaa'an fa asqai naakumoohu wa maaa antum lahoo bikhaazineen",
    "transliteration_id": "Wa arsalnar-riyāḥa lawāqiha fa anzalnā minas-samā'i mā'an fa asqainākumūh(u), wa mā antum lahū bikhāzinīn(a).",
    "translation_en": "And We have sent the fertilizing winds and sent down water from the sky and given you drink from it. And you are not its retainers.",
    "translation_id": "Kami telah meniupkan angin untuk mengawinkan. Maka, Kami menurunkan hujan dari langit lalu memberimu minum dengan (air) itu, sedangkan kamu bukanlah orang-orang yang menyimpannya."
  },
  {
    "ayat": 23,
    "arabic": "وَاِنَّا لَنَحْنُ نُحْيٖ وَنُمِيْتُ وَنَحْنُ الْوٰرِثُوْنَ",
    "transliteration_en": "Wa innnaa la nahnu nuhyee wa numeetu wa nahnul waarisoon",
    "transliteration_id": "Wa innā lanaḥnu nuḥyī wa numītu wa naḥnul-wāriṡūn(a).",
    "translation_en": "And indeed, it is We who give life and cause death, and We are the Inheritor.",
    "translation_id": "Sesungguhnya Kamilah yang menghidupkan dan mematikan serta Kami (pulalah) yang mewarisi."
  },
  {
    "ayat": 24,
    "arabic": "وَلَقَدْ عَلِمْنَا الْمُسْتَقْدِمِيْنَ مِنْكُمْ وَلَقَدْ عَلِمْنَا الْمُسْتَأْخِرِيْنَ",
    "transliteration_en": "Wa la qad 'alimnal mustaqdimeena minkum wa laqad 'alimnal mustaakhireen",
    "transliteration_id": "Wa laqad ‘alimnal-mustaqdimīna minkum wa laqad ‘alimnal-musta'khirīn(a).",
    "translation_en": "And We have already known the preceding [generations] among you, and We have already known the later [ones to come].",
    "translation_id": "Sungguh, Kami benar-benar mengetahui orang-orang yang terdahulu di antara kamu dan Kami mengetahui pula orang-orang yang terkemudian."
  },
  {
    "ayat": 25,
    "arabic": "وَاِنَّ رَبَّكَ هُوَ يَحْشُرُهُمْۗ اِنَّهٗ حَكِيْمٌ عَلِيْمٌ ࣖ",
    "transliteration_en": "Wa inna Rabbaka Huwa yahshuruhum; innahoo Hakeem 'Aleem",
    "transliteration_id": "Wa inna rabbaka huwa yaḥsyuruhum, innahū ḥakīmun ‘alīm(un).",
    "translation_en": "And indeed, your Lord will gather them; indeed, He is Wise and Knowing.",
    "translation_id": "Sesungguhnya hanya Tuhanmulah yang akan mengumpulkan mereka. Sesungguhnya Dia Maha Bijaksana lagi Maha Mengetahui."
  },
  {
    "ayat": 26,
    "arabic": "وَلَقَدْ خَلَقْنَا الْاِنْسَانَ مِنْ صَلْصَالٍ مِّنْ حَمَاٍ مَّسْنُوْنٍۚ",
    "transliteration_en": "Wa laqad khalaqnal insaana min salsaalim min hama im masnoon",
    "transliteration_id": "Wa laqad khalaqnal-insāna min ṣalṣālim min ḥama'im masnūn(in).",
    "translation_en": "And We did certainly create man out of clay from an altered black mud.",
    "translation_id": "Sungguh, Kami benar-benar telah menciptakan manusia (Adam) dari tanah liat kering dari lumpur hitam yang dibentuk."
  },
  {
    "ayat": 27,
    "arabic": "وَالْجَاۤنَّ خَلَقْنٰهُ مِنْ قَبْلُ مِنْ نَّارِ السَّمُوْمِ",
    "transliteration_en": "Waljaaanna khalaqnaahu min qablu min naaris samoom",
    "transliteration_id": "Wal-jānna khalaqnāhu min qablu min nāris-samūm(i).",
    "translation_en": "And the jinn We created before from scorching fire.",
    "translation_id": "Sebelumnya Kami telah menciptakan jin dari api yang sangat panas."
  },
  {
    "ayat": 28,
    "arabic": "وَاِذْ قَالَ رَبُّكَ لِلْمَلٰۤىِٕكَةِ اِنِّيْ خَالِقٌۢ بَشَرًا مِّنْ صَلْصَالٍ مِّنْ حَمَاٍ مَّسْنُوْنٍۚ",
    "transliteration_en": "Wa iz qaala Rabbuka lilmalaaa' ikati innee khaaliqum basharam min salsaalim min hama im masnoon",
    "transliteration_id": "Wa iż qāla rabbuka lil-malā'ikati innī khāliqum basyaram min ṣalṣālim min ḥama'im masnūn(in).",
    "translation_en": "And [mention, O Muhammad], when your Lord said to the angels, \"I will create a human being out of clay from an altered black mud.",
    "translation_id": "(Ingatlah) ketika Tuhanmu berfirman kepada malaikat, “Sesungguhnya Aku akan menciptakan seorang manusia dari tanah liat kering dari lumpur hitam yang dibentuk."
  },
  {
    "ayat": 29,
    "arabic": "فَاِذَا سَوَّيْتُهٗ وَنَفَخْتُ فِيْهِ مِنْ رُّوْحِيْ فَقَعُوْا لَهٗ سٰجِدِيْنَ",
    "transliteration_en": "Fa izaa sawwaituhoo wa nafakhtu feehi mir roohee faqa'oo lahoo saajideen",
    "transliteration_id": "Fa iżā sawwaituhū wa nafakhtu fīhi mir rūḥī fa qa‘ū lahū sājidīn(a).",
    "translation_en": "And when I have proportioned him and breathed into him of My [created] soul, then fall down to him in prostration.\"",
    "translation_id": "Maka, apabila Aku telah menyempurnakan (kejadian)-nya dan telah meniupkan roh (ciptaan)-Ku ke dalamnya, menyungkurlah kamu kepadanya dengan bersujud.”"
  },
  {
    "ayat": 30,
    "arabic": "فَسَجَدَ الْمَلٰۤىِٕكَةُ كُلُّهُمْ اَجْمَعُوْنَۙ",
    "transliteration_en": "Fasajadal malaaa'ikatu kulluhum ajma'oon",
    "transliteration_id": "Fa sajadal-malā'ikatu kulluhum  ajma‘ūn(a).",
    "translation_en": "So the angels prostrated - all of them entirely,",
    "translation_id": "Lalu, para malaikat itu bersujud semuanya bersama-sama,"
  },
  {
    "ayat": 31,
    "arabic": "اِلَّآ اِبْلِيْسَۗ اَبٰىٓ اَنْ يَّكُوْنَ مَعَ السّٰجِدِيْنَ",
    "transliteration_en": "Illaaa ibleesa abaaa ai yakoona ma'as saajideen",
    "transliteration_id": "Illā iblīs(a), abā ay yakūna ma‘as-sājidīn(a).",
    "translation_en": "Except Iblees, he refused to be with those who prostrated.",
    "translation_id": "kecuali Iblis. Ia enggan ikut bersama para (malaikat) yang bersujud."
  },
  {
    "ayat": 32,
    "arabic": "قَالَ يٰٓاِبْلِيْسُ مَا لَكَ اَلَّا تَكُوْنَ مَعَ السّٰجِدِيْنَ",
    "transliteration_en": "Qaala yaaa Ibleesu maa laka allaa takoona ma'as saajideen",
    "transliteration_id": "Qāla yā iblīsu mā laka allā takūna ma‘as-sājidīn(a).",
    "translation_en": "[Allah] said, O Iblees, what is [the matter] with you that you are not with those who prostrate?\"",
    "translation_id": "Dia (Allah) berfirman, “Wahai Iblis, apa yang menyebabkanmu enggan bersama mereka yang bersujud itu?”"
  },
  {
    "ayat": 33,
    "arabic": "قَالَ لَمْ اَكُنْ لِّاَسْجُدَ لِبَشَرٍ خَلَقْتَهٗ مِنْ صَلْصَالٍ مِّنْ حَمَاٍ مَّسْنُوْنٍ",
    "transliteration_en": "Qaala lam akul li asjuda libasharin khalaqtahoo min salsaalim min hama im masnoon",
    "transliteration_id": "Qāla lam akul li'asjuda libasyarin khalaqtahū min ṣalṣālim min ḥama'im masnūn(in).",
    "translation_en": "He said, \"Never would I prostrate to a human whom You created out of clay from an altered black mud.\"",
    "translation_id": "Ia (Iblis) berkata, “Aku sekali-kali tidak akan bersujud kepada manusia yang Engkau ciptakan dari tanah liat kering dari lumpur hitam yang diberi bentuk.”"
  },
  {
    "ayat": 34,
    "arabic": "قَالَ فَاخْرُجْ مِنْهَا فَاِنَّكَ رَجِيْمٌۙ",
    "transliteration_en": "Qaala fakhruj minhaa fa innaka rajeem",
    "transliteration_id": "Qāla fakhruj minhā fa innaka rajīm(un).",
    "translation_en": "[Allah] said, \"Then get out of it, for indeed, you are expelled.",
    "translation_id": "(Allah) berfirman, “Keluarlah darinya (surga) karena sesungguhnya kamu terkutuk."
  },
  {
    "ayat": 35,
    "arabic": "وَّاِنَّ عَلَيْكَ اللَّعْنَةَ اِلٰى يَوْمِ الدِّيْنِ",
    "transliteration_en": "Wa inna 'alikal la'nata ilaa Yawmid Deen",
    "transliteration_id": "Wa inna ‘alaikal-la‘nata ilā yaumid-dīn(i).",
    "translation_en": "And indeed, upon you is the curse until the Day of Recompense.\"",
    "translation_id": "Sesungguhnya kamu terlaknat sampai hari Kiamat.”"
  },
  {
    "ayat": 36,
    "arabic": "قَالَ رَبِّ فَاَنْظِرْنِيْٓ اِلٰى يَوْمِ يُبْعَثُوْنَ",
    "transliteration_en": "Qaala Rabbi fa anzirneee ilaa Yawmi yub'asoon",
    "transliteration_id": "Qāla rabbi fa anẓirnī ilā yaumi yub‘aṡūn(a).",
    "translation_en": "He said, \"My Lord, then reprieve me until the Day they are resurrected.\"",
    "translation_id": "(Iblis) berkata, “Wahai Tuhanku, tangguhkanlah (usia)-ku sampai hari mereka (manusia) dibangkitkan.”"
  },
  {
    "ayat": 37,
    "arabic": "قَالَ فَاِنَّكَ مِنَ الْمُنْظَرِيْنَۙ",
    "transliteration_en": "Qaala fa innaka minal munzareen",
    "transliteration_id": "Qāla fa innaka minal-munẓarīn(a).",
    "translation_en": "[Allah] said, \"So indeed, you are of those reprieved",
    "translation_id": "(Allah) berfirman, “Sesungguhnya kamu termasuk golongan yang ditangguhkan"
  },
  {
    "ayat": 38,
    "arabic": "اِلٰى يَوْمِ الْوَقْتِ الْمَعْلُوْمِ",
    "transliteration_en": "Ilaa Yawmil waqtil ma'loom",
    "transliteration_id": "Ilā yaumil-waqtil-ma‘lūm(i).",
    "translation_en": "Until the Day of the time well-known.\"",
    "translation_id": "sampai hari yang telah ditentukan waktunya (kiamat).”"
  },
  {
    "ayat": 39,
    "arabic": "قَالَ رَبِّ بِمَآ اَغْوَيْتَنِيْ لَاُزَيِّنَنَّ لَهُمْ فِى الْاَرْضِ وَلَاُغْوِيَنَّهُمْ اَجْمَعِيْنَۙ",
    "transliteration_en": "Qaala Rabbi bimaaa aghwaitanee la uzayyinaana lahum fil ardi wa la ughwiyan nahum ajma'een",
    "transliteration_id": "Qāla rabbi bimā agwaitanī la'uzayyinanna lahum fil-arḍi wa la'ugwiyannahum ajma‘īn(a).",
    "translation_en": "[Iblees] said, \"My Lord, because You have put me in error, I will surely make [disobedience] attractive to them on earth, and I will mislead them all",
    "translation_id": "Ia (Iblis) berkata, “Tuhanku, karena Engkau telah menyesatkanku, sungguh aku akan menjadikan (kejahatan) terasa indah bagi mereka di bumi dan sungguh aku akan menyesatkan mereka semua,"
  },
  {
    "ayat": 40,
    "arabic": "اِلَّا عِبَادَكَ مِنْهُمُ الْمُخْلَصِيْنَ",
    "transliteration_en": "Illaa 'ibaadaka minhumul mukhlaseen",
    "transliteration_id": "Illā ‘ibādaka minhumul-mukhlaṣīn(a).",
    "translation_en": "Except, among them, Your chosen servants.\"",
    "translation_id": "kecuali hamba-hamba-Mu yang terpilih (karena keikhlasannya) di antara mereka.”"
  },
  {
    "ayat": 41,
    "arabic": "قَالَ هٰذَا صِرَاطٌ عَلَيَّ مُسْتَقِيْمٌ",
    "transliteration_en": "Qaala haaza Siraatun 'alaiya Mustaqeem",
    "transliteration_id": "Qāla hāżā ṣirāṭun ‘alayya mustaqīm(un).",
    "translation_en": "[Allah] said, \"This is a path [of return] to Me [that is] straight.",
    "translation_id": "Dia (Allah) berfirman, “Ini adalah jalan lurus yang Aku jamin (ditunjukkan kepada hamba-hamba-Ku itu)."
  },
  {
    "ayat": 42,
    "arabic": "اِنَّ عِبَادِيْ لَيْسَ لَكَ عَلَيْهِمْ سُلْطٰنٌ اِلَّا مَنِ اتَّبَعَكَ مِنَ الْغَاوِيْنَ",
    "transliteration_en": "Inna 'ibaadee laisa laka 'alaihim sultaanun illaa manittaba'aka minal ghaaween",
    "transliteration_id": "Inna ‘ibādī laisa laka ‘alaihim sulṭānun illā manittaba‘aka minal-gāwīn(a).",
    "translation_en": "Indeed, My servants - no authority will you have over them, except those who follow you of the deviators.",
    "translation_id": "Sesungguhnya kamu (Iblis) tidak kuasa atas hamba-hamba-Ku kecuali mereka yang mengikutimu, yaitu orang-orang yang sesat.”"
  },
  {
    "ayat": 43,
    "arabic": "وَاِنَّ جَهَنَّمَ لَمَوْعِدُهُمْ اَجْمَعِيْنَۙ",
    "transliteration_en": "Wa inna jahannama lamaw'iduhum ajma'een",
    "transliteration_id": "Wa inna jahannama lamau‘iduhum  ajma‘īn(a).",
    "translation_en": "And indeed, Hell is the promised place for them all.",
    "translation_id": "Sesungguhnya (neraka) Jahanam benar-benar (tempat) yang telah dijanjikan untuk mereka (pengikut setan) semua."
  },
  {
    "ayat": 44,
    "arabic": "لَهَا سَبْعَةُ اَبْوَابٍۗ لِكُلِّ بَابٍ مِّنْهُمْ جُزْءٌ مَّقْسُوْمٌ ࣖ",
    "transliteration_en": "Lahaa sab'atu abwaab; likulli baabim minhum juz'um maqsoom",
    "transliteration_id": "Lahā sab‘atu abwāb(in), likulli bābim minhum juz'um maqsūm(un).",
    "translation_en": "It has seven gates; for every gate is of them a portion designated.\"",
    "translation_id": "Ia (Jahanam) mempunyai tujuh pintu. Setiap pintu (telah ditetapkan) untuk golongan tertentu dari mereka."
  },
  {
    "ayat": 45,
    "arabic": "اِنَّ الْمُتَّقِيْنَ فِيْ جَنّٰتٍ وَّعُيُوْنٍۗ",
    "transliteration_en": "Innal muttaqeena fee Jannaatinw wa 'uyoon",
    "transliteration_id": "Innal-muttaqīna fī jannātiw wa ‘uyūn(in).",
    "translation_en": "Indeed, the righteous will be within gardens and springs.",
    "translation_id": "Sesungguhnya orang-orang yang bertakwa berada dalam (surga yang penuh) taman-taman dan mata air."
  },
  {
    "ayat": 46,
    "arabic": "اُدْخُلُوْهَا بِسَلٰمٍ اٰمِنِيْنَ",
    "transliteration_en": "Udkhuloohaa bisalaamin aamineen",
    "transliteration_id": "Udkhulūhā bisalāmin āminīn(a).",
    "translation_en": "[Having been told], \"Enter it in peace, safe [and secure].\"",
    "translation_id": "(Allah berfirman,) “Masuklah ke dalamnya dengan sejahtera dan aman.”"
  },
  {
    "ayat": 47,
    "arabic": "وَنَزَعْنَا مَا فِيْ صُدُوْرِهِمْ مِّنْ غِلٍّ اِخْوَانًا عَلٰى سُرُرٍ مُّتَقٰبِلِيْنَ",
    "transliteration_en": "Wa naza'naa ma fee sudoorihim min ghillin ikhwaanan 'alaa sururim mutaqaabileen",
    "transliteration_id": "Wa naza‘nā mā fī ṣudūrihim min gillin ikhwānan ‘alā sururim mutaqābilīn(a).",
    "translation_en": "And We will remove whatever is in their breasts of resentment, [so they will be] brothers, on thrones facing each other.",
    "translation_id": "Kami mencabut segala rasa dendam yang ada dalam hati mereka. Mereka bersaudara (dan) duduk berhadap-hadapan di atas dipan."
  },
  {
    "ayat": 48,
    "arabic": "لَا يَمَسُّهُمْ فِيْهَا نَصَبٌ وَّمَا هُمْ مِّنْهَا بِمُخْرَجِيْنَ",
    "transliteration_en": "Laa yamas suhum feehaa nasabunw wa maa hum minhaa bimukhrajeen",
    "transliteration_id": "Lā yamassuhum fīhā naṣabuw wa mā hum minhā bimukhrajīn(a).",
    "translation_en": "No fatigue will touch them therein, nor from it will they [ever] be removed.",
    "translation_id": "Mereka tidak merasa lelah di dalamnya dan tidak akan dikeluarkan darinya."
  },
  {
    "ayat": 49,
    "arabic": "۞ نَبِّئْ عِبَادِيْٓ اَنِّيْٓ اَنَا الْغَفُوْرُ الرَّحِيْمُۙ",
    "transliteration_en": "Nabbi' 'ibaadeee annneee anal Ghafoorur Raheem",
    "transliteration_id": "Nabbi' ‘ibādī annī anal-gafūrur-raḥīm(u).",
    "translation_en": "[O Muhammad], inform My servants that it is I who am the Forgiving, the Merciful.",
    "translation_id": "Kabarkanlah kepada hamba-hamba-Ku bahwa sesungguhnya Akulah Yang Maha Pengampun lagi Maha Penyayang"
  },
  {
    "ayat": 50,
    "arabic": "وَاَنَّ عَذَابِيْ هُوَ الْعَذَابُ الْاَلِيْمُ",
    "transliteration_en": "Wa anna 'azaabee uwal 'azaabul aleem",
    "transliteration_id": "Wa anna ‘ażābī huwal-‘ażābul-alīm(u).",
    "translation_en": "And that it is My punishment which is the painful punishment.",
    "translation_id": "dan bahwa sesungguhnya siksaan-Kulah azab yang sangat pedih."
  }
]