[
  {
    "ayat": 51,
    "arabic": "فَاَصَابَهُمْ سَيِّاٰتُ مَا كَسَبُوْا ۗوَالَّذِيْنَ ظَلَمُوْا مِنْ هٰٓؤُلَاۤءِ سَيُصِيْبُهُمْ سَيِّاٰتُ مَا كَسَبُوْا ۙوَمَا هُمْ بِمُعْجِزِيْنَ",
    "transliteration_en": "Fa asaabahum saiyi aatu maa kasaboo; wallazeena zalamoo min haaa'ulaaa'i sa yuzeebuhum saiyi aatu maa kasaboo wa maa hum bimu'jizeen",
    "transliteration_id": "Fa'aṣābahum sayyi'ātu mā kasabū, wal-lażīna ẓalamū min hā'ulā'i sayuṣībuhum  sayyi'ātu mā kasabū, wa mā hum bimu‘jizīn(a).",
    "translation_en": "And the evil consequences of what they earned struck them. And those who have wronged of these [people] will be afflicted by the evil consequences of what they earned; and they will not cause failure.",
    "translation_id": "Lalu, mereka ditimpa (bencana akibat) keburukan-keburukan yang mereka perbuat. Orang-orang yang zalim di antara mereka juga akan ditimpa (bencana akibat) keburukan-keburukan yang mereka perbuat dan tidak dapat melepaskan diri (darinya)."
  },
  {
    "ayat": 52,
    "arabic": "اَوَلَمْ يَعْلَمُوْٓا اَنَّ اللّٰهَ يَبْسُطُ الرِّزْقَ لِمَنْ يَّشَاۤءُ وَيَقْدِرُ ۗاِنَّ فِيْ ذٰلِكَ لَاٰيٰتٍ لِّقَوْمٍ يُّؤْمِنُوْنَ ࣖ",
    "transliteration_en": "Awalam ya'lamooo annal laaha yabsutur rizqa limai yashaaa'u wa yaqdir; inna fee zaalika la Aayaatil liqamai yu'minoon",
    "transliteration_id": "Awalam ya‘lamū annallāha yabsuṭur-rizqa limay yasyā'u wa yaqdir(u), inna fī żālika la'āyātil liqaumiy yu'minūn(a).",
    "translation_en": "Do they not know that Allah extends provision for whom He wills and restricts [it]? Indeed in that are signs for a people who believe.",
    "translation_id": "Tidakkah mereka mengetahui bahwa Allah melapangkan rezeki bagi siapa yang Dia kehendaki dan menyempitkannya (bagi siapa yang Dia kehendaki)? Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda (kekuasaan Allah) bagi kaum yang beriman."
  },
  {
    "ayat": 53,
    "arabic": "۞ قُلْ يٰعِبَادِيَ الَّذِيْنَ اَسْرَفُوْا عَلٰٓى اَنْفُسِهِمْ لَا تَقْنَطُوْا مِنْ رَّحْمَةِ اللّٰهِ ۗاِنَّ اللّٰهَ يَغْفِرُ الذُّنُوْبَ جَمِيْعًا ۗاِنَّهٗ هُوَ الْغَفُوْرُ الرَّحِيْمُ",
    "transliteration_en": "Qul yaa'ibaadiyal lazeena asrafoo 'alaaa anfusihim laa taqnatoo mirrahmatil laah; innal laaha yaghfiruz zunooba jamee'aa; innahoo Huwal Ghafoorur Raheem",
    "transliteration_id": "Qul yā ‘ibādiyal-lażīna asrafū ‘alā anfusihim lā taqnaṭū mir raḥmatillāh(i), innallāha yagfiruż-żunūba jamī‘ā(n), innahū huwal-gafūrur-raḥīm(u).",
    "translation_en": "Say, \"O My servants who have transgressed against themselves [by sinning], do not despair of the mercy of Allah. Indeed, Allah forgives all sins. Indeed, it is He who is the Forgiving, the Merciful.\"",
    "translation_id": "Katakanlah (Nabi Muhammad), “Wahai hamba-hamba-Ku yang melampaui batas (dengan menzalimi) dirinya sendiri, janganlah berputus asa dari rahmat Allah. Sesungguhnya Allah mengampuni dosa semuanya. Sesungguhnya Dialah Yang Maha Pengampun lagi Maha Penyayang."
  },
  {
    "ayat": 54,
    "arabic": "وَاَنِيْبُوْٓا اِلٰى رَبِّكُمْ وَاَسْلِمُوْا لَهٗ مِنْ قَبْلِ اَنْ يَّأْتِيَكُمُ الْعَذَابُ ثُمَّ لَا تُنْصَرُوْنَ",
    "transliteration_en": "Wa aneebooo ilaa Rabbikum wa aslimoo lahoo min qabli ai yaatiyakumul 'azaabu summ laa tunsaroon",
    "transliteration_id": "Wa anībū ilā rabbikum wa aslimū lahū min qabli ay ya'tiyakumul-‘ażābu ṡumma lā tunṣarūn(a).",
    "translation_en": "And return [in repentance] to your Lord and submit to Him before the punishment comes upon you; then you will not be helped.",
    "translation_id": "Kembalilah kepada Tuhanmu dan berserahdirilah kepada-Nya sebelum datang azab kepadamu, kemudian kamu tidak akan ditolong."
  },
  {
    "ayat": 55,
    "arabic": "وَاتَّبِعُوْٓا اَحْسَنَ مَآ اُنْزِلَ اِلَيْكُمْ مِّنْ رَّبِّكُمْ مِّنْ قَبْلِ اَنْ يَّأْتِيَكُمُ الْعَذَابُ بَغْتَةً وَّاَنْتُمْ لَا تَشْعُرُوْنَ ۙ",
    "transliteration_en": "Wattabi'ooo ahsana maaa unzila ilaikum mir Rabbikum min qabli aiyaatiyakumal 'azaabu baghtatanw wa antum laa tash'uroon",
    "transliteration_id": "Wattabi‘ū aḥsana mā unzila ilaikum mir rabbikum min qabli ay ya'tiyakumul ‘ażābu bagtataw wa antum lā tasy‘urūn(a).",
    "translation_en": "And follow the best of what was revealed to you from your Lord before the punishment comes upon you suddenly while you do not perceive,",
    "translation_id": "Ikutilah sebaik-baik apa yang diturunkan kepadamu dari Tuhanmu (Al-Qur’an) sebelum azab datang kepadamu secara mendadak, sedangkan kamu tidak menyadarinya."
  },
  {
    "ayat": 56,
    "arabic": "اَنْ تَقُوْلَ نَفْسٌ يّٰحَسْرَتٰى عَلٰى مَا فَرَّطْتُّ فِيْ جَنْۢبِ اللّٰهِ وَاِنْ كُنْتُ لَمِنَ السّٰخِرِيْنَۙ",
    "transliteration_en": "An taqoola nafsuny yaahasrataa 'alaa maa farrattu fee jambil laahi wa in kuntu laminas saakhireen",
    "transliteration_id": "An taqūla yā ḥasratā ‘alā mā farraṭṭu fī jambillāhi wa in kuntu laminas-sākhirīn(a).",
    "translation_en": "Lest a soul should say, \"Oh [how great is] my regret over what I neglected in regard to Allah and that I was among the mockers.\"",
    "translation_id": "(Maksudnya,) supaya (tidak) ada orang yang berkata, “Alangkah besar penyesalanku atas kelalaianku dalam (menunaikan kewajiban) terhadap Allah dan sesungguhnya aku benar-benar termasuk orang-orang yang memperolok-olokkan (agama Allah).”"
  },
  {
    "ayat": 57,
    "arabic": "اَوْ تَقُوْلَ لَوْ اَنَّ اللّٰهَ هَدٰىنِيْ لَكُنْتُ مِنَ الْمُتَّقِيْنَ ۙ",
    "transliteration_en": "Aw taqoola law annal laaha hadaanee lakuntu minal muttaqeen",
    "transliteration_id": "Au taqūla lau annallāha hadānī lakuntu minal-muttaqīn(a).",
    "translation_en": "Or [lest] it say, \"If only Allah had guided me, I would have been among the righteous.\"",
    "translation_id": "Atau, supaya (tidak) ada yang berkata, “Seandainya Allah memberi petunjuk kepadaku, tentulah aku termasuk orang-orang yang bertakwa.”"
  },
  {
    "ayat": 58,
    "arabic": "اَوْ تَقُوْلَ حِيْنَ تَرَى الْعَذَابَ لَوْ اَنَّ لِيْ كَرَّةً فَاَكُوْنَ مِنَ الْمُحْسِنِيْنَ",
    "transliteration_en": "Aw taqoola heena taral 'azaaba law anna lee karratan fa akoona minal muhsineen",
    "transliteration_id": "Au taqūla ḥīna taral-‘ażāba lau anna lī karratan fa akūna minal-muḥsinīn(a).",
    "translation_en": "Or [lest] it say when it sees the punishment, \"If only I had another turn so I could be among the doers of good.\"",
    "translation_id": "Atau, supaya (tidak) ada (pula) yang berkata ketika melihat azab, “Seandainya aku dapat kembali (ke dunia), tentu aku termasuk orang-orang yang muhsin.”"
  },
  {
    "ayat": 59,
    "arabic": "بَلٰى قَدْ جَاۤءَتْكَ اٰيٰتِيْ فَكَذَّبْتَ بِهَا وَاسْتَكْبَرْتَ وَكُنْتَ مِنَ الْكٰفِرِيْنَ",
    "transliteration_en": "Balaa qad jaaa'atka Asyaatee fakazzabta bihaa wastak barta wa kunta minal kaafireen",
    "transliteration_id": "Balā qad jā'atka āyātī fa każżabta bihā wastakbarta wa kunta minal-kāfirīn(a).",
    "translation_en": "But yes, there had come to you My verses, but you denied them and were arrogant, and you were among the disbelievers.",
    "translation_id": "Tidak begitu! Sebenarnya ayat-ayat-Ku telah datang kepadamu, tetapi kamu mendustakannya, menyombongkan diri, dan termasuk orang-orang kafir."
  },
  {
    "ayat": 60,
    "arabic": "وَيَوْمَ الْقِيٰمَةِ تَرَى الَّذِيْنَ كَذَبُوْا عَلَى اللّٰهِ وُجُوْهُهُمْ مُّسْوَدَّةٌ  ۗ اَلَيْسَ فِيْ جَهَنَّمَ مَثْوًى لِّلْمُتَكَبِّرِيْنَ",
    "transliteration_en": "Wa Yawmal Qiyaamati taral lazeena kazaboo 'alallaahi wujoohuhum muswaddah; alaisa fee Hahannama maswal lilmutakabbireen",
    "transliteration_id": "Wa yaumal-qiyāmati taral-lażīna każabū ‘alallāhi wujūhuhum muswaddah(tun), alaisa fī jahannama maṡwal lil-mutakabbirīn(a).",
    "translation_en": "And on the Day of Resurrection you will see those who lied about Allah [with] their faces blackened. Is there not in Hell a residence for the arrogant?",
    "translation_id": "Pada hari Kiamat, engkau akan melihat bahwa orang-orang yang berdusta kepada Allah wajahnya menghitam. Bukankah (neraka) Jahanam itu tempat tinggal bagi orang-orang yang takabur?"
  },
  {
    "ayat": 61,
    "arabic": "وَيُنَجِّى اللّٰهُ الَّذِيْنَ اتَّقَوْا بِمَفَازَتِهِمْۖ  لَا يَمَسُّهُمُ السُّوْۤءُ وَلَا هُمْ يَحْزَنُوْنَ",
    "transliteration_en": "Wa yunajjil laahul lazee nat taqaw bimafaazatihim laa yamassuhumus sooo'u wa laa hum uahzanoon",
    "transliteration_id": "Wa yunajjillāhul-lażīnattaqau bimafāzatihim, lā yamassuhumus-sū'u wa lā hum yaḥzanūn(a).",
    "translation_en": "And Allah will save those who feared Him by their attainment; no evil will touch them, nor will they grieve.",
    "translation_id": "Allah menyelamatkan orang-orang yang bertakwa karena kemenangannya sehingga mereka tidak disentuh oleh azab dan tidak bersedih."
  },
  {
    "ayat": 62,
    "arabic": "اَللّٰهُ خَالِقُ كُلِّ شَيْءٍ ۙوَّهُوَ عَلٰى كُلِّ شَيْءٍ وَّكِيْلٌ",
    "transliteration_en": "Allaahu khaaliqu kulli shai'inw wa Huwa 'alaa kulli shai'inw Wakeel",
    "transliteration_id": "Allāhu khāliqu kulli syai'(in), wa huwa ‘alā kulli syai'iw wakīl(un).",
    "translation_en": "Allah is the Creator of all things, and He is, over all things, Disposer of affairs.",
    "translation_id": "Allah adalah pencipta segala sesuatu dan Dia Maha Pemelihara atas segala sesuatu."
  },
  {
    "ayat": 63,
    "arabic": "لَهٗ مَقَالِيْدُ السَّمٰوٰتِ وَالْاَرْضِۗ وَالَّذِيْنَ كَفَرُوْا بِاٰيٰتِ اللّٰهِ اُولٰۤىِٕكَ هُمُ الْخٰسِرُوْنَ ࣖ",
    "transliteration_en": "Lahoo maqaaleedus sa maawaati wal ard; wallazeena kafaroo bi ayaatil laahi ulaaa'ika humul khaasiroon",
    "transliteration_id": "Lahū maqālīdus-samāwāti wal-arḍ(i), wal-lażīna kafarū bi'āyātillāhi ulā'ika humul-khāsirūn(a).",
    "translation_en": "To Him belong the keys of the heavens and the earth. And they who disbelieve in the verses of Allah - it is those who are the losers.",
    "translation_id": "Milik-Nyalah kunci-kunci (perbendaharaan) langit dan bumi. Orang-orang yang kufur terhadap ayat-ayat Allah, mereka itulah orang-orang yang rugi."
  },
  {
    "ayat": 64,
    "arabic": "قُلْ اَفَغَيْرَ اللّٰهِ تَأْمُرُوْۤنِّيْٓ اَعْبُدُ اَيُّهَا الْجٰهِلُوْنَ",
    "transliteration_en": "Qul afaghairal laahi taamurooonneee a'budu ayyuhal jaahiloon",
    "transliteration_id": "Qul afagairallāhi ta'murūnnī a‘budu ayyuhal-jāhilūn(a).",
    "translation_en": "Say, [O Muhammad], \"Is it other than Allah that you order me to worship, O ignorant ones?\"",
    "translation_id": "Katakanlah (Nabi Muhammad), “Apakah kamu menyuruhku (untuk) menyembah selain Allah, wahai orang-orang yang bodoh?”"
  },
  {
    "ayat": 65,
    "arabic": "وَلَقَدْ اُوْحِيَ اِلَيْكَ وَاِلَى الَّذِيْنَ مِنْ قَبْلِكَۚ  لَىِٕنْ اَشْرَكْتَ لَيَحْبَطَنَّ عَمَلُكَ وَلَتَكُوْنَنَّ مِنَ الْخٰسِرِيْنَ",
    "transliteration_en": "Wa laqad oohiya ilaika wa ilal lazeena min qablika la in ashrakta la yahbatanna 'amalu ka wa latakoonanna minal khaasireen",
    "transliteration_id": "Wa laqad ūḥiya ilaika wa ilal-lażīna min qablik(a), la'in asyrakta layaḥbaṭanna ‘amaluka wa latakūnanna minal-khāsirīn(a).",
    "translation_en": "And it was already revealed to you and to those before you that if you should associate [anything] with Allah, your work would surely become worthless, and you would surely be among the losers.\"",
    "translation_id": "Sungguh, benar-benar telah diwahyukan kepadamu dan kepada orang-orang (para nabi) sebelummu, “Sungguh, jika engkau mempersekutukan (Allah), niscaya akan gugurlah amalmu dan tentulah engkau termasuk orang-orang yang rugi."
  },
  {
    "ayat": 66,
    "arabic": "بَلِ اللّٰهَ فَاعْبُدْ وَكُنْ مِّنَ الشّٰكِرِيْنَ",
    "transliteration_en": "Balil laahha fa'bud wa kum minash shaakireen",
    "transliteration_id": "Balillāha fa‘bud wa kum minasy-syākirīn(a).",
    "translation_en": "Rather, worship [only] Allah and be among the grateful.",
    "translation_id": "Oleh karena itu, sembahlah Allah (saja) dan jadilah engkau termasuk orang-orang yang bersyukur.”"
  },
  {
    "ayat": 67,
    "arabic": "وَمَا قَدَرُوا اللّٰهَ حَقَّ قَدْرِهٖۖ وَالْاَرْضُ جَمِيْعًا قَبْضَتُهٗ يَوْمَ الْقِيٰمَةِ وَالسَّمٰوٰتُ مَطْوِيّٰتٌۢ بِيَمِيْنِهٖ ۗسُبْحٰنَهٗ وَتَعٰلٰى عَمَّا يُشْرِكُوْنَ",
    "transliteration_en": "Wa maa qadarul laaha haqqa qadrihee wal ardu jamee 'an qabdatuhoo Yawmal Qiyaamit wassamaawaatu matwiyyaatum biyameenih; Subhaanahoo wa Ta'aalaa 'amma yushrikoon",
    "transliteration_id": "Wa mā qadarullāha ḥaqqa qadrih(ī), wal-arḍu jamī‘an qabḍatuhū yaumal-qiyāmati was-samāwātu maṭwiyyātum biyamīnih(ī), subḥānahū wa ta‘ālā ‘ammā yusyrikūn(a).",
    "translation_en": "They have not appraised Allah with true appraisal, while the earth entirely will be [within] His grip on the Day of Resurrection, and the heavens will be folded in His right hand. Exalted is He and high above what they associate with Him.",
    "translation_id": "Mereka tidak mengagungkan Allah sebagaimana mestinya. Padahal, bumi seluruhnya (ada dalam) genggaman-Nya pada hari Kiamat dan langit digulung dengan tangan kanan-Nya. Maha Suci dan Maha Tinggi Dia dari apa yang mereka persekutukan."
  },
  {
    "ayat": 68,
    "arabic": "وَنُفِخَ فِى الصُّوْرِ فَصَعِقَ مَنْ فِى السَّمٰوٰتِ وَمَنْ فِى الْاَرْضِ اِلَّا مَنْ شَاۤءَ اللّٰهُ ۗ ثُمَّ نُفِخَ فِيْهِ اُخْرٰى فَاِذَا هُمْ قِيَامٌ يَّنْظُرُوْنَ",
    "transliteration_en": "Wa nufikha fis Soori fas'iqa man fis samaawaati wa man fil ardi illaa man shaa'al lahu summa nufikha feehi ukhraa fa izaa hum qiyaamuny yanzuroon",
    "transliteration_id": "Wa nufikha fiṣ-ṣūri faṣa‘iqa man fis-samāwāti wa man fil-arḍi illā man syā'allāh(u), ṡumma nufikha fīhi ukhrā fa'iżā hum qiyāmuy yanẓurūn(a).",
    "translation_en": "And the Horn will be blown, and whoever is in the heavens and whoever is on the earth will fall dead except whom Allah wills. Then it will be blown again, and at once they will be standing, looking on.",
    "translation_id": "Sangkakala pun ditiup sehingga matilah semua (makhluk) yang (ada) di langit dan di bumi, kecuali mereka yang dikehendaki Allah. Kemudian, ia ditiup sekali lagi. Seketika itu, mereka bangun (dari kuburnya dan) menunggu (keputusan Allah)."
  },
  {
    "ayat": 69,
    "arabic": "وَاَشْرَقَتِ الْاَرْضُ بِنُوْرِ رَبِّهَا وَوُضِعَ الْكِتٰبُ وَجِايْۤءَ بِالنَّبِيّٖنَ وَالشُّهَدَاۤءِ وَقُضِيَ بَيْنَهُمْ بِالْحَقِّ وَهُمْ لَا يُظْلَمُوْنَ",
    "transliteration_en": "Wa ashraqatil ardu binoori Rabbihaa wa wudi'al Kitaabu wa jeee'a bin nabiyyeena wash shuhadaaa'i wa qudiya bainahum bilhaqqi wa hum laa yuzlamoon",
    "transliteration_id": "Wa asyraqatil-arḍu binūri rabbihā wa wuḍi‘al-kitābu wa jī'a bin-nabiyyīna wasy-syuhadā'i wa quḍiya bainahum bil-ḥaqqi wa hum lā yuẓlamūn(a).",
    "translation_en": "And the earth will shine with the light of its Lord, and the record [of deeds] will be placed, and the prophets and the witnesses will be brought, and it will be judged between them in truth, and they will not be wronged.",
    "translation_id": "Bumi (padang Mahsyar) menjadi terang benderang dengan cahaya Tuhannya, buku (catatan amal) diberikan (kepada setiap orang), para nabi dan para saksi pun dihadirkan, lalu diberikan keputusan di antara mereka secara adil dan mereka tidak dizalimi."
  },
  {
    "ayat": 70,
    "arabic": "وَوُفِّيَتْ كُلُّ نَفْسٍ مَّا عَمِلَتْ وَهُوَ اَعْلَمُ بِمَا يَفْعَلُوْنَ ࣖ",
    "transliteration_en": "Wa wuffiyat kullu nafsim maa 'amilat wa Huwa a'lamubimaa yaf'aloon",
    "transliteration_id": "Wa wuffiyat kullu nafsim mā ‘amilat wa huwa a‘lamu bimā yaf‘alūn(a).",
    "translation_en": "And every soul will be fully compensated [for] what it did; and He is most knowing of what they do.",
    "translation_id": "Setiap jiwa diberi balasan dengan sempurna sesuai dengan apa yang telah dikerjakannya dan Dia paling tahu tentang apa yang mereka lakukan."
  },
  {
    "ayat": 71,
    "arabic": "وَسِيْقَ الَّذِيْنَ كَفَرُوْٓا اِلٰى جَهَنَّمَ زُمَرًا ۗحَتّٰىٓ اِذَا جَاۤءُوْهَا فُتِحَتْ اَبْوَابُهَا وَقَالَ لَهُمْ خَزَنَتُهَآ اَلَمْ يَأْتِكُمْ رُسُلٌ مِّنْكُمْ يَتْلُوْنَ عَلَيْكُمْ اٰيٰتِ رَبِّكُمْ وَيُنْذِرُوْنَكُمْ لِقَاۤءَ يَوْمِكُمْ هٰذَا ۗقَالُوْا بَلٰى وَلٰكِنْ حَقَّتْ كَلِمَةُ الْعَذَابِ عَلَى الْكٰفِرِيْنَ",
    "transliteration_en": "Wa seeqal lazeena kafaroon ilaa jahannama zumaran battaaa izaa jaaa'oohaa futihat abwaabuhaa wa qaala lahum khazanatuhaaa alam yaatikum Rusulum minkum yatloona 'alaikum Aayaati Rabbikum wa yunziroonakum liqaaa'a Yawmikum haazaa; qaaloo balaa wa laakin haqqat kalimatul 'azaabi 'alal kaafireen",
    "transliteration_id": "Wasīqal-lażīna kafarū ilā jahannama zumarā(n), ḥattā iżā jā'ūhā futiḥat abwābuhā wa qāla lahum khazanatuhā alam ya'tikum rusulum minkum yatlūna ‘alaikum āyāti rabbikum wa yunżirūnakum liqā'a yaumikum hāżā, qālū balā wa lākin ḥaqqat kalimatul-‘ażābi ‘alal-kāfirīn(a).",
    "translation_en": "And those who disbelieved will be driven to Hell in groups until, when they reach it, its gates are opened and its keepers will say, \"Did there not come to you messengers from yourselves, reciting to you the verses of your Lord and warning you of the meeting of this Day of yours?\" They will say, \"Yes, but the word of punishment has come into effect upon the disbelievers.",
    "translation_id": "Orang-orang yang kufur digiring ke (neraka) Jahanam secara berombongan sehingga apabila mereka telah sampai di sana, pintu-pintunya dibuka dan para penjaganya berkata kepada mereka, “Apakah belum pernah datang kepadamu rasul-rasul dari kalanganmu yang membacakan ayat-ayat Tuhanmu dan memperingatkan kepadamu pertemuan (dengan) harimu ini?” Mereka menjawab, “Benar, (telah datang para rasul).” Akan tetapi, ketetapan azab pasti berlaku terhadap orang-orang kafir."
  },
  {
    "ayat": 72,
    "arabic": "قِيْلَ ادْخُلُوْٓا اَبْوَابَ جَهَنَّمَ خٰلِدِيْنَ فِيْهَا ۚفَبِئْسَ مَثْوَى الْمُتَكَبِّرِيْنَ",
    "transliteration_en": "Qeelad khuloo abwaaba jahannama khaalideena feeha fabi'sa maswal mutakabbireen",
    "transliteration_id": "Qīladkhulū abwāba jahannama khālidīna fīhā, fa bi'sa maṡwal-mutakabūbirīn(a).",
    "translation_en": "[To them] it will be said, \"Enter the gates of Hell to abide eternally therein, and wretched is the residence of the arrogant.\"",
    "translation_id": "Dikatakan (kepada mereka), “Masuklah pintu-pintu (neraka) Jahanam (untuk tinggal) di dalamnya selama-lamanya!” Maka, (neraka Jahanam) itu seburuk-buruk tempat tinggal bagi orang-orang yang takabur."
  },
  {
    "ayat": 73,
    "arabic": "وَسِيْقَ الَّذِيْنَ اتَّقَوْا رَبَّهُمْ اِلَى الْجَنَّةِ زُمَرًا ۗحَتّٰىٓ اِذَا جَاۤءُوْهَا وَفُتِحَتْ اَبْوَابُهَا وَقَالَ لَهُمْ خَزَنَتُهَا سَلٰمٌ عَلَيْكُمْ طِبْتُمْ فَادْخُلُوْهَا خٰلِدِيْنَ",
    "transliteration_en": "Wa seeqal lazeenat taqaw Rabbahum ilal Jannati zumaran hattaaa izaa jaaa'oohaa wa futihat abwaabuhaa wa qaala lahum khazanatuhaa salaamun 'alaikum tibtum fadkhuloohaa khaalideen",
    "transliteration_id": "Wasīqal-lażīnattaqau rabbahum ilal-jannati zumarā(n), ḥattā iżā jā'ūhā wa futiḥat abwābuhā wa qāla lahum khazanatuhā salāmun ‘alaikum ṭibtum fadkhulūhā khālidīn(a).",
    "translation_en": "But those who feared their Lord will be driven to Paradise in groups until, when they reach it while its gates have been opened and its keepers say, \"Peace be upon you; you have become pure; so enter it to abide eternally therein,\" [they will enter].",
    "translation_id": "Orang-orang yang bertakwa kepada Tuhannya diantar ke dalam surga secara berombongan sehingga apabila mereka telah sampai di sana dan pintu-pintunya telah dibuka, para penjaganya berkata kepada mereka, “Salāmun ‘alaikum (semoga keselamatan tercurah kepadamu), berbahagialah kamu. Maka, masuklah ke dalamnya (untuk tinggal) selama-lamanya!”"
  },
  {
    "ayat": 74,
    "arabic": "وَقَالُوا الْحَمْدُ لِلّٰهِ الَّذِيْ صَدَقَنَا وَعْدَهٗ وَاَوْرَثَنَا الْاَرْضَ نَتَبَوَّاُ مِنَ الْجَنَّةِ حَيْثُ نَشَاۤءُ ۚفَنِعْمَ اَجْرُ الْعٰمِلِيْنَ",
    "transliteration_en": "Wa waalull hamdulillaahil lazee sadaqanaa wa'dahoo wa awrasanal arda natabaw wa-u minal jannati haisu nashaaa'u fani'ma ajrul 'aamileen",
    "transliteration_id": "Wa qālul-ḥamdu lillāhil-lażī ṣadaqanā wa‘dahū wa auraṡanal-arḍa natabawwa'u minal-jannati ḥaiṡu nasyā'(u), fani‘ma ajrul-‘āmilīn(a).",
    "translation_en": "And they will say, \"Praise to Allah, who has fulfilled for us His promise and made us inherit the earth [so] we may settle in Paradise wherever we will. And excellent is the reward of [righteous] workers.\"",
    "translation_id": "Mereka berkata, “Segala puji bagi Allah yang telah memenuhi janji-Nya dan mewariskan bumi (di akhirat) ini kepada kami sehingga dapat menempati surga sesuai dengan kehendak kami.” (Surga adalah) sebaik-baik balasan bagi orang-orang yang beramal (saleh)."
  },
  {
    "ayat": 75,
    "arabic": "وَتَرَى الْمَلٰۤىِٕكَةَ حَاۤفِّيْنَ مِنْ حَوْلِ الْعَرْشِ يُسَبِّحُوْنَ بِحَمْدِ رَبِّهِمْۚ وَقُضِيَ بَيْنَهُمْ بِالْحَقِّ وَقِيْلَ الْحَمْدُ لِلّٰهِ رَبِّ الْعٰلَمِيْنَ ࣖ",
    "transliteration_en": "Wa taral malaaa'ikata haaaffeena min hawlil 'Arshi yusabbihoona bihamdi Rabbihim wa qudiya bainahum bilhaqqi wa qeelal hamdu lillaahi Rabbil 'aalameen",
    "transliteration_id": "Wa taral-malā'ikata ḥāffīna min ḥaulil-‘arsyi yusabbiḥūna biḥamdi rabbihim, wa quḍiya bainahum bil-ḥaqqi wa qīlal-ḥamdu lillāhi rabbil-‘ālamīn(a).",
    "translation_en": "And you will see the angels surrounding the Throne, exalting [Allah] with praise of their Lord. And it will be judged between them in truth, and it will be said, \"[All] praise to Allah, Lord of the worlds.\"",
    "translation_id": "Engkau (Nabi Muhammad) akan melihat malaikat melingkar di sekeliling ʻArasy. Mereka bertasbih sambil memuji Tuhannya. (Urusan) di antara mereka (seluruh makhluk) diputuskan dengan hak (adil). (Ketika itu) dikatakan, “Segala puji bagi Allah, Tuhan semesta alam.”"
  }
]