[
  {
    "ayat": 1,
    "arabic": "تَنْزِيْلُ الْكِتٰبِ مِنَ اللّٰهِ الْعَزِيْزِ الْحَكِيْمِ",
    "transliteration_en": "Tanzeelul Kitaabi minal laahil 'Azeezil Hakeem",
    "transliteration_id": "Tanzīlul-kitābi minallāhil-‘azīzil-ḥakīm(i).",
    "translation_en": "The revelation of the Qur'an is from Allah, the Exalted in Might, the Wise.",
    "translation_id": "Diturunkannya Kitab (Al-Qur’an) ini (berasal) dari Allah Yang Maha Perkasa lagi Maha Bijaksana."
  },
  {
    "ayat": 2,
    "arabic": "اِنَّآ اَنْزَلْنَآ اِلَيْكَ الْكِتٰبَ بِالْحَقِّ فَاعْبُدِ اللّٰهَ مُخْلِصًا لَّهُ الدِّيْنَۗ",
    "transliteration_en": "Innaaa anzalnaaa ilaikal Kitaaba bilhaqqi fa'budil laaha mukhlisal lahud deen",
    "transliteration_id": "Innā anzalnā ilaikal-kitāba bil-ḥaqqi fa‘budillāha mukhliṣal lahud-dīn(a).",
    "translation_en": "Indeed, We have sent down to you the Book, [O Muhammad], in truth. So worship Allah, [being] sincere to Him in religion.",
    "translation_id": "Sesungguhnya Kami menurunkan Kitab (Al-Qur’an) kepadamu (Nabi Muhammad) dengan hak. Maka, sembahlah Allah dengan mengikhlaskan ketaatan kepada-Nya."
  },
  {
    "ayat": 3,
    "arabic": "اَلَا لِلّٰهِ الدِّيْنُ الْخَالِصُ ۗوَالَّذِيْنَ اتَّخَذُوْا مِنْ دُوْنِهٖٓ اَوْلِيَاۤءَۘ مَا نَعْبُدُهُمْ اِلَّا لِيُقَرِّبُوْنَآ اِلَى اللّٰهِ زُلْفٰىۗ اِنَّ اللّٰهَ يَحْكُمُ بَيْنَهُمْ فِيْ مَا هُمْ فِيْهِ يَخْتَلِفُوْنَ ەۗ اِنَّ اللّٰهَ لَا يَهْدِيْ مَنْ هُوَ كٰذِبٌ كَفَّارٌ",
    "transliteration_en": "Alaa lillaahid deenul khaalis; wallazeenat takhazoo min dooniheee awliyaaa'a maa na'buduhum illaa liyuqar riboonaaa ilal laahi zulfaa; innal laaha yahkumu baina hum fee maa hum feehi yakhtalifoon; innal laaha laa yahdee man huwa kaazibun kaffaar",
    "transliteration_id": "Alā lillāhid-dīnul-khāliṣ(u), wal-lażīnattakhażū min dūnihī auliyā'(a), mā na‘buduhum illā liyuqarribūnā ilallāhi zulfā, innallāha yaḥkumu bainahum fī mā hum fīhi yakhtalifūn(a), innallāha lā yahdī man huwa kāżibun kaffār(un).",
    "translation_en": "Unquestionably, for Allah is the pure religion. And those who take protectors besides Him [say], \"We only worship them that they may bring us nearer to Allah in position.\" Indeed, Allah will judge between them concerning that over which they differ. Indeed, Allah does not guide he who is a liar and [confirmed] disbeliever.",
    "translation_id": "Ketahuilah, hanya untuk Allah agama yang bersih (dari syirik). Orang-orang yang mengambil pelindung selain Dia (berkata,) “Kami tidak menyembah mereka, kecuali (berharap) agar mereka mendekatkan kami kepada Allah dengan sedekat-dekatnya.” Sesungguhnya Allah akan memberi putusan di antara mereka tentang apa yang mereka perselisihkan. Sesungguhnya Allah tidak memberi petunjuk kepada pendusta lagi sangat ingkar."
  },
  {
    "ayat": 4,
    "arabic": "لَوْ اَرَادَ اللّٰهُ اَنْ يَّتَّخِذَ وَلَدًا لَّاصْطَفٰى مِمَّا يَخْلُقُ مَا يَشَاۤءُ ۙ سُبْحٰنَهٗ ۗهُوَ اللّٰهُ الْوَاحِدُ الْقَهَّارُ",
    "transliteration_en": "Law araadal laahu aiyattakhiza waladal lastafaa mimmaa yakhluqu maa yashaaa'; Subhaanahoo Huwal laahul Waahidul Qahhaar",
    "transliteration_id": "Wa lau arādallāhu ay yattakhiża waladal laṣṭafā mimmā yakhluqu mā yasyā'(u), subḥānah(ū), huwallāhul-wāḥidul-qahhār(u).",
    "translation_en": "If Allah had intended to take a son, He could have chosen from what He creates whatever He willed. Exalted is He; He is Allah, the One, the Prevailing.",
    "translation_id": "Seandainya Allah hendak mengambil (makhluk-Nya sebagai) anak, pasti akan memilih yang Dia kehendaki dari apa yang Dia ciptakan. Maha Suci Dia. Dialah Allah Yang Maha Esa lagi Maha Mengalahkan."
  },
  {
    "ayat": 5,
    "arabic": "خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ بِالْحَقِّۚ يُكَوِّرُ الَّيْلَ عَلَى النَّهَارِ وَيُكَوِّرُ النَّهَارَ عَلَى الَّيْلِ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَۗ كُلٌّ يَّجْرِيْ لِاَجَلٍ مُّسَمًّىۗ  اَلَا هُوَ الْعَزِيْزُ الْغَفَّارُ",
    "transliteration_en": "Khalaqas samaawaati wal arda bilhaqq; yukawwirul laila 'alan nahaari wa yukawwirun nahaara 'alaal laili wa sakhkharash shamsa walqamara kulluny yajree li ajalim musammaa; alaa Huwal 'Azeezul Ghaffaar",
    "transliteration_id": "Khalaqas-samāwāti wal-arḍa bil-ḥaqq(i), yukawwirul-laila ‘alan-nahāri wa yukawwirun nahāra ‘alal-laili wa sakhkharasy-syamsa wal-qamar(a), kulluy yajrī li'ajalim musammā(n), alā huwal-‘azīzul-gaffār(u).",
    "translation_en": "He created the heavens and earth in truth. He wraps the night over the day and wraps the day over the night and has subjected the sun and the moon, each running [its course] for a specified term. Unquestionably, He is the Exalted in Might, the Perpetual Forgiver.",
    "translation_id": "Dia (Allah) menciptakan langit dan bumi dengan hak (yang benar). Dia menutupkan malam atas siang, menutupkan siang atas malam, serta menundukkan matahari dan bulan. Masing-masing beredar menurut waktu yang ditentukan. Ketahuilah, Dialah Yang Maha Perkasa lagi Maha Pengampun."
  },
  {
    "ayat": 6,
    "arabic": "خَلَقَكُمْ مِّنْ نَّفْسٍ وَّاحِدَةٍ ثُمَّ جَعَلَ مِنْهَا زَوْجَهَا وَاَنْزَلَ لَكُمْ مِّنَ الْاَنْعَامِ ثَمٰنِيَةَ اَزْوَاجٍ ۗ يَخْلُقُكُمْ فِيْ بُطُوْنِ اُمَّهٰتِكُمْ خَلْقًا مِّنْۢ بَعْدِ خَلْقٍ فِيْ ظُلُمٰتٍ ثَلٰثٍۗ ذٰلِكُمُ اللّٰهُ رَبُّكُمْ لَهُ الْمُلْكُۗ  لَآ اِلٰهَ اِلَّا هُوَۚ فَاَنّٰى تُصْرَفُوْنَ",
    "transliteration_en": "Khalaqakum min nafsinw waahidatin summa ja'ala minhaa zawjahaa wa anzala lakum minal-an'aami samaani yata azwaaj; yakhuluqukum fee butooni ummahaatikum khalqam mim ba'di khalqin fee zulumaatin salaas; zaalikumul laahu Rabbukum lahul mulk; laaa ilaaha illaa Huwa fa annaa tusrafoon",
    "transliteration_id": "Khalaqakum min nafsiw wāḥidatin ṡumma ja‘ala minhā zaujahā wa anzala lakum minal-an‘āmi ṡamāniyata azwāj(in), yakhluqukum fī buṭūni ummahātikum khalqam mim ba‘di khalqin fī ẓulumātin ṡalāṡ(in), żālikumullāhu rabbukum lahul-mulk(u), lā ilāha illā huw(a), fa'annā tuṣrafūn(a).",
    "translation_en": "He created you from one soul. Then He made from it its mate, and He produced for you from the grazing livestock eight mates. He creates you in the wombs of your mothers, creation after creation, within three darknesses. That is Allah, your Lord; to Him belongs dominion. There is no deity except Him, so how are you averted?",
    "translation_id": "Dia menciptakanmu dari jiwa yang satu (Adam), kemudian darinya Dia menjadikan pasangannya dan Dia menurunkan delapan pasang hewan ternak untukmu. Dia menciptakanmu dalam perut ibumu kejadian demi kejadian dalam tiga kegelapan. Yang (berbuat) demikian itu adalah Allah, Tuhanmu, Pemilik kerajaan. Tidak ada tuhan selain Dia. Mengapa kamu dapat berpaling (dari kebenaran)?"
  },
  {
    "ayat": 7,
    "arabic": "اِنْ تَكْفُرُوْا فَاِنَّ اللّٰهَ غَنِيٌّ عَنْكُمْ ۗوَلَا يَرْضٰى لِعِبَادِهِ الْكُفْرَۚ وَاِنْ تَشْكُرُوْا يَرْضَهُ لَكُمْۗ وَلَا تَزِرُ وَازِرَةٌ وِّزْرَ اُخْرٰىۗ ثُمَّ اِلٰى رَبِّكُمْ مَّرْجِعُكُمْ فَيُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُوْنَۗ اِنَّهٗ عَلِيْمٌ ۢبِذَاتِ الصُّدُوْرِ",
    "transliteration_en": "In takfuroo fa innal laaha ghaniyyun 'ankum; wa laa yardaa li'ibaadihil kufra wa in tashkuroo yardahu lakum; wa laa taziru waaziratunw wizra ukhraa; summa ilaa Rabikum marji'ukum fa-yunabbi'ukum bimaa kuntum ta'maloon; innahoo 'aleemum bizaatissudoor",
    "transliteration_id": "In takfurū fa'innallāha ganiyyun ‘ankum, wa lā yarḍā li‘ibādihil-kufr(a), wa in tasykurū yarḍahu lakum, wa lā taziru wāziratuw wizra ukhrā, ṡumma ilā rabbikum marji‘ukum fa yunabbi'ukum bimā kuntum ta‘malūn(a), innahū ‘alīmum biżātiṣ-ṣudūr(i).",
    "translation_en": "If you disbelieve - indeed, Allah is Free from need of you. And He does not approve for His servants disbelief. And if you are grateful, He approves it for you; and no bearer of burdens will bear the burden of another. Then to your Lord is your return, and He will inform you about what you used to do. Indeed, He is Knowing of that within the breasts.",
    "translation_id": "Jika kamu kufur, sesungguhnya Allah tidak memerlukanmu. Dia pun tidak meridai kekufuran hamba-hamba-Nya. Jika kamu bersyukur, Dia meridai kesyukuranmu itu. Seseorang yang berdosa tidak memikul dosa orang lain. Kemudian, kepada Tuhanmulah kembalimu, lalu Dia beritakan kepadamu apa yang telah kamu kerjakan. Sesungguhnya Dia Maha Mengetahui apa yang tersimpan di dalam dada."
  },
  {
    "ayat": 8,
    "arabic": "۞ وَاِذَا مَسَّ الْاِنْسَانَ ضُرٌّ دَعَا رَبَّهٗ مُنِيْبًا اِلَيْهِ ثُمَّ اِذَا خَوَّلَهٗ نِعْمَةً مِّنْهُ نَسِيَ مَا كَانَ يَدْعُوْٓا اِلَيْهِ مِنْ قَبْلُ وَجَعَلَ لِلّٰهِ اَنْدَادًا لِّيُضِلَّ عَنْ سَبِيْلِهٖ ۗ قُلْ تَمَتَّعْ بِكُفْرِكَ قَلِيْلًا ۖاِنَّكَ مِنْ اَصْحٰبِ النَّارِ",
    "transliteration_en": "Wa izaa massal insaana durrun da'aa Rabbahoo muneeban ilaihi summa izaa khawwalahoo ni'matam minhu nasiya maa kaana yad'ooo ilaihi min qablu wa ja'ala lillaahi andaadal liyudilla 'ansabeelih; qul tamatta' bikufrika qaleelan innaka min Ashaabin Naar;",
    "transliteration_id": "Wa iżā massal-insāna ḍurrun da‘ā rabbahū munīban ilaihi ṡumma iżā khawwalahū ni‘matan minhu nasiya mā kāna yad‘ū ilaihi min qablu wa ja‘ala lilllāhi andādal liyuḍilla ‘an sabīlih(ī), qul tamatta‘ bikufrika qalīlā(n), innaka min aṣḥābin-nār(i).",
    "translation_en": "And when adversity touches man, he calls upon his Lord, turning to Him [alone]; then when He bestows on him a favor from Himself, he forgets Him whom he called upon before, and he attributes to Allah equals to mislead [people] from His way. Say, \"Enjoy your disbelief for a little; indeed, you are of the companions of the Fire.\"",
    "translation_id": "Apabila ditimpa bencana, manusia memohon (pertolongan) kepada Tuhannya dengan kembali (taat) kepada-Nya. Akan tetapi, apabila Dia memberikan nikmat kepadanya, dia lupa terhadap apa yang pernah dia mohonkan kepada Allah sebelum itu dan dia menjadikan sekutu-sekutu bagi Allah untuk menyesatkan (manusia) dari jalan-Nya. Katakanlah (Nabi Muhammad), “Bersenang-senanglah dengan kekufuranmu untuk sementara waktu! Sesungguhnya kamu termasuk penghuni neraka.”"
  },
  {
    "ayat": 9,
    "arabic": "اَمَّنْ هُوَ قَانِتٌ اٰنَاۤءَ الَّيْلِ سَاجِدًا وَّقَاۤىِٕمًا يَّحْذَرُ الْاٰخِرَةَ وَيَرْجُوْا رَحْمَةَ رَبِّهٖۗ قُلْ هَلْ يَسْتَوِى الَّذِيْنَ يَعْلَمُوْنَ وَالَّذِيْنَ لَا يَعْلَمُوْنَ ۗ اِنَّمَا يَتَذَكَّرُ اُولُوا الْاَلْبَابِ ࣖ",
    "transliteration_en": "Amman huwa qaanitun aanaaa'al laili saajidanw wa qaaa'imai yahzarul Aakhirata wa yarjoo rahmata Rabbih; qul hal yastawil lazeena ya'lamoona wallazeena laa ya'lamoon; innamaa yatazakkaru ulul albaab",
    "transliteration_id": "Amman huwa qānitun ānā'al-laili sājidaw wa qā'imay yaḥżarul-ākhirata wa yarjū raḥmata rabbih(ī), qul hal yastawil-lażīna ya‘lamūna wal-lażīna lā ya‘lamūn(a), innamā yatażakkaru ulul-albāb(i).",
    "translation_en": "Is one who is devoutly obedient during periods of the night, prostrating and standing [in prayer], fearing the Hereafter and hoping for the mercy of his Lord, [like one who does not]? Say, \"Are those who know equal to those who do not know?\" Only they will remember [who are] people of understanding.",
    "translation_id": "(Apakah orang musyrik yang lebih beruntung) ataukah orang yang beribadah pada waktu malam dalam keadaan bersujud, berdiri, takut pada (azab) akhirat, dan mengharapkan rahmat Tuhannya? Katakanlah (Nabi Muhammad), “Apakah sama orang-orang yang mengetahui (hak-hak Allah) dengan orang-orang yang tidak mengetahui (hak-hak Allah)?” Sesungguhnya hanya ululalbab (orang yang berakal sehat) yang dapat menerima pelajaran."
  },
  {
    "ayat": 10,
    "arabic": "قُلْ يٰعِبَادِ الَّذِيْنَ اٰمَنُوا اتَّقُوْا رَبَّكُمْ ۗلِلَّذِيْنَ اَحْسَنُوْا فِيْ هٰذِهِ الدُّنْيَا حَسَنَةٌ  ۗوَاَرْضُ اللّٰهِ وَاسِعَةٌ  ۗاِنَّمَا يُوَفَّى الصّٰبِرُوْنَ اَجْرَهُمْ بِغَيْرِ حِسَابٍ",
    "transliteration_en": "Qul yaa 'ibaadil lazeena aamanut taqoo Rabbakum; lillazeena ahsanoo fee haazihid dunyaa hasanah; wa ardul laahi waasi'ah; innamaa yuwaffas saabiroona ajrahum bighayri hisab",
    "transliteration_id": "Qul yā ‘ibādil-lażīna āmanuttaqū rabbakum, lil-lażīna aḥsanū fī hāżihid-dun-yā ḥasanah(tun), wa arḍullāhi wāsi‘ah(tun), innamā yuwaffaṣ-ṣābirūna ajrahum bigairi ḥisāb(in).",
    "translation_en": "Say, \"O My servants who have believed, fear your Lord. For those who do good in this world is good, and the earth of Allah is spacious. Indeed, the patient will be given their reward without account.\"",
    "translation_id": "Katakanlah (Nabi Muhammad), “Wahai hamba-hamba-Ku yang beriman, bertakwalah kepada Tuhanmu.” Orang-orang yang berbuat baik di dunia ini akan memperoleh kebaikan. Bumi Allah itu luas. Sesungguhnya hanya orang-orang yang bersabarlah yang disempurnakan pahalanya tanpa perhitungan."
  },
  {
    "ayat": 11,
    "arabic": "قُلْ اِنِّيْٓ اُمِرْتُ اَنْ اَعْبُدَ اللّٰهَ مُخْلِصًا لَّهُ الدِّيْنَ",
    "transliteration_en": "Qul inneee umirtu an a'budal laaha mukhlisal lahud deen",
    "transliteration_id": "Qul innī umirtu an a‘budallāha mukhliṣal lahud-dīn(a).",
    "translation_en": "Say, [O Muhammad], \"Indeed, I have been commanded to worship Allah, [being] sincere to Him in religion.",
    "translation_id": "Katakanlah, “Sesungguhnya aku diperintahkan untuk menyembah Allah dengan mengikhlaskan ketaatan kepada-Nya."
  },
  {
    "ayat": 12,
    "arabic": "وَاُمِرْتُ لِاَنْ اَكُوْنَ اَوَّلَ الْمُسْلِمِيْنَ",
    "transliteration_en": "Wa umirtu li an akoona awwalal muslimeen",
    "transliteration_id": "Wa umirtu li'an akūna awwalal-muslimīn(a).",
    "translation_en": "And I have been commanded to be the first [among you] of the Muslims.\"",
    "translation_id": "Aku diperintahkan untuk menjadi orang pertama (dari umatnya) yang berserah diri (kepada Allah).”"
  },
  {
    "ayat": 13,
    "arabic": "قُلْ اِنِّيْٓ اَخَافُ اِنْ عَصَيْتُ رَبِّيْ عَذَابَ يَوْمٍ عَظِيْمٍ",
    "transliteration_en": "Qul inneee akhaafu in 'asaitu Rabbee 'azaaba Yawmin 'azeem",
    "transliteration_id": "Qul innī akhāfu in ‘aṣaitu rabbī ‘ażāba yaumin ‘aẓīm(in).",
    "translation_en": "Say, \"Indeed I fear, if I should disobey my Lord, the punishment of a tremendous Day.\"",
    "translation_id": "Katakanlah, “Sesungguhnya aku takut azab pada hari yang besar (kiamat) jika aku durhaka kepada Tuhanku.”"
  },
  {
    "ayat": 14,
    "arabic": "قُلِ اللّٰهَ اَعْبُدُ مُخْلِصًا لَّهٗ دِيْنِيْۚ",
    "transliteration_en": "Qulil laaha a'budu mukhlisal lahoo deenee",
    "transliteration_id": "Qulillāha a‘budu mukhliṣal lahū dīnī.",
    "translation_en": "Say, \"Allah [alone] do I worship, sincere to Him in my religion,",
    "translation_id": "Katakanlah, “Hanya Allah yang aku sembah dengan mengikhlaskan ketaatanku kepada-Nya.”"
  },
  {
    "ayat": 15,
    "arabic": "فَاعْبُدُوْا مَا شِئْتُمْ مِّنْ دُوْنِهٖۗ قُلْ اِنَّ الْخٰسِرِيْنَ الَّذِيْنَ خَسِرُوْٓا اَنْفُسَهُمْ وَاَهْلِيْهِمْ يَوْمَ الْقِيٰمَةِۗ  اَلَا ذٰلِكَ هُوَ الْخُسْرَانُ الْمُبِيْنُ",
    "transliteration_en": "Fa'budoo maa shi'tum min doonih; qul innal khaasireenal lazeena khasirooo anfusahum wa ahleehim yawmal qiyaamah; alaa zaalika huwal khusraanul mubeen",
    "transliteration_id": "Fa‘budū mā syi'tum min dūnih(ī), qul innal-khāsirīnal-lażīna khasirū anfusahum wa ahlīhim yaumal-qiyāmah(ti), alā żālika huwal-khusrānul-mubīn(u).",
    "translation_en": "So worship what you will besides Him.\" Say, \"Indeed, the losers are the ones who will lose themselves and their families on the Day of Resurrection. Unquestionably, that is the manifest loss.\"",
    "translation_id": "Maka, sembahlah sesukamu selain Dia (wahai orang-orang musyrik!) Katakanlah, “Sesungguhnya orang-orang yang rugi ialah orang-orang yang merugikan diri sendiri dan keluarganya pada hari Kiamat.” Ingatlah, yang demikian itu adalah kerugian yang nyata."
  },
  {
    "ayat": 16,
    "arabic": "لَهُمْ مِّنْ فَوْقِهِمْ ظُلَلٌ مِّنَ النَّارِ وَمِنْ تَحْتِهِمْ ظُلَلٌ  ۗذٰلِكَ يُخَوِّفُ اللّٰهُ بِهٖ عِبَادَهٗ ۗيٰعِبَادِ فَاتَّقُوْنِ",
    "transliteration_en": "Lahum min fawqihim zulalum minan Naari wa min tahtihim zulal; zaalika yukhaw wiful laahu bihee 'ibaadah; yaa 'ibaadi fattaqoon",
    "transliteration_id": "Lahum min fauqihim ẓulalum minan-nāri wa min taḥtihim ẓulal(un), żālika yukhawwifullāhu bihī ‘ibādah(ū), yā ‘ibādi fattaqūn(i).",
    "translation_en": "They will have canopies of fire above them and below them, canopies. By that Allah threatens His servants. O My servants, then fear Me.",
    "translation_id": "Di atas mereka ada lapisan-lapisan dari api dan di bawah mereka pun ada lapisan-lapisan pula. Demikianlah Allah membuat takut hamba-hamba-Nya dengan (azab) itu. “Wahai hamba-hamba-Ku, bertakwalah kepada-Ku!”"
  },
  {
    "ayat": 17,
    "arabic": "وَالَّذِيْنَ اجْتَنَبُوا الطَّاغُوْتَ اَنْ يَّعْبُدُوْهَا وَاَنَابُوْٓا اِلَى اللّٰهِ لَهُمُ الْبُشْرٰىۚ فَبَشِّرْ عِبَادِۙ",
    "transliteration_en": "Wallazeenaj tanabut Taaghoota ai ya'budoohaa wa anaabooo ilal laahi lahumul bushraa; fabashshir 'ibaad",
    "transliteration_id": "Wal-lażīnajtanabuṭ-ṭāgūta ay ya‘budūhā wa anābū ilallāhi lahumul-busyrā, fabasysyir ‘ibād(i).",
    "translation_en": "But those who have avoided Taghut, lest they worship it, and turned back to Allah - for them are good tidings. So give good tidings to My servants",
    "translation_id": "Orang-orang yang menjauhi tagut, (yaitu) tidak menyembahnya dan kembali (bertobat) kepada Allah, bagi mereka berita gembira. Maka, sampaikanlah kabar gembira itu kepada hamba-hamba-Ku."
  },
  {
    "ayat": 18,
    "arabic": "الَّذِيْنَ يَسْتَمِعُوْنَ الْقَوْلَ فَيَتَّبِعُوْنَ اَحْسَنَهٗ ۗ اُولٰۤىِٕكَ الَّذِيْنَ هَدٰىهُمُ اللّٰهُ وَاُولٰۤىِٕكَ هُمْ اُولُوا الْاَلْبَابِ",
    "transliteration_en": "Allazeena yastami'oonal qawla fayattabi'oona ahsanah; ulaaa'ikal lazeena hadaahumul laahu wa ulaaa'ika hum ulul albaab",
    "transliteration_id": "Allażīna yastami‘ūnal-qaula fa yattabi‘ūna aḥsanah(ū), ulā'ikal-lażīna hadāhumullāhu wa ulā'ika hum ulul-albāb(i).",
    "translation_en": "Who listen to speech and follow the best of it. Those are the ones Allah has guided, and those are people of understanding.",
    "translation_id": "(Yaitu) mereka yang mendengarkan perkataan lalu mengikuti apa yang paling baik di antaranya. Mereka itulah orang-orang yang telah diberi petunjuk oleh Allah dan mereka itulah ululalbab (orang-orang yang mempunyai akal sehat)."
  },
  {
    "ayat": 19,
    "arabic": "اَفَمَنْ حَقَّ عَلَيْهِ كَلِمَةُ الْعَذَابِۗ اَفَاَنْتَ تُنْقِذُ مَنْ فِى النَّارِ ۚ",
    "transliteration_en": "Afaman haqqa 'alaihi kalimatul 'azaab; afa anta tunqizu man fin Naar",
    "transliteration_id": "Afaman ḥaqqa ‘alaihi kalimatul-‘ażāb(i), afa'anta tunqiżu man fin-nār(i).",
    "translation_en": "Then, is one who has deserved the decree of punishment [to be guided]? Then, can you save one who is in the Fire?",
    "translation_id": "Maka, apakah (engkau, Nabi Muhammad, hendak mengubah nasib) orang-orang yang telah dipastikan mendapat azab? Apakah engkau akan menyelamatkan orang yang berada di dalam neraka?"
  },
  {
    "ayat": 20,
    "arabic": "لٰكِنِ الَّذِيْنَ اتَّقَوْا رَبَّهُمْ لَهُمْ غُرَفٌ مِّنْ فَوْقِهَا غُرَفٌ مَّبْنِيَّةٌ  ۙتَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُ ەۗ وَعْدَ اللّٰهِ ۗ لَا يُخْلِفُ اللّٰهُ الْمِيْعَادَ",
    "transliteration_en": "Laakinil lazeenat taqaw Rabbahum lahum ghurafum min fawqihaa ghurafum mabniyyatun tajree min tahtihal anhaar; wa'dal laah; laa yukhliful laahul mee'aad",
    "transliteration_id": "Lākinil-lażīnattaqau rabbahum lahum gurafum min fauqihā gurafum mabniyyah(tun), tajrī min taḥtihal-anhār(u), wa‘dallāh(i), lā yukhlifullāhul-mī‘ād(a).",
    "translation_en": "But those who have feared their Lord - for them are chambers, above them chambers built high, beneath which rivers flow. [This is] the promise of Allah. Allah does not fail in [His] promise.",
    "translation_id": "Akan tetapi, orang-orang yang bertakwa kepada Tuhannya bagi mereka kamar-kamar (di surga), di atasnya terdapat kamar-kamar yang dibangun (bertingkat-tingkat), dan mengalir di bawahnya sungai-sungai. (Itulah) janji Allah. Allah tidak akan mengingkari janji."
  },
  {
    "ayat": 21,
    "arabic": "اَلَمْ تَرَ اَنَّ اللّٰهَ اَنْزَلَ مِنَ السَّمَاۤءِ مَاۤءً فَسَلَكَهٗ يَنَابِيْعَ فِى الْاَرْضِ ثُمَّ يُخْرِجُ بِهٖ زَرْعًا مُّخْتَلِفًا اَلْوَانُهٗ ثُمَّ يَهِيْجُ فَتَرٰىهُ مُصْفَرًّا ثُمَّ يَجْعَلُهٗ حُطَامًا ۗاِنَّ فِيْ ذٰلِكَ لَذِكْرٰى لِاُولِى الْاَلْبَابِ ࣖ",
    "transliteration_en": "Alam tara annal laaha anzala minas samaaa'i maaa'an fasalakahoo yanaabee'a fil ardi summa yukhriju bihee zar'am mukhtalifan alwaanuhoo summa yaheeju fatarahu musfarran summa yaj'aluhoo hutaamaa; inna fee zaalika lazikraa li ulil albaab",
    "transliteration_id": "Alam tara annallāha anzala minas-samā'i mā'an fasalakahū yanābī‘a fil-arḍi ṡumma yaj‘aluhū ḥuṭāmā(n), ina fī żālika lażikrā li'ulil-albāb(i).",
    "translation_en": "Do you not see that Allah sends down rain from the sky and makes it flow as springs [and rivers] in the earth; then He produces thereby crops of varying colors; then they dry and you see them turned yellow; then He makes them [scattered] debris. Indeed in that is a reminder for those of understanding.",
    "translation_id": "Tidakkah engkau memperhatikan bahwa Allah menurunkan air (hujan) dari langit, lalu Dia mengalirkannya menjadi sumber-sumber air di bumi. Kemudian, dengan air itu Dia tumbuhkan tanam-tanaman yang bermacam-macam warnanya, kemudian ia menjadi kering, engkau melihatnya kekuning-kuningan, kemudian Dia menjadikannya hancur berderai. Sesungguhnya pada yang demikian itu benar-benar terdapat pelajaran bagi ululalbab."
  },
  {
    "ayat": 22,
    "arabic": "اَفَمَنْ شَرَحَ اللّٰهُ صَدْرَهٗ لِلْاِسْلَامِ فَهُوَ عَلٰى نُوْرٍ مِّنْ رَّبِّهٖ ۗفَوَيْلٌ لِّلْقٰسِيَةِ قُلُوْبُهُمْ مِّنْ ذِكْرِ اللّٰهِ ۗ اُولٰۤىِٕكَ فِيْ ضَلٰلٍ مُّبِيْنٍ",
    "transliteration_en": "Afaman sharahal laahu sadrahoo lil Islaami fahuwa 'alaa noorim mir Rabbih; fa wailul lilqaasiyati quloobuhum min zikril laah; ulaaa'ika fee dalaalim mubeen",
    "transliteration_id": "Afaman syaraḥallāhu ṣadrahū lil-islāmi fahuwa ‘alā nūrim mir rabbih(ī), fawailul lil-qāsiyati qulūbuhum min żikrillāh(i), ulā'ika fī ḍalālim mubīn(in).",
    "translation_en": "So is one whose breast Allah has expanded to [accept] Islam and he is upon a light from his Lord [like one whose heart rejects it]? Then woe to those whose hearts are hardened against the remembrance of Allah. Those are in manifest error.",
    "translation_id": "Maka, apakah orang yang Allah bukakan hatinya untuk (menerima) agama Islam, lalu mendapat cahaya dari Tuhannya (sama dengan orang yang hatinya membatu)? Maka, celakalah mereka yang hatinya membatu dari mengingat Allah. Mereka itu dalam kesesatan yang nyata."
  },
  {
    "ayat": 23,
    "arabic": "اَللّٰهُ نَزَّلَ اَحْسَنَ الْحَدِيْثِ كِتٰبًا مُّتَشَابِهًا مَّثَانِيَۙ  تَقْشَعِرُّ مِنْهُ جُلُوْدُ الَّذِيْنَ يَخْشَوْنَ رَبَّهُمْ ۚ ثُمَّ تَلِيْنُ جُلُوْدُهُمْ وَقُلُوْبُهُمْ اِلٰى ذِكْرِ اللّٰهِ ۗذٰلِكَ هُدَى اللّٰهِ يَهْدِيْ بِهٖ مَنْ يَّشَاۤءُ ۗوَمَنْ يُّضْلِلِ اللّٰهُ فَمَا لَهٗ مِنْ هَادٍ",
    "transliteration_en": "Allahu nazzala ahsanal hadeesi Kitaabam mutashaa biham masaaniy taqsha'irru minhu juloodul lazeena yakhshawna Rabbahum summa taleenu julooduhum wa quloo buhum ilaa zikril laah; zaalika hudal laahi yahdee bihee mai yashaaa'; wa mai yudlilil laahu famaa lahoo min haad",
    "transliteration_id": "Allāhu nazzala aḥsanal-ḥadīṡi kitābam mutasyābiham maṡāniy(a), taqsya‘irru minhu julūdul-lażīna yakhsyauna rabbahum, ṡumma talīnu julūduhum wa qulūbuhum ilā żikrillāh(i), żālika hudallāhi yahdī bihī may yasyā'(u), wa may yuḍlilillāhu famā lahū min hād(in).",
    "translation_en": "Allah has sent down the best statement: a consistent Book wherein is reiteration. The skins shiver therefrom of those who fear their Lord; then their skins and their hearts relax at the remembrance of Allah. That is the guidance of Allah by which He guides whom He wills. And one whom Allah leaves astray - for him there is no guide.",
    "translation_id": "Allah telah menurunkan perkataan yang terbaik, (yaitu) Kitab (Al-Qur’an) yang serupa (ayat-ayatnya) lagi berulang-ulang. Oleh karena itu, kulit orang yang takut kepada Tuhannya gemetar. Kemudian, kulit dan hati mereka menjadi lunak ketika mengingat Allah. Itulah petunjuk Allah yang dengannya Dia memberi petunjuk kepada siapa yang Dia kehendaki. Siapa yang dibiarkan sesat oleh Allah tidak ada yang dapat memberi petunjuk."
  },
  {
    "ayat": 24,
    "arabic": "اَفَمَنْ يَّتَّقِيْ بِوَجْهِهٖ سُوْۤءَ الْعَذَابِ يَوْمَ الْقِيٰمَةِ ۗوَقِيْلَ لِلظّٰلِمِيْنَ ذُوْقُوْا مَا كُنْتُمْ تَكْسِبُوْنَ",
    "transliteration_en": "Afamai yattaqee biwaj hihee sooo'al 'azaabi Yawmal Qiyaamah; wa qeela lizzaali meena zooqoo maa kuntum taksiboon",
    "transliteration_id": "Afamay yattaqī biwajhihī sū'al-‘ażābi yaumal-qiyāmah(ti), wa qīla liẓ-ẓālimīna żūqū mā kuntum taksibūn(a).",
    "translation_en": "Then is he who will shield with his face the worst of the punishment on the Day of Resurrection [like one secure from it]? And it will be said to the wrongdoers, \"Taste what you used to earn.\"",
    "translation_id": "Apakah orang yang menghindari azab yang buruk dengan wajahnya pada hari Kiamat (sama dengan orang mukmin yang tidak kena azab)? Dikatakan kepada orang-orang yang zalim, “Rasakanlah balasan apa yang telah kamu kerjakan.”"
  },
  {
    "ayat": 25,
    "arabic": "كَذَّبَ الَّذِيْنَ مِنْ قَبْلِهِمْ فَاَتٰىهُمُ الْعَذَابُ مِنْ حَيْثُ لَا يَشْعُرُوْنَ",
    "transliteration_en": "Kazzabal lazeena min qablihim fa ataahumul 'azaabu min haisu laa yash'uroon",
    "transliteration_id": "Każżabal-lażīna min qablihim fa'atāhumul-‘ażābu mi ḥaiṡu lā yasy‘urūn(a).",
    "translation_en": "Those before them denied, and punishment came upon them from where they did not perceive.",
    "translation_id": "Orang-orang yang sebelum mereka telah mendustakan (rasul-rasul), datanglah azab kepada mereka dari arah yang tidak mereka sadari."
  },
  {
    "ayat": 26,
    "arabic": "فَاَذَاقَهُمُ اللّٰهُ الْخِزْيَ فِى الْحَيٰوةِ الدُّنْيَا ۚوَلَعَذَابُ الْاٰخِرَةِ اَكْبَرُ ۘ لَوْ كَانُوْا يَعْلَمُوْنَ",
    "transliteration_en": "Fa azaaqahumul laahul khizya fil hayaatid dunyaa wa la'azaabul Aakirati akbar; law kaanoo ya'lamoon",
    "transliteration_id": "Fa ażāqahumullāhul-khizya fil-ḥayātid-dun-yā, wa la‘ażābul-ākhirati akbar(u), lau kānū ya‘lamūn(a).",
    "translation_en": "So Allah made them taste disgrace in worldly life. But the punishment of the Hereafter is greater, if they only knew.",
    "translation_id": "Maka, Allah menimpakan kepada mereka kehinaan dalam kehidupan dunia. Sungguh, azab akhirat lebih besar kalau mereka mengetahui(-nya)."
  },
  {
    "ayat": 27,
    "arabic": "وَلَقَدْ ضَرَبْنَا لِلنَّاسِ فِيْ هٰذَا الْقُرْاٰنِ مِنْ كُلِّ مَثَلٍ لَّعَلَّهُمْ يَتَذَكَّرُوْنَۚ",
    "transliteration_en": "Wa laqad darabnaa linnaasi fee haazal Qur-aani min kulli masalil la'allahum yatazakkaroon",
    "transliteration_id": "Wa laqad ḍarabnā lin-nāsi fī hāżal-qur'āni min kulli maṡalil la‘allahum yatażakkarūn(a).",
    "translation_en": "And We have certainly presented for the people in this Qur'an from every [kind of] example - that they might remember.",
    "translation_id": "Sungguh, Kami benar-benar telah membuatkan dalam Al-Qur’an ini segala macam perumpamaan bagi manusia agar mereka mendapat pelajaran."
  },
  {
    "ayat": 28,
    "arabic": "قُرْاٰنًا عَرَبِيًّا غَيْرَ ذِيْ عِوَجٍ لَّعَلَّهُمْ يَتَّقُوْنَ",
    "transliteration_en": "Qur-aanan 'Arabiyyan ghaira zee 'iwajil la'allahum yattaqoon",
    "transliteration_id": "Qur'ānan ‘arabiyyan gaira żī ‘iwajil la‘allahum yattaqūn(a).",
    "translation_en": "[It is] an Arabic Qur'an, without any deviance that they might become righteous.",
    "translation_id": "(Yaitu) Al-Qur’an dalam bahasa Arab yang tidak ada kebengkokan (di dalamnya) agar mereka bertakwa."
  },
  {
    "ayat": 29,
    "arabic": "ضَرَبَ اللّٰهُ مَثَلًا رَّجُلًا فِيْهِ شُرَكَاۤءُ مُتَشٰكِسُوْنَ وَرَجُلًا سَلَمًا لِّرَجُلٍ هَلْ يَسْتَوِيٰنِ مَثَلًا ۗ اَلْحَمْدُ لِلّٰهِ ۗبَلْ اَكْثَرُهُمْ لَا يَعْلَمُوْنَ",
    "transliteration_en": "Darabal laahu masalar rajulan feehi shurakaaa'u mutashaakisoona wa rajulan salamal lirajulin hal tastawi yaani masalaa; alhamdu lillaah; bal aksaruhum laa ya'lamoon",
    "transliteration_id": "Ḍaraballāhu maṡalar rajulan fīhi syurakā'u mutasyākisūna wa rajulan salamal lirajulin hal yastawiyāni maṡalā(n), al-ḥamdu lillāh(i), bal akṡaruhum lā ya‘lamūn(a).",
    "translation_en": "Allah presents an example: a slave owned by quarreling partners and another belonging exclusively to one man - are they equal in comparison? Praise be to Allah! But most of them do not know.",
    "translation_id": "Allah membuat perumpamaan, (yaitu) seorang laki-laki (hamba sahaya) yang dimiliki oleh beberapa orang yang berserikat, (tetapi) dalam perselisihan dan seorang (hamba sahaya) yang menjadi milik penuh seorang (saja). Apakah keduanya sama keadaannya? Segala puji bagi Allah, tetapi kebanyakan mereka tidak mengetahui(-nya)."
  },
  {
    "ayat": 30,
    "arabic": "اِنَّكَ مَيِّتٌ وَّاِنَّهُمْ مَّيِّتُوْنَ ۖ",
    "transliteration_en": "Innaka maiyitunw wa inna hum maiyitunw wa inna hum maiyitoon",
    "transliteration_id": "Innaka mayyituw wa innahum mayyitūn(a).",
    "translation_en": "Indeed, you are to die, and indeed, they are to die.",
    "translation_id": "Sesungguhnya engkau (Nabi Muhammad akan) mati dan sesungguhnya mereka pun (akan) mati."
  },
  {
    "ayat": 31,
    "arabic": "ثُمَّ اِنَّكُمْ يَوْمَ الْقِيٰمَةِ عِنْدَ رَبِّكُمْ تَخْتَصِمُوْنَ ࣖ   ۔",
    "transliteration_en": "Summa innakum Yawmal Qiyaamati 'inda Rabbikum takhtasimoon",
    "transliteration_id": "Ṡumma innakum yaumal-qiyāmati ‘inda rabbikum takhtaṣimūn(a).",
    "translation_en": "Then indeed you, on the Day of Resurrection, before your Lord, will dispute.",
    "translation_id": "Kemudian, sesungguhnya kamu sekalian pada hari Kiamat akan berbantah-bantahan di hadapan Tuhanmu."
  },
  {
    "ayat": 32,
    "arabic": "۞ فَمَنْ اَظْلَمُ مِمَّنْ كَذَبَ عَلَى اللّٰهِ وَكَذَّبَ بِالصِّدْقِ اِذْ جَاۤءَهٗۗ  اَلَيْسَ فِيْ جَهَنَّمَ مَثْوًى لِّلْكٰفِرِيْنَ",
    "transliteration_en": "Faman azlamu mimman kazaba 'alal laahi wa kazzaba bissidqi iz jaaa'ah; alaisa fee Jahannama maswal lilkaafir",
    "transliteration_id": "Faman aẓlamu mimman każaba ‘alallāhi wa każżaba biṣ-ṣidqi iż jā'ah(ū), alaisa fī jahannama maṡwal lil-kāfirīn(a).",
    "translation_en": "So who is more unjust than one who lies about Allah and denies the truth when it has come to him? Is there not in Hell a residence for the disbelievers?",
    "translation_id": "Maka, siapakah yang lebih zalim daripada orang yang membuat kebohongan terhadap Allah dan mendustakan kebenaran ketika datang kepadanya? Bukankah di (neraka) Jahanam terdapat tempat tinggal bagi orang-orang kafir?"
  },
  {
    "ayat": 33,
    "arabic": "وَالَّذِيْ جَاۤءَ بِالصِّدْقِ وَصَدَّقَ بِهٖٓ اُولٰۤىِٕكَ هُمُ الْمُتَّقُوْنَ",
    "transliteration_en": "Wallazee jaaa'a bissidqi wa saddaqa biheee ulaaa'ika humul muttaqoon",
    "transliteration_id": "Wal-lażī jā'a biṣ-ṣidqi wa ṣaddaqa bihī ulā'ika humul-muttaqūn(a).",
    "translation_en": "And the one who has brought the truth and [they who] believed in it - those are the righteous.",
    "translation_id": "Orang yang membawa kebenaran (Nabi Muhammad) dan yang membenarkannya, mereka itulah orang-orang yang bertakwa."
  },
  {
    "ayat": 34,
    "arabic": "لَهُمْ مَّا يَشَاۤءُوْنَ عِنْدَ رَبِّهِمْ ۗ ذٰلِكَ جَزَاۤءُ الْمُحْسِنِيْنَۚ",
    "transliteration_en": "Lahum maa yashaaa'oona 'inda Rabbihim; zaalika jazaaa'ul muhsineen",
    "transliteration_id": "Lahum mā yasyā'ūna ‘inda rabbihim, żālika jazā'ul-muḥsinīn(a).",
    "translation_en": "They will have whatever they desire with their Lord. That is the reward of the doers of good -",
    "translation_id": "Mereka memperoleh apa yang mereka kehendaki di sisi Tuhannya. Itulah balasan bagi orang-orang yang berbuat kebaikan."
  },
  {
    "ayat": 35,
    "arabic": "لِيُكَفِّرَ اللّٰهُ عَنْهُمْ اَسْوَاَ الَّذِيْ عَمِلُوْا وَيَجْزِيَهُمْ اَجْرَهُمْ بِاَحْسَنِ الَّذِيْ كَانُوْا يَعْمَلُوْنَ",
    "transliteration_en": "Liyukaffiral laahu 'anhum aswa allazee 'amiloo wa yajziyahum ajrahum bi ahsanil lazee kaano ya'maloon",
    "transliteration_id": "Liyukaffirallāhu ‘anhum aswa'al-lażī ‘amilū wa yajziyahum ajrahum bi'aḥsanil-lażī kānū ya‘malūn(a).",
    "translation_en": "That Allah may remove from them the worst of what they did and reward them their due for the best of what they used to do.",
    "translation_id": "(Demikian itu) agar Allah menghapus (dosa) perbuatan mereka yang paling buruk yang pernah mereka lakukan dan memberi pahala kepada mereka dengan yang lebih baik daripada apa yang dahulu mereka kerjakan."
  },
  {
    "ayat": 36,
    "arabic": "اَلَيْسَ اللّٰهُ بِكَافٍ عَبْدَهٗۗ وَيُخَوِّفُوْنَكَ بِالَّذِيْنَ مِنْ دُوْنِهٖۗ وَمَنْ يُّضْلِلِ اللّٰهُ فَمَا لَهٗ مِنْ هَادٍۚ",
    "transliteration_en": "Alaisal laahu bikaafin 'abdahoo wa yukhawwi foonaka billazeena min doonih; wa mai yudlilil laahu famaa lahoo min haad",
    "transliteration_id": "Alaisallāhu bikāfin ‘abdah(ū), wa yukhawwifūnaka bil-lażīna min dūnih(ī), wa may yuḍlilillāhu famā lahū min hād(in).",
    "translation_en": "Is not Allah sufficient for His Servant [Prophet Muhammad]? And [yet], they threaten you with those [they worship] other than Him. And whoever Allah leaves astray - for him there is no guide.",
    "translation_id": "Bukankah Allah yang mencukupi hamba-Nya? Mereka menakut-nakutimu dengan (sesembahan) selain Dia. Siapa yang Allah biarkan sesat tidak ada satu pun yang memberi petunjuk kepadanya."
  },
  {
    "ayat": 37,
    "arabic": "وَمَنْ يَّهْدِ اللّٰهُ فَمَا لَهٗ مِنْ مُّضِلٍّ ۗ اَلَيْسَ اللّٰهُ بِعَزِيْزٍ ذِى انْتِقَامٍ",
    "transliteration_en": "Wa mai yahdil laahu famalahoo mim mudlil; alai sal laahu bi'azeezin zin tiqaam",
    "transliteration_id": "Wa may yahdillāhu famā lahū min muḍill(in), alaisallāhu bi‘azīzin żintiqām(in).",
    "translation_en": "And whoever Allah guides - for him there is no misleader. Is not Allah Exalted in Might and Owner of Retribution?",
    "translation_id": "Siapa yang Allah tunjuki tidak satu pun yang menyesatkannya. Bukankah Allah Maha Perkasa lagi Maha Memiliki (kekuasaan) untuk membalas?"
  },
  {
    "ayat": 38,
    "arabic": "وَلَىِٕنْ سَاَلْتَهُمْ مَّنْ خَلَقَ السَّمٰوٰتِ وَالْاَرْضَ لَيَقُوْلُنَّ اللّٰهُ ۗ قُلْ اَفَرَءَيْتُمْ مَّا تَدْعُوْنَ مِنْ دُوْنِ اللّٰهِ اِنْ اَرَادَنِيَ اللّٰهُ بِضُرٍّ هَلْ هُنَّ كٰشِفٰتُ ضُرِّهٖٓ اَوْ اَرَادَنِيْ بِرَحْمَةٍ هَلْ هُنَّ مُمْسِكٰتُ رَحْمَتِهٖۗ قُلْ حَسْبِيَ اللّٰهُ ۗعَلَيْهِ يَتَوَكَّلُ الْمُتَوَكِّلُوْنَ",
    "transliteration_en": "Wa la'in sa altahum man khalaqas samaawaati wal arda la yaqoolunal laah; qul afara'aitum maa tad'oona min doonil laahi in araadaniyal laahu bidurrin hal hunna kaashi faatu durriheee aw araadanee birahmatin hal hunna mumsikaatu rahmatih; qul hasbiyal laahu 'alaihi tatawakkalul mutawakkiloon",
    "transliteration_id": "Wa la'in sa'altahum man khalaqas-samāwāti wal-arḍa layaqūlunnallāh(u), qul afara'aitum mā tad‘ūna min dūnillāhi in arādaniyallāhu biḍurrin hal hunna kāsyifātu ḍurrihī au arādanī biraḥmatin hal hunna mumsikātu raḥmatih(ī), qul ḥasbiyallāh(u), ‘alaihi yatawakkalul-mutawakkilūn(a).",
    "translation_en": "And if you asked them, \"Who created the heavens and the earth?\" they would surely say, \"Allah.\" Say, \"Then have you considered what you invoke besides Allah? If Allah intended me harm, are they removers of His harm; or if He intended me mercy, are they withholders of His mercy?\" Say, \"Sufficient for me is Allah; upon Him [alone] rely the [wise] reliers.\"",
    "translation_id": "Sungguh, jika engkau (Nabi Muhammad) bertanya kepada mereka (kaum musyrik Makkah) siapa yang menciptakan langit dan bumi, niscaya mereka menjawab, “Allah.” Katakanlah, “Kalau begitu, tahukah kamu tentang apa yang kamu sembah selain Allah jika Allah hendak mendatangkan bencana kepadaku, apakah mereka (sesembahan itu) mampu menghilangkan bencana itu atau jika Allah hendak memberi rahmat kepadaku, apakah mereka dapat mencegah rahmat-Nya?” Katakanlah, “Cukuplah Allah (sebagai pelindung) bagiku. Hanya kepada-Nya orang-orang yang bertawakal berserah diri.”"
  },
  {
    "ayat": 39,
    "arabic": "قُلْ يٰقَوْمِ اعْمَلُوْا عَلٰى مَكَانَتِكُمْ اِنِّيْ عَامِلٌ ۚفَسَوْفَ تَعْلَمُوْنَۙ",
    "transliteration_en": "Qul yaa qawmi'maloo 'alaa makaanatikum innee 'aamilun fasawfa ta'lamoon",
    "transliteration_id": "Qul yā qaumi‘malū ‘alā makānatikum innī ‘āmil(un), fa saufa ta‘lamūn(a).",
    "translation_en": "Say, \"O my people, work according to your position, [for] indeed, I am working; and you are going to know",
    "translation_id": "Katakanlah, “Wahai kaumku, berbuatlah menurut kedudukanmu! Sesungguhnya aku pun berbuat (demikian). Kelak kamu akan mengetahui"
  },
  {
    "ayat": 40,
    "arabic": "مَنْ يَّأْتِيْهِ عَذَابٌ يُّخْزِيْهِ وَيَحِلُّ عَلَيْهِ عَذَابٌ مُّقِيْمٌ",
    "transliteration_en": "Mai yaateehi 'azaabuny yukhzeehi wa yahillu 'alaihi 'azaabum muqeem",
    "transliteration_id": "May ya'tīhi ‘ażābuy yukhzīhi wa yaḥillu ‘alaihi ‘ażābum muqīm(un).",
    "translation_en": "To whom will come a torment disgracing him and on whom will descend an enduring punishment.\"",
    "translation_id": "siapa yang akan mendapat siksa yang menghinakannya dan yang akan ditimpa azab yang kekal.”"
  },
  {
    "ayat": 41,
    "arabic": "اِنَّآ اَنْزَلْنَا عَلَيْكَ الْكِتٰبَ لِلنَّاسِ بِالْحَقِّۚ فَمَنِ اهْتَدٰى فَلِنَفْسِهٖۚ وَمَنْ ضَلَّ فَاِنَّمَا يَضِلُّ عَلَيْهَا ۚوَمَآ اَنْتَ عَلَيْهِمْ بِوَكِيْلٍ ࣖ",
    "transliteration_en": "Innaa anzalnaa 'alaikal Kitaaba linnaasi bilhaqq; famanih tadaa falinafsihee wa man dalla fa innamaa yadillu 'alaihaa wa maaa anta 'alaihim biwakeel",
    "transliteration_id": "Innā anzalnā ‘alaikal-kitāba lin-nāsi bil-ḥaqq(i), fa manihtadā fa linafsih(ī), wa man ḍalla fa innamā yaḍillu ‘alaihā, wa mā anta ‘alaihim biwakīl(in).",
    "translation_en": "Indeed, We sent down to you the Book for the people in truth. So whoever is guided - it is for [the benefit of] his soul; and whoever goes astray only goes astray to its detriment. And you are not a manager over them.",
    "translation_id": "Sesungguhnya Kami telah menurunkan kepadamu (Nabi Muhammad) Kitab (Al-Qur’an) untuk (seluruh) manusia dengan hak. Siapa yang mendapat petunjuk, (petunjuk itu) untuk dirinya sendiri, dan siapa yang sesat, sesungguhnya kesesatan itu untuk dirinya sendiri. Engkau bukanlah penanggung jawab mereka."
  },
  {
    "ayat": 42,
    "arabic": "اَللّٰهُ يَتَوَفَّى الْاَنْفُسَ حِيْنَ مَوْتِهَا وَالَّتِيْ لَمْ تَمُتْ فِيْ مَنَامِهَا ۚ فَيُمْسِكُ الَّتِيْ قَضٰى عَلَيْهَا الْمَوْتَ وَيُرْسِلُ الْاُخْرٰىٓ اِلٰٓى اَجَلٍ مُّسَمًّىۗ اِنَّ فِيْ ذٰلِكَ لَاٰيٰتٍ لِّقَوْمٍ يَّتَفَكَّرُوْنَ",
    "transliteration_en": "Allaahu yatawaffal anfusa heena mawtihaa wallatee lam tamut fee manaamihaa fa yumsikul latee qadaa 'alaihal mawta wa yursilul ukhraaa ilaaa ajalim musammaa; inna fee zaalika la Aayaatil liqawmai yatafakkarron",
    "transliteration_id": "Allāhu yatawaffal-anfusa ḥīna mautihā wal-latī lam tamut fī manāmihā, fayumsikul-latī qaḍā ‘alaihal-mauta wa yursilul-ukhrā ilā ajalim musammā(n), inna fī żālika la'āyātil liqaumiy yatafakkarūn(a).",
    "translation_en": "Allah takes the souls at the time of their death, and those that do not die [He takes] during their sleep. Then He keeps those for which He has decreed death and releases the others for a specified term. Indeed in that are signs for a people who give thought.",
    "translation_id": "Allah menggenggam nyawa (manusia) pada saat kematiannya dan yang belum mati ketika dia tidur. Dia menahan nyawa yang telah Dia tetapkan kematiannya dan Dia melepaskan nyawa yang lain sampai waktu yang ditentukan. Sesungguhnya pada yang demikian itu benar-benar terdapat bukti-bukti (kekuasaan) Allah bagi kaum yang berpikir."
  },
  {
    "ayat": 43,
    "arabic": "اَمِ اتَّخَذُوْا مِنْ دُوْنِ اللّٰهِ شُفَعَاۤءَۗ قُلْ اَوَلَوْ كَانُوْا لَا يَمْلِكُوْنَ شَيْـًٔا وَّلَا يَعْقِلُوْنَ",
    "transliteration_en": "Amit takhazoo min doonillaahi shufa'aaa'; qul awalaw kaanoo laa yamlikoona shai'aw wa laa ya'qiloon",
    "transliteration_id": "Amittakhażū min dūnillāhi syufa‘ā'(a), qul awalau kānū lā yamlikūna syai'aw wa lā ya‘qilūn(a).",
    "translation_en": "Or have they taken other than Allah as intercessors? Say, \"Even though they do not possess [power over] anything, nor do they reason?\"",
    "translation_id": "Apakah mereka juga menjadikan penolong selain Allah? Katakanlah, “Apakah (kamu menjadikannya penolong juga) meskipun mereka tidak memiliki suatu apa pun dan tidak mengerti?”"
  },
  {
    "ayat": 44,
    "arabic": "قُلْ لِّلّٰهِ الشَّفَاعَةُ جَمِيْعًا ۗ لَهٗ مُلْكُ السَّمٰوٰتِ وَالْاَرْضِۗ ثُمَّ اِلَيْهِ تُرْجَعُوْنَ",
    "transliteration_en": "Qul lillaahish shafaa'atu jamee'aa; lahoo mulkus samaawaati wal ardi summa ilaihi turj'oon",
    "transliteration_id": "Qul lillāhisy-syafā‘atu jamī‘ā(n), lahū mulkus-samāwāti wal-arḍ(i), ṡumma ilaihi turja‘ūn(a).",
    "translation_en": "Say, \"To Allah belongs [the right to allow] intercession entirely. To Him belongs the dominion of the heavens and the earth. Then to Him you will be returned.\"",
    "translation_id": "Katakanlah (Nabi Muhammad), “Hanya milik Allah pertolongan itu semuanya. Milik-Nya kerajaan langit dan bumi. Kemudian, hanya kepada-Nya kamu dikembalikan.”"
  },
  {
    "ayat": 45,
    "arabic": "وَاِذَا ذُكِرَ اللّٰهُ وَحْدَهُ اشْمَـَٔزَّتْ قُلُوْبُ الَّذِيْنَ لَا يُؤْمِنُوْنَ بِالْاٰخِرَةِۚ وَاِذَا ذُكِرَ الَّذِيْنَ مِنْ دُوْنِهٖٓ اِذَا هُمْ يَسْتَبْشِرُوْنَ",
    "transliteration_en": "Wa izaa zukiral laahu wahdahush ma azzat quloobul lazeena laa yu'minoona bil Aakhirati wa izaa zukiral lazeena min dooniheee izaa hum yastabshiroon",
    "transliteration_id": "Wa iżā żukirallāhu waḥdahusyma'azzat qulūbul-lażīna  lā yu'minūna bil-ākhirah(ti), wa iżā żukiral-lażīna min dūnihī iżā hum yastabsyirūn(a).",
    "translation_en": "And when Allah is mentioned alone, the hearts of those who do not believe in the Hereafter shrink with aversion, but when those [worshipped] other than Him are mentioned, immediately they rejoice.",
    "translation_id": "Apabila hanya (nama) Allah yang disebut, hati orang-orang yang tidak beriman kepada akhirat kesal. Namun, apabila (nama-nama sembahan) selain Allah disebut, tiba-tiba mereka bergembira."
  },
  {
    "ayat": 46,
    "arabic": "قُلِ اللّٰهُمَّ فَاطِرَ السَّمٰوٰتِ وَالْاَرْضِ عٰلِمَ الْغَيْبِ وَالشَّهَادَةِ اَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيْ مَا كَانُوْا فِيْهِ يَخْتَلِفُوْنَ",
    "transliteration_en": "Qulil laahumma faatiras samaawaati wal ardi 'Aalimal Ghaibi washshahaadati Anta tahkumu baina 'ibaadika fee maa kaanoo fee yakhtalifoon",
    "transliteration_id": "Qulillāhumma fāṭiras-samāwāti wal-arḍi ‘ālimal-gaibi wasy-syahādati anta taḥkumu baina  ‘ibādika fīmā kānū fīhi yakhtalifūn(a).",
    "translation_en": "Say, \"O Allah, Creator of the heavens and the earth, Knower of the unseen and the witnessed, You will judge between your servants concerning that over which they used to differ.\"",
    "translation_id": "Katakanlah, “Ya Allah, Pencipta langit dan bumi, yang mengetahui segala yang gaib dan nyata, Engkaulah yang memutuskan di antara hamba-hamba-Mu apa yang selalu mereka perselisihkan.”"
  },
  {
    "ayat": 47,
    "arabic": "وَلَوْ اَنَّ لِلَّذِيْنَ ظَلَمُوْا مَا فِى الْاَرْضِ جَمِيْعًا وَّمِثْلَهٗ مَعَهٗ لَافْتَدَوْا بِهٖ مِنْ سُوْۤءِ الْعَذَابِ يَوْمَ الْقِيٰمَةِۗ وَبَدَا لَهُمْ مِّنَ اللّٰهِ مَا لَمْ يَكُوْنُوْا يَحْتَسِبُوْنَ",
    "transliteration_en": "Wa law anna lillazeena zalamoo maa fil ardi jamee'anw wa mislahoo ma'ahoo laftadaw bihee min sooo'il azaabi Yawmal Qiyaamah; wa badaa lahum minal laahi maa lam yakkoonoo yahtasiboon",
    "transliteration_id": "Wa lau anna lil-lażīna ẓalamū mā fil-arḍi jamī‘aw wa miṡlahū ma‘ahū laftadau bihī min sū'il-‘ażābi yaumal-qiyāmah(ti), wa badā lahum minallāhi mā lam yakūnū yaḥtasibūn(a).",
    "translation_en": "And if those who did wrong had all that is in the earth entirely and the like of it with it, they would [attempt to] ransom themselves thereby from the worst of the punishment on the Day of Resurrection. And there will appear to them from Allah that which they had not taken into account.",
    "translation_id": "Sekiranya orang-orang yang zalim mempunyai segala apa yang ada di bumi dan ditambah lagi sebanyak itu, niscaya mereka akan menebus dirinya dengan itu dari azab yang buruk pada hari Kiamat. Tampak jelaslah bagi mereka (azab) dari Allah yang belum pernah mereka perkirakan."
  },
  {
    "ayat": 48,
    "arabic": "وَبَدَا لَهُمْ سَيِّاٰتُ مَا كَسَبُوْا وَحَاقَ بِهِمْ مَّا كَانُوْا بِهٖ يَسْتَهْزِءُوْنَ",
    "transliteration_en": "Wa badaa lahum saiyiaatu maa kasaboo wa haaqa bihim maa kaanoo bihee yastahzi'oon",
    "transliteration_id": "Wa badā lahum sayyi'ātu mā kasabū wa ḥāqa bihim mā kānū bihī yastahzi'ūn(a).",
    "translation_en": "And there will appear to them the evils they had earned, and they will be enveloped by what they used to ridicule.",
    "translation_id": "Tampak jelaslah bagi mereka keburukan-keburukan yang mereka kerjakan (di dunia) dan mereka diliputi oleh (azab) yang selalu mereka olok-olokkan."
  },
  {
    "ayat": 49,
    "arabic": "فَاِذَا مَسَّ الْاِنْسَانَ ضُرٌّ دَعَانَاۖ  ثُمَّ اِذَا خَوَّلْنٰهُ نِعْمَةً مِّنَّاۙ قَالَ اِنَّمَآ اُوْتِيْتُهٗ عَلٰى عِلْمٍ ۗبَلْ هِيَ فِتْنَةٌ وَّلٰكِنَّ اَكْثَرَهُمْ لَا يَعْلَمُوْنَ",
    "transliteration_en": "Fa izaa massal insaana durrun da'aanaa summa izaa khawwalnaahu ni'matam minna qaala innamaaa ootee tuhoo 'alaa 'ilm; bal hiya fitna tunw wa laakinna aksarahum laa ya'lamoon",
    "transliteration_id": "Fa'iżā massal-insāna ḍurrun da‘ānā ṡumma iżā khawwalnāhu ni‘matam minnā, qāla innamā ūtītuhū ‘alā ‘ilm(in), bal hiya fitnatuw wa lākinna akṡarahum lā ya‘lamūn(a).",
    "translation_en": "And when adversity touches man, he calls upon Us; then when We bestow on him a favor from Us, he says, \"I have only been given it because of [my] knowledge.\" Rather, it is a trial, but most of them do not know.",
    "translation_id": "Apabila ditimpa bencana, manusia menyeru Kami. Kemudian, apabila Kami memberikan nikmat sebagai anugerah Kami kepadanya, dia berkata, “Sesungguhnya aku diberikan (nikmat) itu hanyalah karena kepintaranku.” Sebenarnya, itu adalah ujian, tetapi kebanyakan mereka tidak mengetahui(-nya)."
  },
  {
    "ayat": 50,
    "arabic": "قَدْ قَالَهَا الَّذِيْنَ مِنْ قَبْلِهِمْ فَمَآ اَغْنٰى عَنْهُمْ مَّا كَانُوْا يَكْسِبُوْنَ",
    "transliteration_en": "Qad qaalahul lazeena min qablihim famaaa aghnaa 'anhum maa kaanoo yaksiboon",
    "transliteration_id": "Qad qālahal-lażīna min qablihim famā agnā ‘anhum mā kānū yaksibūn(a).",
    "translation_en": "Those before them had already said it, but they were not availed by what they used to earn.",
    "translation_id": "Sungguh, orang-orang yang sebelum mereka pun telah mengatakan hal itu. Maka, tidak berguna lagi bagi mereka apa yang selalu mereka usahakan."
  }
]