[
  {
    "ayat": 101,
    "arabic": "فَاِذَا نُفِخَ فِى الصُّوْرِ فَلَآ اَنْسَابَ بَيْنَهُمْ يَوْمَىِٕذٍ وَّلَا يَتَسَاۤءَلُوْنَ",
    "transliteration_en": "Fa izaa nufikha fis Soori falaaa ansaaba bainahum yawma'izinw wa laa yatasaaa'aloon",
    "transliteration_id": "Fa iżā nufikha fiṣ-ṣūri falā ansāba bainahum yauma'iżiw wa lā yatasā'alūn(a).",
    "translation_en": "So when the Horn is blown, no relationship will there be among them that Day, nor will they ask about one another.",
    "translation_id": "Apabila sangkakala ditiup, pada hari itu (hari Kiamat) tidak ada lagi pertalian keluarga di antara mereka dan tidak (pula) mereka saling bertanya."
  },
  {
    "ayat": 102,
    "arabic": "فَمَنْ ثَقُلَتْ مَوَازِيْنُهٗ فَاُولٰۤىِٕكَ هُمُ الْمُفْلِحُوْنَ",
    "transliteration_en": "Faman saqulat mawaazee nuhoo fa ulaaa'ika humul muflihoon",
    "transliteration_id": "Faman ṡaqulat mawāzīnuhū fa ulā'ika humul-mufliḥūn(a).",
    "translation_en": "And those whose scales are heavy [with good deeds] - it is they who are the successful.",
    "translation_id": "Siapa yang berat timbangan (kebaikan)-nya, mereka itulah orang-orang beruntung."
  },
  {
    "ayat": 103,
    "arabic": "وَمَنْ خَفَّتْ مَوَازِيْنُهٗ فَاُولٰۤىِٕكَ الَّذِيْنَ خَسِرُوْٓا اَنْفُسَهُمْ فِيْ جَهَنَّمَ خٰلِدُوْنَ ۚ",
    "transliteration_en": "Wa man khaffat mawaa zeenuhoo fa ulaaa'ikal lazeena khasiroon anfusahum fee Jahannnama khaalidoon",
    "transliteration_id": "Wa man khaffat mawāzīnuhū fa ulā'ikal-lażīna khasirū anfusahum fī jahannama khālidūn(a).",
    "translation_en": "But those whose scales are light - those are the ones who have lost their souls, [being] in Hell, abiding eternally.",
    "translation_id": "Siapa yang ringan timbangan (kebaikan)-nya, mereka itulah orang-orang yang merugikan dirinya sendiri. Mereka kekal di dalam (neraka) Jahanam."
  },
  {
    "ayat": 104,
    "arabic": "تَلْفَحُ وُجُوْهَهُمُ النَّارُ وَهُمْ فِيْهَا كٰلِحُوْنَ",
    "transliteration_en": "Talfahu wujoohahumun Naaru wa hum feehaa kaalihood",
    "transliteration_id": "Talfaḥu wujūhahumun-nāru wa hum fīhā kāliḥūn(a).",
    "translation_en": "The Fire will sear their faces, and they therein will have taut smiles.",
    "translation_id": "Wajah mereka dibakar api neraka dan mereka di neraka dalam keadaan sangat menyeramkan."
  },
  {
    "ayat": 105,
    "arabic": "اَلَمْ تَكُنْ اٰيٰتِيْ تُتْلٰى عَلَيْكُمْ فَكُنْتُمْ بِهَا تُكَذِّبُوْنَ",
    "transliteration_en": "Alam takun Aayaatee tutlaa 'alaikum fakuntum bihaa tukazziboon",
    "transliteration_id": "Alam takun āyātī tutlā ‘alaikum fa kuntum bihā tukażżibūn(a).",
    "translation_en": "[It will be said]. \"Were not My verses recited to you and you used to deny them?\"",
    "translation_id": "Bukankah ayat-ayat-Ku telah dibacakan kepadamu, tetapi kamu selalu mendustakannya?"
  },
  {
    "ayat": 106,
    "arabic": "قَالُوْا رَبَّنَا غَلَبَتْ عَلَيْنَا شِقْوَتُنَا وَكُنَّا قَوْمًا ضَاۤلِّيْنَ",
    "transliteration_en": "Qaaloo Rabbanaa ghalabat 'alainaa shiqwatunaa wa kunnaa qawman daaalleen",
    "transliteration_id": "Qālū rabbanā galabat ‘alainā syiqwatunā wa kunnā qauman ḍāllīn(a).",
    "translation_en": "They will say, \"Our Lord, our wretchedness overcame us, and we were a people astray.",
    "translation_id": "Mereka berkata, “Ya Tuhan kami, kedurhakaan kami telah menguasai kami dan kami adalah orang-orang yang sesat."
  },
  {
    "ayat": 107,
    "arabic": "رَبَّنَآ اَخْرِجْنَا مِنْهَا فَاِنْ عُدْنَا فَاِنَّا ظٰلِمُوْنَ",
    "transliteration_en": "Rabbanaa akhrijnaa minhaa fa in 'udnaa fa innaa zaalimoon",
    "transliteration_id": "Rabbanā akhrijnā minhā fa in ‘udnā fa innā ẓālimūn(a).",
    "translation_en": "Our Lord, remove us from it, and if we were to return [to evil], we would indeed be wrongdoers.\"",
    "translation_id": "Ya Tuhan kami, keluarkanlah kami darinya (api neraka dan kembalikan ke dunia). Kemudian, jika kami masih mengulangi (kekafiran), sesungguhnya kami adalah orang-orang zalim.”"
  },
  {
    "ayat": 108,
    "arabic": "قَالَ اخْسَـُٔوْا فِيْهَا وَلَا تُكَلِّمُوْنِ",
    "transliteration_en": "Qaalakh sa'oo feehaa wa laa tukallimoon",
    "transliteration_id": "Qālakhsa'ū fīhā wa lā tukallimūn(i).",
    "translation_en": "He will say, \"Remain despised therein and do not speak to Me.",
    "translation_id": "Dia (Allah) berfirman, “Tinggallah kamu di sana dengan hina dan janganlah berbicara dengan-Ku.”"
  },
  {
    "ayat": 109,
    "arabic": "اِنَّهٗ كَانَ فَرِيْقٌ مِّنْ عِبَادِيْ يَقُوْلُوْنَ رَبَّنَآ اٰمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَاَنْتَ خَيْرُ الرّٰحِمِيْنَ ۚ",
    "transliteration_en": "Innahoo kaana fareequm min 'ibaadee yaqooloona Rabbanaaa aamannaa faghfir lanaa warhamnaa wa Anta khairur raahimeen",
    "transliteration_id": "Innahū kāna farīqum min ‘ibādī yaqūlūna rabbanā āmannā fagfir lanā warḥamnā wa anta khairur-rāḥimīn(a).",
    "translation_en": "Indeed, there was a party of My servants who said, 'Our Lord, we have believed, so forgive us and have mercy upon us, and You are the best of the merciful.'",
    "translation_id": "Sesungguhnya segolongan dari hamba-hamba-Ku berdoa, “Ya Tuhan kami, kami telah beriman, maka ampunilah kami dan berilah kami rahmat. Engkau adalah sebaik-baik pemberi rahmat.”"
  },
  {
    "ayat": 110,
    "arabic": "فَاتَّخَذْتُمُوْهُمْ سِخْرِيًّا حَتّٰىٓ اَنْسَوْكُمْ ذِكْرِيْ وَكُنْتُمْ مِّنْهُمْ تَضْحَكُوْنَ",
    "transliteration_en": "Fattakhaztumoohum sikhriyyan hattaaa ansawkum zikree wa kuntum minhum tadhakoon",
    "transliteration_id": "Fattakhażtumūhum sikhriyyan ḥattā ansaukum żikrī wa kuntum minhum taḍḥakūn(a).",
    "translation_en": "But you took them in mockery to the point that they made you forget My remembrance, and you used to laugh at them.",
    "translation_id": "Lalu, kamu jadikan mereka bahan ejekan sehingga itu membuatmu lupa mengingat-Ku dan kamu (selalu) menertawakan mereka."
  },
  {
    "ayat": 111,
    "arabic": "اِنِّيْ جَزَيْتُهُمُ الْيَوْمَ بِمَا صَبَرُوْٓاۙ اَنَّهُمْ هُمُ الْفَاۤىِٕزُوْنَ",
    "transliteration_en": "Inee jazaituhumul Yawma bimaa sabarooo annahum humul faaa'izoon",
    "transliteration_id": "Innī jazaituhumul-yauma bimā ṣabarū, annahum humul-fā'izūn(a).",
    "translation_en": "Indeed, I have rewarded them this Day for their patient endurance - that they are the attainers [of success].\"",
    "translation_id": "Sesungguhnya pada hari ini Aku memberi balasan kepada mereka karena kesabaran mereka. Sesungguhnya mereka itulah orang-orang yang menang."
  },
  {
    "ayat": 112,
    "arabic": "قٰلَ كَمْ لَبِثْتُمْ فِى الْاَرْضِ عَدَدَ سِنِيْنَ",
    "transliteration_en": "Qaala kam labistum fil ardi 'adada sineen",
    "transliteration_id": "Qāla kam labiṡtum fil-arḍi ‘adada sinīn(a).",
    "translation_en": "[Allah] will say, \"How long did you remain on earth in number of years?\"",
    "translation_id": "Dia (Allah) berfirman, “Berapa tahunkah lamanya kamu tinggal di bumi?”"
  },
  {
    "ayat": 113,
    "arabic": "قَالُوْا لَبِثْنَا يَوْمًا اَوْ بَعْضَ يَوْمٍ فَسْـَٔلِ الْعَاۤدِّيْنَ",
    "transliteration_en": "Qaaloo labisnaa yawman aw ba'da yawmin fas'alil 'aaaddeen",
    "transliteration_id": "Qālū labiṡnā yauman au baḍa yaumin fas'alil-‘āddīn(a).",
    "translation_en": "They will say, \"We remained a day or part of a day; ask those who enumerate.\"",
    "translation_id": "Mereka menjawab, “Kami tinggal (di bumi) sehari atau setengah hari. Tanyalah kepada mereka yang menghitung.”"
  },
  {
    "ayat": 114,
    "arabic": "قٰلَ اِنْ لَّبِثْتُمْ اِلَّا قَلِيْلًا لَّوْ اَنَّكُمْ كُنْتُمْ تَعْلَمُوْنَ",
    "transliteration_en": "Qaala il labistum illaa qaleelal law annakum kuntum ta'lamoon",
    "transliteration_id": "Qāla il labiṡtum illā qalīlal lau annakum kuntum ta‘lamūn(a).",
    "translation_en": "He will say, \"You stayed not but a little - if only you had known.",
    "translation_id": "Dia (Allah) berfirman, “Kamu tinggal (di bumi) hanya sebentar jika kamu benar-benar mengetahui.”"
  },
  {
    "ayat": 115,
    "arabic": "اَفَحَسِبْتُمْ اَنَّمَا خَلَقْنٰكُمْ عَبَثًا وَّاَنَّكُمْ اِلَيْنَا لَا تُرْجَعُوْنَ",
    "transliteration_en": "Afahsibtum annamaa khalaqnaakum 'abasanw wa annakum ilainaa laa turja'oon",
    "transliteration_id": "Afa ḥasibtum annamā khalaqnākum ‘abaṡaw wa annakum ilainā lā turja‘ūn(a).",
    "translation_en": "Then did you think that We created you uselessly and that to Us you would not be returned?\"",
    "translation_id": "Apakah kamu mengira bahwa Kami menciptakan kamu main-main (tanpa ada maksud) dan kamu tidak akan dikembalikan kepada Kami?"
  },
  {
    "ayat": 116,
    "arabic": "فَتَعٰلَى اللّٰهُ الْمَلِكُ الْحَقُّۚ  لَآ اِلٰهَ اِلَّا هُوَۚ رَبُّ الْعَرْشِ الْكَرِيْمِ",
    "transliteration_en": "Fata'aalal laahul Malikul Haqq; laaa ilaaha illaa Huwa Rabbul 'Arshil Kareem",
    "transliteration_id": "Fa ta‘ālallāhul-malikul-ḥaqq(u), lā ilāha illā huw(a), rabbul-‘arsyil-karīm(i).",
    "translation_en": "So exalted is Allah, the Sovereign, the Truth; there is no deity except Him, Lord of the Noble Throne.",
    "translation_id": "Maha Tinggi Allah, Raja yang sebenarnya. Tidak ada tuhan selain Dia, pemilik ‘Arasy yang mulia."
  },
  {
    "ayat": 117,
    "arabic": "وَمَنْ يَّدْعُ مَعَ اللّٰهِ اِلٰهًا اٰخَرَ لَا بُرْهَانَ لَهٗ بِهٖۙ فَاِنَّمَا حِسَابُهٗ عِنْدَ رَبِّهٖۗ اِنَّهٗ لَا يُفْلِحُ الْكٰفِرُوْنَ",
    "transliteration_en": "Wa mai yad'u ma'allaahi ilaahan aakhara laa burhaana lahoo bihee fa innnamaa hisaabuhoo 'inda Rabbih; innahoo laa yuflihul kaafiroon",
    "transliteration_id": "Wa may yad‘u ma‘allāhi ilāhan ākhara lā burhāna lahū bih(ī), fa innamā ḥisābuhū ‘inda rabbih(ī), innahū lā yufliḥul-kāfirūn(a).",
    "translation_en": "And whoever invokes besides Allah another deity for which he has no proof - then his account is only with his Lord. Indeed, the disbelievers will not succeed.",
    "translation_id": "Siapa yang menyembah tuhan yang lain bersama Allah, padahal tidak ada suatu bukti pun baginya (yang membenarkan) tentang itu, maka perhitungan (amal)-nya hanya pada Tuhannya. Sesungguhnya orang-orang kafir itu tidak akan beruntung."
  },
  {
    "ayat": 118,
    "arabic": "وَقُلْ رَّبِّ اغْفِرْ وَارْحَمْ وَاَنْتَ خَيْرُ الرّٰحِمِيْنَ ࣖ",
    "transliteration_en": "Wa qur Rabbigh fir warham wa Anta khairur raahimeen",
    "transliteration_id": "Wa qur rabbigfir warḥam wa anta khairur-rāḥimīn(a).",
    "translation_en": "And, [O Muhammad], say, \"My Lord, forgive and have mercy, and You are the best of the merciful.\"",
    "translation_id": "Katakanlah (Nabi Muhammad), “Ya Tuhanku, berilah ampunan dan rahmat. Engkaulah sebaik-baik pemberi rahmat.”"
  }
]