[
  {
    "ayat": 1,
    "arabic": "قَدْ اَفْلَحَ الْمُؤْمِنُوْنَ ۙ",
    "transliteration_en": "Qad aflahal mu'minoon",
    "transliteration_id": "Qad aflaḥal-mu'minūn(a).",
    "translation_en": "Certainly will the believers have succeeded:",
    "translation_id": "Sungguh, beruntunglah orang-orang mukmin."
  },
  {
    "ayat": 2,
    "arabic": "الَّذِيْنَ هُمْ فِيْ صَلَاتِهِمْ خٰشِعُوْنَ",
    "transliteration_en": "Allazeena hum fee Salaatihim khaashi'oon",
    "transliteration_id": "Allażīna hum fī ṣalātihim khāsyi‘ūn(a).",
    "translation_en": "They who are during their prayer humbly submissive",
    "translation_id": "(Yaitu) orang-orang yang khusyuk dalam salatnya,"
  },
  {
    "ayat": 3,
    "arabic": "وَالَّذِيْنَ هُمْ عَنِ اللَّغْوِ مُعْرِضُوْنَ ۙ",
    "transliteration_en": "Wallazeena hum 'anillaghwimu'ridoon",
    "transliteration_id": "Wal-lażīna hum anil-lagwi muriḍūn(a).",
    "translation_en": "And they who turn away from ill speech",
    "translation_id": "orang-orang yang meninggalkan (perbuatan dan perkataan) yang tidak berguna,"
  },
  {
    "ayat": 4,
    "arabic": "وَالَّذِيْنَ هُمْ لِلزَّكٰوةِ فٰعِلُوْنَ ۙ",
    "transliteration_en": "Wallazeena hum liz Zakaati faa'iloon",
    "transliteration_id": "Wal-lażīna hum liz-zakāti fā‘ilūn(a).",
    "translation_en": "And they who are observant of zakah",
    "translation_id": "orang-orang yang menunaikan zakat,"
  },
  {
    "ayat": 5,
    "arabic": "وَالَّذِيْنَ هُمْ لِفُرُوْجِهِمْ حٰفِظُوْنَ ۙ",
    "transliteration_en": "Wallazeena hum lifuroo jihim haafizoon",
    "transliteration_id": "Wal-lażīna hum lifurūjihim ḥāfiẓūn(a).",
    "translation_en": "And they who guard their private parts",
    "translation_id": "dan orang-orang yang menjaga kemaluannya,"
  },
  {
    "ayat": 6,
    "arabic": "اِلَّا عَلٰٓى اَزْوَاجِهِمْ اَوْ مَا مَلَكَتْ اَيْمَانُهُمْ فَاِنَّهُمْ غَيْرُ مَلُوْمِيْنَۚ",
    "transliteration_en": "Illaa 'alaaa azwaajihim aw maa malakat aimaanuhum fa innahum ghairu maloomeen",
    "transliteration_id": "Illā ‘alā azwājihim au mā malakat aimānuhum fa innahum gairu malūmīn(a).",
    "translation_en": "Except from their wives or those their right hands possess, for indeed, they will not be blamed -",
    "translation_id": "kecuali terhadap istri-istri mereka atau hamba sahaya yang mereka miliki. Sesungguhnya mereka tidak tercela (karena menggaulinya)."
  },
  {
    "ayat": 7,
    "arabic": "فَمَنِ ابْتَغٰى وَرَاۤءَ ذٰلِكَ فَاُولٰۤىِٕكَ هُمُ الْعَادُوْنَ ۚ",
    "transliteration_en": "Famanib taghaa waraaa'a zaalika fa ulaaa'ika humul 'aadoon",
    "transliteration_id": "Famanibtagā warā'a żālika fa ulā'ika humul-‘ādūn(a).",
    "translation_en": "But whoever seeks beyond that, then those are the transgressors -",
    "translation_id": "Maka, siapa yang mencari (pelampiasan syahwat) selain itu, mereka itulah orang-orang yang melampaui batas."
  },
  {
    "ayat": 8,
    "arabic": "وَالَّذِيْنَ هُمْ لِاَمٰنٰتِهِمْ وَعَهْدِهِمْ رَاعُوْنَ ۙ",
    "transliteration_en": "Wallazeena hum li amaanaatihim wa 'ahdihim raa'oon",
    "transliteration_id": "Wal-lażīna hum li'amānātihim wa ‘ahdihim rā‘ūn(a).",
    "translation_en": "And they who are to their trusts and their promises attentive",
    "translation_id": "(Sungguh beruntung pula) orang-orang yang memelihara amanat dan janji mereka"
  },
  {
    "ayat": 9,
    "arabic": "وَالَّذِيْنَ هُمْ عَلٰى صَلَوٰتِهِمْ يُحَافِظُوْنَ ۘ",
    "transliteration_en": "Wallazeena hum 'alaa Salawaatihim yuhaafizoon",
    "transliteration_id": "Wal-lażīna hum ‘alā ṣalawātihim yuḥāfiẓūn(a).",
    "translation_en": "And they who carefully maintain their prayers -",
    "translation_id": "serta orang-orang yang memelihara salat mereka."
  },
  {
    "ayat": 10,
    "arabic": "اُولٰۤىِٕكَ هُمُ الْوٰرِثُوْنَ ۙ",
    "transliteration_en": "Ulaaa'ika humul waarisoon",
    "transliteration_id": "Ulā'ika humul-wāriṡūn(a).",
    "translation_en": "Those are the inheritors",
    "translation_id": "Mereka itulah orang-orang yang akan mewarisi."
  },
  {
    "ayat": 11,
    "arabic": "الَّذِيْنَ يَرِثُوْنَ الْفِرْدَوْسَۗ هُمْ فِيْهَا خٰلِدُوْنَ",
    "transliteration_en": "Allazeena yarisoonal Firdawsa hum feehaa khaalidoon",
    "transliteration_id": "Allażīna yariṡūnal-firdaus(a), hum fīhā khālidūn(a).",
    "translation_en": "Who will inherit al-Firdaus. They will abide therein eternally.",
    "translation_id": "(Yaitu) orang-orang yang akan mewarisi (surga) Firdaus. Mereka kekal di dalamnya."
  },
  {
    "ayat": 12,
    "arabic": "وَلَقَدْ خَلَقْنَا الْاِنْسَانَ مِنْ سُلٰلَةٍ مِّنْ طِيْنٍ ۚ",
    "transliteration_en": "Wa laqad khalaqnal insaana min sulaalatim minteen",
    "transliteration_id": "Wa laqad khalaqnal-insāna min sulālatim min ṭīn(in).",
    "translation_en": "And certainly did We create man from an extract of clay.",
    "translation_id": "Sungguh, Kami telah menciptakan manusia dari sari pati (yang berasal) dari tanah."
  },
  {
    "ayat": 13,
    "arabic": "ثُمَّ جَعَلْنٰهُ نُطْفَةً فِيْ قَرَارٍ مَّكِيْنٍ ۖ",
    "transliteration_en": "Summa ja'alnaahu nutfatan fee qaraarim makeen",
    "transliteration_id": "Ṡumma ja‘alnāhu nuṭfatan fī qarārim makīn(in).",
    "translation_en": "Then We placed him as a sperm-drop in a firm lodging.",
    "translation_id": "Kemudian, Kami menjadikannya air mani di dalam tempat yang kukuh (rahim)."
  },
  {
    "ayat": 14,
    "arabic": "ثُمَّ خَلَقْنَا النُّطْفَةَ عَلَقَةً فَخَلَقْنَا الْعَلَقَةَ مُضْغَةً فَخَلَقْنَا الْمُضْغَةَ عِظٰمًا فَكَسَوْنَا الْعِظٰمَ لَحْمًا ثُمَّ اَنْشَأْنٰهُ خَلْقًا اٰخَرَۗ فَتَبَارَكَ اللّٰهُ اَحْسَنُ الْخٰلِقِيْنَۗ",
    "transliteration_en": "Summa khalaqnan nutfata 'alaqatan fakhalaqnal 'alaqata mudghatan fakhalaq nal mudghata 'izaaman fakasawnal 'izaama lahman summa anshaanaahu khalqan aakhar; fatabaarakal laahu ahsanul khaaliqeen",
    "transliteration_id": "Ṡumma khalaqnan-nuṭfata ‘alaqatan fa khalaqnal-‘alaqata muḍgatan fa khalaqnal-muḍgata ‘iẓāman fa kasaunal-‘iẓāma laḥmā(n), ṡumma ansya'nāhu khalqan ākhar(a), fa tabārakallāhu aḥsanul-khāliqīn(a).",
    "translation_en": "Then We made the sperm-drop into a clinging clot, and We made the clot into a lump [of flesh], and We made [from] the lump, bones, and We covered the bones with flesh; then We developed him into another creation. So blessed is Allah, the best of creators.",
    "translation_id": "Kemudian, air mani itu Kami jadikan sesuatu yang menggantung (darah). Lalu, sesuatu yang menggantung itu Kami jadikan segumpal daging. Lalu, segumpal daging itu Kami jadikan tulang belulang. Lalu, tulang belulang itu Kami bungkus dengan daging. Kemudian, Kami menjadikannya makhluk yang (berbentuk) lain. Maha Suci Allah sebaik-baik pencipta."
  },
  {
    "ayat": 15,
    "arabic": "ثُمَّ اِنَّكُمْ بَعْدَ ذٰلِكَ لَمَيِّتُوْنَ ۗ",
    "transliteration_en": "Summa innakum ba'da zaalika la maaiyitoon",
    "transliteration_id": "Ṡumma innakum ba‘da żālika lamayyitūn(a).",
    "translation_en": "Then indeed, after that you are to die.",
    "translation_id": "Kemudian, sesungguhnya kamu setelah itu benar-benar akan mati."
  },
  {
    "ayat": 16,
    "arabic": "ثُمَّ اِنَّكُمْ يَوْمَ الْقِيٰمَةِ تُبْعَثُوْنَ",
    "transliteration_en": "Summa innakum Yawmal Qiyaamati tub'asoon",
    "transliteration_id": "Ṡumma innakum yaumal-qiyāmati tub‘aṡūn(a).",
    "translation_en": "Then indeed you, on the Day of Resurrection, will be resurrected.",
    "translation_id": "Kemudian, sesungguhnya kamu pada hari Kiamat akan dibangkitkan."
  },
  {
    "ayat": 17,
    "arabic": "وَلَقَدْ خَلَقْنَا فَوْقَكُمْ سَبْعَ طَرَاۤىِٕقَۖ وَمَا كُنَّا عَنِ الْخَلْقِ غٰفِلِيْنَ",
    "transliteration_en": "Wa laqad khalaqnaa fawqakum sab'a taraaa'iqa wa maa kunnaa 'anil khalqi ghaafileen",
    "transliteration_id": "Wa laqad khalaqnā fauqakum sab‘a ṭarā'iq(a), wa mā kunnā ‘anil-khalqi gāfilīn(a).",
    "translation_en": "And We have created above you seven layered heavens, and never have We been of [Our] creation unaware.",
    "translation_id": "Sungguh, Kami telah menciptakan tujuh langit di atas kamu dan Kami tidaklah lengah terhadap ciptaan (Kami)."
  },
  {
    "ayat": 18,
    "arabic": "وَاَنْزَلْنَا مِنَ السَّمَاۤءِ مَاۤءًۢ بِقَدَرٍ فَاَسْكَنّٰهُ فِى الْاَرْضِۖ وَاِنَّا عَلٰى ذَهَابٍۢ بِهٖ لَقٰدِرُوْنَ ۚ",
    "transliteration_en": "Wa anzalnaa minas samaaa'i maaa'am biqadarin fa-askannaahu fil ardi wa innaa 'alaa zahaabim bihee laqaa diroon",
    "transliteration_id": "Wa anzalnā minas-samā'i mā'am biqadarin fa askannāhu fil-arḍ(i), wa innā ‘alā żahābim bihī laqādirūn(a).",
    "translation_en": "And We have sent down rain from the sky in a measured amount and settled it in the earth. And indeed, We are Able to take it away.",
    "translation_id": "Kami turunkan air dari langit dengan suatu ukuran. Lalu, Kami jadikan air itu menetap di bumi dan sesungguhnya Kami Maha Kuasa melenyapkannya."
  },
  {
    "ayat": 19,
    "arabic": "فَاَنْشَأْنَا لَكُمْ بِهٖ جَنّٰتٍ مِّنْ نَّخِيْلٍ وَّاَعْنَابٍۘ لَكُمْ فِيْهَا فَوَاكِهُ كَثِيْرَةٌ وَّمِنْهَا تَأْكُلُوْنَ ۙ",
    "transliteration_en": "Fa anshaanaa lakum bihee Jannaatim min nakheelinw wa a'naab; lakum feehaa fawaakihu kaseeratunw wa minhaa taakuloon",
    "transliteration_id": "Fa ansya'nā lakum bihī jannātim min nakhīliw wa a‘nāb(in), lakum fīhā fawākihu kaṡīratuw wa minhā ta'kulūn(a).",
    "translation_en": "And We brought forth for you thereby gardens of palm trees and grapevines in which for you are abundant fruits and from which you eat.",
    "translation_id": "Lalu, dengan (air) itu Kami tumbuhkan untukmu kebun-kebun kurma dan anggur. Di sana kamu mendapatkan buah-buahan yang banyak dan dari sebagiannya itu kamu makan."
  },
  {
    "ayat": 20,
    "arabic": "وَشَجَرَةً تَخْرُجُ مِنْ طُوْرِ سَيْنَاۤءَ تَنْۢبُتُ بِالدُّهْنِ وَصِبْغٍ لِّلْاٰكِلِيْنَ",
    "transliteration_en": "Wa shajaratan takhruju min Toori Sainaaa'a tambutu bidduhni wa sibghil lil aakileen",
    "transliteration_id": "Wa syajaratan takhruju min ṭūri sainā'a tambutu bid-duhni wa ṣibgil lil-ākilīn(a).",
    "translation_en": "And [We brought forth] a tree issuing from Mount Sinai which produces oil and food for those who eat.",
    "translation_id": "(Kami tumbuhkan) pohon (zaitun) yang tumbuh di Bukit Sinai, yang menghasilkan minyak dan lauk-pauk pembangkit selera bagi orang-orang yang makan."
  },
  {
    "ayat": 21,
    "arabic": "وَاِنَّ لَكُمْ فِى الْاَنْعَامِ لَعِبْرَةًۗ  نُسْقِيْكُمْ مِّمَّا فِيْ بُطُوْنِهَا وَلَكُمْ فِيْهَا مَنَافِعُ كَثِيْرَةٌ وَّمِنْهَا تَأْكُلُوْنَ ۙ",
    "transliteration_en": "Wa inna lakum fil an'aami la'ibrah; nusqeekum mimmaa fee butoonihaa wa lakum feehaa manaafi'u kaseeratunw wa minhaa taakuloon",
    "transliteration_id": "Wa inna lakum fil-an‘āmi la‘ibrah(tan), nusqīkum mimmā fī buṭūnihā wa lakum fīhā manāfi‘u kaṡīratuw wa minhā ta'kulūn(a).",
    "translation_en": "And indeed, for you in livestock is a lesson. We give you drink from that which is in their bellies, and for you in them are numerous benefits, and from them you eat.",
    "translation_id": "Sesungguhnya pada hewan-hewan ternak benar-benar terdapat pelajaran bagimu. Kami memberi minum kamu dari sebagian apa yang ada dalam perutnya (air susu), padanya terdapat banyak manfaat untukmu, dan sebagian darinya kamu makan."
  },
  {
    "ayat": 22,
    "arabic": "وَعَلَيْهَا وَعَلَى الْفُلْكِ تُحْمَلُوْنَ ࣖ",
    "transliteration_en": "Wa 'alaihaa wa'alal fulki tuhmaloon",
    "transliteration_id": "Wa ‘alaihā wa ‘alal-fulki tuḥmalūn(a).",
    "translation_en": "And upon them and on ships you are carried.",
    "translation_id": "Di atasnya (hewan-hewan ternak) dan di atas kapal-kapal kamu diangkut."
  },
  {
    "ayat": 23,
    "arabic": "وَلَقَدْ اَرْسَلْنَا نُوْحًا اِلٰى قَوْمِهٖ فَقَالَ يٰقَوْمِ اعْبُدُوا اللّٰهَ مَا لَكُمْ مِّنْ اِلٰهٍ غَيْرُهٗۗ اَفَلَا تَتَّقُوْنَ",
    "transliteration_en": "Wa laqad arsalnaa Noohan ilaa qawmihee faqaala yaa qawmi'budul laaha maa lakum min ilahin ghairuhoo afalaa tattaqoon",
    "transliteration_id": "Wa laqad arsalnā nūḥan ilā qaumihī fa qāla yā qaumi‘budullāha mā lakum min ilāhin gairuh(ū), afalā tattaqūn(a).",
    "translation_en": "And We had certainly sent Noah to his people, and he said, \"O my people, worship Allah; you have no deity other than Him; then will you not fear Him?\"",
    "translation_id": "Sungguh, Kami telah mengutus Nuh kepada kaumnya. Lalu, dia berkata, “Wahai kaumku, sembahlah Allah, tidak ada Tuhan bagimu selain Dia. Apakah kamu tidak bertakwa?”"
  },
  {
    "ayat": 24,
    "arabic": "فَقَالَ الْمَلَؤُا الَّذِيْنَ كَفَرُوْا مِنْ قَوْمِهٖ مَا هٰذَآ اِلَّا بَشَرٌ مِّثْلُكُمْۙ يُرِيْدُ اَنْ يَّتَفَضَّلَ عَلَيْكُمْۗ وَلَوْ شَاۤءَ اللّٰهُ لَاَنْزَلَ مَلٰۤىِٕكَةً  ۖمَّا سَمِعْنَا بِهٰذَا فِيْٓ اٰبَاۤىِٕنَا الْاَوَّلِيْنَ ۚ",
    "transliteration_en": "Faqaalal mala'ul lazeena kafaroo min qawmihee maa haazaaa illaa basharum mislukum yureedu ai yatafaddala 'alaikum wa law shaaa'al laahu la anzala malaaa'ikatam maa sami'naa bihaazaa feee aabaaa'inal awwaleen",
    "transliteration_id": "Fa qālal-mala'ul-lażīna kafarū min qaumihī mā hāżā illā basyarum miṡlukum, yurīdu ay yatafaḍḍala ‘alaikum, wa lau syā'allāhu la'anzala malā'ikah(tan), mā sami‘nā bihāżā fī ābā'inal-awwalīn(a).",
    "translation_en": "But the eminent among those who disbelieved from his people said, \"This is not but a man like yourselves who wishes to take precedence over you; and if Allah had willed [to send a messenger], He would have sent down angels. We have not heard of this among our forefathers.",
    "translation_id": "Maka, para pemuka orang-orang yang kufur dari kaumnya berkata, “Orang ini tidak lain hanyalah manusia seperti kamu. Dia ingin menjadi orang yang lebih mulia daripada kamu. Seandainya Allah berkehendak, tentu Dia akan mengutus malaikat. Belum pernah kami dengar (seruan seperti) ini pada (masa) nenek moyang kami dahulu."
  },
  {
    "ayat": 25,
    "arabic": "اِنْ هُوَ اِلَّا رَجُلٌۢ بِهٖ جِنَّةٌ فَتَرَبَّصُوْا بِهٖ حَتّٰى حِيْنٍ",
    "transliteration_en": "In huwa illaa rajulum bihee jinnatun fatarabbasoo bihee hattan heen",
    "transliteration_id": "In huwa illā rajulum bihī jinnatun fa tarabbaṣū bihī ḥattā ḥīn(in).",
    "translation_en": "He is not but a man possessed with madness, so wait concerning him for a time.\"",
    "translation_id": "Dia hanyalah seorang laki-laki yang gila. Tunggulah dia sampai waktu yang ditentukan.”"
  },
  {
    "ayat": 26,
    "arabic": "قَالَ رَبِّ انْصُرْنِيْ بِمَا كَذَّبُوْنِ",
    "transliteration_en": "Qaala Rabbin surnee bimaa kazzaboon",
    "transliteration_id": "Qāla rabbinṣurnī bimā każżabūn(i).",
    "translation_en": "[Noah] said, \"My Lord, support me because they have denied me.\"",
    "translation_id": "Dia (Nuh) berdoa, “Ya Tuhanku, tolonglah aku karena mereka telah mendustakanku.”"
  },
  {
    "ayat": 27,
    "arabic": "فَاَوْحَيْنَآ اِلَيْهِ اَنِ اصْنَعِ الْفُلْكَ بِاَعْيُنِنَا وَوَحْيِنَا فَاِذَا جَاۤءَ اَمْرُنَا وَفَارَ التَّنُّوْرُۙ فَاسْلُكْ فِيْهَا مِنْ كُلٍّ زَوْجَيْنِ اثْنَيْنِ وَاَهْلَكَ اِلَّا مَنْ سَبَقَ عَلَيْهِ الْقَوْلُ مِنْهُمْۚ وَلَا تُخَاطِبْنِيْ فِى الَّذِيْنَ ظَلَمُوْاۚ اِنَّهُمْ مُّغْرَقُوْنَ",
    "transliteration_en": "Fa awhainaaa ilaihi anis na'il fulka bi a'yuninaa wa wahyinaa fa izaa jaaa'a amrunaa wa faarat tannooru fasluk feehaa min kullin zawjainis naini wa ahlaka illaa man sabaqa 'alaihil qawlu minhum wa laa tukhaat ibnee fil lazeena zalamooo innaahum mughraqoon",
    "transliteration_id": "Fa auḥainā ilaihi aniṣna‘il-fulka bi'a‘yuninā wa waḥyinā fa iżā jā'a amrunā wafārat-tannūr(u), fasluk fīhā min kullin zaujainiṡnaini wa ahlaka illā man sabaqa ‘alaihil-qaulu minhum, wa lā tukhāṭibnī fil-lażīna ẓalamū, innahum mugraqūn(a).",
    "translation_en": "So We inspired to him, \"Construct the ship under Our observation, and Our inspiration, and when Our command comes and the oven overflows, put into the ship from each [creature] two mates and your family, except those for whom the decree [of destruction] has proceeded. And do not address Me concerning those who have wronged; indeed, they are to be drowned.",
    "translation_id": "Kami wahyukan kepadanya, “Buatlah kapal dengan pengawasan dan petunjuk Kami. Apabila perintah Kami telah datang dan tungku (dapur) telah memancarkan air, masukkanlah ke dalam (kapal) itu sepasang-sepasang dari setiap jenis (binatang), juga keluargamu, kecuali orang yang lebih dahulu ditetapkan (akan ditimpa siksaan) di antara mereka. Janganlah engkau bicarakan dengan-Ku tentang orang-orang yang zalim. Sesungguhnya mereka itu akan ditenggelamkan."
  },
  {
    "ayat": 28,
    "arabic": "فَاِذَا اسْتَوَيْتَ اَنْتَ وَمَنْ مَّعَكَ عَلَى الْفُلْكِ فَقُلِ الْحَمْدُ لِلّٰهِ الَّذِيْ نَجّٰىنَا مِنَ الْقَوْمِ الظّٰلِمِيْنَ",
    "transliteration_en": "Fa izas tawaita ata wa mam ma'aka 'alal fulki faqulil hamdu lillaahil lazee najjaanaa minal qawmiz zalimeen",
    "transliteration_id": "Fa iżastawaita anta wa mam ma‘aka ‘alal-fulki fa qulil-ḥamdu lillāhil-lażī najjānā minal-qaumiẓ-ẓālimīn(a).",
    "translation_en": "And when you have boarded the ship, you and those with you, then say, 'Praise to Allah who has saved us from the wrongdoing people.'",
    "translation_id": "Apabila engkau dan orang yang bersamamu telah berada di atas kapal, ucapkanlah, ‘Segala puji bagi Allah yang telah menyelamatkan kami dari kaum yang zalim.’"
  },
  {
    "ayat": 29,
    "arabic": "وَقُلْ رَّبِّ اَنْزِلْنِيْ مُنْزَلًا مُّبٰرَكًا وَّاَنْتَ خَيْرُ الْمُنْزِلِيْنَ",
    "transliteration_en": "Wa qur Rabbi anzilnee munzalam mubaarakanw wa Anta khairul munzileen",
    "transliteration_id": "Wa qur rabbi anzilnī munzalam mubārakaw wa anta khairul-munzilīn(a).",
    "translation_en": "And say, 'My Lord, let me land at a blessed landing place, and You are the best to accommodate [us].' \"",
    "translation_id": "Berdoalah, ‘Wahai Tuhanku, tempatkanlah aku pada tempat yang diberkahi dan Engkau adalah sebaik-baik pemberi tempat.’”"
  },
  {
    "ayat": 30,
    "arabic": "اِنَّ فِيْ ذٰلِكَ لَاٰيٰتٍ وَّاِنْ كُنَّا لَمُبْتَلِيْنَ",
    "transliteration_en": "Inna fee zaalika la Aayaatinw wa in kunnaa lamubtaleen",
    "transliteration_id": "Inna fī żālika la'āyātiw wa in kunnā lamubtalīn(a).",
    "translation_en": "Indeed in that are signs, and indeed, We are ever testing [Our servants].",
    "translation_id": "Sesungguhnya pada (kejadian) itu benar-benar terdapat tanda-tanda (kebesaran Allah). Sesungguhnya Kami benar-benar menimpakan cobaan (kepada kaum Nuh itu)."
  },
  {
    "ayat": 31,
    "arabic": "ثُمَّ اَنْشَأْنَا مِنْۢ بَعْدِهِمْ قَرْنًا اٰخَرِيْنَ ۚ",
    "transliteration_en": "Summaa anshaana mim ba'dihim qarnan aakhareen",
    "transliteration_id": "Ṡumma ansya'nā mim ba‘dihim qarnan ākharīn(a).",
    "translation_en": "Then We produced after them a generation of others.",
    "translation_id": "Kemudian, Kami ciptakan setelah mereka umat yang lain (kaum ‘Ad)."
  },
  {
    "ayat": 32,
    "arabic": "فَاَرْسَلْنَا فِيْهِمْ رَسُوْلًا مِّنْهُمْ اَنِ اعْبُدُوا اللّٰهَ مَا لَكُمْ مِّنْ اِلٰهٍ غَيْرُهٗۗ اَفَلَا تَتَّقُوْنَ ࣖ",
    "transliteration_en": "Fa arsalnaa feehim Rasoolam minhum ani'budul laaha maa lakum min ilaahin ghairuhoo afalaa tattaqoon",
    "transliteration_id": "Fa arsalnā fīhim rasūlam minhum ani‘budullāha mā lakum min ilāhin gairuh(ū), afalā tattaqūn(a).",
    "translation_en": "And We sent among them a messenger from themselves, [saying], \"Worship Allah; you have no deity other than Him; then will you not fear Him?\"",
    "translation_id": "Lalu, Kami utus kepada mereka seorang rasul dari (kalangan) mereka sendiri. (Dia berkata,) “Sembahlah Allah, tidak ada Tuhan bagimu selain Dia. Apakah kamu tidak bertakwa?”"
  },
  {
    "ayat": 33,
    "arabic": "وَقَالَ الْمَلَاُ مِنْ قَوْمِهِ الَّذِيْنَ كَفَرُوْا وَكَذَّبُوْا بِلِقَاۤءِ الْاٰخِرَةِ وَاَتْرَفْنٰهُمْ فِى الْحَيٰوةِ الدُّنْيَاۙ مَا هٰذَآ اِلَّا بَشَرٌ مِّثْلُكُمْۙ يَأْكُلُ مِمَّا تَأْكُلُوْنَ مِنْهُ وَيَشْرَبُ مِمَّا تَشْرَبُوْنَ",
    "transliteration_en": "Wa qaalal mala-u min qawmihil lazeena kafaroo wa kazzaboo bi liqaaa'il Aakhirati wa atrafnaahum fil hayaatid dunyaa maa haazaaa illaa basharum mislukum yaakulu mimmaa taakuloona minhu wa yashrabu mimmaa tashraboon",
    "transliteration_id": "Wa qālal-mala'u min qaumihil-lażīna kafarū wa każżabū biliqā'il-ākhirati wa atrafnāhum fil-ḥayātid-dun-yā, mā hāżā illā basyarum miṡlukum, ya'kulu mimmā ta'kulūna minhu wa yasyrabu mimmā tasyrabūn(a).",
    "translation_en": "And the eminent among his people who disbelieved and denied the meeting of the Hereafter while We had given them luxury in the worldly life said, \"This is not but a man like yourselves. He eats of that from which you eat and drinks of what you drink.",
    "translation_id": "Para pemuka kaumnya yang kufur dan mendustakan pertemuan hari akhirat serta mereka yang telah Kami beri kemewahan dan kesenangan dalam kehidupan di dunia berkata, “(Orang) ini tidak lain hanyalah manusia seperti kamu. Dia makan apa yang kamu makan dan minum apa yang kamu minum."
  },
  {
    "ayat": 34,
    "arabic": "وَلَىِٕنْ اَطَعْتُمْ بَشَرًا مِّثْلَكُمْ اِنَّكُمْ اِذًا لَّخٰسِرُوْنَ ۙ",
    "transliteration_en": "Wa la'in at'atum basharam mislakum innakum izal lakhaasiroon",
    "transliteration_id": "Wa la'in aṭa‘tum basyaram miṡlakum innakum iżal lakhāsirūn(a).",
    "translation_en": "And if you should obey a man like yourselves, indeed, you would then be losers.",
    "translation_id": "Sungguh, jika menaati manusia yang seperti kamu, sesungguhnya kamu benar-benar akan merugi."
  },
  {
    "ayat": 35,
    "arabic": "اَيَعِدُكُمْ اَنَّكُمْ اِذَا مِتُّمْ وَكُنْتُمْ تُرَابًا وَّعِظَامًا اَنَّكُمْ مُّخْرَجُوْنَ ۖ",
    "transliteration_en": "A-Ya'idukum annakum izaa mittum wa kuntum turaabanw wa izaaman annakum mukhrajoon",
    "transliteration_id": "Aya‘idukum annakum iżā mittum wa kuntum turābaw wa ‘iẓāman annakum mukhrajūn(a).",
    "translation_en": "Does he promise you that when you have died and become dust and bones that you will be brought forth [once more]?",
    "translation_id": "Adakah dia menjanjikan kepadamu bahwa apabila telah mati serta menjadi tanah dan tulang belulang, kamu benar-benar akan dikeluarkan (dari kuburmu)?"
  },
  {
    "ayat": 36,
    "arabic": "۞ هَيْهَاتَ هَيْهَاتَ لِمَا تُوْعَدُوْنَ ۖ",
    "transliteration_en": "Haihaata haihaata limaa too'adoon",
    "transliteration_id": "Haihāta haihāta limā tū‘adūn(a).",
    "translation_en": "How far, how far, is that which you are promised.",
    "translation_id": "Jauh, jauh sekali apa yang diancamkan kepadamu itu (dari kebenaran)."
  },
  {
    "ayat": 37,
    "arabic": "اِنْ هِيَ اِلَّا حَيَاتُنَا الدُّنْيَا نَمُوْتُ وَنَحْيَا وَمَا نَحْنُ بِمَبْعُوْثِيْنَ ۖ",
    "transliteration_en": "In hiya illaa hayaatunad dunyaa namootu wa nahyaa wa maa nahnu bimab'ooseen",
    "transliteration_id": "In hiya illā ḥayātunad-dun-yā namūtu wa naḥyā wa mā naḥnu bimab‘ūṡīn(a).",
    "translation_en": "Life is not but our worldly life - we die and live, but we will not be resurrected.",
    "translation_id": "Ia (kehidupan itu) tidak lain hanyalah kehidupan kita di dunia ini. (Di sanalah) kita mati, hidup, dan tidak akan dibangkitkan (lagi)."
  },
  {
    "ayat": 38,
    "arabic": "اِنْ هُوَ اِلَّا رَجُلُ ِۨافْتَرٰى عَلَى اللّٰهِ كَذِبًا وَّمَا نَحْنُ لَهٗ بِمُؤْمِنِيْنَ",
    "transliteration_en": "In huwa illaa rajulunif taraa 'alal laahi kazibanw wa maa nahnuu lahoo bimu'mineen",
    "transliteration_id": "In huwa illā rajuluniftarā ‘alallāhi każibaw wa mā naḥnu lahū bimu'minīn(a).",
    "translation_en": "He is not but a man who has invented a lie about Allah, and we will not believe him.\"",
    "translation_id": "Dia (Hud) tidak lain hanyalah seorang laki-laki yang mengada-adakan kebohongan terhadap Allah dan kita tidak akan mempercayainya.”"
  },
  {
    "ayat": 39,
    "arabic": "قَالَ رَبِّ انْصُرْنِيْ بِمَا كَذَّبُوْنِ",
    "transliteration_en": "Qaala Rabbin surnee bimaa kazzaboon",
    "transliteration_id": "Qāla rabbinṣurnī bimā każżabūn(i).",
    "translation_en": "He said, \"My Lord, support me because they have denied me.\"",
    "translation_id": "Dia (Hud) berdoa, “Ya Tuhanku, tolonglah aku karena mereka telah mendustakanku.”"
  },
  {
    "ayat": 40,
    "arabic": "قَالَ عَمَّا قَلِيْلٍ لَّيُصْبِحُنَّ نٰدِمِيْنَ ۚ",
    "transliteration_en": "Qaala 'ammaa qaleelil la yusbihunna naadimeen",
    "transliteration_id": "Qāla ‘ammā qalīlil layuṣbiḥunna nādimīn(a).",
    "translation_en": "[Allah] said, \"After a little, they will surely become regretful.\"",
    "translation_id": "Dia (Allah) berfirman, “Tidak lama lagi mereka benar-benar akan menyesal.”"
  },
  {
    "ayat": 41,
    "arabic": "فَاَخَذَتْهُمُ الصَّيْحَةُ بِالْحَقِّ فَجَعَلْنٰهُمْ غُثَاۤءًۚ فَبُعْدًا لِّلْقَوْمِ الظّٰلِمِيْنَ",
    "transliteration_en": "Fa akhazat humus saihatu bilhaqqi faja'alnaahum ghusaaa'aa; fabu;dal lilqaw miz zaalimeen",
    "transliteration_id": "Fa akhażathumuṣ-ṣaiḥatu bil-ḥaqqi fa ja'alahum guṡā'ā(n), fa bu‘dal lil-qaumiẓ-ẓālimīn(a).",
    "translation_en": "So the shriek seized them in truth, and We made them as [plant] stubble. Then away with the wrongdoing people.",
    "translation_id": "Lalu, mereka dimusnahkan oleh suara yang menggelegar dengan sebenar-benarnya dan Kami jadikan mereka (seperti) sampah yang dihanyutkan banjir. Maka, kebinasaanlah bagi kaum yang zalim."
  },
  {
    "ayat": 42,
    "arabic": "ثُمَّ اَنْشَأْنَا مِنْۢ بَعْدِهِمْ قُرُوْنًا اٰخَرِيْنَ ۗ",
    "transliteration_en": "Summa anshaanaa mim ba'dihim quroonan aakhareen",
    "transliteration_id": "Ṡumma ansya'nā mim ba‘dihim qurūnan ākharīn(a).",
    "translation_en": "Then We produced after them other generations.",
    "translation_id": "Kemudian, Kami ciptakan setelah mereka umat-umat yang lain."
  },
  {
    "ayat": 43,
    "arabic": "مَا تَسْبِقُ مِنْ اُمَّةٍ اَجَلَهَا وَمَا يَسْتَأْخِرُوْنَ ۗ",
    "transliteration_en": "Maa tasbiqu min ummatin ajalahaa wa maa yastaakhiroon",
    "transliteration_id": "Mā tasbiqu min ummatin ajalahā wa mā yasta'khirūn(a).",
    "translation_en": "No nation will precede its time [of termination], nor will they remain [thereafter].",
    "translation_id": "Tidak ada satu umat pun yang dapat menyegerakan ajalnya dan tidak (pula) menangguhkan(-nya)."
  },
  {
    "ayat": 44,
    "arabic": "ثُمَّ اَرْسَلْنَا رُسُلَنَا تَتْرَاۗ  كُلَّمَا جَاۤءَ اُمَّةً رَّسُوْلُهَا كَذَّبُوْهُ فَاَتْبَعْنَا بَعْضَهُمْ بَعْضًا وَّجَعَلْنٰهُمْ اَحَادِيْثَۚ فَبُعْدًا لِّقَوْمٍ لَّا يُؤْمِنُوْنَ",
    "transliteration_en": "Summa arsalnaa Rusulanaa tatraa kulla maa jaaa'a ummatar Rasooluhaa kazzabooh; fa atba'naa ba'dahum ba'danw wa ja'alnaahum ahaadees; fabu'dal liqawmil laa yu'minoon",
    "transliteration_id": "Ṡumma arsalnā rusulanā tatrā, kullamā jā'a ummatar rasūluhā każżabūhu fa atba‘nā ba‘ḍahum ba‘ḍaw wa ja‘alnāhum aḥādīṡ(a), fa bu‘dal liqaumil lā yu'minūn(a).",
    "translation_en": "Then We sent Our messengers in succession. Every time there came to a nation its messenger, they denied him, so We made them follow one another [to destruction], and We made them narrations. So away with a people who do not believe.",
    "translation_id": "Kemudian, Kami utus rasul-rasul Kami secara berturut-turut. Setiap kali seorang rasul datang kepada suatu umat, mereka mendustakannya. Maka, Kami iringkan (kebinasaan) sebagian mereka dengan sebagian yang lain. Kami jadikan (pula) mereka bahan pembicaraan. Maka, kebinasaanlah bagi kaum yang tidak beriman."
  },
  {
    "ayat": 45,
    "arabic": "ثُمَّ اَرْسَلْنَا مُوْسٰى وَاَخَاهُ هٰرُوْنَ ەۙ بِاٰيٰتِنَا وَسُلْطٰنٍ مُّبِيْنٍۙ",
    "transliteration_en": "Summa arsalnaa Moosaa wa akhaahu Haaroona bi Aayaatinaa wa sultaanim mubeen",
    "transliteration_id": "Ṡumma arsalnā mūsā wa akhāhu hārūn(a), bi'āyātinā wa sulṭānim mubīn(in).",
    "translation_en": "Then We sent Moses and his brother Aaron with Our signs and a clear authority",
    "translation_id": "Kemudian, Kami utus Musa dan saudaranya, Harun, dengan membawa tanda-tanda (kebesaran) Kami dan bukti yang nyata"
  },
  {
    "ayat": 46,
    "arabic": "اِلٰى فِرْعَوْنَ وَمَلَا۟ىِٕهٖ فَاسْتَكْبَرُوْا وَكَانُوْا قَوْمًا عَالِيْنَ ۚ",
    "transliteration_en": "Ilaa Fir'awna wa mala'ihee fastakbaroo wa kaanoo qawman 'aaleem",
    "transliteration_id": "Ilā fir‘auna wa mala'ihī fastakbarū wa kānū qauman ‘ālīn(a).",
    "translation_en": "To Pharaoh and his establishment, but they were arrogant and were a haughty people.",
    "translation_id": "kepada Fir‘aun dan para pemuka kaumnya. Akan tetapi, mereka angkuh dan sejak dahulu mereka adalah kaum yang sombong."
  },
  {
    "ayat": 47,
    "arabic": "فَقَالُوْٓا اَنُؤْمِنُ لِبَشَرَيْنِ مِثْلِنَا وَقَوْمُهُمَا لَنَا عٰبِدُوْنَ ۚ",
    "transliteration_en": "Faqaaloo annu'minu libasharaini mislinaa wa qawmuhumaa lanaa 'aabidoon",
    "transliteration_id": "Fa qālū anu'minu libasyaraini miṡlinā wa qaumuhumā lanā ‘ābidūn(a).",
    "translation_en": "They said, \"Should we believe two men like ourselves while their people are for us in servitude?\"",
    "translation_id": "Mereka berkata, “Apakah (pantas) kita percaya kepada dua orang manusia seperti kita, padahal kaum mereka (Bani Israil) adalah orang-orang yang mengabdikan diri kepada kita?”"
  },
  {
    "ayat": 48,
    "arabic": "فَكَذَّبُوْهُمَا فَكَانُوْا مِنَ الْمُهْلَكِيْنَ",
    "transliteration_en": "Fakazzaboohumaa fakaanoo minal mmuhlakeen",
    "transliteration_id": "Fa każżabūhumā fa kānū minal-muhlakīn(a).",
    "translation_en": "So they denied them and were of those destroyed.",
    "translation_id": "Maka, mereka mendustakan keduanya. Oleh karena itu, mereka termasuk orang-orang yang dibinasakan."
  },
  {
    "ayat": 49,
    "arabic": "وَلَقَدْ اٰتَيْنَا مُوْسَى الْكِتٰبَ لَعَلَّهُمْ يَهْتَدُوْنَ",
    "transliteration_en": "Wa laqad aatainaa Moosal Kitaaba la'allahum yahtadoon",
    "transliteration_id": "Wa laqad ātainā mūsal-kitāba la‘allahum yahtadūn(a).",
    "translation_en": "And We certainly gave Moses the Scripture that perhaps they would be guided.",
    "translation_id": "Sungguh Kami benar-benar telah menganugerahkan Kitab (Taurat) kepada Musa agar mereka (Bani Israil) mendapat petunjuk."
  },
  {
    "ayat": 50,
    "arabic": "وَجَعَلْنَا ابْنَ مَرْيَمَ وَاُمَّهٗٓ اٰيَةً وَّاٰوَيْنٰهُمَآ اِلٰى رَبْوَةٍ ذَاتِ قَرَارٍ وَّمَعِيْنٍ ࣖ",
    "transliteration_en": "Wa ja'alnab na Maryama wa ummahooo aayatannw wa aawainaahumaaa ilaa rabwatin zaati qaraarinw wa ma'een",
    "transliteration_id": "Wa ja‘alnabna maryama wa ummahū āyataw wa āwaināhumā ilā rabwatin żāti qarāriw wa ma‘īn(in).",
    "translation_en": "And We made the son of Mary and his mother a sign and sheltered them within a high ground having level [areas] and flowing water.",
    "translation_id": "Telah Kami jadikan (Isa) putra Maryam bersama ibunya sebagai tanda (kebesaran Kami) dan Kami lindungi mereka di sebuah dataran tinggi yang tenang untuk ditempati dengan air yang mengalir."
  }
]