[
  {
    "ayat": 51,
    "arabic": "۞ وَمَا كَانَ لِبَشَرٍ اَنْ يُّكَلِّمَهُ اللّٰهُ اِلَّا وَحْيًا اَوْ مِنْ وَّرَاۤئِ حِجَابٍ اَوْ يُرْسِلَ رَسُوْلًا فَيُوْحِيَ بِاِذْنِهٖ مَا يَشَاۤءُ ۗاِنَّهٗ عَلِيٌّ حَكِيْمٌ",
    "transliteration_en": "Wa maa kaana libasharin any yukallimahul laahu illaa wahyan aw minw waraaa'i hijaabin aw yursila Rasoolan fa yoohiya bi iznuhee maa yashaaa'; innahoo 'Aliyyun Hakeem",
    "transliteration_id": "Wa mā kāna libasyarin ay yukallimahullāhu illā waḥyan au miw warā'i ḥijābin au yursila rasūlan fa yūḥiya bi'iżnihī mā yasyā'(u), innahū ‘aliyyun ḥakīm(un).",
    "translation_en": "And it is not for any human being that Allah should speak to him except by revelation or from behind a partition or that He sends a messenger to reveal, by His permission, what He wills. Indeed, He is Most High and Wise.",
    "translation_id": "Tidak mungkin bagi seorang manusia untuk diajak berbicara langsung oleh Allah, kecuali dengan (perantaraan) wahyu, dari belakang tabir, atau dengan mengirim utusan (malaikat) lalu mewahyukan kepadanya dengan izin-Nya apa yang Dia kehendaki. Sesungguhnya Dia Maha Tinggi lagi Maha Bijaksana."
  },
  {
    "ayat": 52,
    "arabic": "وَكَذٰلِكَ اَوْحَيْنَآ اِلَيْكَ رُوْحًا مِّنْ اَمْرِنَا ۗمَا كُنْتَ تَدْرِيْ مَا الْكِتٰبُ وَلَا الْاِيْمَانُ وَلٰكِنْ جَعَلْنٰهُ نُوْرًا نَّهْدِيْ بِهٖ مَنْ نَّشَاۤءُ مِنْ عِبَادِنَا ۗوَاِنَّكَ لَتَهْدِيْٓ اِلٰى صِرَاطٍ مُّسْتَقِيْمٍۙ",
    "transliteration_en": "Wa kazaalika awhainaaa ilaika rooham min amrinaa; maa kunta tadree mal Kitaabu wa lal eemaanu wa laakin ja'alnaahu nooran nahdee bihee man nashaaa'u min 'ibaadinaa; wa innaka latahdeee ilaaa Siraatim Mustaqeem",
    "transliteration_id": "Wa każālika auḥainā ilaika rūḥam min amrinā, mā kunta tadrī mal-kitābu wa lal-īmānu wa lākin ja‘alnāhu nūran nahdī bihī man nasyā'u min ‘ibādinā, wa innaka latahdī ilā ṣirāṭim mustaqīm(in).",
    "translation_en": "And thus We have revealed to you an inspiration of Our command. You did not know what is the Book or [what is] faith, but We have made it a light by which We guide whom We will of Our servants. And indeed, [O Muhammad], you guide to a straight path -",
    "translation_id": "Demikianlah Kami mewahyukan kepadamu (Nabi Muhammad) rūh (Al-Qur’an) dengan perintah Kami. Sebelumnya engkau tidaklah mengetahui apakah Kitab (Al-Qur’an) dan apakah iman itu, tetapi Kami menjadikannya (Al-Qur’an) cahaya yang dengannya Kami memberi petunjuk siapa yang Kami kehendaki di antara hamba-hamba Kami. Sesungguhnya engkau benar-benar membimbing (manusia) ke jalan yang lurus,"
  },
  {
    "ayat": 53,
    "arabic": "صِرَاطِ اللّٰهِ الَّذِيْ لَهٗ مَا فِى السَّمٰوٰتِ وَمَا فِى الْاَرْضِۗ  اَلَآ اِلَى اللّٰهِ تَصِيْرُ الْاُمُوْرُ ࣖ",
    "transliteration_en": "Siraatil laahil lazee lahoo maa fis samaawaati wa maa fil ard; alaaa ilal laahi taseerul umoor",
    "transliteration_id": "Ṣirāṭillāhil-lażī lahū mā fis-samāwāti wa mā fil-arḍ(i), alā ilallāhi taṣīrul-umūr(u).",
    "translation_en": "The path of Allah, to whom belongs whatever is in the heavens and whatever is on the earth. Unquestionably, to Allah do [all] matters evolve.",
    "translation_id": "(yaitu) jalan Allah yang milik-Nyalah apa yang ada di langit dan apa yang ada di bumi. Ketahuilah (bahwa) kepada Allahlah segala urusan kembali!"
  }
]