[
  {
    "ayat": 1,
    "arabic": "يٰٓاَيُّهَا النَّاسُ اتَّقُوْا رَبَّكُمْۚ اِنَّ زَلْزَلَةَ السَّاعَةِ شَيْءٌ عَظِيْمٌ",
    "transliteration_en": "Yaaa ayyuhan naasuttaqoo Rabbakum; inna zalzalatas Saa'ati shai'un 'azeem",
    "transliteration_id": "Yā ayyuhan-nāsuttaqū rabbakum, inna zalzalatas-sā‘ati syai'un ‘aẓīm(un).",
    "translation_en": "O mankind, fear your Lord. Indeed, the convulsion of the [final] Hour is a terrible thing.",
    "translation_id": "Wahai manusia, bertakwalah kepada Tuhanmu. Sesungguhnya guncangan hari Kiamat itu adalah sesuatu yang sangat besar."
  },
  {
    "ayat": 2,
    "arabic": "يَوْمَ تَرَوْنَهَا تَذْهَلُ كُلُّ مُرْضِعَةٍ عَمَّآ اَرْضَعَتْ وَتَضَعُ كُلُّ ذَاتِ حَمْلٍ حَمْلَهَا وَتَرَى النَّاسَ سُكٰرٰى وَمَا هُمْ بِسُكٰرٰى وَلٰكِنَّ عَذَابَ اللّٰهِ شَدِيْدٌ",
    "transliteration_en": "Yawma tarawnahaa tazhalu kullu murdi'atin 'ammaaa arda'at wa tada'u kullu zaati hamlin hamlahaa wa tarannaasa sukaaraa wa maa hum bisukaaraa wa lakinaa 'azaabal laahi shadeed",
    "transliteration_id": "Yauma taraunahā tażhalu kullu murḍi‘atin ‘ammā arḍa‘at wa taḍa‘u kullu żāti ḥamlin ḥamlahā wa taran-nāsa sukārā wa mā hum bisukārā wa lākinna ‘ażāballāhi syadīd(un).",
    "translation_en": "On the Day you see it every nursing mother will be distracted from that [child] she was nursing, and every pregnant woman will abort her pregnancy, and you will see the people [appearing] intoxicated while they are not intoxicated; but the punishment of Allah is severe.",
    "translation_id": "Pada hari kamu melihatnya (guncangan itu), semua perempuan yang menyusui melupakan anak yang disusuinya, setiap perempuan yang hamil akan keguguran kandungannya dan kamu melihat manusia mabuk, padahal sebenarnya mereka tidak mabuk. Akan tetapi, azab Allah itu sangat keras."
  },
  {
    "ayat": 3,
    "arabic": "وَمِنَ النَّاسِ مَنْ يُّجَادِلُ فِى اللّٰهِ بِغَيْرِ عِلْمٍ وَّيَتَّبِعُ كُلَّ شَيْطٰنٍ مَّرِيْدٍۙ",
    "transliteration_en": "Wa minan naasi mai yujaadilu fil laahi bighairi 'ilminw wa yattabi'u kullaa shaitaanim mareed",
    "transliteration_id": "Wa minan-nāsi may yujādilu fillāhi bigairi ‘ilmiw wa yattabi‘u kulla syaiṭānim marīd(in).",
    "translation_en": "And of the people is he who disputes about Allah without knowledge and follows every rebellious devil.",
    "translation_id": "Di antara manusia ada yang berdebat tentang Allah tanpa ilmu dan (hanya) mengikuti setiap (langkah dan tipu daya) setan yang sangat jahat."
  },
  {
    "ayat": 4,
    "arabic": "كُتِبَ عَلَيْهِ اَنَّهٗ مَنْ تَوَلَّاهُ فَاَنَّهٗ يُضِلُّهٗ وَيَهْدِيْهِ اِلٰى عَذَابِ السَّعِيْرِ",
    "transliteration_en": "Kutiba 'alaihi annahoo man tawallaahu fa annahoo yudil lauhoo wa yahdeehi ilaa 'azaabis sa'eer",
    "transliteration_id": "Kutiba ‘alaihi annahū man tawallāhu fa annahū yuḍilluhū wa yahdīhi ilā ‘ażābis-sa‘īr(i).",
    "translation_en": "It has been decreed for every devil that whoever turns to him - he will misguide him and will lead him to the punishment of the Blaze.",
    "translation_id": "Telah ditetapkan atasnya (setan) bahwa siapa yang berteman dengannya akan disesatkan dan dibawanya ke azab (neraka) yang menyala-nyala."
  },
  {
    "ayat": 5,
    "arabic": "يٰٓاَيُّهَا النَّاسُ اِنْ كُنْتُمْ فِيْ رَيْبٍ مِّنَ الْبَعْثِ فَاِنَّا خَلَقْنٰكُمْ مِّنْ تُرَابٍ ثُمَّ مِنْ نُّطْفَةٍ ثُمَّ مِنْ عَلَقَةٍ ثُمَّ مِنْ مُّضْغَةٍ مُّخَلَّقَةٍ وَّغَيْرِ مُخَلَّقَةٍ لِّنُبَيِّنَ لَكُمْۗ وَنُقِرُّ فِى الْاَرْحَامِ مَا نَشَاۤءُ اِلٰٓى اَجَلٍ مُّسَمًّى ثُمَّ نُخْرِجُكُمْ طِفْلًا ثُمَّ لِتَبْلُغُوْٓا اَشُدَّكُمْۚ وَمِنْكُمْ مَّنْ يُّتَوَفّٰى وَمِنْكُمْ مَّنْ يُّرَدُّ اِلٰٓى اَرْذَلِ الْعُمُرِ لِكَيْلَا يَعْلَمَ مِنْۢ بَعْدِ عِلْمٍ شَيْـًٔاۗ وَتَرَى الْاَرْضَ هَامِدَةً فَاِذَآ اَنْزَلْنَا عَلَيْهَا الْمَاۤءَ اهْتَزَّتْ وَرَبَتْ وَاَنْۢبَتَتْ مِنْ كُلِّ زَوْجٍۢ بَهِيْجٍ",
    "transliteration_en": "Yaaa ayyuhan naasu in kuntum fee raibim minal ba'si fa innaa khalaqnaakum min turaabin summa min nutfatin summaa min 'alaqatin summa mim mud ghatim mukhal laqatinw wa ghairi mukhalla qatil linubaiyina lakum; wa nuqirru fil arhaami maa nashaaa'u ilaaa ajalim musam man summa nukhrijukum tiflan summa litablughooo ashud dakum wa minkum mai yutawaffa wa minkum mai yuraddu ilaaa arzalil 'umuri likailaa ya'lama mim ba'di 'ilmin shai'aa; wa taral arda haamidatan fa izaaa anzalnaa 'alaihal maaa'ah tazzat wa rabat wa ambatat min kulli zawjim baheej",
    "transliteration_id": "Yā ayyuhan-nāsu in kuntum fī raibim minal-ba‘ṡi fa innā khalaqnākum min turābin ṡumma min nuṭfatin ṡumma min ‘alaqatin ṡumma mim muḍgatim mukhallaqatiw wa gairi mukhallaqatil linubayyina lakum, wa nuqirru fil-arḥāmi mā nasyā'u ilā ajalim musamman ṡumma nukhrijukum ṭiflan ṡumma litablugū asyuddakum, wa minkum may yutawaffā wa minkum may yuraddu ilā arżalil-‘umuri likailā ya‘lama ba‘da  ‘ilmin syai'ā(n), wa taral-arḍa hāmidatan fa iżā anzalnā ‘alaihal-mā'ahtazzat wa rabat wa ambatat min kulli zaujim bahīj(in).",
    "translation_en": "O People, if you should be in doubt about the Resurrection, then [consider that] indeed, We created you from dust, then from a sperm-drop, then from a clinging clot, and then from a lump of flesh, formed and unformed - that We may show you. And We settle in the wombs whom We will for a specified term, then We bring you out as a child, and then [We develop you] that you may reach your [time of] maturity. And among you is he who is taken in [early] death, and among you is he who is returned to the most decrepit [old] age so that he knows, after [once having] knowledge, nothing. And you see the earth barren, but when We send down upon it rain, it quivers and swells and grows [something] of every beautiful kind.",
    "translation_id": "Wahai manusia, jika kamu meragukan (hari) kebangkitan, sesungguhnya Kami telah menciptakan (orang tua) kamu (Nabi Adam) dari tanah, kemudian (kamu sebagai keturunannya Kami ciptakan) dari setetes mani, lalu segumpal darah, lalu segumpal daging, baik kejadiannya sempurna maupun tidak sempurna, agar Kami jelaskan kepadamu (tanda kekuasaan Kami dalam penciptaan). Kami tetapkan dalam rahim apa yang Kami kehendaki sampai waktu yang sudah ditentukan. Kemudian, Kami mengeluarkanmu sebagai bayi, lalu (Kami memeliharamu) hingga kamu mencapai usia dewasa. Di antara kamu ada yang diwafatkan dan (ada pula) yang dikembalikan ke umur yang sangat tua sehingga dia tidak mengetahui lagi sesuatu yang pernah diketahuinya (pikun). Kamu lihat bumi itu kering. Jika Kami turunkan air (hujan) di atasnya, ia pun hidup dan menjadi subur serta menumbuhkan berbagai jenis (tetumbuhan) yang indah."
  },
  {
    "ayat": 6,
    "arabic": "ذٰلِكَ بِاَنَّ اللّٰهَ هُوَ الْحَقُّ وَاَنَّهٗ يُحْيِ الْمَوْتٰى وَاَنَّهٗ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ ۙ",
    "transliteration_en": "Zaalika bi annal laaha Huwal haqqu wa annahoo yuhyil mawtaa wa annahoo 'alaakulli shai'in Qadeer",
    "transliteration_id": "Żālika bi'annallāha huwal-ḥaqqu wa annahū yuḥyil-mautā wa annahū ‘alā kulli syai'in qadīr(un).",
    "translation_en": "That is because Allah is the Truth and because He gives life to the dead and because He is over all things competent",
    "translation_id": "Demikianlah (penciptaan manusia) itu karena sesungguhnya Allah, Dialah yang Maha Benar dan sesungguhnya Dia menghidupkan orang-orang yang mati dan sesungguhnya Dia Maha Kuasa atas segala sesuatu."
  },
  {
    "ayat": 7,
    "arabic": "وَّاَنَّ السَّاعَةَ اٰتِيَةٌ لَّا رَيْبَ فِيْهَاۙ وَاَنَّ اللّٰهَ يَبْعَثُ مَنْ فِى الْقُبُوْرِ",
    "transliteration_en": "Wa annas Saa'ata aatiya tul laa raiba feeha wa annal laaha yab'asuman fil quboor",
    "transliteration_id": "Wa annas-sā‘ata ātiyatul lā raiba fīhā, wa annallāha yab‘aṡu man fil-qubūr(i).",
    "translation_en": "And [that they may know] that the Hour is coming - no doubt about it - and that Allah will resurrect those in the graves.",
    "translation_id": "Sesungguhnya kiamat itu pasti datang, tidak ada keraguan padanya dan sesungguhnya Allah akan membangkitkan siapa pun yang di dalam kubur."
  },
  {
    "ayat": 8,
    "arabic": "وَمِنَ النَّاسِ مَنْ يُّجَادِلُ فِى اللّٰهِ بِغَيْرِ عِلْمٍ وَّلَا هُدًى وَّلَا كِتٰبٍ مُّنِيْرٍ ۙ",
    "transliteration_en": "Wa minan naasi mai yujaadilu fil laahi bighairi 'ilminw wa laa hudanw wa laa Kitaabim Muneer",
    "transliteration_id": "Wa minan-nāsi may yujādilu fillāhi bigairi ‘ilmiw wa lā hudaw wa lā kitābim munīr(in).",
    "translation_en": "And of the people is he who disputes about Allah without knowledge or guidance or an enlightening book [from Him],",
    "translation_id": "Di antara manusia ada yang berdebat tentang Allah tanpa ilmu, tanpa petunjuk, dan tanpa kitab (wahyu) yang memberi penerangan."
  },
  {
    "ayat": 9,
    "arabic": "ثَانِيَ عِطْفِهٖ لِيُضِلَّ عَنْ سَبِيْلِ اللّٰهِ ۗ لَهٗ فِى الدُّنْيَا خِزْيٌ وَّنُذِيْقُهٗ يَوْمَ الْقِيٰمَةِ عَذَابَ الْحَرِيْقِ",
    "transliteration_en": "Saaniya 'itfihee liyudilla 'an sabeelil laahi lahoo fiddun yaa khizyunw wa nuzeequhoo Yawmal Qiyaamati 'azaabal lhareeq",
    "transliteration_id": "Ṡāniya ‘iṭfihī liyuḍilla ‘an sabīlillāh(i), lahū fid-dun-yā khizyuw wa nużīquhū yaumal-qiyāmati ‘ażābal-ḥarīq(i).",
    "translation_en": "Twisting his neck [in arrogance] to mislead [people] from the way of Allah. For him in the world is disgrace, and We will make him taste on the Day of Resurrection the punishment of the Burning Fire [while it is said],",
    "translation_id": "Sambil memalingkan lehernya (dengan congkak) untuk menyesatkan manusia dari jalan Allah. Bagi dialah kehinaan di dunia dan pada hari Kiamat Kami mencicipkan kepadanya azab (neraka) yang membakar."
  },
  {
    "ayat": 10,
    "arabic": "ذٰلِكَ بِمَا قَدَّمَتْ يَدٰكَ وَاَنَّ اللّٰهَ لَيْسَ بِظَلَّامٍ لِّلْعَبِيْدِ ࣖ",
    "transliteration_en": "Zaalika bimaa qaddamat yadaaka wa annal laaha laisa bizallaamil lil'abeed",
    "transliteration_id": "Żālika bimā qaddamat yadāka wa annallāha laisa biẓallāmil lil-‘abīd(i).",
    "translation_en": "\"That is for what your hands have put forth and because Allah is not ever unjust to [His] servants.\"",
    "translation_id": "(Akan dikatakan kepadanya,) “Hal itu disebabkan apa yang dahulu kamu lakukan dan sesungguhnya Allah sekali-kali tidak menzalimi hamba-hamba-Nya.”"
  },
  {
    "ayat": 11,
    "arabic": "وَمِنَ النَّاسِ مَنْ يَّعْبُدُ اللّٰهَ عَلٰى حَرْفٍۚ فَاِنْ اَصَابَهٗ خَيْرُ ِۨاطْمَئَنَّ بِهٖۚ وَاِنْ اَصَابَتْهُ فِتْنَةُ ِۨانْقَلَبَ عَلٰى وَجْهِهٖۗ خَسِرَ الدُّنْيَا وَالْاٰخِرَةَۗ ذٰلِكَ هُوَ الْخُسْرَانُ الْمُبِيْنُ",
    "transliteration_en": "Wa minan naasi mai ya'budul laaha 'alaa harfin fa in asaabahoo khairunit maanna bihee wa in asaabat hu fitnatunin qalaba 'alaa wajhihee khasirad dunyaa wal aakhirah; zaalika huwal khusraanul mubeen",
    "transliteration_id": "Wa minan-nāsi may ya‘budullāha ‘alā ḥarf(in), fa in aṣābahū khairuniṭma'anna  bih(ī), wa in aṣābathu fitnatuninqalaba ‘alā wajhih(ī), khasirad-dun-yā wal-ākhirah(ta), żālika huwal-khusrānul-mubīn(u).",
    "translation_en": "And of the people is he who worships Allah on an edge. If he is touched by good, he is reassured by it; but if he is struck by trial, he turns on his face [to the other direction]. He has lost [this] world and the Hereafter. That is what is the manifest loss.",
    "translation_id": "Di antara manusia ada yang menyembah Allah hanya di tepi (tidak dengan penuh keyakinan). Jika memperoleh kebaikan, dia pun tenang. Akan tetapi, jika ditimpa suatu cobaan, dia berbalik ke belakang (kembali kufur). Dia merugi di dunia dan akhirat. Itulah kerugian yang nyata."
  },
  {
    "ayat": 12,
    "arabic": "يَدْعُوْا مِنْ دُوْنِ اللّٰهِ مَا لَا يَضُرُّهٗ وَمَا لَا يَنْفَعُهٗۗ ذٰلِكَ هُوَ الضَّلٰلُ الْبَعِيْدُ ۚ",
    "transliteration_en": "Yad'oo min doonil laahi maa laa yadurruhoo wa maa laa yanfa'uh' zaalika huwad dalaalul ba'ed",
    "transliteration_id": "Yad‘ū min dūnillāhi mā lā yaḍurruhū wa mā lā yanfa‘uh(ū), żālika huwaḍ-ḍalālul-ba‘īd(u).",
    "translation_en": "He invokes instead of Allah that which neither harms him nor benefits him. That is what is the extreme error.",
    "translation_id": "Dia menyeru sesuatu selain Allah yang tidak dapat mendatangkan mudarat dan tidak (pula) memberikan manfaat kepadanya. Itulah kesesatan yang jauh."
  },
  {
    "ayat": 13,
    "arabic": "يَدْعُوْا لَمَنْ ضَرُّهٗٓ اَقْرَبُ مِنْ نَّفْعِهٖۗ  لَبِئْسَ الْمَوْلٰى وَلَبِئْسَ الْعَشِيْرُ",
    "transliteration_en": "Yad'oo laman darruhooo aqrabu min naf'ih; labi'salmawlaa wa labi'sal 'asheer",
    "transliteration_id": "Yad‘ū laman ḍarruhū aqrabu min naf‘ih(ī), labi'sal-maulā wa labi'sal-‘asyīr(u).",
    "translation_en": "He invokes one whose harm is closer than his benefit - how wretched the protector and how wretched the associate.",
    "translation_id": "Dia menyeru kepada sesuatu yang mudaratnya benar-benar lebih dekat daripada manfaatnya. Sungguh, itu seburuk-buruk penolong dan sejahat-jahat kawan."
  },
  {
    "ayat": 14,
    "arabic": "اِنَّ اللّٰهَ يُدْخِلُ الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ جَنّٰتٍ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُۗ اِنَّ اللّٰهَ يَفْعَلُ مَا يُرِيْدُ",
    "transliteration_en": "Innal laaha yudkhilul laeena aamanoo wa 'amilus saalihaati jannaatin tajree min tahtihal anhaar; innal laaha yaf'alu maa yureed",
    "transliteration_id": "Innallāha yudkhilul-lażīna āmanū wa ‘amiluṣ-ṣāliḥāti jannātin tajrī min taḥtihal-anhār(u), innallāha yaf‘alu mā yurīd(u).",
    "translation_en": "Indeed, Allah will admit those who believe and do righteous deeds to gardens beneath which rivers flow. Indeed, Allah does what He intends.",
    "translation_id": "Sesungguhnya Allah akan memasukkan orang-orang yang beriman dan beramal saleh ke dalam surga-surga yang mengalir di bawahnya sungai-sungai. Sesungguhnya Allah melakukan apa yang Dia kehendaki."
  },
  {
    "ayat": 15,
    "arabic": "مَنْ كَانَ يَظُنُّ اَنْ لَّنْ يَّنْصُرَهُ اللّٰهُ فِى الدُّنْيَا وَالْاٰخِرَةِ فَلْيَمْدُدْ بِسَبَبٍ اِلَى السَّمَاۤءِ ثُمَّ لْيَقْطَعْ فَلْيَنْظُرْ هَلْ يُذْهِبَنَّ كَيْدُهٗ مَا يَغِيْظُ",
    "transliteration_en": "Man kaana yazunnu allai yansurahul laahu fid dunyaa wal aakhirati fal yamdud bisababin ilas samaaa'i summal yaqta' falyanzur hal yuzhibanna kaiduhoo maa yagheez",
    "transliteration_id": "Man kāna yaẓunnu allay yanṣurahullāhu fid-dun-yā wal-ākhirati falyamdud bisababin ilas-samā'i ṡummalyaqṭa‘ falyanẓur hal yużhibanna kaiduhū mā yagīẓ(u).",
    "translation_en": "Whoever should think that Allah will not support [Prophet Muhammad] in this world and the Hereafter - let him extend a rope to the ceiling, then cut off [his breath], and let him see: will his effort remove that which enrages [him]?",
    "translation_id": "Siapa yang menyangka bahwa Allah tidak akan menolongnya (Nabi Muhammad) di dunia dan di akhirat hendaklah merentangkan tali ke langit-langit (rumahnya untuk mencekik lehernya), lalu memutuskan tali tersebut. Kemudian, hendaklah dia memperhatikan apakah tipu dayanya itu dapat melenyapkan apa yang menyakitkan (hatinya)?"
  },
  {
    "ayat": 16,
    "arabic": "وَكَذٰلِكَ اَنْزَلْنٰهُ اٰيٰتٍۢ بَيِّنٰتٍۙ وَّاَنَّ اللّٰهَ يَهْدِيْ مَنْ يُّرِيْدُ",
    "transliteration_en": "Wa kazaalika anzalnaahu aayaatim baiyinaatinw wa annal laaha yahdee mai yureed",
    "transliteration_id": "Wa każālika anzalnāhu āyātim bayyināt(in), wa annallāha yahdī may yurīd(u).",
    "translation_en": "And thus have We sent the Qur'an down as verses of clear evidence and because Allah guides whom He intends.",
    "translation_id": "Demikianlah Kami telah menurunkannya (Al-Qur’an) sebagai ayat-ayat yang jelas dan sesungguhnya Allah memberikan petunjuk kepada siapa yang Dia kehendaki."
  },
  {
    "ayat": 17,
    "arabic": "اِنَّ الَّذِيْنَ اٰمَنُوْا وَالَّذِيْنَ هَادُوْا وَالصَّابِـِٕيْنَ وَالنَّصٰرٰى وَالْمَجُوْسَ وَالَّذِيْنَ اَشْرَكُوْٓا ۖاِنَّ اللّٰهَ يَفْصِلُ بَيْنَهُمْ يَوْمَ الْقِيٰمَةِۗ اِنَّ اللّٰهَ عَلٰى كُلِّ شَيْءٍ شَهِيْدٌ",
    "transliteration_en": "Innal lazeena aamanoo wallazeena haadoo was saabi'eena wan nasaaraa wal Majoosa wallazeena ashrakooo innal laaha yafsilu bainahum yawmal qiyaamah; innal laaha 'alaa kulli shai'in shaheed",
    "transliteration_id": "Innal-lażīna āmanū wal-lażīna hādū waṣ-ṣābi'īna wan-naṣārā wal-majūsa wal-lażīna asyrakū, innallāha yafṣilu bainahum yaumal-qiyāmah(ti), innallāha ‘alā kulli syai'in syahīd(un).",
    "translation_en": "Indeed, those who have believed and those who were Jews and the Sabeans and the Christians and the Magians and those who associated with Allah - Allah will judge between them on the Day of Resurrection. Indeed Allah is, over all things, Witness.",
    "translation_id": "Sesungguhnya orang-orang yang beriman, orang-orang Yahudi, Sabiin, Nasrani, Majusi, dan orang-orang yang menyekutukan Allah akan Allah berikan keputusan di antara mereka pada hari Kiamat. Sesungguhnya Allah menjadi saksi atas segala sesuatu."
  },
  {
    "ayat": 18,
    "arabic": "اَلَمْ تَرَ اَنَّ اللّٰهَ يَسْجُدُ لَهٗ مَنْ فِى السَّمٰوٰتِ وَمَنْ فِى الْاَرْضِ وَالشَّمْسُ وَالْقَمَرُ وَالنُّجُوْمُ وَالْجِبَالُ وَالشَّجَرُ وَالدَّوَاۤبُّ وَكَثِيْرٌ مِّنَ النَّاسِۗ وَكَثِيْرٌ حَقَّ عَلَيْهِ الْعَذَابُۗ وَمَنْ يُّهِنِ اللّٰهُ فَمَا لَهٗ مِنْ مُّكْرِمٍۗ اِنَّ اللّٰهَ يَفْعَلُ مَا يَشَاۤءُ ۩ۗ",
    "transliteration_en": "Alam tara annal laaha yasjudu lahoo man fis samaawaati wa man fil ardi wash shamsu walqamaru wan nu joomu wal jibaalu wash shajaru wad dawaaabbu wa kaseerum minan naasi wa kaseerun haqqa 'alaihil 'azaab; wa mai yuhinil laahu famaa lahoo mim mukrim; innallaaha yaf'alu maa yashaaa",
    "transliteration_id": "Alam tara annallāha yasjudu lahū man fis-samāwāti wa man fil-arḍi wasy-syamsu wal-qamaru wan-nujūmu wal-jibālu wasy-syajaru wad-dawābbu wa kaṡīrum minan-nās(i), wa kaṡīrun ḥaqqa ‘alaihil-‘ażāb(u), wa may yuhinillāhu famā lahū mim mukrim(in), innallāha yaf‘alu mā yasyā'(u).",
    "translation_en": "Do you not see that to Allah prostrates whoever is in the heavens and whoever is on the earth and the sun, the moon, the stars, the mountains, the trees, the moving creatures and many of the people? But upon many the punishment has been justified. And he whom Allah humiliates - for him there is no bestower of honor. Indeed, Allah does what He wills.",
    "translation_id": "Tidakkah engkau mengetahui bahwa bersujud kepada Allah siapa yang ada di langit dan siapa yang ada di bumi, juga matahari, bulan, bintang, gunung, pohon, hewan melata, dan kebanyakan manusia? Akan tetapi, banyak (manusia) yang pantas mendapatkan azab. Siapa yang dihinakan Allah tidak seorang pun yang akan memuliakannya. Sesungguhnya Allah melakukan apa yang Dia kehendaki."
  },
  {
    "ayat": 19,
    "arabic": "۞ هٰذَانِ خَصْمٰنِ اخْتَصَمُوْا فِيْ رَبِّهِمْ  فَالَّذِيْنَ كَفَرُوْا قُطِّعَتْ لَهُمْ ثِيَابٌ مِّنْ نَّارٍۗ يُصَبُّ مِنْ فَوْقِ رُءُوْسِهِمُ الْحَمِيْمُ ۚ",
    "transliteration_en": "Haazaani khasmaanikh tasamoo fee Rabbihim fal lazeena kafaroo qutti'at lahum siyaabum min naar; yusabbu min fawqi ru'oosihimul hameem",
    "transliteration_id": "Hāżāni khaṣmānikhtaṣamū fī rabbihim fal-lażīna kafarū quṭṭi‘at lahum ṡiyābum min nār(in), yuṣabbu min fauqi ru'ūsihimul-ḥamīm(u).",
    "translation_en": "These are two adversaries who have disputed over their Lord. But those who disbelieved will have cut out for them garments of fire. Poured upon their heads will be scalding water",
    "translation_id": "Inilah dua golongan (mukmin dan kafir) yang bertengkar. Mereka bertengkar tentang Tuhan mereka. Bagi orang-orang yang kufur dibuatkan pakaian dari api neraka. Ke atas kepala mereka akan disiramkan air yang mendidih."
  },
  {
    "ayat": 20,
    "arabic": "يُصْهَرُ بِهٖ مَا فِيْ بُطُوْنِهِمْ وَالْجُلُوْدُ ۗ",
    "transliteration_en": "Yusharu bihee maa fee butoonihim waljulood",
    "transliteration_id": "Yuṣharu bihī mā fī buṭūnihim wal-julūd(u).",
    "translation_en": "By which is melted that within their bellies and [their] skins.",
    "translation_id": "Dengan (air mendidih) itu akan diluluhlantakkan apa yang ada dalam perut mereka dan (juga) kulit (mereka)."
  },
  {
    "ayat": 21,
    "arabic": "وَلَهُمْ مَّقَامِعُ مِنْ حَدِيْدٍ",
    "transliteration_en": "Wa lahum maqaami'u min hadeed",
    "transliteration_id": "Wa lahum maqāmi‘u min ḥadīd(in).",
    "translation_en": "And for [striking] them are maces of iron.",
    "translation_id": "Untuk mereka (azab berupa) palu (godam) dari besi."
  },
  {
    "ayat": 22,
    "arabic": "كُلَّمَآ اَرَادُوْٓا اَنْ يَّخْرُجُوْا مِنْهَا مِنْ غَمٍّ اُعِيْدُوْا فِيْهَا وَذُوْقُوْا عَذَابَ الْحَرِيْقِ ࣖ",
    "transliteration_en": "Kullamaa araadooo any yakhrujoo minhaa min ghammin u'eedoo feeha wa zooqoo 'azaabal hareeq",
    "transliteration_id": "Kullamā arādū ay yakhrujū minhā min gammin u‘īdū fīhā, wa żūqū ‘ażābal-ḥarīq(i).",
    "translation_en": "Every time they want to get out of Hellfire from anguish, they will be returned to it, and [it will be said], \"Taste the punishment of the Burning Fire!\"",
    "translation_id": "Setiap kali hendak keluar darinya (neraka) karena tersiksa, mereka dikembalikan (lagi) ke dalamnya. (Kepada mereka dikatakan,) “Rasakanlah azab (neraka) yang membakar ini!”"
  },
  {
    "ayat": 23,
    "arabic": "اِنَّ اللّٰهَ يُدْخِلُ الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ جَنّٰتٍ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُ يُحَلَّوْنَ فِيْهَا مِنْ اَسَاوِرَ مِنْ ذَهَبٍ وَّلُؤْلُؤًاۗ وَلِبَاسُهُمْ فِيْهَا حَرِيْرٌ",
    "transliteration_en": "Innal laaha yudkhilul lazeena aamanoo wa 'amilus saalihaati jannaatin tajree min tahtihal anhaaru yuhallawna feehaa min asaawira min zahabinw wa lu'lu'aa; wa libaasuhum feehaa hareer",
    "transliteration_id": "Innallāha yudkhilul-lażīna āmanū wa ‘amiluṣ-ṣāliḥāti jannātin tajrī min taḥtihal-anhāru yuḥallauna fīhā min asāwira min żahabiw wa lu'lu'ā(n), wa libāsuhum fīhā ḥarīr(un).",
    "translation_en": "Indeed, Allah will admit those who believe and do righteous deeds to gardens beneath which rivers flow. They will be adorned therein with bracelets of gold and pearl, and their garments therein will be silk.",
    "translation_id": "Sesungguhnya Allah akan memasukkan orang-orang yang beriman dan beramal saleh ke dalam surga-surga yang mengalir di bawahnya sungai-sungai. Di dalamnya mereka diberi perhiasan berupa gelang emas dan mutiara. Pakaian mereka di dalamnya adalah sutra."
  },
  {
    "ayat": 24,
    "arabic": "وَهُدُوْٓا اِلَى الطَّيِّبِ مِنَ الْقَوْلِۚ وَهُدُوْٓا اِلٰى صِرَاطِ الْحَمِيْدِ",
    "transliteration_en": "Wa hudooo ilat taiyibi minal qawli wa hudooo ilaaa siraatil hameed",
    "transliteration_id": "Wa hudū ilaṭ-ṭayyibi minal-qaul(i), wa hudū ilā ṣirāṭil-ḥamīd(i).",
    "translation_en": "And they had been guided [in worldly life] to good speech, and they were guided to the path of the Praiseworthy.",
    "translation_id": "Mereka diberi petunjuk pada ucapan yang baik dan diberi petunjuk (pula) ke jalan (Allah) Yang Maha Terpuji."
  },
  {
    "ayat": 25,
    "arabic": "اِنَّ الَّذِيْنَ كَفَرُوْا وَيَصُدُّوْنَ عَنْ سَبِيْلِ اللّٰهِ وَالْمَسْجِدِ الْحَرَامِ الَّذِيْ جَعَلْنٰهُ لِلنَّاسِ سَوَاۤءً ۨالْعَاكِفُ فِيْهِ وَالْبَادِۗ وَمَنْ يُّرِدْ فِيْهِ بِاِلْحَادٍۢ بِظُلْمٍ نُّذِقْهُ مِنْ عَذَابٍ اَلِيْمٍ ࣖ",
    "transliteration_en": "Innal lazeena kafaroo wa yasuddoona 'an sabeelil laahi wal Masjidil Haraamil lazee ja'alnaahu linnaasi sawaaa'anil 'aakifu feehi walbaad; wa mai yurid feehi bi ilhaadim bizulmin nuziqhu min 'azaabin aleem",
    "transliteration_id": "Innal-lażīna kafarū wa yaṣuddūna ‘an sabīlillāhi wal-masjidil-ḥarāmil-lażī ja‘alnāhu lin-nāsi sawā'anil-‘ākifu fīhi wal-bād(i), wa may yurid fīhi bi'ilḥādim biẓulmin nużiqhu min ‘ażābin alīm(in).",
    "translation_en": "Indeed, those who have disbelieved and avert [people] from the way of Allah and [from] al-Masjid al-Haram, which We made for the people - equal are the resident therein and one from outside; and [also] whoever intends [a deed] therein of deviation [in religion] or wrongdoing - We will make him taste of a painful punishment.",
    "translation_id": "Sesungguhnya orang-orang yang kufur dan menghalangi (manusia) dari jalan Allah dan (dari) Masjidilharam yang telah Kami jadikan (terbuka) untuk semua manusia, baik yang bermukim di sana maupun yang datang dari luar (akan mendapatkan siksa yang sangat pedih). Siapa saja yang bermaksud melakukan kejahatan secara zalim di dalamnya pasti akan Kami jadikan dia merasakan sebagian siksa yang pedih."
  },
  {
    "ayat": 26,
    "arabic": "وَاِذْ بَوَّأْنَا لِاِبْرٰهِيْمَ مَكَانَ الْبَيْتِ اَنْ لَّا تُشْرِكْ بِيْ شَيْـًٔا وَّطَهِّرْ بَيْتِيَ لِلطَّاۤىِٕفِيْنَ وَالْقَاۤىِٕمِيْنَ وَالرُّكَّعِ السُّجُوْدِ",
    "transliteration_en": "Wa iz bawwaanaa li Ibraaheema makaanal Baiti allaa tushrik bee shai'anw wa tahhir Baitiya litaaa'ifeena walqaaa' imeena warrukka 'is sujood",
    "transliteration_id": "Wa iż bawwa'nā li'ibrāhīma makānal-baiti allā tusyrik bī syai'aw wa ṭahhir baitiya liṭ-ṭā'ifīna wal-qā'imīna war-rukka‘is-sujūd(i).",
    "translation_en": "And [mention, O Muhammad], when We designated for Abraham the site of the House, [saying], \"Do not associate anything with Me and purify My House for those who perform Tawaf and those who stand [in prayer] and those who bow and prostrate.",
    "translation_id": "(Ingatlah) ketika Kami menempatkan Ibrahim di tempat Baitullah (dengan berfirman), “Janganlah engkau mempersekutukan Aku dengan apa pun, sucikanlah rumah-Ku bagi orang-orang yang tawaf, mukim (di sekitarnya), serta rukuk (dan) sujud."
  },
  {
    "ayat": 27,
    "arabic": "وَاَذِّنْ فِى النَّاسِ بِالْحَجِّ يَأْتُوْكَ رِجَالًا وَّعَلٰى كُلِّ ضَامِرٍ يَّأْتِيْنَ مِنْ كُلِّ فَجٍّ عَمِيْقٍ ۙ",
    "transliteration_en": "Wa azzin fin naasi bil Hajji yaatooka rijaalanw wa 'alaa kulli daamiriny yaateena min kulli fajjin 'ameeq",
    "transliteration_id": "Wa ażżin fin-nāsi bil-ḥajji ya'tūka rijālaw wa ‘alā kulli ḍāmiriy ya'tīna min kulli fajjin ‘amīq(in).",
    "translation_en": "And proclaim to the people the Hajj [pilgrimage]; they will come to you on foot and on every lean camel; they will come from every distant pass -",
    "translation_id": "(Wahai Ibrahim, serulah manusia untuk (mengerjakan) haji, niscaya mereka akan datang kepadamu dengan berjalan kaki dan mengendarai unta kurus yang datang dari segenap penjuru yang jauh."
  },
  {
    "ayat": 28,
    "arabic": "لِّيَشْهَدُوْا مَنَافِعَ لَهُمْ وَيَذْكُرُوا اسْمَ اللّٰهِ فِيْٓ اَيَّامٍ مَّعْلُوْمٰتٍ عَلٰى مَا رَزَقَهُمْ مِّنْۢ بَهِيْمَةِ الْاَنْعَامِۚ فَكُلُوْا مِنْهَا وَاَطْعِمُوا الْبَاۤىِٕسَ الْفَقِيْرَ ۖ",
    "transliteration_en": "Li yashhadoo manaafi'a lahum wa yazkurus mal laahi feee ayyaamimma'loomaatin 'alaa maa razaqahum mim baheematil an'aami fakuloo minhaa wa at'imul baaa'isal faqeer",
    "transliteration_id": "Liyasyhadū manāfi‘a lahum wa yażkurusmallāhi fī ayyāmim ma‘lūmātin ‘alā mā razaqahum mim bahīmatil-an‘ām(i), fa kulū minhā wa aṭ‘imul-bā'isal-faqīr(a).",
    "translation_en": "That they may witness benefits for themselves and mention the name of Allah on known days over what He has provided for them of [sacrificial] animals. So eat of them and feed the miserable and poor.",
    "translation_id": "(Mereka berdatangan) supaya menyaksikan berbagai manfaat untuk mereka dan menyebut nama Allah pada beberapa hari yang telah ditentukan atas rezeki yang telah dianugerahkan-Nya kepada mereka berupa binatang ternak. Makanlah sebagian darinya dan (sebagian lainnya) berilah makan orang yang sengsara lagi fakir."
  },
  {
    "ayat": 29,
    "arabic": "ثُمَّ لْيَقْضُوْا تَفَثَهُمْ وَلْيُوْفُوْا نُذُوْرَهُمْ وَلْيَطَّوَّفُوْا بِالْبَيْتِ الْعَتِيْقِ",
    "transliteration_en": "Summal yaqdoo tafasahum wal yoofoo nuzoorahum wal yattawwafoo bil Baitil 'Ateeq",
    "transliteration_id": "Ṡummal yaqḍū tafaṡafahum wal yūfū nużūrahum wal yaṭṭawwafū bil-baitil-‘atīq(i).",
    "translation_en": "Then let them end their untidiness and fulfill their vows and perform Tawaf around the ancient House.\"",
    "translation_id": "Kemudian, hendaklah mereka menghilangkan kotoran yang ada di badan mereka, menyempurnakan nazar-nazar mereka, dan melakukan tawaf di sekeliling al-Bait al-‘Atīq (Baitullah).”"
  },
  {
    "ayat": 30,
    "arabic": "ذٰلِكَ وَمَنْ يُّعَظِّمْ حُرُمٰتِ اللّٰهِ فَهُوَ خَيْرٌ لَّهٗ عِنْدَ رَبِّهٖۗ وَاُحِلَّتْ لَكُمُ الْاَنْعَامُ اِلَّا مَا يُتْلٰى عَلَيْكُمْ فَاجْتَنِبُوا الرِّجْسَ مِنَ الْاَوْثَانِ وَاجْتَنِبُوْا قَوْلَ الزُّوْرِ ۙ",
    "transliteration_en": "Zaalika wa mai yu'azzim hurumaatil laahi fahuwa khairul lahoo 'inda Rabbih; wa uhillat lakumul an'aamu illaa maa yutlaa 'alaikum fajtanibur rijsa minal awsaani wajtaniboo qawlaz zoor",
    "transliteration_id": "Żālika wa may yu‘aẓẓim ḥurumātillāhi fa huwa khairul lahū ‘inda rabbih(ī), wa uḥillat lakumul-an‘āmu illā mā yutlā ‘alaikum fajtanibur-rijsa minal-auṡāni wajtanibū qaulaz-zūr(i).",
    "translation_en": "That [has been commanded], and whoever honors the sacred ordinances of Allah - it is best for him in the sight of his Lord. And permitted to you are the grazing livestock, except what is recited to you. So avoid the uncleanliness of idols and avoid false statement,",
    "translation_id": "Demikianlah (petunjuk dan perintah Allah). Siapa yang mengagungkan apa yang terhormat di sisi Allah (ḥurumāt) lebih baik baginya di sisi Tuhannya. Semua hewan ternak telah dihalalkan bagi kamu, kecuali yang diterangkan kepadamu (keharamannya). Maka, jauhilah (penyembahan) berhala-berhala yang najis itu dan jauhi (pula) perkataan dusta."
  },
  {
    "ayat": 31,
    "arabic": "حُنَفَاۤءَ لِلّٰهِ غَيْرَ مُشْرِكِيْنَ بِهٖۗ وَمَنْ يُّشْرِكْ بِاللّٰهِ فَكَاَنَّمَا خَرَّ مِنَ السَّمَاۤءِ فَتَخْطَفُهُ الطَّيْرُ اَوْ تَهْوِيْ بِهِ الرِّيْحُ فِيْ مَكَانٍ سَحِيْقٍ",
    "transliteration_en": "Hunafaaa'a lillaahi ghaira mushrikeena bih; wa mai yushrik billaahi faka annamaa kharra minas samaaa'i fatakh tafuhut tairu aw tahwee bihir reehu bee makaanin saheeq",
    "transliteration_id": "Ḥunafā'a lillāhi gaira musyrikīna bih(ī), wa may yusyrik billāhi fa ka'annamā kharra minas-samā'i fa takhṭafuhuṭ-ṭairu au tahwī bihir-rīḥu fī makānin saḥīq(in).",
    "translation_en": "Inclining [only] to Allah, not associating [anything] with Him. And he who associates with Allah - it is as though he had fallen from the sky and was snatched by the birds or the wind carried him down into a remote place.",
    "translation_id": "(Beribadahlah) dengan ikhlas kepada Allah, tanpa mempersekutukan-Nya. Siapa yang mempersekutukan Allah seakan-akan dia jatuh dari langit, lalu disambar oleh burung atau diterbangkan angin ke tempat yang jauh."
  },
  {
    "ayat": 32,
    "arabic": "ذٰلِكَ وَمَنْ يُّعَظِّمْ شَعَاۤىِٕرَ اللّٰهِ فَاِنَّهَا مِنْ تَقْوَى الْقُلُوْبِ",
    "transliteration_en": "Zaalika wa mai yu'azzim sha'aaa'iral laahi fa innahaa min taqwal quloob",
    "transliteration_id": "Żālika wa may yu‘aẓẓim sya‘ā'irallāhi fa innahā min taqwal-qulūb(i).",
    "translation_en": "That [is so]. And whoever honors the symbols of Allah - indeed, it is from the piety of hearts.",
    "translation_id": "Demikianlah (perintah Allah). Siapa yang mengagungkan syiar-syiar Allah sesungguhnya hal itu termasuk dalam ketakwaan hati."
  },
  {
    "ayat": 33,
    "arabic": "لَكُمْ فِيْهَا مَنَافِعُ اِلٰٓى اَجَلٍ مُّسَمًّى ثُمَّ مَحِلُّهَآ اِلَى الْبَيْتِ الْعَتِيْقِ ࣖ",
    "transliteration_en": "Lakum feehaa manaafi'u ilaaa ajalim musamman summa mahilluhaaa ilal Baitil 'Ateeq",
    "transliteration_id": "Lakum fīhā manāfi‘u ilā ajalim musamman ṡumma maḥilluhā ilal-baitil-‘atīq(i).",
    "translation_en": "For you the animals marked for sacrifice are benefits for a specified term; then their place of sacrifice is at the ancient House.",
    "translation_id": "Bagi kamu padanya (hewan hadyu) ada beberapa manfaat, sampai waktu yang ditentukan, kemudian tempat penyembelihannya berada di sekitar al-Bait al-‘Atīq (Tanah Haram seluruhnya)."
  },
  {
    "ayat": 34,
    "arabic": "وَلِكُلِّ اُمَّةٍ جَعَلْنَا مَنْسَكًا لِّيَذْكُرُوا اسْمَ اللّٰهِ عَلٰى مَا رَزَقَهُمْ مِّنْۢ بَهِيْمَةِ الْاَنْعَامِۗ فَاِلٰهُكُمْ اِلٰهٌ وَّاحِدٌ فَلَهٗٓ اَسْلِمُوْاۗ وَبَشِّرِ الْمُخْبِتِيْنَ ۙ",
    "transliteration_en": "Wa likulli ummatin ja'alnaa mansakal liyazkurus mal laahi 'alaa maa razaqahum mim baheematil an'aam; failaahukum ilaahunw Waahidun falahooo aslimoo; wa bashshiril mukhbiteen",
    "transliteration_id": "Wa likulli ummatin ja‘alnā mansakal liyażkurusmallāhi ‘alā mā razaqahum mim bahīmatil-an‘ām(i), fa ilāhukum ilāhuw wāḥidun fa lahū aslimū, wa basysyiril-mukhbitīn(a).",
    "translation_en": "And for all religion We have appointed a rite [of sacrifice] that they may mention the name of Allah over what He has provided for them of [sacrificial] animals. For your god is one God, so to Him submit. And, [O Muhammad], give good tidings to the humble [before their Lord]",
    "translation_id": "Bagi setiap umat telah Kami syariatkan penyembelihan (kurban) agar mereka menyebut nama Allah atas binatang ternak yang dianugerahkan-Nya kepada mereka. Tuhanmu ialah Tuhan Yang Maha Esa. Maka, berserahdirilah kepada-Nya. Sampaikanlah (Nabi Muhammad) kabar gembira kepada orang-orang yang rendah hati lagi taat (kepada Allah)."
  },
  {
    "ayat": 35,
    "arabic": "الَّذِيْنَ اِذَا ذُكِرَ اللّٰهُ وَجِلَتْ قُلُوْبُهُمْ وَالصّٰبِرِيْنَ عَلٰى مَآ اَصَابَهُمْ وَالْمُقِيْمِى الصَّلٰوةِۙ وَمِمَّا رَزَقْنٰهُمْ يُنْفِقُوْنَ",
    "transliteration_en": "Allazeena izaa zukiral laahu wajilat quloobuhum wassaabireena 'alaa maaa asaabahum walmuqeemis Salaati wa mimmaa razaqnaahum yunfiqoon",
    "transliteration_id": "Allażīna iżā żukirallāhu wajilat qulūbuhum waṣ-ṣābirīna ‘alā mā aṣābahum wal-muqīmiṣ-ṣalāh(ti), wa mimmā razaqnāhum yunfiqūn(a).",
    "translation_en": "Who, when Allah is mentioned, their hearts are fearful, and [to] the patient over what has afflicted them, and the establishers of prayer and those who spend from what We have provided them.",
    "translation_id": "(Yaitu) orang-orang yang apabila disebut nama Allah, hati mereka bergetar, sabar atas apa yang menimpa mereka, melaksanakan salat, dan menginfakkan sebagian rezeki yang Kami anugerahkan kepada mereka."
  },
  {
    "ayat": 36,
    "arabic": "وَالْبُدْنَ جَعَلْنٰهَا لَكُمْ مِّنْ شَعَاۤىِٕرِ اللّٰهِ لَكُمْ فِيْهَا خَيْرٌۖ فَاذْكُرُوا اسْمَ اللّٰهِ عَلَيْهَا صَوَاۤفَّۚ فَاِذَا وَجَبَتْ جُنُوْبُهَا فَكُلُوْا مِنْهَا وَاَطْعِمُوا الْقَانِعَ وَالْمُعْتَرَّۗ  كَذٰلِكَ سَخَّرْنٰهَا لَكُمْ لَعَلَّكُمْ تَشْكُرُوْنَ",
    "transliteration_en": "Walbudna ja'alnaahaa lakum min sha'aaa'iril laahi lakum feehaa khairun fazkurusmal laahi 'alaihaa sawaaff; fa izaa wajabat junoobuhaa fakuloo minhaa wa at'imul qaani'a walmu'tarr; kazaalika sakhkharnaahaa lakum la'allakum tashkuroon",
    "transliteration_id": "Wal-budna ja‘alnāhā lakum min sya‘ā'irillāhi lakum fīhā khair(un), fażkurusmallāhi ‘alaihā ṣawāff(a), fa iżā wajabat junūbuhā fa kulū minhā wa aṭ‘imul-qāni‘a wal-mu‘tarr(a), każālika sakhkharnāhā lakum la‘allakum tasykurūn(a).",
    "translation_en": "And the camels and cattle We have appointed for you as among the symbols of Allah; for you therein is good. So mention the name of Allah upon them when lined up [for sacrifice]; and when they are [lifeless] on their sides, then eat from them and feed the needy and the beggar. Thus have We subjected them to you that you may be grateful.",
    "translation_id": "Unta-unta itu Kami jadikan untukmu sebagai bagian dari syiar agama Allah. Bagimu terdapat kebaikan padanya. Maka, sebutlah nama Allah (ketika kamu akan menyembelihnya, sedangkan unta itu) dalam keadaan berdiri (dan kaki-kaki telah terikat). Lalu, apabila telah rebah (mati), makanlah sebagiannya dan berilah makan orang yang merasa cukup dengan apa yang ada padanya (tidak meminta-minta) dan orang yang meminta-minta. Demikianlah Kami telah menundukkannya (unta-unta itu) untukmu agar kamu bersyukur."
  },
  {
    "ayat": 37,
    "arabic": "لَنْ يَّنَالَ اللّٰهَ لُحُوْمُهَا وَلَا دِمَاۤؤُهَا وَلٰكِنْ يَّنَالُهُ التَّقْوٰى مِنْكُمْۗ  كَذٰلِكَ سَخَّرَهَا لَكُمْ لِتُكَبِّرُوا اللّٰهَ عَلٰى مَا هَدٰىكُمْ ۗ وَبَشِّرِ الْمُحْسِنِيْنَ",
    "transliteration_en": "Lany yanaalal laaha luhoo muhaa wa laa dimaaa'uhaa wa laakiny yanaaluhut taqwaa minkum; kazaalika sakhkharhaa lakum litukabbirul laaha 'alaa ma hadaakum; wa bashshirul muhsineen",
    "transliteration_id": "Lay yanālallāha luḥūmuhā wa lā dimā'uhā wa lākiy yanāluhut-taqwā minkum, każālika sakhkharahā lakum litukabbirullāha ‘alā mā hadākum, wa basysyiril-muḥsinīn(a).",
    "translation_en": "Their meat will not reach Allah, nor will their blood, but what reaches Him is piety from you. Thus have We subjected them to you that you may glorify Allah for that [to] which He has guided you; and give good tidings to the doers of good.",
    "translation_id": "Daging (hewan kurban) dan darahnya itu sekali-kali tidak akan sampai kepada Allah, tetapi yang sampai kepada-Nya adalah ketakwaanmu. Demikianlah Dia menundukkannya untukmu agar kamu mengagungkan Allah atas petunjuk yang Dia berikan kepadamu. Berilah kabar gembira kepada orang-orang yang muhsin."
  },
  {
    "ayat": 38,
    "arabic": "۞ اِنَّ اللّٰهَ يُدَافِعُ عَنِ الَّذِيْنَ اٰمَنُوْاۗ اِنَّ اللّٰهَ لَا يُحِبُّ كُلَّ خَوَّانٍ كَفُوْرٍ ࣖ",
    "transliteration_en": "Innal laaha yudaafi' 'anil lazeena aamanoo; innal laaha laa yuhibbu kulla khawwaanin kafoor",
    "transliteration_id": "Innallāha yudāfi‘u ‘anil-lażīna āmanū, innallāha lā yuḥibbu kulla khawwānin kafūr(in).",
    "translation_en": "Indeed, Allah defends those who have believed. Indeed, Allah does not like everyone treacherous and ungrateful.",
    "translation_id": "Sesungguhnya Allah membela orang-orang yang beriman. Sesungguhnya Allah tidak menyukai setiap orang yang sangat khianat lagi sangat kufur."
  },
  {
    "ayat": 39,
    "arabic": "اُذِنَ لِلَّذِيْنَ يُقَاتَلُوْنَ بِاَنَّهُمْ ظُلِمُوْاۗ وَاِنَّ اللّٰهَ عَلٰى نَصْرِهِمْ لَقَدِيْرٌ ۙ",
    "transliteration_en": "Uzina lillazeena yuqaataloona bi annahum zulimoo; wa innal laaha 'alaa nasrihim la Qaderr",
    "transliteration_id": "Użina lil-lażīna yuqātalūna bi'annahum ẓulimū, wa innallāha ‘alā naṣrihim laqadīr(un).",
    "translation_en": "Permission [to fight] has been given to those who are being fought, because they were wronged. And indeed, Allah is competent to give them victory.",
    "translation_id": "Diizinkan (berperang) kepada orang-orang yang diperangi karena sesungguhnya mereka dizalimi. Sesungguhnya Allah benar-benar Maha Kuasa membela mereka."
  },
  {
    "ayat": 40,
    "arabic": "ۨالَّذِيْنَ اُخْرِجُوْا مِنْ دِيَارِهِمْ بِغَيْرِ حَقٍّ اِلَّآ اَنْ يَّقُوْلُوْا رَبُّنَا اللّٰهُ ۗوَلَوْلَا دَفْعُ اللّٰهِ النَّاسَ بَعْضَهُمْ بِبَعْضٍ لَّهُدِّمَتْ صَوَامِعُ وَبِيَعٌ وَّصَلَوٰتٌ وَّمَسٰجِدُ يُذْكَرُ فِيْهَا اسْمُ اللّٰهِ كَثِيْرًاۗ وَلَيَنْصُرَنَّ اللّٰهُ مَنْ يَّنْصُرُهٗۗ اِنَّ اللّٰهَ لَقَوِيٌّ عَزِيْزٌ",
    "transliteration_en": "Allazeena ukhrijoo min diyaarihim bighairi haqqin illaaa any yaqooloo rabbunallaah; wa law laa daf'ul laahin naasa ba'dahum biba'dil lahuddimat sawaami'u wa biya'unw wa salawaatunw wa masaajidu yuzkaru feehasmul laahi kaseeraa; wa layansurannal laahu mai yansuruh; innal laaha la qawiyyun 'Azeez",
    "transliteration_id": "Allażīna ukhrijū min diyārihim bigairi ḥaqqin illā ay yaqūlū rabbunallāh(u), wa lau lā daf‘ullāhin-nāsa ba‘ḍahum biba‘ḍil lahuddimat ṣawāmi‘u wa biya‘uw wa ṣalawātuw wa masājidu yużkaru fīhasmullāhi kaṡīrā(n), wa layanṣurannallāhu may yanṣuruh(ū), innallāha laqawiyyun ‘azīz(un).",
    "translation_en": "[They are] those who have been evicted from their homes without right - only because they say, \"Our Lord is Allah.\" And were it not that Allah checks the people, some by means of others, there would have been demolished monasteries, churches, synagogues, and mosques in which the name of Allah is much mentioned. And Allah will surely support those who support Him. Indeed, Allah is Powerful and Exalted in Might.",
    "translation_id": "(Yaitu) orang-orang yang diusir dari kampung halamannya, tanpa alasan yang benar hanya karena mereka berkata, “Tuhan kami adalah Allah.” Seandainya Allah tidak menolak (keganasan) sebagian manusia dengan sebagian yang lain, tentu telah dirobohkan biara-biara, gereja-gereja, sinagoge-sinagoge, dan masjid-masjid yang di dalamnya banyak disebut nama Allah. Sungguh, Allah pasti menolong orang yang menolong (agama)-Nya. Sesungguhnya Allah benar-benar Maha Kuat lagi Maha Perkasa."
  },
  {
    "ayat": 41,
    "arabic": "اَلَّذِيْنَ اِنْ مَّكَّنّٰهُمْ فِى الْاَرْضِ اَقَامُوا الصَّلٰوةَ وَاٰتَوُا الزَّكٰوةَ وَاَمَرُوْا بِالْمَعْرُوْفِ وَنَهَوْا عَنِ الْمُنْكَرِۗ وَلِلّٰهِ عَاقِبَةُ الْاُمُوْرِ",
    "transliteration_en": "Allazeena im makkan naahum fil ardi aqaamus Salaata wa aatawuz Zakaata wa amaroo bilma'roofi wa nahaw 'anil munkar; wa lillaahi 'aaqibatul umoor",
    "transliteration_id": "Allażīna im makkannāhum fil-arḍi aqāmuṣ-ṣalāta wa ātawuz-zakāta wa amarū bil-ma‘rūfi wa nahau ‘anil-munkar(i), wa lillāhi ‘āqibatul-umūr(i).",
    "translation_en": "[And they are] those who, if We give them authority in the land, establish prayer and give zakah and enjoin what is right and forbid what is wrong. And to Allah belongs the outcome of [all] matters.",
    "translation_id": "(Yaitu) orang-orang yang jika Kami beri kemantapan (hidup) di bumi, mereka menegakkan salat, menunaikan zakat, menyuruh berbuat yang makruf, dan mencegah dari yang mungkar. Hanya kepada Allah kesudahan segala urusan."
  },
  {
    "ayat": 42,
    "arabic": "وَاِنْ يُّكَذِّبُوْكَ فَقَدْ كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوْحٍ وَّعَادٌ وَّثَمُوْدُ ۙ",
    "transliteration_en": "Wa iny yukazzibooka faqad kazzabat qablahum qawmu Nooinw wa Aadunw wa Samood",
    "transliteration_id": "Wa iy yukażżibūka faqad każżabat qablahum qaumu nūḥiw wa ‘āduw wa ṡamūd(u).",
    "translation_en": "And if they deny you, [O Muhammad] - so, before them, did the people of Noah and 'Aad and Thamud deny [their prophets],",
    "translation_id": "Jika mereka (orang-orang musyrik) mendustakan engkau (Nabi Muhammad), sungguh, sebelum mereka, kaum (Nabi) Nuh, ‘Ad, dan Samud telah mendustakan (para rasul)."
  },
  {
    "ayat": 43,
    "arabic": "وَقَوْمُ اِبْرٰهِيْمَ وَقَوْمُ لُوْطٍ ۙ",
    "transliteration_en": "Wa qawmu Ibraaheema wa qawmu Loot",
    "transliteration_id": "Wa qaumu ibrāhīma wa qaumu lūṭ(in).",
    "translation_en": "And the people of Abraham and the people of Lot",
    "translation_id": "(Demikian juga) kaum (Nabi) Ibrahim dan kaum (Nabi) Lut."
  },
  {
    "ayat": 44,
    "arabic": "وَّاَصْحٰبُ مَدْيَنَۚ وَكُذِّبَ مُوْسٰى فَاَمْلَيْتُ لِلْكٰفِرِيْنَ ثُمَّ اَخَذْتُهُمْۚ فَكَيْفَ كَانَ نَكِيْرِ",
    "transliteration_en": "Wa as haabu Madyana wa kuzziba Moosaa fa amlaitu lilkaafireena summa akhaztuhum fakaifa kaana nakeer",
    "transliteration_id": "Wa aṣḥābu madyan(a), wa kużżiba mūsā fa amlaitu lil-kāfirīna ṡumma akhażtuhum, fa kaifa kāna nakīr(i).",
    "translation_en": "And the inhabitants of Madyan. And Moses was denied, so I prolonged enjoyment for the disbelievers; then I seized them, and how [terrible] was My reproach.",
    "translation_id": "(Begitu juga) penduduk Madyan. Musa (juga) telah didustakan. Namun, Aku beri tenggang waktu kepada orang-orang kafir, kemudian Aku siksa mereka. Maka, betapa kuatnya pengingkaran-Ku (terhadap sikap mereka)."
  },
  {
    "ayat": 45,
    "arabic": "فَكَاَيِّنْ مِّنْ قَرْيَةٍ اَهْلَكْنٰهَا وَهِيَ ظَالِمَةٌ فَهِيَ خَاوِيَةٌ عَلٰى عُرُوْشِهَاۖ وَبِئْرٍ مُّعَطَّلَةٍ وَّقَصْرٍ مَّشِيْدٍ",
    "transliteration_en": "Faka ayyim min qaryatin ahlaknaahaa wa hiya zaalimatun fahiya khaawiyatun 'alaa 'urooshihaa wa bi'rim mu'at talatinw wa qasrim masheed",
    "transliteration_id": "Fa ka'ayyim min qaryatin ahlaknāhā wa hiya ẓālimatun fa hiya khāwiyatun ‘alā ‘urūsyihā, wa bi'rim mu‘aṭṭalatiw wa qaṣrim masyīd(in).",
    "translation_en": "And how many a city did We destroy while it was committing wrong - so it is [now] fallen into ruin - and [how many] an abandoned well and [how many] a lofty palace.",
    "translation_id": "Betapa banyak negeri yang telah Kami binasakan karena (penduduk)-nya dalam keadaan zalim sehingga bangunan-bangunannya runtuh dan (betapa banyak pula) sumur yang ditelantarkan serta istana tinggi (yang ditinggalkan)."
  },
  {
    "ayat": 46,
    "arabic": "اَفَلَمْ يَسِيْرُوْا فِى الْاَرْضِ فَتَكُوْنَ لَهُمْ قُلُوْبٌ يَّعْقِلُوْنَ بِهَآ اَوْ اٰذَانٌ يَّسْمَعُوْنَ بِهَاۚ فَاِنَّهَا لَا تَعْمَى الْاَبْصَارُ وَلٰكِنْ تَعْمَى الْقُلُوْبُ الَّتِيْ فِى الصُّدُوْرِ",
    "transliteration_en": "Afalam yaseeroo fil ardi fatakoona lahum quloobuny ya'qiloona bihaaa aw aazaanuny yasm'oona bihaa fa innahaa laa ta'mal absaaru wa laakin ta'mal quloobul latee fissudoor",
    "transliteration_id": "Afalam yasīrū fil-arḍi fa takūna lahum qulūbuy ya‘qilūna bihā au āżānuy yasma‘ūna bihā, fa innahā lā ta‘mal-abṣāru wa lākin ta‘mal-qulūbul-latī fiṣ-ṣudūr(i).",
    "translation_en": "So have they not traveled through the earth and have hearts by which to reason and ears by which to hear? For indeed, it is not eyes that are blinded, but blinded are the hearts which are within the breasts.",
    "translation_id": "Tidakkah mereka berjalan di bumi sehingga hati mereka dapat memahami atau telinga mereka dapat mendengar? Sesungguhnya bukanlah mata itu yang buta, tetapi yang buta ialah hati yang berada dalam dada."
  },
  {
    "ayat": 47,
    "arabic": "وَيَسْتَعْجِلُوْنَكَ بِالْعَذَابِ وَلَنْ يُّخْلِفَ اللّٰهُ وَعْدَهٗۗ وَاِنَّ يَوْمًا عِنْدَ رَبِّكَ كَاَلْفِ سَنَةٍ مِّمَّا تَعُدُّوْنَ",
    "transliteration_en": "Wa yasta'juloonaka bil'azaabi wa lany yukhlifal laahu wa'dah; wa inna yawman 'inda Rabbika ka'alfi sanatim mimmaa ta'uddoon",
    "transliteration_id": "Wa yasta‘jilūnaka bil-‘ażābi wa lay yukhlifallāhu wa‘dah(ū), wa inna yauman ‘inda rabbika ka'alfi sanatim mimmā ta‘uddūn(a).",
    "translation_en": "And they urge you to hasten the punishment. But Allah will never fail in His promise. And indeed, a day with your Lord is like a thousand years of those which you count.",
    "translation_id": "Mereka (kaum musyrik Makkah) meminta kepadamu (Nabi Muhammad) agar azab itu disegerakan, padahal Allah tidak akan menyalahi janji-Nya. Sesungguhnya sehari di sisi Tuhanmu adalah seperti seribu tahun menurut perhitunganmu."
  },
  {
    "ayat": 48,
    "arabic": "وَكَاَيِّنْ مِّنْ قَرْيَةٍ اَمْلَيْتُ لَهَا وَهِيَ ظَالِمَةٌ ثُمَّ اَخَذْتُهَاۚ وَاِلَيَّ الْمَصِيْرُ ࣖ",
    "transliteration_en": "Wa ka ayyim min qaryatin amlaitu lahaa wa hiya zaalimatun summa akhaztuhaa wa ilaiyal maseer",
    "transliteration_id": "Wa ka'ayyim min qaryatin amlaitu lahā wa hiya ẓālimatun ṡumma akhażtuhā, wa ilayyal-maṣīr(u).",
    "translation_en": "And for how many a city did I prolong enjoyment while it was committing wrong. Then I seized it, and to Me is the [final] destination.",
    "translation_id": "Berapa banyak negeri yang Aku tangguhkan (siksa)-nya, padahal (penduduk)-nya berbuat zalim, kemudian Aku siksa mereka. Hanya kepada-Ku tempat kembali (segala sesuatu)."
  },
  {
    "ayat": 49,
    "arabic": "قُلْ يٰٓاَيُّهَا النَّاسُ اِنَّمَآ اَنَا۠ لَكُمْ نَذِيْرٌ مُّبِيْنٌ ۚ",
    "transliteration_en": "Qul yaaa ayyuhan naasu innamaaa ana lakum nazeerum mubeen",
    "transliteration_id": "Qul yā ayyuhan-nāsu innamā ana lakum nażīrum mubīn(un).",
    "translation_en": "Say, \"O people, I am only to you a clear warner.\"",
    "translation_id": "Katakanlah (Nabi Muhammad), “Wahai manusia, aku hanyalah sebagai pemberi peringatan yang nyata kepadamu.”"
  },
  {
    "ayat": 50,
    "arabic": "فَالَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ لَهُمْ مَّغْفِرَةٌ وَّرِزْقٌ كَرِيْمٌ",
    "transliteration_en": "Fallazeena aamanoo wa 'amilu saalihaati lahum maghfiratunw wa rizqun kareem",
    "transliteration_id": "Fal-lażīna āmanū wa ‘amiluṣ-ṣāliḥāti lahum magfiratuw wa rizqun karīm(un).",
    "translation_en": "And those who have believed and done righteous deeds - for them is forgiveness and noble provision.",
    "translation_id": "Orang-orang yang beriman dan beramal saleh, bagi mereka ada ampunan dan rezeki yang mulia (halal dan memuaskan)."
  }
]