[
  {
    "ayat": 1,
    "arabic": "كۤهٰيٰعۤصۤ ۚ",
    "transliteration_en": "Kaaaf-Haa-Yaa-'Ayyyn-Saaad",
    "transliteration_id": "Kāf hā yā ‘aīn ṣād.",
    "translation_en": "Kaf, Ha, Ya, 'Ayn, Sad.",
    "translation_id": "Kāf Hā Yā ‘Ain Ṣād."
  },
  {
    "ayat": 2,
    "arabic": "ذِكْرُ رَحْمَتِ رَبِّكَ عَبْدَهٗ زَكَرِيَّا ۚ",
    "transliteration_en": "Zikru rahmati Rabbika 'abdahoo Zakariyya",
    "transliteration_id": "Żikru raḥmati rabbika ‘abdahū zakariyyā.",
    "translation_en": "[This is] a mention of the mercy of your Lord to His servant Zechariah",
    "translation_id": "(Yang dibacakan ini adalah) penjelasan tentang rahmat Tuhanmu kepada hamba-Nya, Zakaria,"
  },
  {
    "ayat": 3,
    "arabic": "اِذْ نَادٰى رَبَّهٗ نِدَاۤءً خَفِيًّا",
    "transliteration_en": "Iz naadaa Rabbahoo nidaaa'an khafiyyaa",
    "transliteration_id": "Iż nādā rabbahū nidā'an khafiyyā(n).",
    "translation_en": "When he called to his Lord a private supplication.",
    "translation_id": "(yaitu) ketika dia berdoa kepada Tuhannya dengan suara yang lirih."
  },
  {
    "ayat": 4,
    "arabic": "قَالَ رَبِّ اِنِّيْ وَهَنَ الْعَظْمُ مِنِّيْ وَاشْتَعَلَ الرَّأْسُ شَيْبًا وَّلَمْ اَكُنْۢ بِدُعَاۤىِٕكَ رَبِّ شَقِيًّا",
    "transliteration_en": "Qaala Rabbi innee wahanal'azmu minnee washta'alar raasu shaibanw wa lam akum bidu'aaa'ika Rabbi shaqiyyaa",
    "transliteration_id": "Qāla rabbi innī wahanal-‘aẓmu minnī wasyta‘alar-ra'su syaibaw wa lam akum bidu‘ā'ika rabbi syaqiyyā(n).",
    "translation_en": "He said, \"My Lord, indeed my bones have weakened, and my head has filled with white, and never have I been in my supplication to You, my Lord, unhappy.",
    "translation_id": "Dia (Zakaria) berkata, “Wahai Tuhanku, sesungguhnya tulangku telah lemah, kepalaku telah dipenuhi uban, dan aku tidak pernah kecewa dalam berdoa kepada-Mu, wahai Tuhanku."
  },
  {
    "ayat": 5,
    "arabic": "وَاِنِّيْ خِفْتُ الْمَوَالِيَ مِنْ وَّرَاۤءِيْ وَكَانَتِ امْرَاَتِيْ عَاقِرًا فَهَبْ لِيْ مِنْ لَّدُنْكَ وَلِيًّا ۙ",
    "transliteration_en": "Wa innee khiftul mawaa liya minw waraaa'ee wa kaana tim ra atee 'aairan fahab lee mil ladunka waliyyaa",
    "transliteration_id": "Wa innī khiftul-mawāliya miw warā'ī wa kānatimra'atī ‘āqiran fahab lī mil ladunka waliyyā(n).",
    "translation_en": "And indeed, I fear the successors after me, and my wife has been barren, so give me from Yourself an heir",
    "translation_id": "Sesungguhnya aku khawatir terhadap keluargaku sepeninggalku, sedangkan istriku adalah seorang yang mandul. Anugerahilah aku seorang anak dari sisi-Mu."
  },
  {
    "ayat": 6,
    "arabic": "يَّرِثُنِيْ وَيَرِثُ مِنْ اٰلِ يَعْقُوْبَ وَاجْعَلْهُ رَبِّ رَضِيًّا",
    "transliteration_en": "Yarisunee wa yarisu min aali Ya'qoob, waj'alhu Rabbi radiyya",
    "transliteration_id": "Yariṡunī wa yariṡu min āli ya‘qūba waj‘alhu rabbi raḍiyyā(n).",
    "translation_en": "Who will inherit me and inherit from the family of Jacob. And make him, my Lord, pleasing [to You].\"",
    "translation_id": "(Seorang anak) yang akan mewarisi aku dan keluarga Ya‘qub serta jadikanlah dia, wahai Tuhanku, seorang yang diridai.”"
  },
  {
    "ayat": 7,
    "arabic": "يٰزَكَرِيَّآ اِنَّا نُبَشِّرُكَ بِغُلٰمِ ِۨاسْمُهٗ يَحْيٰىۙ لَمْ نَجْعَلْ لَّهٗ مِنْ قَبْلُ سَمِيًّا",
    "transliteration_en": "Yaa Zakariyyaaa innaa nubashshiruka bighulaami nismuhoo Yahyaa lam naj'al lahoo min qablu samiyyaa",
    "transliteration_id": "Yā zakariyyā innā nubasysyiruka bigulāminismuhū yaḥyā, lam naj‘al lahū min qablu samiyyā(n).",
    "translation_en": "[He was told], \"O Zechariah, indeed We give you good tidings of a boy whose name will be John. We have not assigned to any before [this] name.\"",
    "translation_id": "(Allah berfirman,) “Wahai Zakaria, Kami memberi kabar gembira kepadamu dengan seorang anak laki-laki yang bernama Yahya yang nama itu tidak pernah Kami berikan sebelumnya.”"
  },
  {
    "ayat": 8,
    "arabic": "قَالَ رَبِّ اَنّٰى يَكُوْنُ لِيْ غُلٰمٌ وَّكَانَتِ امْرَاَتِيْ عَاقِرًا وَّقَدْ بَلَغْتُ مِنَ الْكِبَرِ عِتِيًّا",
    "transliteration_en": "Qaala Rabbi annaa yakoonu lee ghulaamunw wa kaanatim ra atee aaqiranw wa qad balaghtu minal kibari 'itiyyaa",
    "transliteration_id": "Qāla rabbi annā yakūnu lī gulāmuw wa kānatimra'atī ‘āqiraw wa qad balagtu minal-kibari ‘itiyyā(n).",
    "translation_en": "He said, \"My Lord, how will I have a boy when my wife has been barren and I have reached extreme old age?\"",
    "translation_id": "Dia (Zakaria) berkata, “Wahai Tuhanku, bagaimana (mungkin) aku akan mempunyai anak, sedangkan istriku seorang yang mandul dan sungguh aku sudah mencapai usia yang sangat tua?”"
  },
  {
    "ayat": 9,
    "arabic": "قَالَ كَذٰلِكَۗ قَالَ رَبُّكَ هُوَ عَلَيَّ هَيِّنٌ وَّقَدْ خَلَقْتُكَ مِنْ قَبْلُ وَلَمْ تَكُ شَيْـًٔا",
    "transliteration_en": "Qaala kazaalika qaala Rabbuka huwa 'alaiya haiyinunw wa qad khalaqtuka min qablu wa lam taku shai'aa",
    "transliteration_id": "Qāla każālik(a), qāla rabbuka huwa ‘alayya hayyinuw wa qad khalaqtuka min qablu wa lam taku syai'ā(n).",
    "translation_en": "[An angel] said, \"Thus [it will be]; your Lord says, 'It is easy for Me, for I created you before, while you were nothing.' \"",
    "translation_id": "Dia (Allah) berfirman, ”Demikianlah.” Tuhanmu berfirman, ”Hal itu mudah bagi-Ku; sungguh, engkau telah Aku ciptakan sebelum itu, padahal (pada waktu itu) engkau belum berwujud sama sekali.”"
  },
  {
    "ayat": 10,
    "arabic": "قَالَ رَبِّ اجْعَلْ لِّيْٓ اٰيَةً ۗقَالَ اٰيَتُكَ اَلَّا تُكَلِّمَ النَّاسَ ثَلٰثَ لَيَالٍ سَوِيًّا",
    "transliteration_en": "Qaala Rabbij 'al leee Aayah; qaala Aayatuka allaa tukalliman naasa salaasa layaalin sawiyyaa",
    "transliteration_id": "Qāla rabbij‘al lī āyah(tan), qāla āyatuka allā tukalliman-nāsa  ṡalāṡa layālin sawiyyā(n).",
    "translation_en": "[Zechariah] said, \"My Lord, make for me a sign.\" He said, \"Your sign is that you will not speak to the people for three nights, [being] sound.\"",
    "translation_id": "Dia (Zakaria) berkata, “Wahai Tuhanku, berilah aku suatu tanda.” (Allah) berfirman, “Tandanya bagimu ialah bahwa engkau tidak dapat bercakap-cakap dengan manusia selama (tiga hari) tiga malam, padahal engkau sehat.”"
  },
  {
    "ayat": 11,
    "arabic": "فَخَرَجَ عَلٰى قَوْمِهٖ مِنَ الْمِحْرَابِ فَاَوْحٰٓى اِلَيْهِمْ اَنْ سَبِّحُوْا بُكْرَةً وَّعَشِيًّا",
    "transliteration_en": "Fakharaja 'alaa qawmihee minal mihraabi fa-awhaaa ilaihim an sabbihoo bukratanw wa 'ashiyyaa",
    "transliteration_id": "Fa kharaja ‘alā qaumihī minal-miḥrābi fa auḥā ilaihim an sabbiḥū bukrataw wa ‘asyiyyā(n).",
    "translation_en": "So he came out to his people from the prayer chamber and signaled to them to exalt [Allah] in the morning and afternoon.",
    "translation_id": "Lalu, (Zakaria) keluar dari mihrab menuju kaumnya lalu dia memberi isyarat kepada mereka agar bertasbihlah kamu pada waktu pagi dan petang."
  },
  {
    "ayat": 12,
    "arabic": "يٰيَحْيٰى خُذِ الْكِتٰبَ بِقُوَّةٍ ۗوَاٰتَيْنٰهُ الْحُكْمَ صَبِيًّاۙ",
    "transliteration_en": "Yaa Yahyaa khuzil Kitaaba biquwwatinw wa aatainaahul hukma saiyyaa",
    "transliteration_id": "Yā yaḥyā khużil-kitāba biquwwah(tin), wa ātaināhul-ḥukma ṣabiyyā(n).",
    "translation_en": "[Allah] said, \"O John, take the Scripture with determination.\" And We gave him judgement [while yet] a boy",
    "translation_id": "(Allah berfirman,) “Wahai Yahya, ambillah (pelajarilah) Kitab (Taurat) itu dengan sungguh-sungguh.” Kami menganugerahkan hikmah kepadanya (Yahya) selagi dia masih kanak-kanak."
  },
  {
    "ayat": 13,
    "arabic": "وَّحَنَانًا مِّنْ لَّدُنَّا وَزَكٰوةً ۗوَكَانَ تَقِيًّا ۙ",
    "transliteration_en": "Wa hanaanam mil ladunnaa wa zakaatanw wa kaana taqiyyaa",
    "transliteration_id": "Wa ḥanānam mil ladunnā wa zakāh(tan), wa kāna taqiyyā(n).",
    "translation_en": "And affection from Us and purity, and he was fearing of Allah",
    "translation_id": "(Kami anugerahkan juga kepadanya) rasa kasih sayang (kepada sesama) dari Kami dan bersih (dari dosa). Dia pun adalah seorang yang bertakwa."
  },
  {
    "ayat": 14,
    "arabic": "وَّبَرًّاۢ بِوَالِدَيْهِ وَلَمْ يَكُنْ جَبَّارًا عَصِيًّا",
    "transliteration_en": "Wa barram biwaalidayhi wa lam yakum jabbaaran 'asiyyaa",
    "transliteration_id": "Wa barram biwālidaihi wa lam yakun jabbāran ‘aṣiyyā(n).",
    "translation_en": "And dutiful to his parents, and he was not a disobedient tyrant.",
    "translation_id": "(Dia) orang yang berbakti kepada kedua orang tuanya dan dia bukan orang yang sombong lagi durhaka."
  },
  {
    "ayat": 15,
    "arabic": "وَسَلٰمٌ عَلَيْهِ يَوْمَ وُلِدَ وَيَوْمَ يَمُوْتُ وَيَوْمَ يُبْعَثُ حَيًّا ࣖ",
    "transliteration_en": "Wa salaamun 'alaihi yawma wulida wa yawma yamootu wa yawma yub'asu haiyaa",
    "transliteration_id": "Wa salāmun ‘alaihi yauma wulida wa yauma yamūtu wa yauma yub‘aṡu ḥayyā(n).",
    "translation_en": "And peace be upon him the day he was born and the day he dies and the day he is raised alive.",
    "translation_id": "Kesejahteraan baginya (Yahya) pada hari dia dilahirkan, hari dia wafat, dan hari dia dibangkitkan hidup kembali."
  },
  {
    "ayat": 16,
    "arabic": "وَاذْكُرْ فِى الْكِتٰبِ مَرْيَمَۘ اِذِ انْتَبَذَتْ مِنْ اَهْلِهَا مَكَانًا شَرْقِيًّا ۙ",
    "transliteration_en": "Wazkur fil Kitaabi Marya; izin tabazat min ahlihaa makaanan shariqyyaa",
    "transliteration_id": "Ważkur fil-kitābi maryam(a), iżintabażat min ahlihā makānan syarqiyyā(n).",
    "translation_en": "And mention, [O Muhammad], in the Book [the story of] Mary, when she withdrew from her family to a place toward the east.",
    "translation_id": "Ceritakanlah (Nabi Muhammad) kisah Maryam di dalam Kitab (Al-Qur’an), (yaitu) ketika dia mengasingkan diri dari keluarganya ke suatu tempat di sebelah timur (Baitulmaqdis)."
  },
  {
    "ayat": 17,
    "arabic": "فَاتَّخَذَتْ مِنْ دُوْنِهِمْ حِجَابًاۗ فَاَرْسَلْنَآ اِلَيْهَا رُوْحَنَا فَتَمَثَّلَ لَهَا بَشَرًا سَوِيًّا",
    "transliteration_en": "Fattakhazat min doonihim hijaaban fa arsalnaaa ilaihaa roohanaa fatamassala lahaa basharan sawiyyaa",
    "transliteration_id": "Fattakhażat min dūnihim ḥijābā(n), fa arsalnā ilaihā rūḥanā fa tamaṡṡala lahā basyaran sawiyyā(n).",
    "translation_en": "And she took, in seclusion from them, a screen. Then We sent to her Our Angel, and he represented himself to her as a well-proportioned man.",
    "translation_id": "Dia (Maryam) memasang tabir (yang melindunginya) dari mereka. Lalu, Kami mengutus roh Kami (Jibril) kepadanya, kemudian dia menampakkan diri di hadapannya dalam bentuk manusia yang sempurna."
  },
  {
    "ayat": 18,
    "arabic": "قَالَتْ اِنِّيْٓ اَعُوْذُ بِالرَّحْمٰنِ مِنْكَ اِنْ كُنْتَ تَقِيًّا",
    "transliteration_en": "Qaalat inneee a'oozu bir Rahmaani minka in kunta taqiyyaa",
    "transliteration_id": "Qālat innī a‘ūżu bir-raḥmāni minka in kunta taqiyyā(n).",
    "translation_en": "She said, \"Indeed, I seek refuge in the Most Merciful from you, [so leave me], if you should be fearing of Allah.\"",
    "translation_id": "Dia (Maryam) berkata (kepadanya), “Sesungguhnya aku berlindung kepada Tuhan Yang Maha Pengasih darimu (untuk berbuat jahat kepadaku) jika kamu seorang yang bertakwa.”"
  },
  {
    "ayat": 19,
    "arabic": "قَالَ اِنَّمَآ اَنَا۠ رَسُوْلُ رَبِّكِۖ لِاَهَبَ لَكِ غُلٰمًا زَكِيًّا",
    "transliteration_en": "Qaala innamaa ana rasoolu Rabbiki li ahaba laki ghulaaman zakiyyaa",
    "transliteration_id": "Qāla innamā ana rasūlu rabbik(a), li'ahaba laki gulāman zakiyyā(n).",
    "translation_en": "He said, \"I am only the messenger of your Lord to give you [news of] a pure boy.\"",
    "translation_id": "Dia (Jibril) berkata, “Sesungguhnya aku hanyalah utusan Tuhanmu untuk memberikan anugerah seorang anak laki-laki yang suci kepadamu.”"
  },
  {
    "ayat": 20,
    "arabic": "قَالَتْ اَنّٰى يَكُوْنُ لِيْ غُلٰمٌ وَّلَمْ يَمْسَسْنِيْ بَشَرٌ وَّلَمْ اَكُ بَغِيًّا",
    "transliteration_en": "Qaalat anna yakoonu lee ghulaamunw wa lam yamsasnee bashrunw wa lam aku baghiyyaa",
    "transliteration_id": "Qālat annā yakūnu lī gulāmuw wa lam yamsasnī basyaruw wa lam aku bagiyyā(n).",
    "translation_en": "She said, \"How can I have a boy while no man has touched me and I have not been unchaste?\"",
    "translation_id": "Dia (Maryam) berkata, “Bagaimana (mungkin) aku mempunyai anak laki-laki, padahal tidak pernah ada seorang (laki-laki) pun yang menyentuhku dan aku bukan seorang pelacur?”"
  },
  {
    "ayat": 21,
    "arabic": "قَالَ كَذٰلِكِۚ قَالَ رَبُّكِ هُوَ عَلَيَّ هَيِّنٌۚ وَلِنَجْعَلَهٗٓ اٰيَةً لِّلنَّاسِ وَرَحْمَةً مِّنَّاۚ وَكَانَ اَمْرًا مَّقْضِيًّا",
    "transliteration_en": "Qaala kazaaliki qaala Rabbuki huwa 'alaiya yaiyimunw wa linaj 'alahooo Aayatal linnaasi wa rahmatam minnaa; wa kaana amram maqdiyyaa",
    "transliteration_id": "Qāla każālik(a), qāla rabbuka huwa ‘alayya hayyin(un), wa linaj‘alahū āyatal lin-nāsi wa raḥmatam minnā, wa kāna amram maqḍiyyā(n).",
    "translation_en": "He said, \"Thus [it will be]; your Lord says, 'It is easy for Me, and We will make him a sign to the people and a mercy from Us. And it is a matter [already] decreed.' \"",
    "translation_id": "Dia (Jibril) berkata, “Demikianlah.” Tuhanmu berfirman, “Hal itu sangat mudah bagi-Ku dan agar Kami menjadikannya sebagai tanda (kebesaran-Ku) bagi manusia dan rahmat dari Kami. Hal itu adalah suatu urusan yang (sudah) diputuskan.”"
  },
  {
    "ayat": 22,
    "arabic": "۞ فَحَمَلَتْهُ فَانْتَبَذَتْ بِهٖ مَكَانًا قَصِيًّا",
    "transliteration_en": "Fahamalat hu fantabazat bihee makaanan qasiyyaa",
    "transliteration_id": "Fa ḥamalathu fantabażat bihī makānan qaṣiyyā(n).",
    "translation_en": "So she conceived him, and she withdrew with him to a remote place.",
    "translation_id": "Maka, dia (Maryam) mengandungnya, lalu mengasingkan diri bersamanya ke tempat yang jauh."
  },
  {
    "ayat": 23,
    "arabic": "فَاَجَاۤءَهَا الْمَخَاضُ اِلٰى جِذْعِ النَّخْلَةِۚ قَالَتْ يٰلَيْتَنِيْ مِتُّ قَبْلَ هٰذَا وَكُنْتُ نَسْيًا مَّنْسِيًّا",
    "transliteration_en": "Fa ajaaa 'ahal makhaadu ilaa jiz'in nakhlati qaalat yaa laitanee mittu qabla haazaa wa kuntu nasyam mansiyyaa",
    "transliteration_id": "Fa ajā'ahal-makhāḍu ilā jiz‘in nakhlah(ti), qālat yā laitanī mittu qabla hāżā wa kuntu nas-yam mansiyyā(n).",
    "translation_en": "And the pains of childbirth drove her to the trunk of a palm tree. She said, \"Oh, I wish I had died before this and was in oblivion, forgotten.\"",
    "translation_id": "Rasa sakit akan melahirkan memaksanya (bersandar) pada pangkal pohon kurma. Dia (Maryam) berkata, “Oh, seandainya aku mati sebelum ini dan menjadi seorang yang tidak diperhatikan dan dilupakan (selama-lamanya).”"
  },
  {
    "ayat": 24,
    "arabic": "فَنَادٰىهَا مِنْ تَحْتِهَآ اَلَّا تَحْزَنِيْ قَدْ جَعَلَ رَبُّكِ تَحْتَكِ سَرِيًّا",
    "transliteration_en": "Fanaadaahaa min tahtihaan allaa tahzanee qad ja'ala Rabbuki tahtaki sariyyaa",
    "transliteration_id": "Fa nādāhā min taḥtihā allā taḥzanī qad ja‘ala rabbuki taḥtaki sariyyā(n).",
    "translation_en": "But he called her from below her, \"Do not grieve; your Lord has provided beneath you a stream.",
    "translation_id": "Dia (Jibril) berseru kepadanya dari tempat yang rendah, “Janganlah engkau bersedih. Sungguh, Tuhanmu telah menjadikan anak sungai di bawahmu."
  },
  {
    "ayat": 25,
    "arabic": "وَهُزِّيْٓ اِلَيْكِ بِجِذْعِ النَّخْلَةِ تُسٰقِطْ عَلَيْكِ رُطَبًا جَنِيًّا ۖ",
    "transliteration_en": "Wa huzzeee ilaiki bijiz 'in nakhlati tusaaqit 'alaiki rutaban janiyyaa",
    "transliteration_id": "Wa huzzī ilaiki bijiz‘in-nakhlati tusāqiṭ ‘alaiki ruṭaban janiyyā(n).",
    "translation_en": "And shake toward you the trunk of the palm tree; it will drop upon you ripe, fresh dates.",
    "translation_id": "Goyanglah pangkal pohon kurma itu ke arahmu, niscaya (pohon) itu akan menjatuhkan buah kurma yang masak kepadamu."
  },
  {
    "ayat": 26,
    "arabic": "فَكُلِيْ وَاشْرَبِيْ وَقَرِّيْ عَيْنًا ۚفَاِمَّا تَرَيِنَّ مِنَ الْبَشَرِ اَحَدًاۙ فَقُوْلِيْٓ اِنِّيْ نَذَرْتُ لِلرَّحْمٰنِ صَوْمًا فَلَنْ اُكَلِّمَ الْيَوْمَ اِنْسِيًّا ۚ",
    "transliteration_en": "Fakulee washrabee wa qarree 'ainaa; fa immaa tarayinnna minal bashari ahadan faqooleee innee nazartu lir Rahmaani sawman falan ukallimal yawma insiyyaa",
    "transliteration_id": "Fa kulī wasyrabī wa qarrī ‘ainā(n), fa immā tarayinna minal-basyari aḥadā(n), fa qūlī innī nażartu lir-raḥmāni ṣauman falan ukallimal-yauma insiyyā(n).",
    "translation_en": "So eat and drink and be contented. And if you see from among humanity anyone, say, 'Indeed, I have vowed to the Most Merciful abstention, so I will not speak today to [any] man.' \"",
    "translation_id": "Makan, minum, dan bersukacitalah engkau. Jika engkau melihat seseorang, katakanlah, ‘Sesungguhnya aku telah bernazar puasa (bicara) untuk Tuhan Yang Maha Pengasih. Oleh karena itu, aku tidak akan berbicara dengan siapa pun pada hari ini.’”"
  },
  {
    "ayat": 27,
    "arabic": "فَاَتَتْ بِهٖ قَوْمَهَا تَحْمِلُهٗ ۗقَالُوْا يٰمَرْيَمُ لَقَدْ جِئْتِ شَيْـًٔا فَرِيًّا",
    "transliteration_en": "Fa atat bihee qawmahaa tahmiluhoo qaaloo yaa Maryamoo laqad ji'ti shai'an fariyyaa",
    "transliteration_id": "Fa atat bihī qaumahā taḥmiluh(ū), qālū yā maryamu laqad ji'ti syai'an fariyyā(n).",
    "translation_en": "Then she brought him to her people, carrying him. They said, \"O Mary, you have certainly done a thing unprecedented.",
    "translation_id": "Dia (Maryam) membawa dia (bayi itu) kepada kaumnya dengan menggendongnya. Mereka (kaumnya) berkata, “Wahai Maryam, sungguh, engkau benar-benar telah membawa sesuatu yang sangat mungkar."
  },
  {
    "ayat": 28,
    "arabic": "يٰٓاُخْتَ هٰرُوْنَ مَا كَانَ اَبُوْكِ امْرَاَ سَوْءٍ وَّمَا كَانَتْ اُمُّكِ بَغِيًّا ۖ",
    "transliteration_en": "Yaaa ukkhta Haaroona maa kaana abokim ra-a saw'inw wa maa kaanat ummuki baghiyyaa",
    "transliteration_id": "Yā ukhta hārūna kāna abūkimra'a sau'iw wa mā kānat ummuki bagiyyā(n).",
    "translation_en": "O sister of Aaron, your father was not a man of evil, nor was your mother unchaste.\"",
    "translation_id": "Wahai saudara perempuan Harun (Maryam), ayahmu bukan seorang yang berperangai buruk dan ibumu bukan seorang perempuan pezina.”"
  },
  {
    "ayat": 29,
    "arabic": "فَاَشَارَتْ اِلَيْهِۗ قَالُوْا كَيْفَ نُكَلِّمُ مَنْ كَانَ فِى الْمَهْدِ صَبِيًّا",
    "transliteration_en": "Fa ashaarat ilaih; qaaloo kaifa nukallimu man kaana fil mahdi sabiyyaa",
    "transliteration_id": "Fa asyārat ilaīh(i), qālū kaifa nukallimu man kāna fil-mahdi ṣabiyyā(n).",
    "translation_en": "So she pointed to him. They said, \"How can we speak to one who is in the cradle a child?\"",
    "translation_id": "Dia (Maryam) menunjuk kepada (bayi)-nya (agar mereka bertanya kepadanya). Mereka berkata, “Bagaimana mungkin kami akan berbicara dengan anak kecil yang masih dalam ayunan?”"
  },
  {
    "ayat": 30,
    "arabic": "قَالَ اِنِّيْ عَبْدُ اللّٰهِ ۗاٰتٰىنِيَ الْكِتٰبَ وَجَعَلَنِيْ نَبِيًّا ۙ",
    "transliteration_en": "Qaala innee 'abdullaahi aataaniyal Kitaaba wa ja'alanee Nabiyyaa",
    "transliteration_id": "Qāla innī ‘abdullāh(i), ātāniyal-kitāba wa ja‘alanī nabiyyā(n).",
    "translation_en": "[Jesus] said, \"Indeed, I am the servant of Allah. He has given me the Scripture and made me a prophet.",
    "translation_id": "Dia (Isa) berkata, “Sesungguhnya aku hamba Allah. Dia (akan) memberiku Kitab (Injil) dan menjadikan aku seorang nabi."
  },
  {
    "ayat": 31,
    "arabic": "وَّجَعَلَنِيْ مُبٰرَكًا اَيْنَ مَا كُنْتُۖ وَاَوْصٰنِيْ بِالصَّلٰوةِ وَالزَّكٰوةِ مَا دُمْتُ حَيًّا ۖ",
    "transliteration_en": "Wa ja'alanee mubaarakan aina maa kuntu wa awsaanee bis Salaati waz Zakaati maa dumtu haiyaa",
    "transliteration_id": "Wa ja‘alanī mubārakan aina mā kunt(u), wa auṣānī biṣ-ṣalāti waz-zakāti mā dumtu ḥayyā(n).",
    "translation_en": "And He has made me blessed wherever I am and has enjoined upon me prayer and zakah as long as I remain alive",
    "translation_id": "Dia menjadikan aku seorang yang diberkahi di mana saja aku berada dan memerintahkan kepadaku (untuk melaksanakan) salat serta (menunaikan) zakat sepanjang hayatku,"
  },
  {
    "ayat": 32,
    "arabic": "وَّبَرًّاۢ بِوَالِدَتِيْ وَلَمْ يَجْعَلْنِيْ جَبَّارًا شَقِيًّا",
    "transliteration_en": "Wa barram biwaalidatee wa lam yaj'alnee jabbaaran shaqiyyaa",
    "transliteration_id": "Wa barram biwālidatī wa lam yaj‘alnī jabbāran syaqiyyā(n).",
    "translation_en": "And [made me] dutiful to my mother, and He has not made me a wretched tyrant.",
    "translation_id": "dan berbakti kepada ibuku serta Dia tidak menjadikanku orang yang sombong lagi celaka."
  },
  {
    "ayat": 33,
    "arabic": "وَالسَّلٰمُ عَلَيَّ يَوْمَ وُلِدْتُّ وَيَوْمَ اَمُوْتُ وَيَوْمَ اُبْعَثُ حَيًّا",
    "transliteration_en": "Wassalaamu 'alaiya yawma wulittu wa yawma amootu wa yawma ub'asu baiyaa",
    "transliteration_id": "Was-salāmu ‘alayya yauma wulittu wa yauma amūtu wa yauma ub‘aṡu ḥayyā(n).",
    "translation_en": "And peace is on me the day I was born and the day I will die and the day I am raised alive.\"",
    "translation_id": "Kesejahteraan semoga dilimpahkan kepadaku pada hari kelahiranku, hari wafatku, dan hari aku dibangkitkan hidup (kembali).”"
  },
  {
    "ayat": 34,
    "arabic": "ذٰلِكَ عِيْسَى ابْنُ مَرْيَمَ ۚقَوْلَ الْحَقِّ الَّذِيْ فِيْهِ يَمْتَرُوْنَ",
    "transliteration_en": "Zaalika 'Eesab-nu Marya; qawlal haqqil lazee feehi yamtaroon",
    "transliteration_id": "Żālika ‘īsabnu maryam(a), qaulal-ḥaqqil-lażī fīhi yamtarūn(a).",
    "translation_en": "That is Jesus, the son of Mary - the word of truth about which they are in dispute.",
    "translation_id": "Itulah (hakikat) Isa putra Maryam, perkataan benar yang mereka ragukan."
  },
  {
    "ayat": 35,
    "arabic": "مَا كَانَ لِلّٰهِ اَنْ يَّتَّخِذَ مِنْ وَّلَدٍ سُبْحٰنَهٗ ۗاِذَا قَضٰٓى اَمْرًا فَاِنَّمَا يَقُوْلُ لَهٗ كُنْ فَيَكُوْنُ ۗ",
    "transliteration_en": "Maa kaana lillaahi ai yattakhiza minw waladin Subhaanah; izaa qadaaa amran fa innamaa yaqoolu lahoo kun fa yakoon",
    "transliteration_id": "Mā kāna lillāhi ay yattakhiża miw waladin subḥānah(ū), iżā qaḍā amran fa innamā yaqūlu lahū kun fa yakūn(u).",
    "translation_en": "It is not [befitting] for Allah to take a son; exalted is He! When He decrees an affair, He only says to it, \"Be,\" and it is.",
    "translation_id": "Tidak patut bagi Allah mempunyai anak. Maha Suci Dia. Apabila hendak menetapkan sesuatu, Dia hanya berkata kepadanya, “Jadilah!” Maka, jadilah sesuatu itu."
  },
  {
    "ayat": 36,
    "arabic": "وَاِنَّ اللّٰهَ رَبِّيْ وَرَبُّكُمْ فَاعْبُدُوْهُ ۗهٰذَا صِرَاطٌ مُّسْتَقِيْمٌ",
    "transliteration_en": "Wa innal laaha Rabbee wa Rabbukum fa'budooh; haazaa Siraatum Mustaqeem",
    "transliteration_id": "Wa innallāha rabbī wa rabbukum fa‘budūh(u), hāżā ṣirāṭum mustaqīm(un).",
    "translation_en": "[Jesus said], \"And indeed, Allah is my Lord and your Lord, so worship Him. That is a straight path.\"",
    "translation_id": "(Isa berkata,) “Sesungguhnya Allah itu Tuhanku dan Tuhanmu. Sembahlah Dia! Ini adalah jalan yang lurus.”"
  },
  {
    "ayat": 37,
    "arabic": "فَاخْتَلَفَ الْاَحْزَابُ مِنْۢ بَيْنِهِمْۚ فَوَيْلٌ لِّلَّذِيْنَ كَفَرُوْا مِنْ مَّشْهَدِ يَوْمٍ عَظِيْمٍ",
    "transliteration_en": "Fakhtalafal ahzaabu mim bainihim fawailul lillazeena kafaroo mim mashhadi Yawmin 'azeem",
    "transliteration_id": "Fakhtalafal-aḥzābu mim bainihim, fa wailul lil-lażīna kafarū mim masyhadi yaumin ‘aẓīm(in).",
    "translation_en": "Then the factions differed [concerning Jesus] from among them, so woe to those who disbelieved - from the scene of a tremendous Day.",
    "translation_id": "Golongan-golongan di antara mereka (Yahudi dan Nasrani) berselisih. Celakalah orang-orang yang kufur pada waktu menyaksikan hari yang sangat agung!"
  },
  {
    "ayat": 38,
    "arabic": "اَسْمِعْ بِهِمْ وَاَبْصِرْۙ يَوْمَ يَأْتُوْنَنَا لٰكِنِ الظّٰلِمُوْنَ الْيَوْمَ فِيْ ضَلٰلٍ مُّبِيْنٍ",
    "transliteration_en": "Asmi' bihim wa absir Yawma yaatoonanaa laakiniz zaalimoonal yawma fee dalaalim mubeen",
    "transliteration_id": "Asmi‘ bihim wa abṣir, yauma ya'tūnanā lākiniẓ-ẓālimūnal-yauma fī ḍalālim mubīn(in).",
    "translation_en": "How [clearly] they will hear and see the Day they come to Us, but the wrongdoers today are in clear error.",
    "translation_id": "Alangkah tajam pendengaran dan penglihatan mereka pada hari mereka datang kepada Kami (di akhirat)! Akan tetapi, orang-orang zalim pada hari ini (di dunia) berada dalam kesesatan yang nyata."
  },
  {
    "ayat": 39,
    "arabic": "وَاَنْذِرْهُمْ يَوْمَ الْحَسْرَةِ اِذْ قُضِيَ الْاَمْرُۘ وَهُمْ فِيْ غَفْلَةٍ وَّهُمْ لَا يُؤْمِنُوْنَ",
    "transliteration_en": "Wa anzirhum Yawmal hasrati iz qudiyal amr; wa hum fee ghaflatinw wa hum laa yu'minoon",
    "transliteration_id": "Wa anżirhum yaumal-ḥasrati  iż quḍiyal-amr(u), wa hum fī gaflatiw wa hum lā yu'minūn(a).",
    "translation_en": "And warn them, [O Muhammad], of the Day of Regret, when the matter will be concluded; and [yet], they are in [a state of] heedlessness, and they do not believe.",
    "translation_id": "Berilah mereka peringatan tentang hari penyesalan ketika segala perkara telah diputus, sedangkan mereka dalam kelalaian dan mereka tidak beriman."
  },
  {
    "ayat": 40,
    "arabic": "اِنَّا نَحْنُ نَرِثُ الْاَرْضَ وَمَنْ عَلَيْهَا وَاِلَيْنَا يُرْجَعُوْنَ ࣖ",
    "transliteration_en": "Innaa NNahnu narisul arda wa man 'alaihaa wa ilainaa yurja'oon",
    "transliteration_id": "Innā naḥnu nariṡul-arḍa wa man ‘alaihā wa ilainā yurja‘ūn(a).",
    "translation_en": "Indeed, it is We who will inherit the earth and whoever is on it, and to Us they will be returned.",
    "translation_id": "Sesungguhnya Kamilah yang mewarisi bumi beserta semua yang ada di atasnya dan hanya kepada Kamilah mereka dikembalikan."
  },
  {
    "ayat": 41,
    "arabic": "وَاذْكُرْ فِى الْكِتٰبِ اِبْرٰهِيْمَ ەۗ اِنَّهٗ كَانَ صِدِّيْقًا نَّبِيًّا",
    "transliteration_en": "Wazkur fil Kitaabi Ibraaheem; innahoo kaana siddeeqan Nabiyyaa",
    "transliteration_id": "Ważkur fil-kitābi ibrāhīm(a), innahū kāna ṣiddīqan nabiyyā(n).",
    "translation_en": "And mention in the Book [the story of] Abraham. Indeed, he was a man of truth and a prophet.",
    "translation_id": "Ceritakanlah (Nabi Muhammad, kisah) Ibrahim di dalam Kitab (Al-Qur’an)! Sesungguhnya dia adalah seorang yang sangat benar dan membenarkan lagi seorang nabi."
  },
  {
    "ayat": 42,
    "arabic": "اِذْ قَالَ لِاَبِيْهِ يٰٓاَبَتِ لِمَ تَعْبُدُ مَا لَا يَسْمَعُ وَلَا يُبْصِرُ وَلَا يُغْنِيْ عَنْكَ شَيْـًٔا",
    "transliteration_en": "Iz qaala li abeehi yaaa abati lima ta'budu maa laa yasma'u wa laa yubsiru wa laa yughnee 'anka shai'aa",
    "transliteration_id": "Iż qāla li'abīhi yā abati lima ta‘budu mā lā yasma‘u wa lā yubṣiru wa lā yugnī ‘anka syai'ā(n).",
    "translation_en": "[Mention] when he said to his father, \"O my father, why do you worship that which does not hear and does not see and will not benefit you at all?",
    "translation_id": "Ketika dia (Ibrahim) berkata kepada bapaknya, “Wahai Bapakku, mengapa engkau menyembah sesuatu yang tidak mendengar, tidak melihat, dan tidak pula bermanfaat kepadamu sedikit pun?"
  },
  {
    "ayat": 43,
    "arabic": "يٰٓاَبَتِ اِنِّيْ قَدْ جَاۤءَنِيْ مِنَ الْعِلْمِ مَا لَمْ يَأْتِكَ فَاتَّبِعْنِيْٓ اَهْدِكَ صِرَاطًا سَوِيًّا",
    "transliteration_en": "Yaaa abati innee qad jaaa'anee minal 'ilmi maa lam yaatika fattabi'neee ahdika siraatan Sawiyyaa",
    "transliteration_id": "Yā abati innī qad jā'anī minal-‘ilmi mā lam ya'tika fattabi‘nī ahdika ṣirāṭan sawiyyā(n).",
    "translation_en": "O my father, indeed there has come to me of knowledge that which has not come to you, so follow me; I will guide you to an even path.",
    "translation_id": "Wahai Bapakku, sesungguhnya telah datang kepadaku sebagian ilmu yang tidak datang kepadamu. Ikutilah aku, niscaya aku tunjukkan kepadamu jalan yang lurus."
  },
  {
    "ayat": 44,
    "arabic": "يٰٓاَبَتِ لَا تَعْبُدِ الشَّيْطٰنَۗ اِنَّ الشَّيْطٰنَ كَانَ لِلرَّحْمٰنِ عَصِيًّا",
    "transliteration_en": "Yaaa abati laa ta'budish Shaitaana innash Shaitaana kaana lir Rahmaani 'asiyyaa",
    "transliteration_id": "Yā abati lā ta‘budisy-syaiṭān(a), innasy-syaiṭāna kāna lir-raḥmāni ‘aṣiyyā(n).",
    "translation_en": "O my father, do not worship Satan. Indeed Satan has ever been, to the Most Merciful, disobedient.",
    "translation_id": "Wahai Bapakku, janganlah menyembah setan! Sesungguhnya setan itu sangat durhaka kepada Tuhan Yang Maha Pemurah."
  },
  {
    "ayat": 45,
    "arabic": "يٰٓاَبَتِ اِنِّيْٓ اَخَافُ اَنْ يَّمَسَّكَ عَذَابٌ مِّنَ الرَّحْمٰنِ فَتَكُوْنَ لِلشَّيْطٰنِ وَلِيًّا",
    "transliteration_en": "Yaaa abati innee akhaafu ai yamssaka 'azaabum minar Rahmaani fatakoona lish Shaitaani waliyyaa",
    "transliteration_id": "Yā abati innī akhāfu ay yamassaka ‘ażābum minar-raḥmāni fa takūna lisy-syaiṭāni waliyyā(n).",
    "translation_en": "O my father, indeed I fear that there will touch you a punishment from the Most Merciful so you would be to Satan a companion [in Hellfire].\"",
    "translation_id": "Wahai Bapakku, sesungguhnya aku takut azab dari (Tuhan) Yang Maha Pemurah menimpamu sehingga engkau menjadi teman setan.”"
  },
  {
    "ayat": 46,
    "arabic": "قَالَ اَرَاغِبٌ اَنْتَ عَنْ اٰلِهَتِيْ يٰٓاِبْرٰهِيْمُ ۚ لَىِٕنْ لَّمْ تَنْتَهِ لَاَرْجُمَنَّكَ وَاهْجُرْنِيْ مَلِيًّا",
    "transliteration_en": "Qaala araaghibun anta 'an aalihatee yaaa Ibraaheemu la 'il lam tantahi la arjumannaka wahjumee maliyyaa",
    "transliteration_id": "Qāla arāgibun anta ‘an ālihatī yā ibrāhīm(u), la'illam tantahi la'arjumannaka wahjurnī maliyyā(n).",
    "translation_en": "[His father] said, \"Have you no desire for my gods, O Abraham? If you do not desist, I will surely stone you, so avoid me a prolonged time.\"",
    "translation_id": "Dia (bapaknya) berkata, “Apakah kamu membenci tuhan-tuhanku, wahai Ibrahim? Jika tidak berhenti (mencela tuhan yang kusembah), engkau pasti akan kurajam. Tinggalkanlah aku untuk waktu yang lama.”"
  },
  {
    "ayat": 47,
    "arabic": "قَالَ سَلٰمٌ عَلَيْكَۚ سَاَسْتَغْفِرُ لَكَ رَبِّيْۗ اِنَّهٗ كَانَ بِيْ حَفِيًّا",
    "transliteration_en": "Qaala salaamun 'alaika sa astaghfiru laka Rabbeee innahoo kaana bee hafiyyaa",
    "transliteration_id": "Qāla salāmun ‘alaik(a), sa'astagfiru laka rabbī, innahū kāna bī ḥafiyyā(n).",
    "translation_en": "[Abraham] said, \"Peace will be upon you. I will ask forgiveness for you of my Lord. Indeed, He is ever gracious to me.",
    "translation_id": "Dia (Ibrahim) berkata, “Semoga keselamatan bagimu. Aku akan memohonkan ampunan bagimu kepada Tuhanku. Sesungguhnya Dia Maha Baik kepadaku."
  },
  {
    "ayat": 48,
    "arabic": "وَاَعْتَزِلُكُمْ وَمَا تَدْعُوْنَ مِنْ دُوْنِ اللّٰهِ وَاَدْعُوْا رَبِّيْۖ عَسٰٓى اَلَّآ اَكُوْنَ بِدُعَاۤءِ رَبِّيْ شَقِيًّا",
    "transliteration_en": "Wa a'tazilukum wa maa tad'oona min doonil laahi wa ad'o Rabbee 'asaaa allaaa akoona bidu'aaa'i Rabbee shaqiyyaa",
    "transliteration_id": "Wa a‘tazilukum wa mā tad‘ūna min dūnillāhi wa ad‘ū rabbī, ‘asā allā akūna bidu‘ā'i rabbī syaqiyyā(n).",
    "translation_en": "And I will leave you and those you invoke other than Allah and will invoke my Lord. I expect that I will not be in invocation to my Lord unhappy.\"",
    "translation_id": "Aku akan menjauh darimu dan apa yang engkau sembah selain Allah. Aku akan berdoa kepada Tuhanku semoga aku tidak kecewa dengan doaku kepada Tuhanku.”"
  },
  {
    "ayat": 49,
    "arabic": "فَلَمَّا اعْتَزَلَهُمْ وَمَا يَعْبُدُوْنَ مِنْ دُوْنِ اللّٰهِ ۙوَهَبْنَا لَهٗٓ اِسْحٰقَ وَيَعْقُوْبَۗ وَكُلًّا جَعَلْنَا نَبِيًّا",
    "transliteration_en": "Falamma' tazalahum wa maa ya'budoona min doonil laahi wahabnaa lahoo is-haaqa wa ya'qoob, wa kullan ja'alnaa Nabiyyaa",
    "transliteration_id": "Falamma‘tazalahum wa mā ya‘budūna min dūnillāh(i), wahabnā lahū isḥāqa wa ya‘qūb(a),  wa kullan ja‘alnā nabiyyā(n).",
    "translation_en": "So when he had left them and those they worshipped other than Allah, We gave him Isaac and Jacob, and each [of them] We made a prophet.",
    "translation_id": "Maka, ketika dia (Ibrahim) sudah menjauh dari mereka dan dari apa yang mereka sembah selain Allah, Kami anugerahkan kepadanya (seorang anak) Ishaq dan (seorang cucu) Ya‘qub. Masing-masing Kami angkat menjadi nabi."
  },
  {
    "ayat": 50,
    "arabic": "وَوَهَبْنَا لَهُمْ مِّنْ رَّحْمَتِنَا وَجَعَلْنَا لَهُمْ لِسَانَ صِدْقٍ عَلِيًّا ࣖ",
    "transliteration_en": "Wa wahabnaa lahum mirrahmatinaa wa ja'alnaa lahum lisaana sidqin 'aliyyaa",
    "transliteration_id": "Wa wahabnā lahum mir raḥmatinā wa ja‘alnā lahum lisāna ṣidqin ‘aliyyā(n).",
    "translation_en": "And We gave them of Our mercy, and we made for them a reputation of high honor.",
    "translation_id": "Kami anugerahkan kepada mereka sebagian dari rahmat Kami dan Kami jadikan mereka buah tutur yang baik lagi mulia."
  }
]