[
  {
    "ayat": 51,
    "arabic": "وَاذْكُرْ فِى الْكِتٰبِ مُوْسٰٓىۖ اِنَّهٗ كَانَ مُخْلَصًا وَّكَانَ رَسُوْلًا نَّبِيًّا",
    "transliteration_en": "Wazkur fil Kitaabi Moosaaa; innahoo kaana mukhlasanw wa kaana Rasoolan Nabiyyaa",
    "transliteration_id": "Ważkur  fil-kitābi mūsā, innahū kāna mukhlaṣaw wa kāna rasūlan nabiyyā(n).",
    "translation_en": "And mention in the Book, Moses. Indeed, he was chosen, and he was a messenger and a prophet.",
    "translation_id": "Ceritakanlah (Nabi Muhammad, kisah) Musa di dalam Kitab (Al-Qur’an). Sesungguhnya dia adalah orang yang terpilih, rasul, dan nabi."
  },
  {
    "ayat": 52,
    "arabic": "وَنَادَيْنٰهُ مِنْ جَانِبِ الطُّوْرِ الْاَيْمَنِ وَقَرَّبْنٰهُ نَجِيًّا",
    "transliteration_en": "Wa naadainaahu min jaanibit Tooril aimani wa qarrabnaahu najiyyaa",
    "transliteration_id": "Wa nādaināhu min jānibiṭ-ṭūril-aimani wa qarrabnāhu najiyyā(n).",
    "translation_en": "And We called him from the side of the mount at [his] right and brought him near, confiding [to him].",
    "translation_id": "Kami telah memanggilnya dari sebelah kanan (Gunung) Tur (Sinai) dan Kami dekatkan dia untuk bermunajat (berbicara tanpa perantara)."
  },
  {
    "ayat": 53,
    "arabic": "وَوَهَبْنَا لَهٗ مِنْ رَّحْمَتِنَآ اَخَاهُ هٰرُوْنَ نَبِيًّا",
    "transliteration_en": "Wa wahabnaa lahoo mir rahmatinaaa akhaahu Haaroona Nabiyyaa",
    "transliteration_id": "Wa wahabnā lahū mir raḥmatinā akhāhu hārūna nabiyyā(n).",
    "translation_en": "And We gave him out of Our mercy his brother Aaron as a prophet.",
    "translation_id": "Kami telah menganugerahkan kepadanya sebagian rahmat Kami, yaitu (menjadikan) saudaranya, Harun, sebagai nabi."
  },
  {
    "ayat": 54,
    "arabic": "وَاذْكُرْ فِى الْكِتٰبِ اِسْمٰعِيْلَ ۖاِنَّهٗ كَانَ صَادِقَ الْوَعْدِ وَكَانَ رَسُوْلًا نَّبِيًّا ۚ",
    "transliteration_en": "Wazkur fil Kitaabi ismaa'eel; innahoo kaana saadiqal wa'di wa kaana Rasoolan Nabiyyaa",
    "transliteration_id": "Ważkur  fil-kitābi ismā‘īl(a), innahū kāna ṣādiqal-wa‘di wa kāna rasūlan nabiyyā(n).",
    "translation_en": "And mention in the Book, Ishmael. Indeed, he was true to his promise, and he was a messenger and a prophet.",
    "translation_id": "Ceritakanlah (Nabi Muhammad kisah) Ismail di dalam Kitab (Al-Qur’an). Sesungguhnya dia adalah orang yang benar janjinya, rasul, dan nabi."
  },
  {
    "ayat": 55,
    "arabic": "وَكَانَ يَأْمُرُ اَهْلَهٗ بِالصَّلٰوةِ وَالزَّكٰوةِۖ وَكَانَ عِنْدَ رَبِّهٖ مَرْضِيًّا",
    "transliteration_en": "Wa kaana yaamuru ahlahoo bis Salaati waz zakaati wa kaana 'inda Rabbihee mardiyyaa",
    "transliteration_id": "Wa kāna ya'muru ahlahū biṣ-ṣalāti waz-zakāh(ti), wa kāna ‘inda rabbihī marḍiyyā(n).",
    "translation_en": "And he used to enjoin on his people prayer and zakah and was to his Lord pleasing.",
    "translation_id": "Dia selalu menyuruh keluarganya untuk (menegakkan) salat dan (menunaikan) zakat. Dia adalah orang yang diridai oleh Tuhannya."
  },
  {
    "ayat": 56,
    "arabic": "وَاذْكُرْ فِى الْكِتٰبِ اِدْرِيْسَۖ اِنَّهٗ كَانَ صِدِّيْقًا نَّبِيًّا ۙ",
    "transliteration_en": "Wazkur fil Kitaabi Idrees; innahoo kaana siddeeqan Nabiyyaa",
    "transliteration_id": "Ważkur  fil-kitābi idrīs(a), innahū kāna ṣādiqan nabiyyā(n).",
    "translation_en": "And mention in the Book, Idrees. Indeed, he was a man of truth and a prophet.",
    "translation_id": "Ceritakanlah (Nabi Muhammad kisah) Idris di dalam Kitab (Al-Qur’an). Sesungguhnya dia adalah orang yang sangat benar dan membenarkan lagi seorang nabi."
  },
  {
    "ayat": 57,
    "arabic": "وَّرَفَعْنٰهُ مَكَانًا عَلِيًّا",
    "transliteration_en": "Wa rafa'naahu makaanan 'aliyyaa",
    "transliteration_id": "Wa rafa‘nāhu makānan ‘aliyyā(n).",
    "translation_en": "And We raised him to a high station.",
    "translation_id": "Kami telah mengangkatnya ke martabat yang tinggi."
  },
  {
    "ayat": 58,
    "arabic": "اُولٰۤىِٕكَ الَّذِيْنَ اَنْعَمَ اللّٰهُ عَلَيْهِمْ مِّنَ النَّبِيّٖنَ مِنْ ذُرِّيَّةِ اٰدَمَ وَمِمَّنْ حَمَلْنَا مَعَ نُوْحٍۖ وَّمِنْ ذُرِّيَّةِ اِبْرٰهِيْمَ وَاِسْرَاۤءِيْلَ ۖوَمِمَّنْ هَدَيْنَا وَاجْتَبَيْنَاۗ اِذَا تُتْلٰى عَلَيْهِمْ اٰيٰتُ الرَّحْمٰنِ خَرُّوْا سُجَّدًا وَّبُكِيًّا ۩",
    "transliteration_en": "Ulaaa'ikal lazeena an'amal laahu 'alaihim minan Nabiyyeena min zurriyyati Aadama wa mimman hamalnaa ma'a Noohinw wa min zurriyyati Ibraaheema wa Israaa'eela wa mimman hadainaa wajta bainaaa; izaa tutlaa 'alaihim Aayaatur Rahmaani kharroo sujjadanw wa bukiyyaa",
    "transliteration_id": "Ulā'ikal-lażīna an‘amallāhu ‘alaihim minan-nabiyyīna min żurriyyati ādama wa mimman ḥamalnā ma‘a nūḥ(in), wa min żurriyyati ibrāhīma wa isrā'īl(a), wa mimman hadainā wajtabainā, iżā tutlā ‘alaihim āyātur-raḥmāni kharrū sujjadaw wa bukiyyā(n).",
    "translation_en": "Those were the ones upon whom Allah bestowed favor from among the prophets of the descendants of Adam and of those We carried [in the ship] with Noah, and of the descendants of Abraham and Israel, and of those whom We guided and chose. When the verses of the Most Merciful were recited to them, they fell in prostration and weeping.",
    "translation_id": "Mereka itulah orang-orang yang telah diberi nikmat oleh Allah, yakni para nabi keturunan Adam, orang yang Kami bawa (dalam kapal) bersama Nuh, keturunan Ibrahim dan Israil (Ya‘qub), serta orang yang telah Kami beri petunjuk dan Kami pilih. Apabila dibacakan kepada mereka ayat-ayat Allah Yang Maha Pengasih, mereka tunduk, sujud, dan menangis."
  },
  {
    "ayat": 59,
    "arabic": "۞ فَخَلَفَ مِنْۢ بَعْدِهِمْ خَلْفٌ اَضَاعُوا الصَّلٰوةَ وَاتَّبَعُوا الشَّهَوٰتِ فَسَوْفَ يَلْقَوْنَ غَيًّا ۙ",
    "transliteration_en": "Fakhalafa mim ba'dihim khalfun adaa'us Salaata wattaba'ush shahawaati fasawfa yalqawna ghaiyaa",
    "transliteration_id": "Fa khalafa mim ba‘dihim khalfun aḍā‘uṣ-ṣalāta wattaba‘usy-syahawāti fa saufa yalqauna gayyā(n).",
    "translation_en": "But there came after them successors who neglected prayer and pursued desires; so they are going to meet evil -",
    "translation_id": "Kemudian, datanglah setelah mereka (generasi) pengganti yang mengabaikan salat dan mengikuti hawa nafsu. Mereka kelak akan tersesat."
  },
  {
    "ayat": 60,
    "arabic": "اِلَّا مَنْ تَابَ وَاٰمَنَ وَعَمِلَ صَالِحًا فَاُولٰۤىِٕكَ يَدْخُلُوْنَ الْجَنَّةَ وَلَا يُظْلَمُوْنَ شَيْـًٔا ۙ",
    "transliteration_en": "Illaa man taaba wa aamana wa 'amila saalihan fa ulaaa'ika yadkhuloonal jannata wa laa yuzlamoona shai'aa",
    "transliteration_id": "Illā man tāba wa āmana wa ‘amila ṣāliḥan fa ulā'ika yadkhulūnal-jannata wa lā yuẓlamūna syai'ā(n).",
    "translation_en": "Except those who repent, believe and do righteousness; for those will enter Paradise and will not be wronged at all.",
    "translation_id": "Kecuali orang yang bertobat, beriman, dan beramal saleh, mereka akan masuk surga dan tidak dizalimi sedikit pun."
  },
  {
    "ayat": 61,
    "arabic": "جَنّٰتِ عَدْنِ ِۨالَّتِيْ وَعَدَ الرَّحْمٰنُ عِبَادَهٗ بِالْغَيْبِۗ اِنَّهٗ كَانَ وَعْدُهٗ مَأْتِيًّا",
    "transliteration_en": "Jannaati 'adninil latee wa'adar Rahmaanu ibaadahoo bilghaib; innahoo kaana wa'duhoo maatiyyaa",
    "transliteration_id": "Jannāti ‘adninil-latī wa‘adar-raḥmānu ‘ibādahū bil-gaib(i), innahū kāna wa‘duhū ma'tiyyā(n).",
    "translation_en": "[Therein are] gardens of perpetual residence which the Most Merciful has promised His servants in the unseen. Indeed, His promise has ever been coming.",
    "translation_id": "(Yaitu,) surga ‘Adn yang telah dijanjikan oleh (Allah) Yang Maha Pengasih kepada hamba-hamba-Nya, sekalipun (surga itu) gaib. Sesungguhnya janji-Nya pasti ditepati."
  },
  {
    "ayat": 62,
    "arabic": "لَا يَسْمَعُوْنَ فِيْهَا لَغْوًا اِلَّا سَلٰمًاۗ وَلَهُمْ رِزْقُهُمْ فِيْهَا بُكْرَةً وَّعَشِيًّا",
    "transliteration_en": "Laa yasma'oona feehaa laghwan illaa salaamaa; wa lahum rizquhum feehaa bukratanw wa 'ashiyyaa",
    "transliteration_id": "Lā yasma‘ūna fīhā lagwan illā salāmā(n), wa lahum rizquhum fīhā bukrataw wa ‘asyiyyā(n).",
    "translation_en": "They will not hear therein any ill speech - only [greetings of] peace - and they will have their provision therein, morning and afternoon.",
    "translation_id": "Di dalamnya mereka tidak mendengar perkataan yang tidak berguna, kecuali salam (ucapan kebaikan dan kedamaian). Di dalamnya mereka mendapatkan rezeki pada pagi dan petang."
  },
  {
    "ayat": 63,
    "arabic": "تِلْكَ الْجَنَّةُ الَّتِيْ نُوْرِثُ مِنْ عِبَادِنَا مَنْ كَانَ تَقِيًّا",
    "transliteration_en": "Tilkal jannatul latee oorisu min 'ibaadinaa man kaana taqiyyaa",
    "transliteration_id": "Tilkal-jannatul-latī nūriṡu min ‘ibādinā man kāna taqiyyā(n).",
    "translation_en": "That is Paradise, which We give as inheritance to those of Our servants who were fearing of Allah.",
    "translation_id": "Itulah surga yang akan Kami wariskan kepada hamba-hamba Kami yang selalu bertakwa."
  },
  {
    "ayat": 64,
    "arabic": "وَمَا نَتَنَزَّلُ اِلَّا بِاَمْرِ رَبِّكَۚ  لَهٗ مَا بَيْنَ اَيْدِيْنَا وَمَا خَلْفَنَا وَمَا بَيْنَ ذٰلِكَ وَمَا كَانَ رَبُّكَ نَسِيًّا ۚ",
    "transliteration_en": "Wa maa natanazzalu illaa bi amri Rabbika lahoo maa baina aideenaa wa maa khalfanaa wa maa baina zaalik; wa maa kaana Rabbuka nasiyyaa",
    "transliteration_id": "Wa mā natanazzalu illā bi'amri rabbik(a), lahū mā baina aidīnā wa mā khalfanā wa mā baina żālika wa mā kāna rabbuka nasiyyā(n).",
    "translation_en": "[Gabriel said], \"And we [angels] descend not except by the order of your Lord. To Him belongs that before us and that behind us and what is in between. And never is your Lord forgetful -",
    "translation_id": "Tidaklah kami (Jibril) turun, kecuali atas perintah Tuhanmu. Milik-Nya segala yang ada di hadapan kita, di belakang kita, dan di antara keduanya. Tuhanmu sekali-kali bukan pelupa."
  },
  {
    "ayat": 65,
    "arabic": "رَبُّ السَّمٰوٰتِ وَالْاَرْضِ وَمَا بَيْنَهُمَا فَاعْبُدْهُ وَاصْطَبِرْ لِعِبَادَتِهٖۗ هَلْ تَعْلَمُ لَهٗ سَمِيًّا ࣖ",
    "transliteration_en": "Rabbus samaawaati wal ardi wa maa bainahumaa fa'bud hu wastabir li'ibaadatih; hal ta'lamu lahoo samiyyaa",
    "transliteration_id": "Rabbus-samāwāti wal-arḍi wa mā bainahumā fa‘budhu waṣṭabir li‘ibādatih(ī), hal ta‘lamu lahū samiyyā(n).",
    "translation_en": "Lord of the heavens and the earth and whatever is between them - so worship Him and have patience for His worship. Do you know of any similarity to Him?\"",
    "translation_id": "(Dialah) Tuhan (yang menguasai) langit, bumi, dan segala yang ada di antara keduanya. Maka, sembahlah Dia dan berteguhhatilah dalam beribadah kepada-Nya. Apakah engkau mengetahui sesuatu yang sama dengan-Nya?"
  },
  {
    "ayat": 66,
    "arabic": "وَيَقُوْلُ الْاِنْسَانُ ءَاِذَا مَا مِتُّ لَسَوْفَ اُخْرَجُ حَيًّا",
    "transliteration_en": "Wa yaqoolul insaanu 'aizaa maa mittu lasawfa ukhraju haiyaa",
    "transliteration_id": "Wa yaqūlul-insānu a'iżā mā mittu lasaufa ukhraju ḥayyā(n).",
    "translation_en": "And the disbeliever says, \"When I have died, am I going to be brought forth alive?\"",
    "translation_id": "Orang (kafir) berkata, “Betulkah apabila telah mati kelak, aku sungguh-sungguh akan dibangkitkan hidup kembali?”"
  },
  {
    "ayat": 67,
    "arabic": "اَوَلَا يَذْكُرُ الْاِنْسَانُ اَنَّا خَلَقْنٰهُ مِنْ قَبْلُ وَلَمْ يَكُ شَيْـًٔا",
    "transliteration_en": "awalaa yazkurul insaanu annaa khalaqnaahu min qablu wa lam yaku shai'aa",
    "transliteration_id": "Awalā yażkurul-insānu annā khalaqnāhu min qablu wa lam yaku syai'ā(n).",
    "translation_en": "Does man not remember that We created him before, while he was nothing?",
    "translation_id": "Apakah manusia tidak menyadari bahwa Kami telah menciptakannya dahulu, padahal (sebelumnya) dia tidak berwujud sama sekali?"
  },
  {
    "ayat": 68,
    "arabic": "فَوَرَبِّكَ لَنَحْشُرَنَّهُمْ وَالشَّيٰطِيْنَ ثُمَّ لَنُحْضِرَنَّهُمْ حَوْلَ جَهَنَّمَ جِثِيًّا",
    "transliteration_en": "Fawa Rabbika lanahshu rannahum wash shayaateena summa lanuhdirannahum hawla jahannama jisiyyaa",
    "transliteration_id": "Fa wa rabbika lanaḥsyurannahum wasy-syayāṭīna ṡumma lanuḥḍirannahum ḥaula jahannama jiṡiyyā(n).",
    "translation_en": "So by your Lord, We will surely gather them and the devils; then We will bring them to be present around Hell upon their knees.",
    "translation_id": "Maka, demi Tuhanmu (Nabi Muhammad), sungguh, Kami pasti akan mengumpulkan mereka bersama setan, kemudian pasti Kami akan mendatangkan mereka ke sekeliling Jahanam dengan tersungkur."
  },
  {
    "ayat": 69,
    "arabic": "ثُمَّ لَنَنْزِعَنَّ مِنْ كُلِّ شِيْعَةٍ اَيُّهُمْ اَشَدُّ عَلَى الرَّحْمٰنِ عِتِيًّا ۚ",
    "transliteration_en": "Summa lananzi 'anna min kulli shee'atin aiyuhum ashaddu 'alar Rahmaani 'itiyyaa",
    "transliteration_id": "Ṡumma lananzi‘anna min kulli syī‘atin ayyuhum asyaddu ‘alar-raḥmāni ‘itiyyā(n).",
    "translation_en": "Then We will surely extract from every sect those of them who were worst against the Most Merciful in insolence.",
    "translation_id": "Kemudian, pasti akan Kami tarik dari setiap golongan siapa di antara mereka yang paling durhaka kepada Yang Maha Pengasih."
  },
  {
    "ayat": 70,
    "arabic": "ثُمَّ لَنَحْنُ اَعْلَمُ بِالَّذِيْنَ هُمْ اَوْلٰى بِهَا صِلِيًّا",
    "transliteration_en": "Summa lanahnu a'lamu billazeena hum awlaa bihaa siliyyaa",
    "transliteration_id": "Ṡumma lanaḥnu a‘lamu bil-lażīna  hum aulā bihā ṣiliyyā(n).",
    "translation_en": "Then, surely it is We who are most knowing of those most worthy of burning therein.",
    "translation_id": "Selanjutnya, Kami sungguh lebih mengetahui orang yang paling layak (dimasukkan) ke dalam neraka."
  },
  {
    "ayat": 71,
    "arabic": "وَاِنْ مِّنْكُمْ اِلَّا وَارِدُهَا ۚ كَانَ عَلٰى رَبِّكَ حَتْمًا مَّقْضِيًّا ۚ",
    "transliteration_en": "Wa im minkum illaa waa riduhaa; kaana 'alaa Rabbika hatmam maqdiyyaa",
    "transliteration_id": "Wa im minkum illā wāriduhā, kāna ‘alā rabbika ḥatmam maqḍiyyā(n).",
    "translation_en": "And there is none of you except he will come to it. This is upon your Lord an inevitability decreed.",
    "translation_id": "Tidak ada seorang pun di antaramu yang tidak melewatinya (sirat di atas neraka). Hal itu bagi Tuhanmu adalah ketentuan yang sudah ditetapkan."
  },
  {
    "ayat": 72,
    "arabic": "ثُمَّ نُنَجِّى الَّذِيْنَ اتَّقَوْا وَّنَذَرُ الظّٰلِمِيْنَ فِيْهَا جِثِيًّا",
    "transliteration_en": "Summa nunajjil lazeenat taqaw wa nazaruz zaalimeena feehaa jisiyyaa",
    "transliteration_id": "Ṡumma nunajjil-lażīnattaqau wa nażaruẓ-ẓālimīna fīhā jiṡiyyā(n).",
    "translation_en": "Then We will save those who feared Allah and leave the wrongdoers within it, on their knees.",
    "translation_id": "Selanjutnya, Kami akan menyelamatkan orang-orang yang bertakwa dan membiarkan orang-orang yang zalim di dalamnya (neraka) dalam keadaan tersungkur."
  },
  {
    "ayat": 73,
    "arabic": "وَاِذَا تُتْلٰى عَلَيْهِمْ اٰيٰتُنَا بَيِّنٰتٍ قَالَ الَّذِيْنَ كَفَرُوْا لِلَّذِيْنَ اٰمَنُوْٓاۙ اَيُّ الْفَرِيْقَيْنِ خَيْرٌ مَّقَامًا وَّاَحْسَنُ نَدِيًّا",
    "transliteration_en": "Wa izaa tutlaa 'alaihim Aayaatunaa baiyinaatin qaalal lazeena kafaroo lillazeena aamanooo aiyul fareeqaini khairum maqaamanw wa ahsanu nadiyyaa",
    "transliteration_id": "Wa iżā tutlā ‘alaihim āyātunā bayyinātin qālal-lażīna kafarū lil-lażīna āmanū, ayyul-farīqaini khairum maqāmaw wa aḥsanu nadiyyā(n).",
    "translation_en": "And when Our verses are recited to them as clear evidences, those who disbelieve say to those who believe, \"Which of [our] two parties is best in position and best in association?\"",
    "translation_id": "Apabila dibacakan kepada mereka ayat-ayat Kami yang jelas, niscaya orang-orang yang kufur berkata kepada orang-orang yang beriman, “Manakah di antara kedua golongan yang lebih baik tempat tinggal dan lebih indah tempat pertemuan(-nya)?”"
  },
  {
    "ayat": 74,
    "arabic": "وَكَمْ اَهْلَكْنَا قَبْلَهُمْ مِّنْ قَرْنٍ هُمْ اَحْسَنُ اَثَاثًا وَّرِءْيًا",
    "transliteration_en": "Wa kam ahlaknaa qablahum min qarnin hum ahsanu asaasanw wa ri'yaa",
    "transliteration_id": "Wa kam ahlaknā qablahum min qarnin hum aḥsanu aṡāṡaw wa ri'yā(n).",
    "translation_en": "And how many a generation have We destroyed before them who were better in possessions and [outward] appearance?",
    "translation_id": "Betapa banyak umat (yang ingkar) yang telah Kami binasakan sebelum mereka, padahal mereka lebih bagus perkakas rumah tangganya dan (lebih indah) dipandang mata."
  },
  {
    "ayat": 75,
    "arabic": "قُلْ مَنْ كَانَ فِى الضَّلٰلَةِ فَلْيَمْدُدْ لَهُ الرَّحْمٰنُ مَدًّا ەۚ حَتّٰىٓ اِذَا رَاَوْا مَا يُوْعَدُوْنَ اِمَّا الْعَذَابَ وَاِمَّا السَّاعَةَ ۗفَسَيَعْلَمُوْنَ مَنْ هُوَ شَرٌّ مَّكَانًا وَّاَضْعَفُ جُنْدًا",
    "transliteration_en": "Qul man kaana fidda laalati falyamdud lahur Rahmaanu maddaa; hattaaa izaa ra aw maa yoo'adoona immal 'azaaba wa immas Saa'ata fasa ya'lamoona man huwa sharrum makaananw wa ad'afu jundaa",
    "transliteration_id": "Qul man kāna fiḍ-ḍalālati falyamdud lahur-raḥmānu maddā(n), ḥattā iżā ra'au mā yū‘adūna immal-‘ażāba wa immas-sā‘ata fa saya‘lamūna man huwa syarrum makānaw wa aḍ‘afu jundā(n).",
    "translation_en": "Say, \"Whoever is in error - let the Most Merciful extend for him an extension [in wealth and time] until, when they see that which they were promised - either punishment [in this world] or the Hour [of resurrection] - they will come to know who is worst in position and weaker in soldiers.\"",
    "translation_id": "Katakanlah (Nabi Muhammad), “Siapa yang berada dalam kesesatan, biarlah Tuhan Yang Maha Pengasih memperpanjang waktu baginya. Hingga apabila telah melihat apa yang diancamkan kepada mereka, baik azab maupun Kiamat, mereka akan mengetahui siapa yang lebih buruk kedudukannya dan lebih lemah bala tentaranya.”"
  },
  {
    "ayat": 76,
    "arabic": "وَيَزِيْدُ اللّٰهُ الَّذِيْنَ اهْتَدَوْا هُدًىۗ وَالْبٰقِيٰتُ الصّٰلِحٰتُ خَيْرٌ عِنْدَ رَبِّكَ ثَوَابًا وَّخَيْرٌ مَّرَدًّا",
    "transliteration_en": "Wa yazeedul laahul lazeenah tadaw hudaa; wal baaqiyaatus saalihaatu khairun 'inda Rabbika sawaabanw wa khairum maraddaa",
    "transliteration_id": "Wa yazīdullāhul-lażīnahtadau hudā(n), wal-bāqiyātuṣ-ṣāliḥātu khairun ‘inda rabbika ṡawābaw wa khairum maraddā(n).",
    "translation_en": "And Allah increases those who were guided, in guidance, and the enduring good deeds are better to your Lord for reward and better for recourse.",
    "translation_id": "Allah akan menambah petunjuk kepada orang-orang yang telah mendapat petunjuk. Amal kebajikan yang kekal itu lebih baik pahala dan kesudahannya di sisi Tuhanmu."
  },
  {
    "ayat": 77,
    "arabic": "اَفَرَاَيْتَ الَّذِيْ كَفَرَ بِاٰيٰتِنَا وَقَالَ لَاُوْتَيَنَّ مَالًا وَّوَلَدًا ۗ",
    "transliteration_en": "Afara'aytal lazee kafara bi Aayaatinaa wa qaala la oota yanna maalanw wa waladaa",
    "transliteration_id": "Afa ra'aital-lażī kafara bi'āyātinā wa qāla la'ūtayanna mālaw wa waladā(n).",
    "translation_en": "Then, have you seen he who disbelieved in Our verses and said, \"I will surely be given wealth and children [in the next life]?\"",
    "translation_id": "Lalu, apakah engkau melihat orang yang kufur terhadap ayat-ayat Kami dan dia mengatakan, “(Di akhirat) pasti aku akan diberi harta dan anak.”"
  },
  {
    "ayat": 78,
    "arabic": "اَطَّلَعَ الْغَيْبَ اَمِ اتَّخَذَ عِنْدَ الرَّحْمٰنِ عَهْدًا ۙ",
    "transliteration_en": "Attala'al ghaiba amitta khaza'indar Rahmaani 'ahdaa",
    "transliteration_id": "Aṭṭala‘al-gaiba amittakhaża ‘indar-raḥmāni ‘ahdā(n).",
    "translation_en": "Has he looked into the unseen, or has he taken from the Most Merciful a promise?",
    "translation_id": "Apakah dia melihat yang gaib ataukah telah membuat perjanjian di sisi Tuhan Yang Maha Pengasih?"
  },
  {
    "ayat": 79,
    "arabic": "كَلَّا ۗسَنَكْتُبُ مَا يَقُوْلُ وَنَمُدُّ لَهٗ مِنَ الْعَذَابِ مَدًّا ۙ",
    "transliteration_en": "Kallaa; sanaktubu maa yaqoolu wa namuddu lahoo minal 'azaabi maddaa",
    "transliteration_id": "Kallā, sanaktubu mā yaqūlu wa namuddu lahū minal-‘ażābi maddā(n).",
    "translation_en": "No! We will record what he says and extend for him from the punishment extensively.",
    "translation_id": "Sama sekali tidak! Kami akan menulis apa yang dia katakan dan Kami akan memperpanjang azab untuknya secara sempurna."
  },
  {
    "ayat": 80,
    "arabic": "وَّنَرِثُهٗ مَا يَقُوْلُ وَيَأْتِيْنَا فَرْدًا",
    "transliteration_en": "Wa narisuhoo maa yaqoolu wa yaateenaa fardaa",
    "transliteration_id": "Wa nariṡuhū mā yaqūlu wa ya'tīnā fardā(n).",
    "translation_en": "And We will inherit him [in] what he mentions, and he will come to Us alone.",
    "translation_id": "Kami akan mengambil kembali apa yang dia katakan itu (harta dan anak) dan dia datang kepada Kami seorang diri."
  },
  {
    "ayat": 81,
    "arabic": "وَاتَّخَذُوْا مِنْ دُوْنِ اللّٰهِ اٰلِهَةً لِّيَكُوْنُوْا لَهُمْ عِزًّا ۙ",
    "transliteration_en": "Wattakhazoo min doonil laahi aalihatal liyakoonoo lahum 'izzaa",
    "transliteration_id": "Wattakhażū min dūnillāhi ālihatal liyakūnū lahum ‘izzā(n).",
    "translation_en": "And they have taken besides Allah [false] deities that they would be for them [a source of] honor.",
    "translation_id": "Mereka telah menjadikan selain Allah sebagai tuhan-tuhan agar menjadi pembela mereka."
  },
  {
    "ayat": 82,
    "arabic": "كَلَّا ۗسَيَكْفُرُوْنَ بِعِبَادَتِهِمْ وَيَكُوْنُوْنَ عَلَيْهِمْ ضِدًّا ࣖ",
    "transliteration_en": "Kallaa; sa yakfuroona bi'ibaadatihim wa yakoonoona 'alaihim diddaa",
    "transliteration_id": "Kallā, sayakfurūna bi‘ibādatihim wa yakūnūna ‘alaihim ḍiddā(n).",
    "translation_en": "No! Those \"gods\" will deny their worship of them and will be against them opponents [on the Day of Judgement].",
    "translation_id": "Sama sekali tidak! Mereka (tuhan-tuhan itu) akan mengingkari penyembahan mereka (orang-orang kafir) terhadapnya dan menjadi musuh bagi mereka."
  },
  {
    "ayat": 83,
    "arabic": "اَلَمْ تَرَ اَنَّآ اَرْسَلْنَا الشَّيٰطِيْنَ عَلَى الْكٰفِرِيْنَ تَؤُزُّهُمْ اَزًّا ۙ",
    "transliteration_en": "Alam tara annaaa arsalnash Shayaateena 'alal kaafireena ta'uzzuhum azzaa",
    "transliteration_id": "Alam tara annā arsalnasy-syayāṭīna ‘alal-kāfirīna ta'uzzuhum azzā(n).",
    "translation_en": "Do you not see that We have sent the devils upon the disbelievers, inciting them to [evil] with [constant] incitement?",
    "translation_id": "Tidakkah engkau memperhatikan bahwa Kami telah mengutus setan-setan kepada orang-orang kafir untuk benar-benar menggoda mereka (berbuat maksiat)?"
  },
  {
    "ayat": 84,
    "arabic": "فَلَا تَعْجَلْ عَلَيْهِمْۗ اِنَّمَا نَعُدُّ لَهُمْ عَدًّا ۗ",
    "transliteration_en": "Falaa ta'jal alaihim innamaa na 'uddu lahum 'addaa",
    "transliteration_id": "Falā ta‘jal ‘alaihim, innamā na‘uddu lahum ‘addā(n).",
    "translation_en": "So be not impatient over them. We only count out to them a [limited] number.",
    "translation_id": "Maka, janganlah engkau (Nabi Muhammad) tergesa-gesa (memintakan azab) bagi mereka. Sesungguhnya Kami hanyalah menghitung dengan teliti (datangnya siksaan) untuk mereka."
  },
  {
    "ayat": 85,
    "arabic": "يَوْمَ نَحْشُرُ الْمُتَّقِيْنَ اِلَى الرَّحْمٰنِ وَفْدًا",
    "transliteration_en": "Yawma nahshurul muttaqeena ilar Rahmaani wafdaa",
    "transliteration_id": "Yauma naḥsyurul-muttaqīna ilar-raḥmāni wafdā(n).",
    "translation_en": "On the Day We will gather the righteous to the Most Merciful as a delegation",
    "translation_id": "(Ingatlah) suatu hari (ketika) Kami mengumpulkan orang-orang yang bertakwa (menghadap) kepada (Allah) Yang Maha Pengasih sebagai rombongan yang terhormat"
  },
  {
    "ayat": 86,
    "arabic": "وَنَسُوْقُ الْمُجْرِمِيْنَ اِلٰى جَهَنَّمَ وِرْدًا ۘ",
    "transliteration_en": "Wa nasooqul mujrimeena ilaa Jahannama wirdaa",
    "transliteration_id": "Wa nasūqul-mujrimīna ilā jahannama wirdā(n).",
    "translation_en": "And will drive the criminals to Hell in thirst",
    "translation_id": "dan Kami menggiring para pendurhaka ke (neraka) Jahanam dalam keadaan dahaga."
  },
  {
    "ayat": 87,
    "arabic": "لَا يَمْلِكُوْنَ الشَّفَاعَةَ اِلَّا مَنِ اتَّخَذَ عِنْدَ الرَّحْمٰنِ عَهْدًا ۘ",
    "transliteration_en": "Laa yamlikoonash shafaa'ta illaa manittakhaza 'indar Rahmaani 'ahdaa",
    "transliteration_id": "Lā yamlikūnasy-syafā‘ata illā manittakhaża ‘indar-raḥmāni ‘ahdā(n).",
    "translation_en": "None will have [power of] intercession except he who had taken from the Most Merciful a covenant.",
    "translation_id": "Mereka tidak punya (hak mendapat atau memberi) syafaat (pertolongan), kecuali orang yang telah mengadakan perjanjian di sisi (Allah) Yang Maha Pengasih."
  },
  {
    "ayat": 88,
    "arabic": "وَقَالُوا اتَّخَذَ الرَّحْمٰنُ وَلَدًا ۗ",
    "transliteration_en": "Wa qaalut takhazar Rahmaanu waladaa",
    "transliteration_id": "Wa qāluttakhażar-raḥmānu waladā(n).",
    "translation_en": "And they say, \"The Most Merciful has taken [for Himself] a son.\"",
    "translation_id": "Mereka berkata, “(Allah) Yang Maha Pengasih telah mengangkat anak.”"
  },
  {
    "ayat": 89,
    "arabic": "لَقَدْ جِئْتُمْ شَيْـًٔا اِدًّا ۙ",
    "transliteration_en": "Laqad ji'tum shai'an iddaa",
    "transliteration_id": "Laqad ji'tum syai'an iddā(n).",
    "translation_en": "You have done an atrocious thing.",
    "translation_id": "Sungguh, kamu benar-benar telah membawa sesuatu yang sangat mungkar."
  },
  {
    "ayat": 90,
    "arabic": "تَكَادُ السَّمٰوٰتُ يَتَفَطَّرْنَ مِنْهُ وَتَنْشَقُّ الْاَرْضُ وَتَخِرُّ الْجِبَالُ هَدًّا ۙ",
    "transliteration_en": "Takaadus samaawaatu yatafattarna minhu wa tanshaq qul ardu wa takhirrul jibaalu haddaa",
    "transliteration_id": "Takādus-samāwātu yatafaṭṭarna  minhu wa tansyaqqul-arḍu wa takhirrul-jibālu haddā(n).",
    "translation_en": "The heavens almost rupture therefrom and the earth splits open and the mountains collapse in devastation",
    "translation_id": "Karena ucapan itu, hampir saja langit pecah, bumi terbelah, dan gunung-gunung runtuh berkeping-keping."
  },
  {
    "ayat": 91,
    "arabic": "اَنْ دَعَوْا لِلرَّحْمٰنِ وَلَدًا ۚ",
    "transliteration_en": "An da'aw lir Rahmaani waladaa",
    "transliteration_id": "An da‘au lir-raḥmāni waladā(n).",
    "translation_en": "That they attribute to the Most Merciful a son.",
    "translation_id": "(Hal itu terjadi) karena mereka menganggap (Allah) Yang Maha Pengasih mempunyai anak."
  },
  {
    "ayat": 92,
    "arabic": "وَمَا يَنْۢبَغِيْ لِلرَّحْمٰنِ اَنْ يَّتَّخِذَ وَلَدًا ۗ",
    "transliteration_en": "Wa maa yambaghee lir Rahmaani ai yattakhiza waladaa",
    "transliteration_id": "Wa mā yambagī lir-raḥmāni ay yattakhiża waladā(n).",
    "translation_en": "And it is not appropriate for the Most Merciful that He should take a son.",
    "translation_id": "Tidak sepantasnya (Allah) Yang Maha Pengasih mengangkat anak."
  },
  {
    "ayat": 93,
    "arabic": "اِنْ كُلُّ مَنْ فِى السَّمٰوٰتِ وَالْاَرْضِ اِلَّآ اٰتِى الرَّحْمٰنِ عَبْدًا ۗ",
    "transliteration_en": "In kullu man fis samaawaati wal ardi illaaa aatir Rahmaani 'abdaa",
    "transliteration_id": "In kullu man fis-samāwāti wal-arḍi illā ātir-raḥmāni ‘abdā(n).",
    "translation_en": "There is no one in the heavens and earth but that he comes to the Most Merciful as a servant.",
    "translation_id": "Tidak ada seorang pun di langit dan di bumi, kecuali akan datang kepada (Allah) Yang Maha Pengasih sebagai seorang hamba."
  },
  {
    "ayat": 94,
    "arabic": "لَقَدْ اَحْصٰىهُمْ وَعَدَّهُمْ عَدًّا ۗ",
    "transliteration_en": "Laqad ahsaahum wa addahum 'addaa",
    "transliteration_id": "Laqad aḥṣāhum wa ‘addahum ‘addā(n).",
    "translation_en": "He has enumerated them and counted them a [full] counting.",
    "translation_id": "Sungguh, Dia (Allah) benar-benar telah menentukan jumlah mereka dan menghitungnya dengan teliti."
  },
  {
    "ayat": 95,
    "arabic": "وَكُلُّهُمْ اٰتِيْهِ يَوْمَ الْقِيٰمَةِ فَرْدًا",
    "transliteration_en": "Wa kulluhum aateehi Yawmal Qiyaamati fardaa",
    "transliteration_id": "Wa kulluhum ātīhi yaumal-qiyāmati fardā(n).",
    "translation_en": "And all of them are coming to Him on the Day of Resurrection alone.",
    "translation_id": "Semuanya akan datang kepada Allah pada hari Kiamat sendiri-sendiri."
  },
  {
    "ayat": 96,
    "arabic": "اِنَّ الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ سَيَجْعَلُ لَهُمُ الرَّحْمٰنُ وُدًّا",
    "transliteration_en": "Innal lazeena aamanoo wa 'amilus saalihaati sa yaj'alu lahumur Rahmaanu wuddaa",
    "transliteration_id": "Innal-lażīna āmanū wa ‘amiluṣ-ṣāliḥāti sayaj‘alu lahumur-raḥmānu wuddā(n).",
    "translation_en": "Indeed, those who have believed and done righteous deeds - the Most Merciful will appoint for them affection.",
    "translation_id": "Sesungguhnya bagi orang-orang yang beriman dan beramal saleh, (Allah) Yang Maha Pengasih akan menanamkan rasa cinta (dalam hati) mereka."
  },
  {
    "ayat": 97,
    "arabic": "فَاِنَّمَا يَسَّرْنٰهُ بِلِسَانِكَ لِتُبَشِّرَ بِهِ الْمُتَّقِيْنَ وَتُنْذِرَ بِهٖ قَوْمًا لُّدًّا",
    "transliteration_en": "Fa innamaa yassarnaahu bilisaanika litubashshira bihil muttaqeena wa tunzira bihee qawmal luddaa",
    "transliteration_id": "Fa innamā yassarnāhu bilisānika litubasysyira bihil-muttaqīna wa tunżira bihī qaumal luddā(n).",
    "translation_en": "So, [O Muhammad], We have only made Qur'an easy in the Arabic language that you may give good tidings thereby to the righteous and warn thereby a hostile people.",
    "translation_id": "Sesungguhnya Kami telah memudahkan (Al-Qur’an) itu dengan bahasamu (Nabi Muhammad) agar dengannya engkau memberi kabar gembira kepada orang-orang yang bertakwa dan memberi peringatan kepada kaum yang membangkang."
  },
  {
    "ayat": 98,
    "arabic": "وَكَمْ اَهْلَكْنَا قَبْلَهُمْ مِّنْ قَرْنٍۗ هَلْ تُحِسُّ مِنْهُمْ مِّنْ اَحَدٍ اَوْ تَسْمَعُ لَهُمْ رِكْزًا ࣖ",
    "transliteration_en": "Wa kam ahlaknaa qabla hum min qarnin hal tuhissu minhum min ahadin aw tasma'u lahum rikzaa",
    "transliteration_id": "Wa kam ahlaknā qablahum min qarn(in), hal tuḥissu minhum min aḥadin au tasma‘u lahum rikzā(n).",
    "translation_en": "And how many have We destroyed before them of generations? Do you perceive of them anyone or hear from them a sound?",
    "translation_id": "Betapa banyak umat yang telah Kami binasakan sebelum mereka. Apakah engkau (Nabi Muhammad) melihat salah seorang dari mereka atau mendengar bisikan mereka?"
  }
]