[
  {
    "ayat": 1,
    "arabic": "تَبٰرَكَ الَّذِيْ نَزَّلَ الْفُرْقَانَ عَلٰى عَبْدِهٖ لِيَكُوْنَ لِلْعٰلَمِيْنَ نَذِيْرًا ۙ",
    "transliteration_en": "Tabaarakal lazee nazzalal Furqaana 'alaa 'abdihee li yakoona lil'aalameena nazeera",
    "transliteration_id": "Tabārakal-lażī nazzalal-furqāna ‘alā ‘abdihī liyakūna lil-‘ālamīna nażīrā(n).",
    "translation_en": "Blessed is He who sent down the Criterion upon His Servant that he may be to the worlds a warner -",
    "translation_id": "Maha berlimpah anugerah (Allah) yang telah menurunkan Furqan (Al-Qur’an) kepada hamba-Nya (Nabi Muhammad) agar dia menjadi pemberi peringatan kepada seluruh alam."
  },
  {
    "ayat": 2,
    "arabic": "ۨالَّذِيْ لَهٗ مُلْكُ السَّمٰوٰتِ وَالْاَرْضِ وَلَمْ يَتَّخِذْ وَلَدًا وَّلَمْ يَكُنْ لَّهٗ شَرِيْكٌ فِى الْمُلْكِ وَخَلَقَ كُلَّ شَيْءٍ فَقَدَّرَهٗ تَقْدِيْرًا",
    "transliteration_en": "Allazee lahoo mulkus samaawaati wal ardi wa lam yattakhiz waladanw wa lam yakul lahoo shareekun filmulki wa khalaqa kulla shai'in faqaddarahoo taqdeeraa",
    "transliteration_id": "Allażī lahū mulkus-samāwāti wal-arḍi wa lam yattakhiż waladaw wa lam yakul lahū syarīkun fil-mulki wa khalaqa  kulla syai'in fa qaddarahū taqdīrā(n).",
    "translation_en": "He to whom belongs the dominion of the heavens and the earth and who has not taken a son and has not had a partner in dominion and has created each thing and determined it with [precise] determination.",
    "translation_id": "(Yaitu Zat) yang milik-Nyalah kerajaan langit dan bumi, (Dia) tidak mempunyai anak, dan tidak ada satu sekutu pun dalam kekuasaan(-Nya). Dia telah menciptakan segala sesuatu, lalu menetapkan ukuran-ukurannya dengan tepat."
  },
  {
    "ayat": 3,
    "arabic": "وَاتَّخَذُوْا مِنْ دُوْنِهٖٓ اٰلِهَةً لَّا يَخْلُقُوْنَ شَيْـًٔا وَّهُمْ يُخْلَقُوْنَ وَلَا يَمْلِكُوْنَ لِاَنْفُسِهِمْ ضَرًّا وَّلَا نَفْعًا وَّلَا يَمْلِكُوْنَ مَوْتًا وَّلَا حَيٰوةً وَّلَا نُشُوْرًا",
    "transliteration_en": "Wattakhazoo min dooniheee aahihatal laa yakhluqoona shai'anw wa hum yukhlaqoona wa laa yamlikoona li anfusihim darranw wa laa naf'anw wa laa yamlikoona mawtanw wa laa hayaatanw wa laa nushooraa",
    "transliteration_id": "Wattakhażū min dūnihī ālihatal lā yakhluqūna syai'aw wa hum yukhlaqūna wa lā yamlikūna li'anfusihim ḍarraw wa lā naf‘aw wa lā yamlikūna mautaw wa lā ḥayātaw wa lā nusyūrā(n).",
    "translation_en": "But they have taken besides Him gods which create nothing, while they are created, and possess not for themselves any harm or benefit and possess not [power to cause] death or life or resurrection.",
    "translation_id": "Mereka mengambil sembahan selain Dia, padahal mereka (sembahan itu) tidak dapat menciptakan apa pun. Bahkan, mereka sendiri diciptakan dan tidak kuasa untuk (menolak) bahaya terhadap dirinya, tidak dapat (mendatangkan) manfaat, serta tidak kuasa mematikan, menghidupkan, dan tidak (pula) membangkitkan."
  },
  {
    "ayat": 4,
    "arabic": "وَقَالَ الَّذِيْنَ كَفَرُوْٓا اِنْ هٰذَآ اِلَّآ اِفْكُ ِۨافْتَرٰىهُ وَاَعَانَهٗ عَلَيْهِ قَوْمٌ اٰخَرُوْنَۚ فَقَدْ جَاۤءُوْ ظُلْمًا وَّزُوْرًا ۚ",
    "transliteration_en": "Wa qaalal lazeena kafarooo in haazaaa illaaa ifkunif taraahu wa a'aanahoo 'alaihi qawmun aakharoona faqad jaaa'oo zulmanw wa zooraa",
    "transliteration_id": "Wa qālal-lażīna kafarū in hāżā illā ifkuniftarāhu wa a‘ānahū ‘alaihi qaumun ākharūn(a), fa qad jā'ū ẓulmaw wa zūrā(n).",
    "translation_en": "And those who disbelieve say, \"This [Qur'an] is not except a falsehood he invented, and another people assisted him in it.\" But they have committed an injustice and a lie.",
    "translation_id": "Orang-orang kafir berkata, “(Al-Qur’an) ini tidak lain hanyalah kebohongan yang diada-adakan oleh dia (Nabi Muhammad) dengan dibantu oleh orang-orang lain,” Sungguh, mereka telah berbuat zalim dan dusta yang besar."
  },
  {
    "ayat": 5,
    "arabic": "وَقَالُوْٓا اَسَاطِيْرُ الْاَوَّلِيْنَ اكْتَتَبَهَا فَهِيَ تُمْلٰى عَلَيْهِ بُكْرَةً وَّاَصِيْلًا",
    "transliteration_en": "Wa qaalooo asaateerul awwaleenak tatabahaa fahiya tumlaa 'alaihi bukratanw wa aseelaa",
    "transliteration_id": "Wa qālū asāṭīrul-awwalīnaktatabahā fa hiya tumlā ‘alaihi bukrataw wa aṣīlā(n).",
    "translation_en": "And they say, \"Legends of the former peoples which he has written down, and they are dictated to him morning and afternoon.\"",
    "translation_id": "Mereka berkata, “(Itu) dongeng-dongeng orang-orang dahulu yang diminta (oleh Nabi Muhammad) agar (dongeng) itu dituliskan. Lalu dibacakanlah dongeng itu kepadanya setiap pagi dan petang.”"
  },
  {
    "ayat": 6,
    "arabic": "قُلْ اَنْزَلَهُ الَّذِيْ يَعْلَمُ السِّرَّ  فِى السَّمٰوٰتِ وَالْاَرْضِۗ اِنَّهٗ كَانَ غَفُوْرًا رَّحِيْمًا",
    "transliteration_en": "Qul anzalhul lazee ya'lamus sirra fis samaawaati wal-ard; innahoo kaana Ghafoorar Raheemaa",
    "transliteration_id": "Qul anzalahul-lażī ya‘lamus-sirra fis-samāwāti wal-arḍ(i), innahū kāna gafūrar raḥīmā(n).",
    "translation_en": "Say, [O Muhammad], \"It has been revealed by He who knows [every] secret within the heavens and the earth. Indeed, He is ever Forgiving and Merciful.\"",
    "translation_id": "Katakanlah (Nabi Muhammad), “(Al-Qur’an) itu diturunkan oleh (Allah) yang mengetahui rahasia di langit dan di bumi. Sesungguhnya Dia Maha Pengampun lagi Maha Penyayang.”"
  },
  {
    "ayat": 7,
    "arabic": "وَقَالُوْا مَالِ هٰذَا الرَّسُوْلِ يَأْكُلُ الطَّعَامَ وَيَمْشِيْ فِى الْاَسْوَاقِۗ  لَوْلَآ اُنْزِلَ اِلَيْهِ مَلَكٌ فَيَكُوْنَ مَعَهٗ نَذِيْرًا ۙ",
    "transliteration_en": "Wa qaaloo maa li haazar Rasooli yaakulut ta'aama wa yamshee fil aswaaq; law laaa unzila ilaihi malakun fa yakoona ma'ahoo nazeeraa",
    "transliteration_id": "Wa qālū mā lihāżar-rasūli ya'kuluṭ-ṭa‘āma wa yamsyī fil-aswāq(i), lau lā unzila ‘alaihi malakun fa yakūna ma‘ahū nażīrā(n).",
    "translation_en": "And they say, \"What is this messenger that eats food and walks in the markets? Why was there not sent down to him an angel so he would be with him a warner?",
    "translation_id": "Mereka berkata, “Mengapa Rasul (Nabi Muhammad) ini memakan makanan dan berjalan di pasar-pasar? Mengapa malaikat tidak diturunkan kepadanya (agar malaikat) itu memberikan peringatan bersama dia,"
  },
  {
    "ayat": 8,
    "arabic": "اَوْ يُلْقٰىٓ اِلَيْهِ كَنْزٌ اَوْ تَكُوْنُ لَهٗ جَنَّةٌ يَّأْكُلُ مِنْهَاۗ وَقَالَ الظّٰلِمُوْنَ اِنْ تَتَّبِعُوْنَ اِلَّا رَجُلًا مَّسْحُوْرًا",
    "transliteration_en": "Aw yulqaaa ilaihi kanzun aw takoonu lahoo jannatuny yaakulu minhaa; wa qaalaz zaalimoona in tattabi'oona illaa rajulam mas hooraa",
    "transliteration_id": "Au yulqā ilaihi kanzun au takūnu lahū jannatuy ya'kulu minhā, wa qālaẓ-ẓālimūna in tattabi‘ūna illā rajulam masḥūrā(n).",
    "translation_en": "Or [why is not] a treasure presented to him [from heaven], or does he [not] have a garden from which he eats?\" And the wrongdoers say, \"You follow not but a man affected by magic.\"",
    "translation_id": "atau (mengapa tidak) diturunkan kepadanya harta kekayaan atau kebun baginya, sehingga dia dapat makan dari (hasil)-nya?” Orang-orang zalim itu berkata, “Kamu tidak lain hanyalah mengikuti seorang laki-laki yang kena sihir.”"
  },
  {
    "ayat": 9,
    "arabic": "اُنْظُرْ كَيْفَ ضَرَبُوْا لَكَ الْاَمْثَالَ فَضَلُّوْا فَلَا يَسْتَطِيْعُوْنَ سَبِيْلًا ࣖ",
    "transliteration_en": "Unzur kaifa daraboo lakal amsaala fadalloo falaa yastatee'oona sabeelaa",
    "transliteration_id": "Unẓur kaifa ḍarabū lakal-amṡāla fa ḍallū falā yastaṭī‘ūna sabīlā(n).",
    "translation_en": "Look how they strike for you comparisons; but they have strayed, so they cannot [find] a way.",
    "translation_id": "Perhatikanlah (Nabi Muhammad) bagaimana mereka membuat perumpamaan-perumpamaan (yang buruk) tentang engkau! Maka, sesatlah mereka. Mereka tidak sanggup (mendapatkan) jalan (untuk menentang kerasulanmu)."
  },
  {
    "ayat": 10,
    "arabic": "تَبٰرَكَ الَّذِيْٓ اِنْ شَاۤءَ جَعَلَ لَكَ خَيْرًا مِّنْ ذٰلِكَ جَنّٰتٍ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُۙ وَيَجْعَلْ لَّكَ قُصُوْرًا",
    "transliteration_en": "Tabaarakal lazeee in shaaa'a ja'ala laka khairam min zaalika jannaatin tajree min tahtihal anhaaru wa yaj'al laka qusooraa",
    "transliteration_id": "Tabārakal-lażī in syā'a ja‘ala laka khairam min żālika jannātin tajrī min taḥtihal-anhār(u), wa yaj‘al laka quṣūrā(n).",
    "translation_en": "Blessed is He who, if He willed, could have made for you [something] better than that - gardens beneath which rivers flow - and could make for you palaces.",
    "translation_id": "Maha berlimpah anugerah (Allah) yang jika Dia menghendaki, niscaya Dia menjadikan bagimu (sesuatu) yang lebih baik daripada (yang mereka katakan) itu, (yaitu) kebun-kebun yang mengalir di bawah (di sekitar)-nya sungai-sungai. Dia menjadikan (pula) istana-istana untukmu."
  },
  {
    "ayat": 11,
    "arabic": "بَلْ كَذَّبُوْا بِالسَّاعَةِۙ وَاَعْتَدْنَا لِمَنْ كَذَّبَ بِالسَّاعَةِ سَعِيْرًا",
    "transliteration_en": "Bal kazzaboo bis Saa'ati wa a'tadnaa liman kazzaba bis Saa'ati sa'eeraa",
    "transliteration_id": "Bal każżabū bis-sā‘ah(ti), wa a‘tadnā liman każżaba bis-sā‘ati sa‘īrā(n).",
    "translation_en": "But they have denied the Hour, and We have prepared for those who deny the Hour a Blaze.",
    "translation_id": "Sebenarnya mereka mendustakan hari Kiamat. Kami menyediakan neraka yang menyala-nyala bagi siapa yang mendustakan hari Kiamat."
  },
  {
    "ayat": 12,
    "arabic": "اِذَا رَاَتْهُمْ مِّنْ مَّكَانٍۢ بَعِيْدٍ سَمِعُوْا لَهَا تَغَيُّظًا وَّزَفِيْرًا",
    "transliteration_en": "Izaa ra'at hum mim ma kaanim ba'eedin sami'oo lahaa taghaiyuzanw wa zafeeraa",
    "transliteration_id": "Iżā ra'athum mim makānim ba‘īdin sami‘ū lahā tagayyuẓaw wa zafīrā(n).",
    "translation_en": "When the Hellfire sees them from a distant place, they will hear its fury and roaring.",
    "translation_id": "Apabila ia (neraka) melihat mereka dari tempat yang jauh, mereka mendengar darinya suara gemuruh karena marah dan geram."
  },
  {
    "ayat": 13,
    "arabic": "وَاِذَآ اُلْقُوْا مِنْهَا مَكَانًا ضَيِّقًا مُّقَرَّنِيْنَ دَعَوْا هُنَالِكَ ثُبُوْرًا ۗ",
    "transliteration_en": "Wa izaaa ulqoo minhaa makaanan daiyiqam muqar raneena da'aw hunaalika subooraa",
    "transliteration_id": "Wa iżā ulqū minhā makānan ḍayyiqam muqarranīna da‘au hunālika ṡubūrā(n).",
    "translation_en": "And when they are thrown into a narrow place therein bound in chains, they will cry out thereupon for destruction.",
    "translation_id": "Apabila mereka dilemparkan ke tempat yang sempit di neraka dalam keadaan dibelenggu, mereka di sana berteriak mengharapkan kebinasaan."
  },
  {
    "ayat": 14,
    "arabic": "لَا تَدْعُوا الْيَوْمَ ثُبُوْرًا وَّاحِدًا وَّادْعُوْا ثُبُوْرًا كَثِيْرًا",
    "transliteration_en": "Laa tad'ul yawma subooranw waahidanw wad'oo subooran kaseeraa",
    "transliteration_id": "Lā tad‘ul-yauma ṡubūraw wāḥidaw wad‘ū ṡubūran kaṡīrā(n).",
    "translation_en": "[They will be told], \"Do not cry this Day for one destruction but cry for much destruction.\"",
    "translation_id": "(Akan dikatakan kepada mereka,) “Janganlah kamu pada hari ini mengharapkan satu kebinasaan saja, tetapi harapkanlah kebinasaan yang banyak.”"
  },
  {
    "ayat": 15,
    "arabic": "قُلْ اَذٰلِكَ خَيْرٌ اَمْ جَنَّةُ الْخُلْدِ الَّتِيْ وُعِدَ الْمُتَّقُوْنَۗ  كَانَتْ لَهُمْ جَزَاۤءً وَّمَصِيْرًا",
    "transliteration_en": "Qul azaalika khairun am Jannatul khuldil latee wu'idal muttaqoon; kaanat lahum jazaaa'anw wa maseeraa",
    "transliteration_id": "Qul ażālika khairun am jannatul-khuldil-latī wu‘idal-muttaqūn(a), kānat lahum jazā'aw wa maṣīrā(n).",
    "translation_en": "Say, \"Is that better or the Garden of Eternity which is promised to the righteous? It will be for them a reward and destination.",
    "translation_id": "Katakanlah (Nabi Muhammad), “Apakah (azab) seperti itu yang baik atau surga yang kekal yang dijanjikan kepada orang-orang yang bertakwa sebagai balasan dan tempat kembali bagi mereka?”"
  },
  {
    "ayat": 16,
    "arabic": "لَهُمْ فِيْهَا مَا يَشَاۤءُوْنَ خٰلِدِيْنَۗ  كَانَ عَلٰى رَبِّكَ وَعْدًا مَّسْـُٔوْلًا",
    "transliteration_en": "Lahum feehaa maa yashaaa'oona khaalideen; kaana 'alaa Rabbika wa'dam mas'oolaa",
    "transliteration_id": "Lahum fīhā mā yasyā'ūna khālidīn(a), kāna ‘alā rabbika wa‘dam mas'ūlā(n).",
    "translation_en": "For them therein is whatever they wish, [while] abiding eternally. It is ever upon your Lord a promise [worthy to be] requested.",
    "translation_id": "Bagi mereka segala yang mereka kehendaki ada di dalamnya (surga). Mereka kekal (di dalamnya). Itulah janji Tuhanmu yang pantas dimohonkan (kepada-Nya)."
  },
  {
    "ayat": 17,
    "arabic": "وَيَوْمَ يَحْشُرُهُمْ وَمَا يَعْبُدُوْنَ مِنْ دُوْنِ اللّٰهِ فَيَقُوْلُ ءَاَنْتُمْ اَضْلَلْتُمْ عِبَادِيْ هٰٓؤُلَاۤءِ اَمْ هُمْ ضَلُّوا السَّبِيْلَ ۗ",
    "transliteration_en": "Wa Yawma yahshuruhum wa maa ya'budoona min doonil lahi fa yaqoolu 'a-antum adlaltum 'ibaadee haaa'ulaaa'i am hum dallus sabeel",
    "transliteration_id": "Wa yauma yaḥsyuruhum wa mā ya‘budūna min dūnillāhi fa yaqūlu a'antum aḍlaltum ‘ibādī hā'ulā'i am hum ḍallus-sabīl(a).",
    "translation_en": "And [mention] the Day He will gather them and that which they worship besides Allah and will say, \"Did you mislead these, My servants, or did they [themselves] stray from the way?\"",
    "translation_id": "(Ingatlah) hari (ketika) Allah mengumpulkan mereka bersama dengan apa yang mereka sembah selain Allah. Dia lalu berfirman (kepada yang disembah), “Apakah kamu yang menyesatkan hamba-hamba-Ku itu ataukah mereka sendiri yang sesat dari jalan (yang benar)?”"
  },
  {
    "ayat": 18,
    "arabic": "قَالُوْا سُبْحٰنَكَ مَا كَانَ يَنْۢبَغِيْ لَنَآ اَنْ نَّتَّخِذَ مِنْ دُوْنِكَ مِنْ اَوْلِيَاۤءَ وَلٰكِنْ مَّتَّعْتَهُمْ وَاٰبَاۤءَهُمْ حَتّٰى نَسُوا الذِّكْرَۚ وَكَانُوْا قَوْمًاۢ بُوْرًا",
    "transliteration_en": "Qaaloo Subhaanaka maa kaana yambaghee lanaaa an nattakhiza min doonika min awliyaaa'a wa laakim matta'tahum wa aabaaa'ahum hattaa nasuz zikra wa kaanoo qawmam booraa",
    "transliteration_id": "Qālū subḥānaka mā kāna yambagī lanā an nattakhiża min dūnika min auliyā'a wa lākim matta‘tahum wa ābā'ahum ḥattā nasuż-żikr(a), wa kānū qaumam būrā(n).",
    "translation_en": "They will say, \"Exalted are You! It was not for us to take besides You any allies. But You provided comforts for them and their fathers until they forgot the message and became a people ruined.\"",
    "translation_id": "Mereka (yang disembah itu) menjawab, “Maha Suci Engkau. Tidaklah pantas bagi kami mengambil pelindung selain Engkau, tetapi Engkau telah memberi mereka dan nenek moyang mereka kenikmatan hidup sehingga mereka melupakan peringatan dan mereka kaum yang binasa.”"
  },
  {
    "ayat": 19,
    "arabic": "فَقَدْ كَذَّبُوْكُمْ بِمَا تَقُوْلُوْنَۙ فَمَا تَسْتَطِيْعُوْنَ صَرْفًا وَّلَا نَصْرًاۚ وَمَنْ يَّظْلِمْ مِّنْكُمْ نُذِقْهُ عَذَابًا كَبِيْرًا",
    "transliteration_en": "Faqad kazzabookum bimaa taqooloona famaa tastatee'oona sarfanw wa laa nasraa; wa mai yazlim minkum nuziqhu 'azaaban kabeeraa",
    "transliteration_id": "Faqad każżabūkum bimā taqūlūn(a), famā tastaṭī‘ūna ṣarfaw wa lā naṣrā(n), wa may yaẓlim minkum nużiqhu ‘ażāban kabīrā(n).",
    "translation_en": "So they will deny you, [disbelievers], in what you say, and you cannot avert [punishment] or [find] help. And whoever commits injustice among you - We will make him taste a great punishment.",
    "translation_id": "Sungguh, mereka (yang disembah itu) telah mengingkari apa yang kamu katakan. Maka, kamu tidak akan dapat menolak (azab) dan tidak dapat (pula) menolong (dirimu). Siapa di antara kamu yang berbuat zalim, niscaya Kami menimpakan kepadanya azab yang besar."
  },
  {
    "ayat": 20,
    "arabic": "وَمَآ اَرْسَلْنَا قَبْلَكَ مِنَ الْمُرْسَلِيْنَ اِلَّآ اِنَّهُمْ لَيَأْكُلُوْنَ الطَّعَامَ وَيَمْشُوْنَ فِى الْاَسْوَاقِۗ وَجَعَلْنَا بَعْضَكُمْ لِبَعْضٍ فِتْنَةً  ۗ اَتَصْبِرُوْنَۚ وَكَانَ رَبُّكَ بَصِيْرًا ࣖ   ۔",
    "transliteration_en": "Wa maaa arsalnaa qablaka minal mursaleena illaaa innahum la yaakuloonat ta'aama wa yamshoona fil aswaaq; wa ja'alnaa ba'dakum liba'din fitnatan atasbiroon; wa kaana Rabbuka Baseera",
    "transliteration_id": "Wa mā arsalnā qablaka minal-mursalīna illā innahum laya'kulūnaṭ-ṭa‘āma wa yamsyūna fil aswāq(i), wa ja‘alnā ba‘ḍakum liba‘ḍin fitnah(tan), ataṣbirūn(a), wa kāna rabbuka baṣīrā(n).",
    "translation_en": "And We did not send before you, [O Muhammad], any of the messengers except that they ate food and walked in the markets. And We have made some of you [people] as trial for others - will you have patience? And ever is your Lord, Seeing.",
    "translation_id": "Kami tidak mengutus rasul-rasul sebelummu (Nabi Muhammad), melainkan mereka pasti menyantap makanan dan berjalan di pasar. Kami menjadikan sebagian kamu sebagai cobaan bagi sebagian yang lain. Maukah kamu bersabar? Tuhanmu Maha Melihat."
  },
  {
    "ayat": 21,
    "arabic": "۞ وَقَالَ الَّذِيْنَ لَا يَرْجُوْنَ لِقَاۤءَنَا لَوْلَآ اُنْزِلَ عَلَيْنَا الْمَلٰۤىِٕكَةُ اَوْ نَرٰى رَبَّنَا ۗ لَقَدِ اسْتَكْبَرُوْا فِيْٓ اَنْفُسِهِمْ وَعَتَوْ عُتُوًّا كَبِيْرًا",
    "transliteration_en": "Wa qaalal lazeena laa yarjoona liqaaa'anaa law laaa unzila 'alainal malaaa'ikatu awnaraa Rabbanaa; laqadistakbaroo feee anfusihim wa 'ataw 'utuwwan kabeeraa",
    "transliteration_id": "Wa qālal-lażīna lā yarjūna liqā'anā lau lā unzila ‘alainal-malā'ikata au narā rabbanā, laqadistakbarū fī anfusihim wa ‘atau ‘utuwwan kabīrā(n).",
    "translation_en": "And those who do not expect the meeting with Us say, \"Why were not angels sent down to us, or [why] do we [not] see our Lord?\" They have certainly become arrogant within themselves and [become] insolent with great insolence.",
    "translation_id": "Orang-orang yang tidak mengharapkan pertemuan dengan Kami (di akhirat) berkata, “Mengapa tidak diturunkan kepada kita malaikat atau (mengapa) kita (tidak) melihat Tuhan kita?” Sungguh, mereka benar-benar telah menyombongkan diri dan melampaui batas (kezaliman) yang sangat besar."
  },
  {
    "ayat": 22,
    "arabic": "يَوْمَ يَرَوْنَ الْمَلٰۤىِٕكَةَ لَا بُشْرٰى يَوْمَىِٕذٍ لِّلْمُجْرِمِيْنَ وَيَقُوْلُوْنَ حِجْرًا مَّحْجُوْرًا",
    "transliteration_en": "Yawma yarawnal malaaa 'ikata laa bushraa Yawma'izil lilmujrimeena wa yaqooloona hijram mahjooraa",
    "transliteration_id": "Yauma yaraunal-malā'ikata  lā busyrā yauma'iżil lil-mujrimīna wa yaqūlūna ḥijram maḥjūrā(n).",
    "translation_en": "The day they see the angels - no good tidings will there be that day for the criminals, and [the angels] will say, \"Prevented and inaccessible.\"",
    "translation_id": "(Ingatlah) hari (ketika) mereka melihat para malaikat. Pada hari itu tidak ada kabar gembira bagi para pendosa dan mereka (para malaikat) berkata, “Sungguh terlarang bagi kamu (kabar gembira).”"
  },
  {
    "ayat": 23,
    "arabic": "وَقَدِمْنَآ اِلٰى مَا عَمِلُوْا مِنْ عَمَلٍ فَجَعَلْنٰهُ هَبَاۤءً مَّنْثُوْرًا",
    "transliteration_en": "Wa qadimnaaa ilaa maa 'amiloo min 'amalin faja'alnaahu habaaa'am mansooraa",
    "transliteration_id": "Wa qadimnā ilā mā ‘amilū min ‘amalin fa ja‘alnāhu habā'am manṡūrā(n).",
    "translation_en": "And We will regard what they have done of deeds and make them as dust dispersed.",
    "translation_id": "Kami perlihatkan segala amal yang mereka kerjakan, lalu Kami jadikan amal itu (bagaikan) debu yang beterbangan."
  },
  {
    "ayat": 24,
    "arabic": "اَصْحٰبُ الْجَنَّةِ يَوْمَىِٕذٍ خَيْرٌ مُّسْتَقَرًّا وَّاَحْسَنُ مَقِيْلًا",
    "transliteration_en": "As haabul jannati yawma'izin khairum mustaqar ranw wa ahsanu maqeela",
    "transliteration_id": "Aṣḥābul-jannati yauma'iżin khairum mustaqarraw wa aḥsanu maqīlā(n).",
    "translation_en": "The companions of Paradise, that Day, are [in] a better settlement and better resting place.",
    "translation_id": "Para penghuni surga pada hari itu paling baik tempat tinggalnya dan paling indah tempat istirahatnya."
  },
  {
    "ayat": 25,
    "arabic": "وَيَوْمَ تَشَقَّقُ السَّمَاۤءُ بِالْغَمَامِ وَنُزِّلَ الْمَلٰۤىِٕكَةُ تَنْزِيْلًا",
    "transliteration_en": "Wa Yawma tashaqqaqus samaaa'u bilghamaami wa nuzzilal malaaa'ikatu tanzeela",
    "transliteration_id": "Wa yauma tasyaqqaqus-samā'u bil-gamāmi wa nuzzilal-malā'ikatu tanzīlā(n).",
    "translation_en": "And [mention] the Day when the heaven will split open with [emerging] clouds, and the angels will be sent down in successive descent.",
    "translation_id": "(Ingatlah) hari (ketika) langit pecah mengeluarkan kabut putih dan malaikat diturunkan (secara) bergelombang."
  },
  {
    "ayat": 26,
    "arabic": "اَلْمُلْكُ يَوْمَىِٕذِ ِۨالْحَقُّ لِلرَّحْمٰنِۗ وَكَانَ يَوْمًا عَلَى الْكٰفِرِيْنَ عَسِيْرًا",
    "transliteration_en": "Almulku Yawma'izinil haqqu lir Rahmaan; wa kaana Yawman'alal kaafireena 'aseeraa",
    "transliteration_id": "Al-mulku yauma'iżinil-ḥaqqu lir-raḥmān(i), wa kāna yauman ‘alal-kāfirīna ‘asīrā(n).",
    "translation_en": "True sovereignty, that Day, is for the Most Merciful. And it will be upon the disbelievers a difficult Day.",
    "translation_id": "Kerajaan yang hak pada hari itu adalah milik Yang Maha Pengasih. Itu adalah hari yang sangat sulit bagi orang-orang kafir."
  },
  {
    "ayat": 27,
    "arabic": "وَيَوْمَ يَعَضُّ الظَّالِمُ عَلٰى يَدَيْهِ يَقُوْلُ يٰلَيْتَنِى اتَّخَذْتُ مَعَ الرَّسُوْلِ سَبِيْلًا",
    "transliteration_en": "Wa Yawma ya'adduz zaalimu 'alaa yadaihi yaqoolu yaa laitanit takhaztu ma'ar Rasooli sabeelaa",
    "transliteration_id": "Wa yauma ya‘aḍḍuẓ-ẓālimu ‘alā yadaihi yaqūlu yā laitanittakhażtu ma‘ar-rasūli sabīlā(n).",
    "translation_en": "And the Day the wrongdoer will bite on his hands [in regret] he will say, \"Oh, I wish I had taken with the Messenger a way.",
    "translation_id": "(Ingatlah) hari (ketika) orang zalim menggigit kedua tangannya seraya berkata, “Oh, seandainya (dahulu) aku mengambil jalan bersama rasul."
  },
  {
    "ayat": 28,
    "arabic": "يٰوَيْلَتٰى لَيْتَنِيْ لَمْ اَتَّخِذْ فُلَانًا خَلِيْلًا",
    "transliteration_en": "Yaa wailataa laitanee lam attakhiz fulaanan khaleelaa",
    "transliteration_id": "Yā wailatā laitanī lam attakhiż fulānan khalīlā(n).",
    "translation_en": "Oh, woe to me! I wish I had not taken that one as a friend.",
    "translation_id": "Oh, celaka aku! Sekiranya (dahulu) aku tidak menjadikan si fulan sebagai teman setia."
  },
  {
    "ayat": 29,
    "arabic": "لَقَدْ اَضَلَّنِيْ عَنِ الذِّكْرِ بَعْدَ اِذْ جَاۤءَنِيْۗ وَكَانَ الشَّيْطٰنُ لِلْاِنْسَانِ خَذُوْلًا",
    "transliteration_en": "Laqad adallanee 'aniz zikri ba'da iz jaaa'anee; wa kaanash Shaitaanu lil insaani khazoolaa",
    "transliteration_id": "Laqad aḍallanī ‘aniż-żikri ba‘da iż jā'anī, wa kānasy-syaiṭānu lil-insāni khażūlā(n).",
    "translation_en": "He led me away from the remembrance after it had come to me. And ever is Satan, to man, a deserter.\"",
    "translation_id": "Sungguh, dia benar-benar telah menyesatkanku dari peringatan (Al-Qur’an) ketika telah datang kepadaku. Setan itu adalah (makhluk) yang sangat enggan menolong manusia.”"
  },
  {
    "ayat": 30,
    "arabic": "وَقَالَ الرَّسُوْلُ يٰرَبِّ اِنَّ قَوْمِى اتَّخَذُوْا هٰذَا الْقُرْاٰنَ مَهْجُوْرًا",
    "transliteration_en": "Wa qaalar Rasoolu yaa Rabbi inna qawmit takhazoo haazal Qur-aana mahjooraa",
    "transliteration_id": "Wa qālar-rasūlu yā rabbi inna qaumittakhażū hāżal-qur'āna mahjūrā(n).",
    "translation_en": "And the Messenger has said, \"O my Lord, indeed my people have taken this Qur'an as [a thing] abandoned.\"",
    "translation_id": "Rasul (Nabi Muhammad) berkata, “Wahai Tuhanku, sesungguhnya kaumku telah menjadikan Al-Qur’an ini (sebagai) sesuatu yang diabaikan.”"
  },
  {
    "ayat": 31,
    "arabic": "وَكَذٰلِكَ جَعَلْنَا لِكُلِّ نَبِيٍّ عَدُوًّا مِّنَ الْمُجْرِمِيْنَۗ وَكَفٰى بِرَبِّكَ هَادِيًا وَّنَصِيْرًا",
    "transliteration_en": "Wa kazaalika ja'alnaa likulli Nabiyyin 'aduwwam minal mujrimeen; wa kafaa bi Rabbika haadiyanw wa naseeraa",
    "transliteration_id": "Wa każālika ja‘alnā likulli nabiyyin ‘aduwwam minal-mujrimīn(a), wa kafā birabbika hādiyaw wa naṣīrā(n).",
    "translation_en": "And thus have We made for every prophet an enemy from among the criminals. But sufficient is your Lord as a guide and a helper.",
    "translation_id": "Begitulah, bagi setiap nabi, telah Kami adakan musuh dari para pendosa. Cukuplah Tuhanmu menjadi pemberi petunjuk dan penolong."
  },
  {
    "ayat": 32,
    "arabic": "وَقَالَ الَّذِيْنَ كَفَرُوْا لَوْلَا نُزِّلَ عَلَيْهِ الْقُرْاٰنُ جُمْلَةً وَّاحِدَةً ۛ كَذٰلِكَ ۛ لِنُثَبِّتَ بِهٖ فُؤَادَكَ وَرَتَّلْنٰهُ تَرْتِيْلًا",
    "transliteration_en": "Wa qaalal lazeena kafaroo law laa nuzzila 'alaihil Quraanu jumlatanw waahidah; kazaalika linusabbita bihee fu'aadaka wa rattalnaahu tarteelaa",
    "transliteration_id": "Wa qālal-lażīna kafarū lau lā nuzzila ‘alaihil-qur'ānu jumlataw wāḥidatan - każālika - linuṡabbita bihī fu'ādaka wa rattalnāhu tartīlā(n).",
    "translation_en": "And those who disbelieve say, \"Why was the Qur'an not revealed to him all at once?\" Thus [it is] that We may strengthen thereby your heart. And We have spaced it distinctly.",
    "translation_id": "Orang-orang yang kufur berkata, “Mengapa Al-Qur’an itu tidak diturunkan kepadanya sekaligus?” Demikianlah, agar Kami memperteguh hatimu (Nabi Muhammad) dengannya dan Kami membacakannya secara tartil (berangsur-angsur, perlahan, dan benar)."
  },
  {
    "ayat": 33,
    "arabic": "وَلَا يَأْتُوْنَكَ بِمَثَلٍ اِلَّا جِئْنٰكَ بِالْحَقِّ وَاَحْسَنَ تَفْسِيْرًا ۗ",
    "transliteration_en": "Wa laa yaatoonaka bimasainn illaa ji'naaka bilhaqqi wa ahsana tafseeraa",
    "transliteration_id": "Wa lā ya'tūnaka bimaṡalin illā ji'nāka bil-ḥaqqi wa aḥsana tafsīrā(n).",
    "translation_en": "And they do not come to you with an argument except that We bring you the truth and the best explanation.",
    "translation_id": "Tidaklah mereka datang kepadamu (membawa) sesuatu yang aneh, kecuali Kami datangkan kepadamu kebenaran dan penjelasan yang terbaik."
  },
  {
    "ayat": 34,
    "arabic": "اَلَّذِيْنَ يُحْشَرُوْنَ عَلٰى وُجُوْهِهِمْ اِلٰى جَهَنَّمَۙ اُولٰۤىِٕكَ شَرٌّ مَّكَانًا وَّاَضَلُّ سَبِيْلًا ࣖ",
    "transliteration_en": "Allazeena yuhsharoona 'alaa wujoohim ilaa jahannama ulaaa'ika sharrum makaananw wa adallu sabeelaa )section 3)",
    "transliteration_id": "Allażīna yuḥsyarūna ‘alā wujūhihim ilā jahannam(a), ulā'ika syarrum makānaw wa aḍallu sabīlā(n).",
    "translation_en": "The ones who are gathered on their faces to Hell - those are the worst in position and farthest astray in [their] way.",
    "translation_id": "Orang-orang yang dikumpulkan ke (neraka) Jahanam dengan diseret wajahnya itulah yang paling buruk tempatnya dan paling sesat jalannya."
  },
  {
    "ayat": 35,
    "arabic": "وَلَقَدْ اٰتَيْنَا مُوْسَى الْكِتٰبَ وَجَعَلْنَا مَعَهٗٓ اَخَاهُ هٰرُوْنَ وَزِيْرًا ۚ",
    "transliteration_en": "Wa laqad aatainaa Moosal Kitaaba wa ja'alnaa ma'ahooo akhaahu Haaroona wazeeraa",
    "transliteration_id": "Wa laqad ātainā mūsal-kitāba wa ja‘alnā ma‘ahū akhāhu hārūna wazīrā(n).",
    "translation_en": "And We had certainly given Moses the Scripture and appointed with him his brother Aaron as an assistant.",
    "translation_id": "Sungguh, Kami telah menganugerahkan Kitab (Taurat) kepada Musa dan menjadikan Harun saudaranya untuk menyertai dia sebagai wazir (pembantu)."
  },
  {
    "ayat": 36,
    "arabic": "فَقُلْنَا اذْهَبَآ اِلَى الْقَوْمِ الَّذِيْنَ كَذَّبُوْا بِاٰيٰتِنَاۗ فَدَمَّرْنٰهُمْ تَدْمِيْرًا ۗ",
    "transliteration_en": "Faqulnaz habaaa ilal qawmil lazeena kazzaboo bi Aayaatinaa fadammarnaahum tadmeeraa",
    "transliteration_id": "Fa qulnażhabā ilal-qaumil-lażīna każżabū bi'āyātinā, fa dammarnāhum tadmīrā(n).",
    "translation_en": "And We said, \"Go both of you to the people who have denied Our signs.\" Then We destroyed them with [complete] destruction.",
    "translation_id": "Kemudian Kami berfirman (kepada keduanya), “Pergilah berdua kepada kaum yang mendustakan ayat-ayat Kami.” Lalu, Kami hancurkan mereka dengan sehancur-hancurnya."
  },
  {
    "ayat": 37,
    "arabic": "وَقَوْمَ نُوْحٍ لَّمَّا كَذَّبُوا الرُّسُلَ اَغْرَقْنٰهُمْ وَجَعَلْنٰهُمْ لِلنَّاسِ اٰيَةًۗ وَاَعْتَدْنَا لِلظّٰلِمِيْنَ عَذَابًا اَلِيْمًا ۚ",
    "transliteration_en": "Wa qawma Noohil lammaa kazzabur Rusula aghraqnaahum wa ja'alnaahum linnaasi Aayatanw wa a'tadnaa lizzaalimeena 'azaaban aleemaa",
    "transliteration_id": "Wa qauma nūḥil lammā każżabur-rusula agraqnāhum wa ja‘alnāhum lin-nāsi āyah(tan), wa a‘tadnā liẓ-ẓālimīna ‘ażāban alīmā(n).",
    "translation_en": "And the people of Noah - when they denied the messengers, We drowned them, and We made them for mankind a sign. And We have prepared for the wrongdoers a painful punishment.",
    "translation_id": "(Kami telah membinasakan) kaum Nuh ketika mereka mendustakan para rasul. Kami menenggelamkan mereka dan menjadikan (kisahnya) sebagai pelajaran bagi manusia. Kami telah menyediakan untuk orang-orang zalim azab yang sangat pedih."
  },
  {
    "ayat": 38,
    "arabic": "وَعَادًا وَّثَمُوْدَا۟ وَاَصْحٰبَ الرَّسِّ وَقُرُوْنًاۢ بَيْنَ ذٰلِكَ كَثِيْرًا",
    "transliteration_en": "Wa 'Aadanw Samooda wa As haabar Rassi wa quroonam baina zaalika kaseeraa",
    "transliteration_id": "Wa ‘ādaw wa ṡamūda wa aṣḥābar-rassi wa qurūnam baina żālika kaṡīrā(n).",
    "translation_en": "And [We destroyed] 'Aad and Thamud and the companions of the well and many generations between them.",
    "translation_id": "(Kami telah membinasakan) kaum ‘Ad, Samud, penduduk Rass, dan banyak (lagi) generasi di antara (kaum-kaum) itu."
  },
  {
    "ayat": 39,
    "arabic": "وَكُلًّا ضَرَبْنَا لَهُ الْاَمْثَالَۖ وَكُلًّا تَبَّرْنَا تَتْبِيْرًا",
    "transliteration_en": "Wa kullandarabnaa lahul amsaala wa kullan tabbarnaa tatbeera",
    "transliteration_id": "Wa kullan ḍarabnā lahul-amṡāl(a), wa kullan tabbarnā tatbīrā(n).",
    "translation_en": "And for each We presented examples [as warnings], and each We destroyed with [total] destruction.",
    "translation_id": "Masing-masing telah Kami berikan kepadanya perumpamaan-perumpamaan (nasib umat terdahulu) dan masing-masing telah Kami hancurkan sehancur-hancurnya."
  },
  {
    "ayat": 40,
    "arabic": "وَلَقَدْ اَتَوْا عَلَى الْقَرْيَةِ الَّتِيْٓ اُمْطِرَتْ مَطَرَ السَّوْءِۗ اَفَلَمْ يَكُوْنُوْا يَرَوْنَهَاۚ بَلْ كَانُوْا لَا يَرْجُوْنَ نُشُوْرًا",
    "transliteration_en": "Wa laqad ataw 'alal qaryatil lateee umtirat mataras saw'; afalam yakoonoo yarawnahaa; bal kaanoo laa yarjoona nushooraa",
    "transliteration_id": "Wa laqad atau ‘alal-qaryatil-latī umṭirat maṭaras-sau'(i), afalam yakūnū yaraunahā, bal kānū lā yarjūna nusyūrā(n).",
    "translation_en": "And they have already come upon the town which was showered with a rain of evil. So have they not seen it? But they are not expecting resurrection.",
    "translation_id": "Sungguh, mereka (kaum musyrik Makkah) benar-benar telah melalui negeri (Sodom) yang (dahulu) dijatuhi hujan yang buruk (hujan batu). Tidakkah mereka menyaksikannya? Bahkan, mereka itu sebenarnya tidak mengharapkan adanya kebangkitan."
  },
  {
    "ayat": 41,
    "arabic": "وَاِذَا رَاَوْكَ اِنْ يَّتَّخِذُوْنَكَ اِلَّا هُزُوًاۗ اَهٰذَا الَّذِيْ بَعَثَ اللّٰهُ رَسُوْلًا",
    "transliteration_en": "Wa izaa ra awka iny yattakhizoonaka illaa huzuwan ahaazal lazee ba'asal laahu Rasoolaa",
    "transliteration_id": "Wa iżā ra'auka iy yattakhiżūnaka illā huzuwā(n), ahāżal-lażī ba‘aṡallāhu rasūlā(n).",
    "translation_en": "And when they see you, [O Muhammad], they take you not except in ridicule, [saying], \"Is this the one whom Allah has sent as a messenger?",
    "translation_id": "Apabila melihat engkau (Nabi Muhammad), mereka tidak menjadikan engkau selain sebagai ejekan (dengan mengatakan), “Inikah orangnya yang diutus Allah sebagai rasul?"
  },
  {
    "ayat": 42,
    "arabic": "اِنْ كَادَ لَيُضِلُّنَا عَنْ اٰلِهَتِنَا لَوْلَآ اَنْ صَبَرْنَا عَلَيْهَاۗ وَسَوْفَ يَعْلَمُوْنَ حِيْنَ يَرَوْنَ الْعَذَابَ مَنْ اَضَلُّ سَبِيْلًا",
    "transliteration_en": "In kaada la yudillunaa 'an aalihatinaa law laaa an sabarnaa 'alaihaa; wa sawfa ya'lamoona heena yarawnal 'azaaba man adallu sabeela",
    "transliteration_id": "In kāda layuḍillunā ‘an ālihatinā lau lā an ṣabarnā ‘alaihā, wa saufa ya‘lamūna ḥīna yaraunal-‘ażāba man aḍallu sabīlā(n).",
    "translation_en": "He almost would have misled us from our gods had we not been steadfast in [worship of] them.\" But they are going to know, when they see the punishment, who is farthest astray in [his] way.",
    "translation_id": "Sesungguhnya hampir saja dia (Nabi Muhammad) menyesatkan kita dari sesembahan kita seandainya kita tidak tetap bertahan (menyembah)-nya.” Kelak mereka akan mengetahui pada saat melihat azab, siapa gerangan yang paling sesat jalannya."
  },
  {
    "ayat": 43,
    "arabic": "اَرَءَيْتَ مَنِ اتَّخَذَ اِلٰهَهٗ هَوٰىهُۗ اَفَاَنْتَ تَكُوْنُ عَلَيْهِ وَكِيْلًا ۙ",
    "transliteration_en": "Ara'aita manit takhaza ilaahahoo hawaahu afa anta takoonu 'alaihi wakeelaa",
    "transliteration_id": "Ara'aita manittakhaża ilāhahū hawāh(u), afa anta takūnu ‘alaihi wakīlā(n).",
    "translation_en": "Have you seen the one who takes as his god his own desire? Then would you be responsible for him?",
    "translation_id": "Sudahkah engkau (Nabi Muhammad) melihat orang yang menjadikan hawa nafsunya sebagai tuhannya. Apakah engkau akan menjadi pelindungnya?"
  },
  {
    "ayat": 44,
    "arabic": "اَمْ تَحْسَبُ اَنَّ اَكْثَرَهُمْ يَسْمَعُوْنَ اَوْ يَعْقِلُوْنَۗ اِنْ هُمْ اِلَّا كَالْاَنْعَامِ  بَلْ هُمْ اَضَلُّ سَبِيْلًا ࣖ",
    "transliteration_en": "Am tahsabu annna aksarahum yasma'oona aw ya''qiloon; in hum illaa kal an'aami bal hum adallu sabeelan",
    "transliteration_id": "Am taḥsabu anna akṡarahum yasma‘ūna au ya‘qilūn(a), in hum illā kal-an‘āmi bal hum aḍallu sabīlā(n).",
    "translation_en": "Or do you think that most of them hear or reason? They are not except like livestock. Rather, they are [even] more astray in [their] way.",
    "translation_id": "Atau, apakah engkau mengira bahwa kebanyakan mereka itu mendengar atau memahami? Mereka tidak lain hanyalah seperti hewan ternak. Bahkan, mereka lebih sesat jalannya."
  },
  {
    "ayat": 45,
    "arabic": "اَلَمْ تَرَ اِلٰى رَبِّكَ كَيْفَ مَدَّ الظِّلَّۚ وَلَوْ شَاۤءَ لَجَعَلَهٗ سَاكِنًاۚ  ثُمَّ جَعَلْنَا الشَّمْسَ عَلَيْهِ دَلِيْلًا ۙ",
    "transliteration_en": "Alam tara ilaa Rabbika kaifa maddaz zilla wa law shaaa'a laja'alahoo saakinan summa ja'alnash shamsa 'alaihe daleelaa",
    "transliteration_id": "Alam tara ilā rabbika kaifa maddaẓ-ẓill(a), wa lau syā'a laja‘alahū sākinā(n), ṡumma ja‘alnasy-syamsa ‘alaihi dalīlā(n).",
    "translation_en": "Have you not considered your Lord - how He extends the shadow, and if He willed, He could have made it stationary? Then We made the sun for it an indication.",
    "translation_id": "Tidakkah engkau memperhatikan (penciptaan) Tuhanmu? Bagaimana Dia memanjangkan (dan memendekkan) bayang-bayang? Sekiranya berkehendak, niscaya Dia menjadikannya (bayang-bayang itu) tetap. Kemudian, Kami jadikan matahari sebagai petunjuk tentangnya (bayang-bayang itu)."
  },
  {
    "ayat": 46,
    "arabic": "ثُمَّ قَبَضْنٰهُ اِلَيْنَا قَبْضًا يَّسِيْرًا",
    "transliteration_en": "Summa qabadnaahu ilainaa qabdany yaseeraa",
    "transliteration_id": "Ṡumma qabaḍnā ilainā qabḍay yasīrā(n).",
    "translation_en": "Then We hold it in hand for a brief grasp.",
    "translation_id": "Kemudian, Kami menariknya (bayang-bayang itu) ke (arah yang) Kami (kehendaki) sedikit demi sedikit."
  },
  {
    "ayat": 47,
    "arabic": "وَهُوَ الَّذِيْ جَعَلَ لَكُمُ الَّيْلَ لِبَاسًا وَّالنَّوْمَ سُبَاتًا وَّجَعَلَ النَّهَارَ نُشُوْرًا",
    "transliteration_en": "Wa Huwal lazee ja'ala lakumul laila libaasanw wannawma subaatanw wa ja'alan nahaara nushooraa",
    "transliteration_id": "Wa huwal-lażī ja‘ala lakumul-laila libāsaw wan-nauma subātaw wa ja‘alan-nahāra nusyūrā(n).",
    "translation_en": "And it is He who has made the night for you as clothing and sleep [a means for] rest and has made the day a resurrection.",
    "translation_id": "Dialah yang menjadikan malam untukmu (sebagai) pakaian dan tidur untuk istirahat. Dia menjadikan siang untuk bangkit berusaha."
  },
  {
    "ayat": 48,
    "arabic": "وَهُوَ الَّذِيْٓ اَرْسَلَ الرِّيَاحَ بُشْرًاۢ بَيْنَ يَدَيْ رَحْمَتِهٖۚ وَاَنْزَلْنَا مِنَ السَّمَاۤءِ مَاۤءً طَهُوْرًا ۙ",
    "transliteration_en": "Wa Huwal lazeee arsalar riyaaha bushram baina yadai rahmatih; wa anzalnaa minas samaaa'i maaa'an tahooraa",
    "transliteration_id": "Wa huwal-lażī arsalar-riyāḥa busyram baina yadai raḥmatih(ī), wa anzalnā minas-samā'i mā'an ṭahūrā(n).",
    "translation_en": "And it is He who sends the winds as good tidings before His mercy, and We send down from the sky pure water",
    "translation_id": "Dialah yang meniupkan angin (sebagai) pembawa kabar gembira sebelum kedatangan rahmat-Nya (hujan). Kami turunkan dari langit air yang sangat suci."
  },
  {
    "ayat": 49,
    "arabic": "لِّنُحْيِ َۧ بِهٖ بَلْدَةً مَّيْتًا وَّنُسْقِيَهٗ مِمَّا خَلَقْنَآ اَنْعَامًا وَّاَنَاسِيَّ كَثِيْرًا",
    "transliteration_en": "Linuhyiya bihee balda tam maitanw wa nusqiyahoo mimmaa khalaqnaaa an'aa manw wa anaasiyya kaseeraa",
    "transliteration_id": "Linuḥyiya bihī baldatam maitaw wa nusqiyahū mimmā khalaqnā an‘āmaw wa anāsiyya kaṡīrā(n).",
    "translation_en": "That We may bring to life thereby a dead land and give it as drink to those We created of numerous livestock and men.",
    "translation_id": "Agar dengannya (air itu) Kami menghidupkan negeri yang mati (tandus) dan memberi minum kepada sebagian apa yang telah Kami ciptakan, (berupa) hewan-hewan ternak dan manusia yang banyak."
  },
  {
    "ayat": 50,
    "arabic": "وَلَقَدْ صَرَّفْنٰهُ بَيْنَهُمْ لِيَذَّكَّرُوْاۖ فَاَبٰىٓ اَكْثَرُ النَّاسِ اِلَّا كُفُوْرًا",
    "transliteration_en": "Wa laqad sarrafnaahu bainahum li yazzakkaroo fa abaaa aksarun naasi illaa kufooraa",
    "transliteration_id": "Wa laqad ṣarrafnāhu bainahum liyażżakkarū, fa abā akṡarun-nāsi illā kufūrā(n).",
    "translation_en": "And We have certainly distributed it among them that they might be reminded, but most of the people refuse except disbelief.",
    "translation_id": "Sungguh, Kami benar-benar telah mempergilirkannya (hujan itu) di antara mereka agar mereka mengambil pelajaran. Akan tetapi, kebanyakan manusia tidak mau (bersyukur), bahkan mereka mengingkari (nikmat)."
  }
]