[
  {
    "ayat": 101,
    "arabic": "خٰلِدِيْنَ فِيْهِ ۗوَسَاۤءَ لَهُمْ يَوْمَ الْقِيٰمَةِ حِمْلًاۙ",
    "transliteration_en": "Khaalideena feehi wa saaa'a lahum Yawmal Qiyaamati himlaa",
    "transliteration_id": "Khālidīna fīh(i), wa sā'a lahum yaumal-qiyāmati ḥimlā(n).",
    "translation_en": "[Abiding] eternally therein, and evil it is for them on the Day of Resurrection as a load -",
    "translation_id": "Mereka kekal di dalamnya. Sangat buruklah beban (dosa) itu bagi mereka pada hari Kiamat,"
  },
  {
    "ayat": 102,
    "arabic": "يَّوْمَ يُنْفَخُ فِى الصُّوْرِ وَنَحْشُرُ الْمُجْرِمِيْنَ يَوْمَىِٕذٍ زُرْقًا ۖ",
    "transliteration_en": "Yawma yunfakhu fissoori wa nahshurul mujrimeena Yawma 'izin zurqaa",
    "transliteration_id": "Yauma yunfakhu fiṣ-ṣūri wa naḥsyurul-mujrimīna yauma'iżin zurqā(n).",
    "translation_en": "The Day the Horn will be blown. And We will gather the criminals, that Day, blue-eyed.",
    "translation_id": "(yaitu) pada hari ketika sangkakala ditiup. Pada hari itu Kami kumpulkan para pendurhaka dengan (wajah) pucat (penuh ketakutan)."
  },
  {
    "ayat": 103,
    "arabic": "يَّتَخَافَتُوْنَ بَيْنَهُمْ اِنْ لَّبِثْتُمْ اِلَّا عَشْرًا",
    "transliteration_en": "Yatakhaafatoona bainahum il labistum illaa 'ashraa",
    "transliteration_id": "Yatakhāfatūna bainahum il labiṡtum illā ‘asyrā(n).",
    "translation_en": "They will murmur among themselves, \"You remained not but ten [days in the world].\"",
    "translation_id": "Mereka berbisik satu sama lain, “Kamu tinggal (di dunia) tidak lebih dari sepuluh (hari).”"
  },
  {
    "ayat": 104,
    "arabic": "نَحْنُ اَعْلَمُ بِمَا يَقُوْلُوْنَ اِذْ يَقُوْلُ اَمْثَلُهُمْ طَرِيْقَةً اِنْ لَّبِثْتُمْ اِلَّا يَوْمًا ࣖ",
    "transliteration_en": "nahnu a'lamu bimaa yaqooloona iz yaqoolu amsaluhum tareeqatan illabistum illaa yawmaa",
    "transliteration_id": "Naḥnu a‘lamu bimā yaqūlūna iż yaqūlu amṡaluhum ṭarīqatan il labiṡtum illā yaumā(n).",
    "translation_en": "We are most knowing of what they say when the best of them in manner will say, \"You remained not but one day.\"",
    "translation_id": "Kami lebih mengetahui apa yang akan mereka katakan, ketika orang yang paling lurus jalannya mengatakan, “Kamu tinggal (di dunia) tidak lebih dari sehari saja.”"
  },
  {
    "ayat": 105,
    "arabic": "وَيَسْـَٔلُوْنَكَ عَنِ الْجِبَالِ فَقُلْ يَنْسِفُهَا رَبِّيْ نَسْفًا ۙ",
    "transliteration_en": "Wa yas'aloonaka 'anil jibaali faqul yansifuhaa Rabbee nasfaa",
    "transliteration_id": "Wa yas'alūnaka ‘anil-jibāli fa qul yansifuhā rabbī nasfā(n).",
    "translation_en": "And they ask you about the mountains, so say, \"My Lord will blow them away with a blast.",
    "translation_id": "Mereka bertanya kepadamu (Nabi Muhammad) tentang gunung-gunung, maka katakanlah, “Tuhanku akan menghancurkannya (pada hari Kiamat) sehancur-hancurnya,"
  },
  {
    "ayat": 106,
    "arabic": "فَيَذَرُهَا قَاعًا صَفْصَفًا ۙ",
    "transliteration_en": "Fa yazaruhaa qaa'an safsafaa",
    "transliteration_id": "Fa yażaruhā qā‘an ṣafṣafā(n).",
    "translation_en": "And He will leave the earth a level plain;",
    "translation_id": "kemudian Dia akan menjadikan (bekas gunung-gunung) itu dataran yang (terhampar) rata."
  },
  {
    "ayat": 107,
    "arabic": "لَّا تَرٰى فِيْهَا عِوَجًا وَّلَآ اَمْتًا ۗ",
    "transliteration_en": "Laa taraa feehaa 'iwajanw wa laaa amtaa",
    "transliteration_id": "Lā tarā fīhā ‘iwajaw wa lā amtā(n).",
    "translation_en": "You will not see therein a depression or an elevation.\"",
    "translation_id": "Engkau tidak akan melihat lagi dataran rendah dan dataran tinggi di sana.”"
  },
  {
    "ayat": 108,
    "arabic": "يَوْمَىِٕذٍ يَّتَّبِعُوْنَ الدَّاعِيَ لَا عِوَجَ لَهٗ ۚوَخَشَعَتِ الْاَصْوَاتُ لِلرَّحْمٰنِ فَلَا تَسْمَعُ اِلَّا هَمْسًا",
    "transliteration_en": "Yawma iziny yattabi'oonad daa'iya laa 'iwaja lahoo wa khasha'atil aswaatu lir Rahmaani falaa tasma'u illaa hamsaa",
    "transliteration_id": "Yauma'iżiy yattabi‘ūnad-dā‘iya lā ‘iwaja lah(ū), wa khasya‘atil-aṣwātu lir-raḥmāni falā tasma‘u illā hamsā(n).",
    "translation_en": "That Day, everyone will follow [the call of] the Caller [with] no deviation therefrom, and [all] voices will be stilled before the Most Merciful, so you will not hear except a whisper [of footsteps].",
    "translation_id": "Pada hari itu mereka mengikuti (panggilan) penyeru (Israfil) tanpa berbelok-belok. Semua suara tunduk merendah kepada Tuhan Yang Maha Pengasih, sehingga yang kamu dengar hanyalah bisik-bisik."
  },
  {
    "ayat": 109,
    "arabic": "يَوْمَىِٕذٍ لَّا تَنْفَعُ الشَّفَاعَةُ اِلَّا مَنْ اَذِنَ لَهُ الرَّحْمٰنُ وَرَضِيَ لَهٗ قَوْلًا",
    "transliteration_en": "Yawma 'izil laa tanfa'ush shafaa'atu illaa man azina lahur Rahmaanu wa radiya lahoo qawlaa",
    "transliteration_id": "Yauma'iżil lā tanfa‘usy-syafā‘atu illā man ażina lahur-raḥmānu wa raḍiya lahū qaulā(n).",
    "translation_en": "That Day, no intercession will benefit except [that of] one to whom the Most Merciful has given permission and has accepted his word.",
    "translation_id": "Pada hari itu tidak berguna syafaat, kecuali dari orang yang telah diberi izin oleh Yang Maha Pengasih dan yang diridai perkataannya."
  },
  {
    "ayat": 110,
    "arabic": "يَعْلَمُ مَا بَيْنَ اَيْدِيْهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيْطُوْنَ بِهٖ عِلْمًا",
    "transliteration_en": "Ya'lamu maa bainaa aideehim wa maa khalfahum wa laa yauheetoona bihee 'ilmaa",
    "transliteration_id": "Ya‘lamu mā baina aidīhim wa mā khalfahum wa lā yuḥīṭūna bihī ‘ilmā(n).",
    "translation_en": "Allah knows what is [presently] before them and what will be after them, but they do not encompass it in knowledge.",
    "translation_id": "Dia (Allah) mengetahui apa yang di hadapan mereka (yang akan terjadi) dan apa yang di belakang mereka (yang telah terjadi), sedangkan ilmu mereka tidak dapat meliputi-Nya."
  },
  {
    "ayat": 111,
    "arabic": "۞ وَعَنَتِ الْوُجُوْهُ لِلْحَيِّ الْقَيُّوْمِۗ وَقَدْ خَابَ مَنْ حَمَلَ ظُلْمًا",
    "transliteration_en": "Wa 'anatil wujoohu lil Haiiyil Qaiyoomi wa qad khaaba man hamala zulmaa",
    "transliteration_id": "Wa ‘anatil-wujūhu lil-ḥayyil-qayyūm(i), wa qad khāba man ḥamala ẓulmā(n).",
    "translation_en": "And [all] faces will be humbled before the Ever-Living, the Sustainer of existence. And he will have failed who carries injustice.",
    "translation_id": "Semua wajah tertunduk di hadapan (Allah) Yang Maha Hidup lagi Maha Mengurus. Sungguh rugi orang yang membawa kezaliman."
  },
  {
    "ayat": 112,
    "arabic": "وَمَنْ يَّعْمَلْ مِنَ الصّٰلِحٰتِ وَهُوَ مُؤْمِنٌ فَلَا يَخٰفُ ظُلْمًا وَّلَا هَضْمًا",
    "transliteration_en": "Wa mai ya'mal minas saalihaati wa huwa mu'minun falaa yakhaafu zulmanw wa laa hadmaa",
    "transliteration_id": "Wa may ya‘mal minaṣ-ṣāliḥāti wa huwa mu'minun falā yakhāfu ẓulmaw wa lā haḍmā(n).",
    "translation_en": "But he who does of righteous deeds while he is a believer - he will neither fear injustice nor deprivation.",
    "translation_id": "Siapa yang mengerjakan kebajikan dan dia (dalam keadaan) beriman, maka dia tidak khawatir akan perlakuan zalim (terhadapnya) dan tidak (pula khawatir) akan pengurangan haknya."
  },
  {
    "ayat": 113,
    "arabic": "وَكَذٰلِكَ اَنْزَلْنٰهُ قُرْاٰنًا عَرَبِيًّا وَّصَرَّفْنَا فِيْهِ مِنَ الْوَعِيْدِ لَعَلَّهُمْ يَتَّقُوْنَ اَوْ يُحْدِثُ لَهُمْ ذِكْرًا",
    "transliteration_en": "Wa kazaalika anzalnaahu Qur-aanan 'Arabiyyanw wa sarrafnaa fee hi minal wa'eedi la'allahum yattaqoona aw yuhdisu lahum zikraa",
    "transliteration_id": "Wa każālika anzalnāhu qur'ānan ‘arabiyyaw wa ṣarrafnā fīhi minal-wa‘īdi la‘allahum yattaqūna au yuḥdiṡu lahum żikrā(n).",
    "translation_en": "And thus We have sent it down as an Arabic Qur'an and have diversified therein the warnings that perhaps they will avoid [sin] or it would cause them remembrance.",
    "translation_id": "Demikianlah, Kami menurunkan Al-Qur’an dalam bahasa Arab dan Kami telah menjelaskan berulang-ulang di dalamnya sebagian dari ancaman agar mereka bertakwa atau agar (Al-Qur’an) itu memberi pengajaran bagi mereka."
  },
  {
    "ayat": 114,
    "arabic": "فَتَعٰلَى اللّٰهُ الْمَلِكُ الْحَقُّۚ وَلَا تَعْجَلْ بِالْقُرْاٰنِ مِنْ قَبْلِ اَنْ يُّقْضٰٓى اِلَيْكَ وَحْيُهٗ ۖوَقُلْ رَّبِّ زِدْنِيْ عِلْمًا",
    "transliteration_en": "Fata'aalal laahul Malikul Haqq; wa laa ta'jal bil Quraani min qabli ai yuqdaaa ilaika wahyuhoo wa qur Rabbi zidnee 'ilmaa",
    "transliteration_id": "Fa ta‘ālallāhul-malikul-ḥaqq(u), wa lā ta‘jal bil-qur'āni min qabli ay yuqḍā ilaika waḥyuh(ū), wa qur rabbi zidnī ‘ilmā(n).",
    "translation_en": "So high [above all] is Allah, the Sovereign, the Truth. And, [O Muhammad], do not hasten with [recitation of] the Qur'an before its revelation is completed to you, and say, \"My Lord, increase me in knowledge.\"",
    "translation_id": "Maha Tinggi Allah, Raja yang sebenar-benarnya. Janganlah engkau (Nabi Muhammad) tergesa-gesa (membaca) Al-Qur’an sebelum selesai pewahyuannya kepadamu dan katakanlah, “Ya Tuhanku, tambahkanlah ilmu kepadaku.”"
  },
  {
    "ayat": 115,
    "arabic": "وَلَقَدْ عَهِدْنَآ اِلٰٓى اٰدَمَ مِنْ قَبْلُ فَنَسِيَ وَلَمْ نَجِدْ لَهٗ عَزْمًا ࣖ",
    "transliteration_en": "Wa laqad 'ahidnaaa ilaaa Aadama min qablu fanasiya wa lam najid lahoo 'azmaa",
    "transliteration_id": "Wa laqad ‘ahidnā ilā ādama min qablu fa nasiya wa lam najid lahū ‘azmā(n).",
    "translation_en": "And We had already taken a promise from Adam before, but he forgot; and We found not in him determination.",
    "translation_id": "Sungguh telah Kami perintahkan Adam dahulu (agar tidak mendekati pohon keabadian), tetapi dia lupa dan Kami tidak mendapati padanya tekad yang kuat (untuk menjauhi larangan)."
  },
  {
    "ayat": 116,
    "arabic": "وَاِذْ قُلْنَا لِلْمَلٰۤىِٕكَةِ اسْجُدُوْا لِاٰدَمَ فَسَجَدُوْٓا اِلَّآ اِبْلِيْسَ اَبٰى ۗ",
    "transliteration_en": "Wa iz qulnaa lilma laaa'ikatis judoo li Aadama fasajadooo illaaa Iblees; abaa",
    "transliteration_id": "Wa iż qulnā lil-malā'ikatisjudū li'ādama fa sajadū illā iblīsa abā.",
    "translation_en": "And [mention] when We said to the angels, \"Prostrate to Adam,\" and they prostrated, except Iblees; he refused.",
    "translation_id": "(Ingatlah) ketika Kami berfirman kepada para malaikat, “Sujudlah kamu kepada Adam!” Mereka pun sujud, tetapi Iblis (enggan). Dia menolak."
  },
  {
    "ayat": 117,
    "arabic": "فَقُلْنَا يٰٓاٰدَمُ اِنَّ هٰذَا عَدُوٌّ لَّكَ وَلِزَوْجِكَ فَلَا يُخْرِجَنَّكُمَا مِنَ الْجَنَّةِ فَتَشْقٰى",
    "transliteration_en": "Faqulnaa yaaa Aadamu inna haazaa 'aduwwul laka wa lizawjika falaa yukhrijan nakumaa minal Jannati fatashqaa",
    "transliteration_id": "Fa qulnā yā ādamu inna hāżā ‘aduwwul laka wa lizaujika falā yukhrijannakumā minal-jannati fa tasyqā.",
    "translation_en": "So We said, \"O Adam, indeed this is an enemy to you and to your wife. Then let him not remove you from Paradise so you would suffer.",
    "translation_id": "Kemudian Kami berfirman, “Wahai Adam, sesungguhnya (Iblis) inilah musuh bagimu dan bagi istrimu. Maka, sekali-kali jangan sampai dia mengeluarkan kamu berdua dari surga. Kelak kamu akan menderita."
  },
  {
    "ayat": 118,
    "arabic": "اِنَّ لَكَ اَلَّا تَجُوْعَ فِيْهَا وَلَا تَعْرٰى ۙ",
    "transliteration_en": "Innaa laka allaa tajoo'a feeha wa laa ta'raa",
    "transliteration_id": "Inna laka allā tajū‘a fīhā wa lā ta‘rā.",
    "translation_en": "Indeed, it is [promised] for you not to be hungry therein or be unclothed.",
    "translation_id": "Sesungguhnya (ada jaminan) untukmu bahwa di sana engkau tidak akan kelaparan dan tidak akan telanjang."
  },
  {
    "ayat": 119,
    "arabic": "وَاَنَّكَ لَا تَظْمَؤُا فِيْهَا وَلَا تَضْحٰى",
    "transliteration_en": "Wa annaka laa tazma'u feehaa wa laa tadhaa",
    "transliteration_id": "Wa annaka lā taẓma'u fīhā wa lā taḍḥā.",
    "translation_en": "And indeed, you will not be thirsty therein or be hot from the sun.\"",
    "translation_id": "Sesungguhnya di sana pun engkau tidak akan merasa dahaga dan tidak akan ditimpa terik matahari.”"
  },
  {
    "ayat": 120,
    "arabic": "فَوَسْوَسَ اِلَيْهِ الشَّيْطٰنُ قَالَ يٰٓاٰدَمُ هَلْ اَدُلُّكَ عَلٰى شَجَرَةِ الْخُلْدِ وَمُلْكٍ لَّا يَبْلٰى",
    "transliteration_en": "Fa waswasa ilaihish Shaitaanu qaala yaaa Aadamu hal adulluka 'alaa shajaratil khuldi wa mulkil laa yablaa",
    "transliteration_id": "Fa waswasa ilaihisy-syaiṭānu qāla yā ādamu hal adulluka ‘alā syajaratil-khuldi wa mulkil lā yablā.",
    "translation_en": "Then Satan whispered to him; he said, \"O Adam, shall I direct you to the tree of eternity and possession that will not deteriorate?\"",
    "translation_id": "Maka, setan membisikkan (pikiran jahat) kepadanya. Ia berkata, “Wahai Adam, maukah aku tunjukkan kepadamu pohon khuldi (keabadian) dan kerajaan yang tidak akan binasa?”"
  },
  {
    "ayat": 121,
    "arabic": "فَاَكَلَا مِنْهَا فَبَدَتْ لَهُمَا سَوْءٰتُهُمَا وَطَفِقَا يَخْصِفٰنِ عَلَيْهِمَا مِنْ وَّرَقِ الْجَنَّةِۚ وَعَصٰىٓ اٰدَمُ رَبَّهٗ فَغَوٰى ۖ",
    "transliteration_en": "Fa akalaa minhaa fabadat lahumaa saw aatuhumaa wa tafiqaa yakhsifaani 'alaihimaa minw waraqil jannah; wa 'asaaa Aadamu Rabbahoo faghawaa",
    "transliteration_id": "Fa akalā minhā fa badat lahumā sau'ātuhumā wa ṭafiqā yakhṣifāni ‘alaihimā miw waraqil-jannah(ti), wa ‘aṣā ādamu rabbahū fa gawā.",
    "translation_en": "And Adam and his wife ate of it, and their private parts became apparent to them, and they began to fasten over themselves from the leaves of Paradise. And Adam disobeyed his Lord and erred.",
    "translation_id": "Lalu, mereka berdua memakannya sehingga tampaklah oleh keduanya aurat mereka dan mulailah keduanya menutupinya dengan daun-daun (yang ada di) surga. Adam telah melanggar (perintah) Tuhannya dan khilaflah dia."
  },
  {
    "ayat": 122,
    "arabic": "ثُمَّ اجْتَبٰىهُ رَبُّهٗ فَتَابَ عَلَيْهِ وَهَدٰى",
    "transliteration_en": "Summaj tabbahu Rabbuhoo fataaba 'alaihi wa hadaa",
    "transliteration_id": "Ṡummajtabāhu rabbuhū fa tāba ‘alaihi wa hadā.",
    "translation_en": "Then his Lord chose him and turned to him in forgiveness and guided [him].",
    "translation_id": "Tuhannya kemudian memilihnya (menjadi rasul). Maka, Dia menerima tobatnya dan memberinya petunjuk."
  },
  {
    "ayat": 123,
    "arabic": "قَالَ اهْبِطَا مِنْهَا جَمِيْعًاۢ بَعْضُكُمْ لِبَعْضٍ عَدُوٌّ ۚفَاِمَّا يَأْتِيَنَّكُمْ مِّنِّيْ هُدًى ەۙ فَمَنِ اتَّبَعَ هُدَايَ فَلَا يَضِلُّ وَلَا يَشْقٰى",
    "transliteration_en": "Qaalah bita minhaa jamee'am ba'dukum liba'din 'aduww; fa immaa yaati yannakum minnee hudan famanit taba'a hudaaya falaa yadillu wa laa yashhqaa",
    "transliteration_id": "Qālahbiṭā minhā jamī‘am ba‘ḍukum liba‘ḍin ‘aduww(un), fa immā ya'tiyannakum minnī hudā(n), fa manittaba‘a hudāya falā yaḍillu wa lā yasyqā.",
    "translation_en": "[Allah] said, \"Descend from Paradise - all, [your descendants] being enemies to one another. And if there should come to you guidance from Me - then whoever follows My guidance will neither go astray [in the world] nor suffer [in the Hereafter].",
    "translation_id": "Dia (Allah) berfirman, “Turunlah kamu berdua dari surga bersama-sama. Sebagian kamu (Adam dan keturunannya) menjadi musuh bagi yang lain. Jika datang kepadamu petunjuk dari-Ku, (ketahuilah bahwa) siapa yang mengikuti petunjuk-Ku, dia tidak akan sesat dan tidak akan celaka."
  },
  {
    "ayat": 124,
    "arabic": "وَمَنْ اَعْرَضَ عَنْ ذِكْرِيْ فَاِنَّ لَهٗ مَعِيْشَةً ضَنْكًا وَّنَحْشُرُهٗ يَوْمَ الْقِيٰمَةِ اَعْمٰى",
    "transliteration_en": "Wa man a'rada 'an Zikree fa inna lahoo ma'eeshatan dankanw wa nahshuruhoo Yawmal Qiyaamati a'maa",
    "transliteration_id": "Wa man a‘raḍa ‘an żikrī fa inna lahū ma‘īsyatan ḍankaw wa naḥsyuruhū yaumal-qiyāmati a‘mā.",
    "translation_en": "And whoever turns away from My remembrance - indeed, he will have a depressed life, and We will gather him on the Day of Resurrection blind.\"",
    "translation_id": "Siapa yang berpaling dari peringatan-Ku, maka sesungguhnya baginya kehidupan yang sempit. Kami akan mengumpulkannya pada hari Kiamat dalam keadaan buta.”"
  },
  {
    "ayat": 125,
    "arabic": "قَالَ رَبِّ لِمَ حَشَرْتَنِيْٓ اَعْمٰى وَقَدْ كُنْتُ بَصِيْرًا",
    "transliteration_en": "Qaala Rabbi lima hashar tanee a'maa wa qad kuntu baseeraa",
    "transliteration_id": "Qāla rabbi lima ḥasyartanī a‘mā wa qad kuntu baṣīrā(n).",
    "translation_en": "He will say, \"My Lord, why have you raised me blind while I was [once] seeing?\"",
    "translation_id": "Dia berkata, “Ya Tuhanku, mengapa Engkau mengumpulkan aku dalam keadaan buta, padahal sungguh dahulu aku dapat melihat?”"
  },
  {
    "ayat": 126,
    "arabic": "قَالَ كَذٰلِكَ اَتَتْكَ اٰيٰتُنَا فَنَسِيْتَهَاۚ وَكَذٰلِكَ الْيَوْمَ تُنْسٰى",
    "transliteration_en": "Qaala kazaalika atatka Aayaatunaa fanaseetahaa wa kazaalikal Yawma tunsaa",
    "transliteration_id": "Qāla każālika atatka āyātunā fa nasītahā, wa każālikal-yauma tunsā.",
    "translation_en": "[Allah] will say, \"Thus did Our signs come to you, and you forgot them; and thus will you this Day be forgotten.\"",
    "translation_id": "Dia (Allah) berfirman, “Memang seperti itulah (balasanmu). (Dahulu) telah datang kepadamu ayat-ayat Kami, lalu engkau mengabaikannya. Begitu (pula) pada hari ini engkau diabaikan.”"
  },
  {
    "ayat": 127,
    "arabic": "وَكَذٰلِكَ نَجْزِيْ مَنْ اَسْرَفَ وَلَمْ يُؤْمِنْۢ بِاٰيٰتِ رَبِّهٖۗ وَلَعَذَابُ الْاٰخِرَةِ اَشَدُّ وَاَبْقٰى",
    "transliteration_en": "Wa kazaalika najzee man asrafa wa lam yu'mim bi Aayaati Rabbih; wa la'azaabul Aakhirati ashaddu wa abqaa",
    "transliteration_id": "Wa każālika najzī man asrafa wa lam yu'mim bi'āyāti rabbih(ī), wa la‘ażābul-ākhirati asyaddu wa abqā.",
    "translation_en": "And thus do We recompense he who transgressed and did not believe in the signs of his Lord. And the punishment of the Hereafter is more severe and more enduring.",
    "translation_id": "Demikianlah Kami membalas orang yang melampaui batas dan tidak percaya pada ayat-ayat Tuhannya. Sungguh, azab di akhirat itu lebih berat dan lebih kekal."
  },
  {
    "ayat": 128,
    "arabic": "اَفَلَمْ يَهْدِ لَهُمْ كَمْ اَهْلَكْنَا قَبْلَهُمْ مِّنَ الْقُرُوْنِ يَمْشُوْنَ فِيْ مَسٰكِنِهِمْۗ اِنَّ فِيْ ذٰلِكَ لَاٰيٰتٍ لِّاُولِى النُّهٰى ࣖ",
    "transliteration_en": "Afalam yahdi lahum kam ahlaknaa qablahum minal qurooni yamshoona fee masaakinihim; inna fee zaalika la Aayaatil li ulinnuhaa",
    "transliteration_id": "Afalam yahdi lahum kam ahlaknā qablahum minal-qurūni yamsyūna fī masākinihim, inna fī żālika la'āyātil li'ulin nuhā.",
    "translation_en": "Then, has it not become clear to them how many generations We destroyed before them as they walk among their dwellings? Indeed in that are signs for those of intelligence.",
    "translation_id": "Tidakkah menjadi petunjuk bagi mereka (orang-orang musyrik) tentang berapa banyak generasi sebelum mereka yang telah Kami binasakan, (padahal) mereka melewati (bekas-bekas) tempat tinggal mereka (generasi itu)? Sesungguhnya pada yang demikian itu terdapat tanda-tanda (kekuasaan Allah) bagi orang-orang yang berakal."
  },
  {
    "ayat": 129,
    "arabic": "وَلَوْلَا كَلِمَةٌ سَبَقَتْ مِنْ رَّبِّكَ لَكَانَ لِزَامًا وَّاَجَلٌ مُّسَمًّى ۗ",
    "transliteration_en": "Wa law laa Kalimatun sabaqat mir Rabbika lakaana lizaamanw wa ajalum musammaa",
    "transliteration_id": "Wa lau lā kalimatun sabaqat mir rabbika lakāna lizāmaw wa ajalum musammā(n).",
    "translation_en": "And if not for a word that preceded from your Lord, punishment would have been an obligation [due immediately], and [if not for] a specified term [decreed].",
    "translation_id": "Seandainya tidak ada suatu ketetapan yang terdahulu dari Tuhanmu serta tidak ada ajal yang telah ditentukan (bagi mereka), pastilah (siksaan itu langsung menimpa mereka)."
  },
  {
    "ayat": 130,
    "arabic": "فَاصْبِرْ عَلٰى مَا يَقُوْلُوْنَ وَسَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوْعِ الشَّمْسِ وَقَبْلَ غُرُوْبِهَا ۚوَمِنْ اٰنَاۤئِ الَّيْلِ فَسَبِّحْ وَاَطْرَافَ النَّهَارِ لَعَلَّكَ تَرْضٰى",
    "transliteration_en": "Fasbir 'alaa maa yaqooloona wa sabbih bihamdi Rabbika qabla tuloo'ish shamsi wa qabla ghuroobihaa wa min aanaaa'il laili fasbbih wa atraafan nahaari la 'allaka tardaa",
    "transliteration_id": "Faṣbir ‘alā mā yaqūlūna wa sabbiḥ biḥamdi rabbika qabla ṭulū‘isy-syamsi wa qabla gurūbihā, wa min ānā'il-laili fa sabbiḥ wa aṭrāfan-nahāri la‘allaka tarḍā.",
    "translation_en": "So be patient over what they say and exalt [Allah] with praise of your Lord before the rising of the sun and before its setting; and during periods of the night [exalt Him] and at the ends of the day, that you may be satisfied.",
    "translation_id": "Maka, bersabarlah engkau (Nabi Muhammad) atas apa yang mereka katakan dan bertasbihlah dengan memuji Tuhanmu sebelum matahari terbit dan sebelum terbenam. Bertasbihlah (pula) pada waktu tengah malam dan di ujung siang hari agar engkau merasa tenang."
  },
  {
    "ayat": 131,
    "arabic": "وَلَا تَمُدَّنَّ عَيْنَيْكَ اِلٰى مَا مَتَّعْنَا بِهٖٓ اَزْوَاجًا مِّنْهُمْ زَهْرَةَ الْحَيٰوةِ الدُّنْيَا ەۙ لِنَفْتِنَهُمْ فِيْهِ ۗوَرِزْقُ رَبِّكَ خَيْرٌ وَّاَبْقٰى",
    "transliteration_en": "Wa laa tamuddanna 'ainaika ilaa ma matta'na biheee azwajam minhum zahratal hayaatid dunya linaftinahum feeh; wa rizqu Rabbika khairunw wa abqaa",
    "transliteration_id": "Wa lā tamuddanna ‘ainaika ilā mā matta‘nā bihī azwājam minhum zahratal-ḥayātid-dun-yā, linaftinahum fīh(i), wa rizqu rabbika khairuw wa abqā.",
    "translation_en": "And do not extend your eyes toward that by which We have given enjoyment to [some] categories of them, [its being but] the splendor of worldly life by which We test them. And the provision of your Lord is better and more enduring.",
    "translation_id": "Janganlah sekali-kali engkau tujukan pandangan matamu pada kenikmatan yang telah Kami anugerahkan kepada beberapa golongan dari mereka (sebagai) bunga kehidupan dunia agar Kami uji mereka dengan (kesenangan) itu. Karunia Tuhanmu lebih baik dan lebih kekal."
  },
  {
    "ayat": 132,
    "arabic": "وَأْمُرْ اَهْلَكَ بِالصَّلٰوةِ وَاصْطَبِرْ عَلَيْهَاۗ  لَا نَسْـَٔلُكَ رِزْقًاۗ نَحْنُ نَرْزُقُكَۗ وَالْعَاقِبَةُ لِلتَّقْوٰى",
    "transliteration_en": "Waamur ahlaka bis Salaati wastabir 'alaihaa la nas'aluka rizqaa; nahnu narzuquk; wal 'aaqibatu littaqwaa",
    "transliteration_id": "Wa'mur ahlaka biṣ-ṣalāti waṣṭabir ‘alaihā, lā nas'aluka rizqā(n), naḥnu narzuquk(a), wal-‘āqibatu lit-taqwā.",
    "translation_en": "And enjoin prayer upon your family [and people] and be steadfast therein. We ask you not for provision; We provide for you, and the [best] outcome is for [those of] righteousness.",
    "translation_id": "Perintahkanlah keluargamu melaksanakan salat dan bersabarlah dengan sungguh-sungguh dalam mengerjakannya. Kami tidak meminta rezeki kepadamu. Kamilah yang memberi rezeki kepadamu. Kesudahan (yang baik di dunia dan akhirat) adalah bagi orang yang bertakwa."
  },
  {
    "ayat": 133,
    "arabic": "وَقَالُوْا لَوْلَا يَأْتِيْنَا بِاٰيَةٍ مِّنْ رَّبِّهٖۗ اَوَلَمْ تَأْتِهِمْ بَيِّنَةُ مَا فِى الصُّحُفِ الْاُوْلٰى",
    "transliteration_en": "Wa qaaloo law laa yaateenaa bi Aayatim mmir Rabbih; awalam taatihim baiyinatu maa fis suhufil oolaa",
    "transliteration_id": "Wa qālū lau lā ya'tīnā bi'āyatim mir rabbih(ī), awalam ta'tihim bayyinatu mā fiṣ-ṣuḥufil-ūlā.",
    "translation_en": "And they say, \"Why does he not bring us a sign from his Lord?\" Has there not come to them evidence of what was in the former scriptures?",
    "translation_id": "Mereka berkata, “Mengapa dia (Nabi Muhammad) tidak membawa tanda (mukjizat) kepada kami dari Tuhannya?” Bukankah telah datang kepada mereka bukti nyata yang tersebut di dalam kitab-kitab terdahulu?"
  },
  {
    "ayat": 134,
    "arabic": "وَلَوْ اَنَّآ اَهْلَكْنٰهُمْ بِعَذَابٍ مِّنْ قَبْلِهٖ لَقَالُوْا رَبَّنَا لَوْلَآ اَرْسَلْتَ اِلَيْنَا رَسُوْلًا فَنَتَّبِعَ اٰيٰتِكَ مِنْ قَبْلِ اَنْ نَّذِلَّ وَنَخْزٰى",
    "transliteration_en": "Wa law annaaa ahlaknaahum bi'azaabim min qablihee laqaaloo Rabbanaa law laaa arsalta ilainaa Rasoolan fanattabi's Aayaatika min qabli an nazilla wa nakhzaa",
    "transliteration_id": "Wa lau annā ahlaknāhum bi‘ażābim min qablihī laqālū rabbanā lau lā arsalta ilainā rasūlan fa nattabi‘a āyātika min qabli an nażilla wa nakhzā.",
    "translation_en": "And if We had destroyed them with a punishment before him, they would have said, \"Our Lord, why did You not send to us a messenger so we could have followed Your verses before we were humiliated and disgraced?\"",
    "translation_id": "Seandainya Kami binasakan mereka dengan suatu siksaan sebelum (bukti itu datang), tentulah mereka berkata, “Ya Tuhan kami, mengapa tidak Engkau utus seorang rasul kepada kami sehingga kami mengikuti ayat-ayat-Mu sebelum kami menjadi hina dan rendah?”"
  },
  {
    "ayat": 135,
    "arabic": "قُلْ كُلٌّ مُّتَرَبِّصٌ فَتَرَبَّصُوْاۚ فَسَتَعْلَمُوْنَ مَنْ اَصْحٰبُ الصِّرَاطِ السَّوِيِّ وَمَنِ اهْتَدٰى ࣖ    ۔",
    "transliteration_en": "Qul kullum mutarabbisun fatarabbasoo fasta'lamoona man Ashaabus Siraatis Sawiyyi wa manih tadaa",
    "transliteration_id": "Qul kullum mutarabbiṣun fa tarabbaṣū, fa sata‘lamūna man aṣḥābuṣ-ṣirāṭis-sawiyyi wa manihtadā.",
    "translation_en": "Say, \"Each [of us] is waiting; so wait. For you will know who are the companions of the sound path and who is guided.\"",
    "translation_id": "Katakanlah (Nabi Muhammad), “Setiap (kita) menanti, maka menantilah! Kelak kamu akan mengetahui siapa yang berada di jalan yang lurus dan siapa yang telah mendapat petunjuk.”"
  }
]